// AnimBlueprintGeneratedClass ABP_WE_SSC_Cardpack.ABP_WE_SSC_Cardpack_C
// Size: 0xd78 (Inherited: 0x2c0)
struct UABP_WE_SSC_Cardpack_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c0(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x2c8(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0x2f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x320(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x348(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x370(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x398(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x3c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x3e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x410(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x438(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x460(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x488(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x4b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x4d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x500(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0x528(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0x5a8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x5d8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x658(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x688(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x708(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x738(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x7b8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x7e8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x868(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x898(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x918(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x948(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x9c8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x9f8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0xa78(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0xaa8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0xb28(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0xb58(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0xbd8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xc08(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0xc88(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0xcb8(0xb0)
	int32_t Trick_Index; // 0xd68(0x04)
	bool Collapse_Pyramid?; // 0xd6c(0x01)
	char pad_D6D[0x3]; // 0xd6d(0x03)
	struct ABP_ShufflingCards_C* ShufflingCardsREF; // 0xd70(0x08)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP_WE_SSC_Cardpack.ABP_WE_SSC_Cardpack_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WE_SSC_Cardpack_AnimGraphNode_TransitionResult_CE2FBFFB434C684F50AB4BA1ABC28B98(); // Function ABP_WE_SSC_Cardpack.ABP_WE_SSC_Cardpack_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WE_SSC_Cardpack_AnimGraphNode_TransitionResult_CE2FBFFB434C684F50AB4BA1ABC28B98 // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WE_SSC_Cardpack_AnimGraphNode_TransitionResult_95DD172D4D21436DEC95DAA1607B6B2C(); // Function ABP_WE_SSC_Cardpack.ABP_WE_SSC_Cardpack_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WE_SSC_Cardpack_AnimGraphNode_TransitionResult_95DD172D4D21436DEC95DAA1607B6B2C // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WE_SSC_Cardpack_AnimGraphNode_TransitionResult_C2C3A6754ED0FA0E9FCEDA8E832C5659(); // Function ABP_WE_SSC_Cardpack.ABP_WE_SSC_Cardpack_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WE_SSC_Cardpack_AnimGraphNode_TransitionResult_C2C3A6754ED0FA0E9FCEDA8E832C5659 // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WE_SSC_Cardpack_AnimGraphNode_TransitionResult_8CCF5C57420216F57C93CF8C2E6506CF(); // Function ABP_WE_SSC_Cardpack.ABP_WE_SSC_Cardpack_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WE_SSC_Cardpack_AnimGraphNode_TransitionResult_8CCF5C57420216F57C93CF8C2E6506CF // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WE_SSC_Cardpack_AnimGraphNode_TransitionResult_DA9471E1429564C287406985CA9CA8BC(); // Function ABP_WE_SSC_Cardpack.ABP_WE_SSC_Cardpack_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WE_SSC_Cardpack_AnimGraphNode_TransitionResult_DA9471E1429564C287406985CA9CA8BC // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WE_SSC_Cardpack_AnimGraphNode_TransitionResult_C55619864B34BC8F774DCEB14D3B38BE(); // Function ABP_WE_SSC_Cardpack.ABP_WE_SSC_Cardpack_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WE_SSC_Cardpack_AnimGraphNode_TransitionResult_C55619864B34BC8F774DCEB14D3B38BE // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WE_SSC_Cardpack_AnimGraphNode_TransitionResult_CC1641A04E52321EDA9181AC13DC45F1(); // Function ABP_WE_SSC_Cardpack.ABP_WE_SSC_Cardpack_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WE_SSC_Cardpack_AnimGraphNode_TransitionResult_CC1641A04E52321EDA9181AC13DC45F1 // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WE_SSC_Cardpack_AnimGraphNode_TransitionResult_6DC8FFC94DB98766E9A25883865F78CA(); // Function ABP_WE_SSC_Cardpack.ABP_WE_SSC_Cardpack_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WE_SSC_Cardpack_AnimGraphNode_TransitionResult_6DC8FFC94DB98766E9A25883865F78CA // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WE_SSC_Cardpack_AnimGraphNode_TransitionResult_35DB34D14541F8EAF5BABFA39B48E096(); // Function ABP_WE_SSC_Cardpack.ABP_WE_SSC_Cardpack_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WE_SSC_Cardpack_AnimGraphNode_TransitionResult_35DB34D14541F8EAF5BABFA39B48E096 // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WE_SSC_Cardpack_AnimGraphNode_TransitionResult_095BB0724173AD65DAC669BDEC0F2B17(); // Function ABP_WE_SSC_Cardpack.ABP_WE_SSC_Cardpack_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WE_SSC_Cardpack_AnimGraphNode_TransitionResult_095BB0724173AD65DAC669BDEC0F2B17 // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WE_SSC_Cardpack_AnimGraphNode_TransitionResult_C9EC36374D77B13F21F7DBBDEF8800DF(); // Function ABP_WE_SSC_Cardpack.ABP_WE_SSC_Cardpack_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WE_SSC_Cardpack_AnimGraphNode_TransitionResult_C9EC36374D77B13F21F7DBBDEF8800DF // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WE_SSC_Cardpack_AnimGraphNode_TransitionResult_C1DCC0664546A4B59334309027C1FDBD(); // Function ABP_WE_SSC_Cardpack.ABP_WE_SSC_Cardpack_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WE_SSC_Cardpack_AnimGraphNode_TransitionResult_C1DCC0664546A4B59334309027C1FDBD // (BlueprintEvent) // @ game+0x38a7480
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function ABP_WE_SSC_Cardpack.ABP_WE_SSC_Cardpack_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void AnimNotify_SSC_NewTrick(); // Function ABP_WE_SSC_Cardpack.ABP_WE_SSC_Cardpack_C.AnimNotify_SSC_NewTrick // (BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_ABP_WE_SSC_Cardpack(int32_t EntryPoint); // Function ABP_WE_SSC_Cardpack.ABP_WE_SSC_Cardpack_C.ExecuteUbergraph_ABP_WE_SSC_Cardpack // (Final|UbergraphFunction) // @ game+0x38a7480
};

