// AnimBlueprintGeneratedClass ABP_HW_Puzzle_Arithmancy_Dice.ABP_HW_Puzzle_Arithmancy_Dice_C
// Size: 0x8bc (Inherited: 0x2c0)
struct UABP_HW_Puzzle_Arithmancy_Dice_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c0(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x2c8(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x2f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x320(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x348(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x370(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x398(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x3c0(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x3e8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x468(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x498(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x518(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x548(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x5c8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x5f8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x678(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x6a8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x728(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x758(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x7d8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x808(0xb0)
	int32_t DiceValue; // 0x8b8(0x04)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP_HW_Puzzle_Arithmancy_Dice.ABP_HW_Puzzle_Arithmancy_Dice_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_HW_Puzzle_Arithmancy_Dice_AnimGraphNode_TransitionResult_7220DEB942D18E97A7A0208F827F5789(); // Function ABP_HW_Puzzle_Arithmancy_Dice.ABP_HW_Puzzle_Arithmancy_Dice_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_HW_Puzzle_Arithmancy_Dice_AnimGraphNode_TransitionResult_7220DEB942D18E97A7A0208F827F5789 // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_HW_Puzzle_Arithmancy_Dice_AnimGraphNode_TransitionResult_A56754C242C46E7EEABA4EACE45CC782(); // Function ABP_HW_Puzzle_Arithmancy_Dice.ABP_HW_Puzzle_Arithmancy_Dice_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_HW_Puzzle_Arithmancy_Dice_AnimGraphNode_TransitionResult_A56754C242C46E7EEABA4EACE45CC782 // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_HW_Puzzle_Arithmancy_Dice_AnimGraphNode_TransitionResult_BC42C58E4301B0705A9C3E98443FB580(); // Function ABP_HW_Puzzle_Arithmancy_Dice.ABP_HW_Puzzle_Arithmancy_Dice_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_HW_Puzzle_Arithmancy_Dice_AnimGraphNode_TransitionResult_BC42C58E4301B0705A9C3E98443FB580 // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_HW_Puzzle_Arithmancy_Dice_AnimGraphNode_TransitionResult_EC29EEBE4DCFFF6ABF225DB0AF625576(); // Function ABP_HW_Puzzle_Arithmancy_Dice.ABP_HW_Puzzle_Arithmancy_Dice_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_HW_Puzzle_Arithmancy_Dice_AnimGraphNode_TransitionResult_EC29EEBE4DCFFF6ABF225DB0AF625576 // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_HW_Puzzle_Arithmancy_Dice_AnimGraphNode_TransitionResult_52AEF0B549EBA32778E53AB2DB0D7F5E(); // Function ABP_HW_Puzzle_Arithmancy_Dice.ABP_HW_Puzzle_Arithmancy_Dice_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_HW_Puzzle_Arithmancy_Dice_AnimGraphNode_TransitionResult_52AEF0B549EBA32778E53AB2DB0D7F5E // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_HW_Puzzle_Arithmancy_Dice_AnimGraphNode_TransitionResult_108731DC460FA43B1DF8188BB8E008C5(); // Function ABP_HW_Puzzle_Arithmancy_Dice.ABP_HW_Puzzle_Arithmancy_Dice_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_HW_Puzzle_Arithmancy_Dice_AnimGraphNode_TransitionResult_108731DC460FA43B1DF8188BB8E008C5 // (BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_ABP_HW_Puzzle_Arithmancy_Dice(int32_t EntryPoint); // Function ABP_HW_Puzzle_Arithmancy_Dice.ABP_HW_Puzzle_Arithmancy_Dice_C.ExecuteUbergraph_ABP_HW_Puzzle_Arithmancy_Dice // (Final|UbergraphFunction) // @ game+0x38a7480
};

