// AnimBlueprintGeneratedClass ABP_Professor_MatildaWeasley_PostProcess.ABP_Professor_MatildaWeasley_PostProcess_C
// Size: 0x42a8 (Inherited: 0x2c0)
struct UABP_Professor_MatildaWeasley_PostProcess_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c0(0x08)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_57; // 0x2c8(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_56; // 0x3e0(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_55; // 0x4f8(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_54; // 0x610(0x118)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x728(0x20)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_53; // 0x748(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_52; // 0x860(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_51; // 0x978(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_50; // 0xa90(0x118)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0xba8(0x20)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_49; // 0xbc8(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_48; // 0xce0(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_47; // 0xdf8(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_46; // 0xf10(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_45; // 0x1028(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_44; // 0x1140(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_43; // 0x1258(0x118)
	struct FAnimNode_LinkedInputPose AnimGraphNode_SubInput; // 0x1370(0x118)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x1488(0x30)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_42; // 0x14b8(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_41; // 0x15d0(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_40; // 0x16e8(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_39; // 0x1800(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_38; // 0x1918(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_37; // 0x1a30(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_36; // 0x1b48(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_35; // 0x1c60(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_34; // 0x1d78(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_33; // 0x1e90(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_32; // 0x1fa8(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_31; // 0x20c0(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_30; // 0x21d8(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_29; // 0x22f0(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_28; // 0x2408(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_27; // 0x2520(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_26; // 0x2638(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_25; // 0x2750(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_24; // 0x2868(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_23; // 0x2980(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_22; // 0x2a98(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_21; // 0x2bb0(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_20; // 0x2cc8(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_19; // 0x2de0(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_18; // 0x2ef8(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_17; // 0x3010(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_16; // 0x3128(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_15; // 0x3240(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_14; // 0x3358(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_13; // 0x3470(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_12; // 0x3588(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_11; // 0x36a0(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_10; // 0x37b8(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_9; // 0x38d0(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_8; // 0x39e8(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_7; // 0x3b00(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_6; // 0x3c18(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_5; // 0x3d30(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_4; // 0x3e48(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_3; // 0x3f60(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_2; // 0x4078(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController; // 0x4190(0x118)

	void AnimGraph(struct FPoseLink InPose, struct FPoseLink& AnimGraph); // Function ABP_Professor_MatildaWeasley_PostProcess.ABP_Professor_MatildaWeasley_PostProcess_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_ABP_Professor_MatildaWeasley_PostProcess(int32_t EntryPoint); // Function ABP_Professor_MatildaWeasley_PostProcess.ABP_Professor_MatildaWeasley_PostProcess_C.ExecuteUbergraph_ABP_Professor_MatildaWeasley_PostProcess // (Final|UbergraphFunction) // @ game+0x38a7480
};

