// AnimBlueprintGeneratedClass ABP_FieldGuideBook.ABP_FieldGuideBook_C
// Size: 0xd24 (Inherited: 0x2c0)
struct UABP_FieldGuideBook_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c0(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x2c8(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21; // 0x2f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20; // 0x320(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0x348(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0x370(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0x398(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0x3c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0x3e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0x410(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x438(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x460(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x488(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x4b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x4d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x500(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x528(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x550(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x578(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x5a0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x5c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x5f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x618(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x640(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x6c0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x6f0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x770(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x7a0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x820(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x850(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x8d0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x900(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x980(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x9b0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0xa30(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0xa60(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0xae0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0xb10(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0xb90(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xbc0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0xc40(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0xc70(0xb0)
	bool ShouldBeOpen; // 0xd20(0x01)
	bool TurnPageLft; // 0xd21(0x01)
	bool TurnPageRht; // 0xd22(0x01)
	bool TransitioningToMap; // 0xd23(0x01)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP_FieldGuideBook.ABP_FieldGuideBook_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FieldGuideBook_AnimGraphNode_TransitionResult_302C2B124D2FABD9746A79BD817E7B97(); // Function ABP_FieldGuideBook.ABP_FieldGuideBook_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FieldGuideBook_AnimGraphNode_TransitionResult_302C2B124D2FABD9746A79BD817E7B97 // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FieldGuideBook_AnimGraphNode_TransitionResult_B330839C43BFA1E57BD0A1BF45DD93BA(); // Function ABP_FieldGuideBook.ABP_FieldGuideBook_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FieldGuideBook_AnimGraphNode_TransitionResult_B330839C43BFA1E57BD0A1BF45DD93BA // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FieldGuideBook_AnimGraphNode_TransitionResult_73B7E0A0438697335DCC8AB476BFA6E8(); // Function ABP_FieldGuideBook.ABP_FieldGuideBook_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FieldGuideBook_AnimGraphNode_TransitionResult_73B7E0A0438697335DCC8AB476BFA6E8 // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FieldGuideBook_AnimGraphNode_TransitionResult_1B9A403449823792AF14779AF756DE95(); // Function ABP_FieldGuideBook.ABP_FieldGuideBook_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FieldGuideBook_AnimGraphNode_TransitionResult_1B9A403449823792AF14779AF756DE95 // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FieldGuideBook_AnimGraphNode_TransitionResult_95A1F49A448A7F7AD12495A4E58EC79F(); // Function ABP_FieldGuideBook.ABP_FieldGuideBook_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FieldGuideBook_AnimGraphNode_TransitionResult_95A1F49A448A7F7AD12495A4E58EC79F // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FieldGuideBook_AnimGraphNode_TransitionResult_E265C57049E6C901F293B79B3A93627F(); // Function ABP_FieldGuideBook.ABP_FieldGuideBook_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FieldGuideBook_AnimGraphNode_TransitionResult_E265C57049E6C901F293B79B3A93627F // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FieldGuideBook_AnimGraphNode_TransitionResult_06A8A50640FEE312AC91BF9AF0B998F3(); // Function ABP_FieldGuideBook.ABP_FieldGuideBook_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FieldGuideBook_AnimGraphNode_TransitionResult_06A8A50640FEE312AC91BF9AF0B998F3 // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FieldGuideBook_AnimGraphNode_TransitionResult_C07A901448B006287008EE82B5C9A637(); // Function ABP_FieldGuideBook.ABP_FieldGuideBook_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FieldGuideBook_AnimGraphNode_TransitionResult_C07A901448B006287008EE82B5C9A637 // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FieldGuideBook_AnimGraphNode_TransitionResult_D615C9FF44C9E3FD5F6FA197C01AABBA(); // Function ABP_FieldGuideBook.ABP_FieldGuideBook_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FieldGuideBook_AnimGraphNode_TransitionResult_D615C9FF44C9E3FD5F6FA197C01AABBA // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FieldGuideBook_AnimGraphNode_TransitionResult_6FA1D1AE4F459B80AB5E05B334B68DE7(); // Function ABP_FieldGuideBook.ABP_FieldGuideBook_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FieldGuideBook_AnimGraphNode_TransitionResult_6FA1D1AE4F459B80AB5E05B334B68DE7 // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FieldGuideBook_AnimGraphNode_TransitionResult_FDA9071F47844008C7D2F69C4D088284(); // Function ABP_FieldGuideBook.ABP_FieldGuideBook_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FieldGuideBook_AnimGraphNode_TransitionResult_FDA9071F47844008C7D2F69C4D088284 // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FieldGuideBook_AnimGraphNode_TransitionResult_6B4E315D497DA91B41122DB371366639(); // Function ABP_FieldGuideBook.ABP_FieldGuideBook_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FieldGuideBook_AnimGraphNode_TransitionResult_6B4E315D497DA91B41122DB371366639 // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FieldGuideBook_AnimGraphNode_TransitionResult_3C44C2A04ED58401293612ABE2604402(); // Function ABP_FieldGuideBook.ABP_FieldGuideBook_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FieldGuideBook_AnimGraphNode_TransitionResult_3C44C2A04ED58401293612ABE2604402 // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FieldGuideBook_AnimGraphNode_TransitionResult_B9B3A3BF4521E4160374F0B154FD11EC(); // Function ABP_FieldGuideBook.ABP_FieldGuideBook_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FieldGuideBook_AnimGraphNode_TransitionResult_B9B3A3BF4521E4160374F0B154FD11EC // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FieldGuideBook_AnimGraphNode_TransitionResult_10E9D6E44FF5EB86F81F8F880E803B5F(); // Function ABP_FieldGuideBook.ABP_FieldGuideBook_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FieldGuideBook_AnimGraphNode_TransitionResult_10E9D6E44FF5EB86F81F8F880E803B5F // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FieldGuideBook_AnimGraphNode_TransitionResult_A40703B146770AE8FFD79AA3B9D6A576(); // Function ABP_FieldGuideBook.ABP_FieldGuideBook_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FieldGuideBook_AnimGraphNode_TransitionResult_A40703B146770AE8FFD79AA3B9D6A576 // (BlueprintEvent) // @ game+0x38a7480
	void OpenBook(); // Function ABP_FieldGuideBook.ABP_FieldGuideBook_C.OpenBook // (BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void StartTransitionToMap(); // Function ABP_FieldGuideBook.ABP_FieldGuideBook_C.StartTransitionToMap // (BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void OnTransitionToMapTimer(); // Function ABP_FieldGuideBook.ABP_FieldGuideBook_C.OnTransitionToMapTimer // (BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void StartTransitionOutOfMap(); // Function ABP_FieldGuideBook.ABP_FieldGuideBook_C.StartTransitionOutOfMap // (BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void TurnPageLeft(); // Function ABP_FieldGuideBook.ABP_FieldGuideBook_C.TurnPageLeft // (BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void TurnPageRight(); // Function ABP_FieldGuideBook.ABP_FieldGuideBook_C.TurnPageRight // (BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void CloseBook(); // Function ABP_FieldGuideBook.ABP_FieldGuideBook_C.CloseBook // (BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_ABP_FieldGuideBook(int32_t EntryPoint); // Function ABP_FieldGuideBook.ABP_FieldGuideBook_C.ExecuteUbergraph_ABP_FieldGuideBook // (Final|UbergraphFunction|HasDefaults) // @ game+0x38a7480
};

