// AnimBlueprintGeneratedClass ABP_Biped_PostProcess.ABP_Biped_PostProcess_C
// Size: 0x6c68 (Inherited: 0x2c0)
struct UABP_Biped_PostProcess_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c0(0x08)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_64; // 0x2c8(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_63; // 0x3e0(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_62; // 0x4f8(0x118)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x610(0x20)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_61; // 0x630(0x118)
	char pad_748[0x8]; // 0x748(0x08)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_8; // 0x750(0x440)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_60; // 0xb90(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_59; // 0xca8(0x118)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0xdc0(0x20)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_58; // 0xde0(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_57; // 0xef8(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_56; // 0x1010(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_55; // 0x1128(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_54; // 0x1240(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_53; // 0x1358(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_52; // 0x1470(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_51; // 0x1588(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_50; // 0x16a0(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_49; // 0x17b8(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_48; // 0x18d0(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_47; // 0x19e8(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_46; // 0x1b00(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_45; // 0x1c18(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_44; // 0x1d30(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_43; // 0x1e48(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_42; // 0x1f60(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_41; // 0x2078(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_40; // 0x2190(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_39; // 0x22a8(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_38; // 0x23c0(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_37; // 0x24d8(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_36; // 0x25f0(0x118)
	char pad_2708[0x8]; // 0x2708(0x08)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_7; // 0x2710(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_6; // 0x2b50(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_5; // 0x2f90(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_4; // 0x33d0(0x440)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_35; // 0x3810(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_34; // 0x3928(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_33; // 0x3a40(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_32; // 0x3b58(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_31; // 0x3c70(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_30; // 0x3d88(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_29; // 0x3ea0(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_28; // 0x3fb8(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_27; // 0x40d0(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_26; // 0x41e8(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_25; // 0x4300(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_24; // 0x4418(0x118)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_3; // 0x4530(0x440)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_23; // 0x4970(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_22; // 0x4a88(0x118)
	struct FAnimNode_LinkedInputPose AnimGraphNode_SubInput; // 0x4ba0(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_21; // 0x4cb8(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_20; // 0x4dd0(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_19; // 0x4ee8(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_18; // 0x5000(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_17; // 0x5118(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_16; // 0x5230(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_15; // 0x5348(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_14; // 0x5460(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_13; // 0x5578(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_12; // 0x5690(0x118)
	char pad_57A8[0x8]; // 0x57a8(0x08)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_2; // 0x57b0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x5bf0(0x440)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_11; // 0x6030(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_10; // 0x6148(0x118)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x6260(0x30)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_9; // 0x6290(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_8; // 0x63a8(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_7; // 0x64c0(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_6; // 0x65d8(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_5; // 0x66f0(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_4; // 0x6808(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_3; // 0x6920(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_2; // 0x6a38(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController; // 0x6b50(0x118)

	void AnimGraph(struct FPoseLink InPose, struct FPoseLink& AnimGraph); // Function ABP_Biped_PostProcess.ABP_Biped_PostProcess_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_ABP_Biped_PostProcess(int32_t EntryPoint); // Function ABP_Biped_PostProcess.ABP_Biped_PostProcess_C.ExecuteUbergraph_ABP_Biped_PostProcess // (Final|UbergraphFunction) // @ game+0x38a7480
};

