// AnimBlueprintGeneratedClass ABP_HW_Brazier_Master.ABP_HW_Brazier_Master_C
// Size: 0xbaa (Inherited: 0x2c0)
struct UABP_HW_Brazier_Master_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c0(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x2c8(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x2f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x320(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x348(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x370(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x398(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x3c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x3e8(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x410(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x490(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x4c0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x540(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x570(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x5f0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x620(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x6a0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x6d0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x750(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_3; // 0x780(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x830(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x860(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x888(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x8b0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x930(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x960(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x9e0(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0xa10(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0xac0(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0xaf0(0xb0)
	bool IsLit; // 0xba0(0x01)
	char pad_BA1[0x3]; // 0xba1(0x03)
	int32_t CurrentNumber; // 0xba4(0x04)
	bool RotateUnlit; // 0xba8(0x01)
	bool HasRotatedUnlit; // 0xba9(0x01)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP_HW_Brazier_Master.ABP_HW_Brazier_Master_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_HW_Brazier_Master_AnimGraphNode_TransitionResult_DBB5D6264964B4E0E82CC693E7571815(); // Function ABP_HW_Brazier_Master.ABP_HW_Brazier_Master_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_HW_Brazier_Master_AnimGraphNode_TransitionResult_DBB5D6264964B4E0E82CC693E7571815 // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_HW_Brazier_Master_AnimGraphNode_TransitionResult_935AF4954EA16F78F1BEF9B2595DEA76(); // Function ABP_HW_Brazier_Master.ABP_HW_Brazier_Master_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_HW_Brazier_Master_AnimGraphNode_TransitionResult_935AF4954EA16F78F1BEF9B2595DEA76 // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_HW_Brazier_Master_AnimGraphNode_TransitionResult_E8D468CB406CBBC56F6ACD99DAEE03E1(); // Function ABP_HW_Brazier_Master.ABP_HW_Brazier_Master_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_HW_Brazier_Master_AnimGraphNode_TransitionResult_E8D468CB406CBBC56F6ACD99DAEE03E1 // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_HW_Brazier_Master_AnimGraphNode_TransitionResult_B97949DE4E9A2F4FE1C611A7F16A22AB(); // Function ABP_HW_Brazier_Master.ABP_HW_Brazier_Master_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_HW_Brazier_Master_AnimGraphNode_TransitionResult_B97949DE4E9A2F4FE1C611A7F16A22AB // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_HW_Brazier_Master_AnimGraphNode_TransitionResult_3819F3964DDAE12566027C988776E026(); // Function ABP_HW_Brazier_Master.ABP_HW_Brazier_Master_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_HW_Brazier_Master_AnimGraphNode_TransitionResult_3819F3964DDAE12566027C988776E026 // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_HW_Brazier_Master_AnimGraphNode_TransitionResult_D953617F4FCA6769B88C9CA5D54D1DCA(); // Function ABP_HW_Brazier_Master.ABP_HW_Brazier_Master_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_HW_Brazier_Master_AnimGraphNode_TransitionResult_D953617F4FCA6769B88C9CA5D54D1DCA // (BlueprintEvent) // @ game+0x38a7480
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function ABP_HW_Brazier_Master.ABP_HW_Brazier_Master_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_ABP_HW_Brazier_Master(int32_t EntryPoint); // Function ABP_HW_Brazier_Master.ABP_HW_Brazier_Master_C.ExecuteUbergraph_ABP_HW_Brazier_Master // (Final|UbergraphFunction) // @ game+0x38a7480
};

