// AnimBlueprintGeneratedClass ABP_Doors_RoomofAdmittance.ABP_Doors_RoomofAdmittance_C
// Size: 0xc5c (Inherited: 0x2c0)
struct UABP_Doors_RoomofAdmittance_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c0(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x2c8(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x2f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x320(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x348(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x370(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x398(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x3c0(0x28)
	struct FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_2; // 0x3e8(0xf8)
	struct FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator; // 0x4e0(0xf8)
	struct FAnimNode_StateResult AnimGraphNode_CustomTransitionResult; // 0x5d8(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x608(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x630(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x658(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x680(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x6a8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x728(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x758(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x7d8(0x30)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x808(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x838(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x8b8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x8e8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x968(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x998(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0xa18(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0xa48(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0xac8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xaf8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0xb78(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0xba8(0xb0)
	bool Unlocked; // 0xc58(0x01)
	bool Open; // 0xc59(0x01)
	bool PlayBegan; // 0xc5a(0x01)
	bool OpenFailed; // 0xc5b(0x01)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP_Doors_RoomofAdmittance.ABP_Doors_RoomofAdmittance_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Doors_RoomofAdmittance_AnimGraphNode_TransitionResult_280F39FF43AA49B7C0414E8DEC7AB1D6(); // Function ABP_Doors_RoomofAdmittance.ABP_Doors_RoomofAdmittance_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Doors_RoomofAdmittance_AnimGraphNode_TransitionResult_280F39FF43AA49B7C0414E8DEC7AB1D6 // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Doors_RoomofAdmittance_AnimGraphNode_TransitionResult_0873B5D34C0FCA08E4E8C4A574F87337(); // Function ABP_Doors_RoomofAdmittance.ABP_Doors_RoomofAdmittance_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Doors_RoomofAdmittance_AnimGraphNode_TransitionResult_0873B5D34C0FCA08E4E8C4A574F87337 // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Doors_RoomofAdmittance_AnimGraphNode_TransitionResult_741431FF45A9E7D17F1342ABE4814F30(); // Function ABP_Doors_RoomofAdmittance.ABP_Doors_RoomofAdmittance_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Doors_RoomofAdmittance_AnimGraphNode_TransitionResult_741431FF45A9E7D17F1342ABE4814F30 // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Doors_RoomofAdmittance_AnimGraphNode_TransitionResult_7BD9A5AD4C61886F251D6FA370D4FFC6(); // Function ABP_Doors_RoomofAdmittance.ABP_Doors_RoomofAdmittance_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Doors_RoomofAdmittance_AnimGraphNode_TransitionResult_7BD9A5AD4C61886F251D6FA370D4FFC6 // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Doors_RoomofAdmittance_AnimGraphNode_TransitionResult_36E5D188410D1FA9DE6C9BA1C870FF8D(); // Function ABP_Doors_RoomofAdmittance.ABP_Doors_RoomofAdmittance_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Doors_RoomofAdmittance_AnimGraphNode_TransitionResult_36E5D188410D1FA9DE6C9BA1C870FF8D // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Doors_RoomofAdmittance_AnimGraphNode_TransitionResult_1C4E2BEF40ABA2DC092E2682C7676A43(); // Function ABP_Doors_RoomofAdmittance.ABP_Doors_RoomofAdmittance_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Doors_RoomofAdmittance_AnimGraphNode_TransitionResult_1C4E2BEF40ABA2DC092E2682C7676A43 // (BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_ABP_Doors_RoomofAdmittance(int32_t EntryPoint); // Function ABP_Doors_RoomofAdmittance.ABP_Doors_RoomofAdmittance_C.ExecuteUbergraph_ABP_Doors_RoomofAdmittance // (Final|UbergraphFunction) // @ game+0x38a7480
};

