// AnimBlueprintGeneratedClass ABP_SK_HUM_F_Hair_StuHair11_UpBun_Master.ABP_SK_HUM_F_Hair_StuHair11_UpBun_Master_C
// Size: 0x3b90 (Inherited: 0x2c0)
struct UABP_SK_HUM_F_Hair_StuHair11_UpBun_Master_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c0(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x2c8(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_SubInput; // 0x2f8(0x118)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x410(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x430(0x20)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_13; // 0x450(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_12; // 0x890(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_11; // 0xcd0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_10; // 0x1110(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_9; // 0x1550(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_8; // 0x1990(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_7; // 0x1dd0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_6; // 0x2210(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_5; // 0x2650(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_4; // 0x2a90(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_3; // 0x2ed0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_2; // 0x3310(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x3750(0x440)

	void AnimGraph(struct FPoseLink InPose, struct FPoseLink& AnimGraph); // Function ABP_SK_HUM_F_Hair_StuHair11_UpBun_Master.ABP_SK_HUM_F_Hair_StuHair11_UpBun_Master_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_ABP_SK_HUM_F_Hair_StuHair11_UpBun_Master(int32_t EntryPoint); // Function ABP_SK_HUM_F_Hair_StuHair11_UpBun_Master.ABP_SK_HUM_F_Hair_StuHair11_UpBun_Master_C.ExecuteUbergraph_ABP_SK_HUM_F_Hair_StuHair11_UpBun_Master // (Final|UbergraphFunction) // @ game+0x38a7480
};

