// AnimBlueprintGeneratedClass ABP_Dragons.ABP_Dragons_C
// Size: 0x7f69 (Inherited: 0x690)
struct UABP_Dragons_C : UEnemy_AnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x690(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x698(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x6c8(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x6f0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x770(0x30)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x7a0(0x48)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x7e8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_3; // 0x818(0xb0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x8c8(0xa0)
	struct FAnimNode_AbilityAnimPlayer AnimGraphNode_AbilityAnimPlayer; // 0x968(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0xa18(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0xa48(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0xaf8(0x158)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0xc50(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xc78(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xca0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0xd20(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0xd50(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0xd78(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0xda8(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0xe58(0x158)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0xfb0(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x1050(0x28)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0x1078(0x20)
	char pad_1098[0x8]; // 0x1098(0x08)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_24; // 0x10a0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_23; // 0x14e0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_22; // 0x1920(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_21; // 0x1d60(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_20; // 0x21a0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_19; // 0x25e0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_18; // 0x2a20(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_17; // 0x2e60(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_16; // 0x32a0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_15; // 0x36e0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_14; // 0x3b20(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_13; // 0x3f60(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_12; // 0x43a0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_11; // 0x47e0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_10; // 0x4c20(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_9; // 0x5060(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_8; // 0x54a0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_7; // 0x58e0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_6; // 0x5d20(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_5; // 0x6160(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_4; // 0x65a0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_3; // 0x69e0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_2; // 0x6e20(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x7260(0x440)
	struct FAnimNode_IKMasterNode AnimGraphNode_IKMasterNode_2; // 0x76a0(0x1b0)
	struct FAnimNode_RequestedLayerBlend AnimGraphNode_RequestedLayerBlend_2; // 0x7850(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x7900(0x28)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x7928(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0x7a30(0x20)
	struct FAnimNode_RequestedLayerBlend AnimGraphNode_RequestedLayerBlend; // 0x7a50(0xb0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x7b00(0xa0)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x7ba0(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x7bc0(0x20)
	struct FAnimNode_IKMasterNode AnimGraphNode_IKMasterNode; // 0x7be0(0x1b0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x7d90(0x28)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x7db8(0x108)
	bool TrackTarget; // 0x7ec0(0x01)
	char pad_7EC1[0x3]; // 0x7ec1(0x03)
	float HeadAimAlpha; // 0x7ec4(0x04)
	struct UEnemyAIComponent* EnemyAIComp; // 0x7ec8(0x08)
	struct FVector TargetLocation; // 0x7ed0(0x0c)
	struct FRotator HeadRotation; // 0x7edc(0x0c)
	float TargetHeadAimAlpha; // 0x7ee8(0x04)
	float LerpAlpha; // 0x7eec(0x04)
	struct FRotator Bone1Rotation; // 0x7ef0(0x0c)
	struct FRotator Bone2Rotation; // 0x7efc(0x0c)
	struct FRotator Bone3Rotation; // 0x7f08(0x0c)
	struct FRotator Bone4Rotation; // 0x7f14(0x0c)
	struct FRotator Bone5Rotation; // 0x7f20(0x0c)
	struct FVector DesiredTargetLocation; // 0x7f2c(0x0c)
	float TrackTongueAlpha; // 0x7f38(0x04)
	char pad_7F3C[0x4]; // 0x7f3c(0x04)
	struct TSoftObjectPtr<AActor> HeadTrackingTargetOverride; // 0x7f40(0x28)
	bool IKMasterBlend; // 0x7f68(0x01)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP_Dragons.ABP_Dragons_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void CalculateLookAtRotation(struct FVector TargetLocation, struct FRotator InHeadRotation, struct FName SourceBone, struct USkeletalMeshComponent* CharacterMesh, struct ACharacter* Character, struct FRotator& OutHeadRotation); // Function ABP_Dragons.ABP_Dragons_C.CalculateLookAtRotation // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void RemapLookAtRotator(struct FRotator InRotator, struct FRotator& OutRotator); // Function ABP_Dragons.ABP_Dragons_C.RemapLookAtRotator // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Dragons_AnimGraphNode_TransitionResult_09E7882040E4EE0712AC5F80BBC1554E(); // Function ABP_Dragons.ABP_Dragons_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Dragons_AnimGraphNode_TransitionResult_09E7882040E4EE0712AC5F80BBC1554E // (BlueprintEvent) // @ game+0x38a7480
	void AnimNotify_StartupAbility(); // Function ABP_Dragons.ABP_Dragons_C.AnimNotify_StartupAbility // (BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function ABP_Dragons.ABP_Dragons_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Dragons_AnimGraphNode_TransitionResult_528FAE73484933C25CAD2CABA16C4EDD(); // Function ABP_Dragons.ABP_Dragons_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Dragons_AnimGraphNode_TransitionResult_528FAE73484933C25CAD2CABA16C4EDD // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Dragons_AnimGraphNode_TransitionResult_B5DBA97E4A6F36014E41B2B1DA8BAEFD(); // Function ABP_Dragons.ABP_Dragons_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Dragons_AnimGraphNode_TransitionResult_B5DBA97E4A6F36014E41B2B1DA8BAEFD // (BlueprintEvent) // @ game+0x38a7480
	void HeadTrackingStart(struct UObject* Caller); // Function ABP_Dragons.ABP_Dragons_C.HeadTrackingStart // (BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void HeadTrackingStop(struct UObject* Caller); // Function ABP_Dragons.ABP_Dragons_C.HeadTrackingStop // (BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Dragons_AnimGraphNode_ModifyBone_3A0F407240EF99388DAFCEBE227BF297(); // Function ABP_Dragons.ABP_Dragons_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Dragons_AnimGraphNode_ModifyBone_3A0F407240EF99388DAFCEBE227BF297 // (BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_ABP_Dragons(int32_t EntryPoint); // Function ABP_Dragons.ABP_Dragons_C.ExecuteUbergraph_ABP_Dragons // (Final|UbergraphFunction|HasDefaults) // @ game+0x38a7480
};

