// AnimBlueprintGeneratedClass ABP_Staff_AgnesScriven_PostProcess.ABP_Staff_AgnesScriven_PostProcess_C
// Size: 0x4b28 (Inherited: 0x2c0)
struct UABP_Staff_AgnesScriven_PostProcess_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c0(0x08)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_57; // 0x2c8(0x118)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_2; // 0x3e0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x820(0x440)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_56; // 0xc60(0x118)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0xd78(0x20)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_55; // 0xd98(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_54; // 0xeb0(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_53; // 0xfc8(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_52; // 0x10e0(0x118)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x11f8(0x20)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_51; // 0x1218(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_50; // 0x1330(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_49; // 0x1448(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_48; // 0x1560(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_47; // 0x1678(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_46; // 0x1790(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_45; // 0x18a8(0x118)
	struct FAnimNode_LinkedInputPose AnimGraphNode_SubInput; // 0x19c0(0x118)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x1ad8(0x30)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_44; // 0x1b08(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_43; // 0x1c20(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_42; // 0x1d38(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_41; // 0x1e50(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_40; // 0x1f68(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_39; // 0x2080(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_38; // 0x2198(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_37; // 0x22b0(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_36; // 0x23c8(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_35; // 0x24e0(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_34; // 0x25f8(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_33; // 0x2710(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_32; // 0x2828(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_31; // 0x2940(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_30; // 0x2a58(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_29; // 0x2b70(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_28; // 0x2c88(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_27; // 0x2da0(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_26; // 0x2eb8(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_25; // 0x2fd0(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_24; // 0x30e8(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_23; // 0x3200(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_22; // 0x3318(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_21; // 0x3430(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_20; // 0x3548(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_19; // 0x3660(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_18; // 0x3778(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_17; // 0x3890(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_16; // 0x39a8(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_15; // 0x3ac0(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_14; // 0x3bd8(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_13; // 0x3cf0(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_12; // 0x3e08(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_11; // 0x3f20(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_10; // 0x4038(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_9; // 0x4150(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_8; // 0x4268(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_7; // 0x4380(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_6; // 0x4498(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_5; // 0x45b0(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_4; // 0x46c8(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_3; // 0x47e0(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_2; // 0x48f8(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController; // 0x4a10(0x118)

	void AnimGraph(struct FPoseLink InPose, struct FPoseLink& AnimGraph); // Function ABP_Staff_AgnesScriven_PostProcess.ABP_Staff_AgnesScriven_PostProcess_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_ABP_Staff_AgnesScriven_PostProcess(int32_t EntryPoint); // Function ABP_Staff_AgnesScriven_PostProcess.ABP_Staff_AgnesScriven_PostProcess_C.ExecuteUbergraph_ABP_Staff_AgnesScriven_PostProcess // (Final|UbergraphFunction) // @ game+0x38a7480
};

