// AnimBlueprintGeneratedClass ABP_World_Events_MagicKiteBattle_Kelpie.ABP_World_Events_MagicKiteBattle_Kelpie_C
// Size: 0x5950 (Inherited: 0x2c0)
struct UABP_World_Events_MagicKiteBattle_Kelpie_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c0(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x2c8(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2f8(0x118)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_20; // 0x410(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_19; // 0x850(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_18; // 0xc90(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_17; // 0x10d0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_16; // 0x1510(0x440)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x1950(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x1970(0x20)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_15; // 0x1990(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_14; // 0x1dd0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_13; // 0x2210(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_12; // 0x2650(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_11; // 0x2a90(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_10; // 0x2ed0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_9; // 0x3310(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_8; // 0x3750(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_7; // 0x3b90(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_6; // 0x3fd0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_5; // 0x4410(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_4; // 0x4850(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_3; // 0x4c90(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_2; // 0x50d0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x5510(0x440)

	void AnimGraph(struct FPoseLink InPose, struct FPoseLink& AnimGraph); // Function ABP_World_Events_MagicKiteBattle_Kelpie.ABP_World_Events_MagicKiteBattle_Kelpie_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_ABP_World_Events_MagicKiteBattle_Kelpie(int32_t EntryPoint); // Function ABP_World_Events_MagicKiteBattle_Kelpie.ABP_World_Events_MagicKiteBattle_Kelpie_C.ExecuteUbergraph_ABP_World_Events_MagicKiteBattle_Kelpie // (Final|UbergraphFunction) // @ game+0x38a7480
};

