// AnimBlueprintGeneratedClass ABP_Sanc_TableTopGameWizardingChess.ABP_Sanc_TableTopGameWizardingChess_C
// Size: 0x708 (Inherited: 0x2c0)
struct UABP_Sanc_TableTopGameWizardingChess_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c0(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x2c8(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x2f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x320(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x348(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x370(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x398(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x418(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x448(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x4c8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x4f8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x578(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x5a8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x628(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x658(0xb0)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP_Sanc_TableTopGameWizardingChess.ABP_Sanc_TableTopGameWizardingChess_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Sanc_TableTopGameWizardingChess_AnimGraphNode_TransitionResult_D4A80834488155B87D4EBA851A708501(); // Function ABP_Sanc_TableTopGameWizardingChess.ABP_Sanc_TableTopGameWizardingChess_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Sanc_TableTopGameWizardingChess_AnimGraphNode_TransitionResult_D4A80834488155B87D4EBA851A708501 // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Sanc_TableTopGameWizardingChess_AnimGraphNode_TransitionResult_A3FD94BC45ED300C6E639995956A2F56(); // Function ABP_Sanc_TableTopGameWizardingChess.ABP_Sanc_TableTopGameWizardingChess_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Sanc_TableTopGameWizardingChess_AnimGraphNode_TransitionResult_A3FD94BC45ED300C6E639995956A2F56 // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Sanc_TableTopGameWizardingChess_AnimGraphNode_TransitionResult_2D5A06CE4BEC9AE8E3578FBF7CB31528(); // Function ABP_Sanc_TableTopGameWizardingChess.ABP_Sanc_TableTopGameWizardingChess_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Sanc_TableTopGameWizardingChess_AnimGraphNode_TransitionResult_2D5A06CE4BEC9AE8E3578FBF7CB31528 // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Sanc_TableTopGameWizardingChess_AnimGraphNode_TransitionResult_D1D104D24F02E0B08E44DC8D3DF42739(); // Function ABP_Sanc_TableTopGameWizardingChess.ABP_Sanc_TableTopGameWizardingChess_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Sanc_TableTopGameWizardingChess_AnimGraphNode_TransitionResult_D1D104D24F02E0B08E44DC8D3DF42739 // (BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_ABP_Sanc_TableTopGameWizardingChess(int32_t EntryPoint); // Function ABP_Sanc_TableTopGameWizardingChess.ABP_Sanc_TableTopGameWizardingChess_C.ExecuteUbergraph_ABP_Sanc_TableTopGameWizardingChess // (Final|UbergraphFunction) // @ game+0x38a7480
};

