// AnimBlueprintGeneratedClass ABP_Horklump.ABP_Horklump_C
// Size: 0x11af (Inherited: 0x2c0)
struct UABP_Horklump_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c0(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x2c8(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_40; // 0x2f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39; // 0x320(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38; // 0x348(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37; // 0x370(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36; // 0x398(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35; // 0x3c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34; // 0x3e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33; // 0x410(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32; // 0x438(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31; // 0x460(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x488(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0x508(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x538(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x5b8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x5e8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x668(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x698(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x718(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30; // 0x748(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29; // 0x770(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28; // 0x798(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27; // 0x7c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26; // 0x7e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25; // 0x810(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24; // 0x838(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23; // 0x860(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22; // 0x888(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21; // 0x8b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20; // 0x8d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0x900(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0x928(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0x950(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0x978(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0x9a0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0x9c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x9f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0xa18(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0xa40(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0xa68(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0xa90(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0xab8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0xae0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0xb08(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0xb30(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0xb58(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0xb80(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0xba8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xbd0(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0xbf8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0xc78(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0xca8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0xd28(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0xd58(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0xdd8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0xe08(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0xe88(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0xeb8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0xf38(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xf68(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0xfe8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0x1018(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x10c8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x10f8(0xb0)
	int32_t NextState; // 0x11a8(0x04)
	bool PlayerClose; // 0x11ac(0x01)
	bool PlayerCollect; // 0x11ad(0x01)
	bool ResetFromCollect; // 0x11ae(0x01)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP_Horklump.ABP_Horklump_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_513E641146A0AB3FDA644BB8932DFEAE(); // Function ABP_Horklump.ABP_Horklump_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_513E641146A0AB3FDA644BB8932DFEAE // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_DF8E58934DB57600494CDEBAF076C58B(); // Function ABP_Horklump.ABP_Horklump_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_DF8E58934DB57600494CDEBAF076C58B // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_65E4A607483ED04C8D410A9CAF61991C(); // Function ABP_Horklump.ABP_Horklump_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_65E4A607483ED04C8D410A9CAF61991C // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_0A998FAB47B7E58553A4EFAC72B76E24(); // Function ABP_Horklump.ABP_Horklump_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_0A998FAB47B7E58553A4EFAC72B76E24 // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_6338B8E144D47F76130A86ACC8B2A04D(); // Function ABP_Horklump.ABP_Horklump_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_6338B8E144D47F76130A86ACC8B2A04D // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_F29296BA478BA3D06F8E8295411A00B9(); // Function ABP_Horklump.ABP_Horklump_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_F29296BA478BA3D06F8E8295411A00B9 // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_3EE91DDB42624393B14CFC81F9E651BB(); // Function ABP_Horklump.ABP_Horklump_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_3EE91DDB42624393B14CFC81F9E651BB // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_84AC3F4A4ADFFC8C0ED98189CF89CD7E(); // Function ABP_Horklump.ABP_Horklump_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_84AC3F4A4ADFFC8C0ED98189CF89CD7E // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_E66EDB264597F66D419CB8A2507C9FD6(); // Function ABP_Horklump.ABP_Horklump_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_E66EDB264597F66D419CB8A2507C9FD6 // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_5D3CED454078C2A91599489D0691B827(); // Function ABP_Horklump.ABP_Horklump_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_5D3CED454078C2A91599489D0691B827 // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_1449DE214DB6870789AB96BE6B6D2511(); // Function ABP_Horklump.ABP_Horklump_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_1449DE214DB6870789AB96BE6B6D2511 // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_B528F5E7493C5CAAD3A06995057D78DE(); // Function ABP_Horklump.ABP_Horklump_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_B528F5E7493C5CAAD3A06995057D78DE // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_2FC7C943472DC56E0B867DA651CFA973(); // Function ABP_Horklump.ABP_Horklump_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_2FC7C943472DC56E0B867DA651CFA973 // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_F748BC58442F1AF1E02888B5FCA67771(); // Function ABP_Horklump.ABP_Horklump_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_F748BC58442F1AF1E02888B5FCA67771 // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_8B5919B94EC782E9C145AA99B0811896(); // Function ABP_Horklump.ABP_Horklump_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_8B5919B94EC782E9C145AA99B0811896 // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_7BB0DE5B434FA139C9D7C1B419B42F52(); // Function ABP_Horklump.ABP_Horklump_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_7BB0DE5B434FA139C9D7C1B419B42F52 // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_4820DB12411A9CB16A2CAA8BE91A8E5A(); // Function ABP_Horklump.ABP_Horklump_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_4820DB12411A9CB16A2CAA8BE91A8E5A // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_FA476A524F5E380EA38CEE98C1EBEEC3(); // Function ABP_Horklump.ABP_Horklump_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_FA476A524F5E380EA38CEE98C1EBEEC3 // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_526E47B84295384CCF190EB253A50540(); // Function ABP_Horklump.ABP_Horklump_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_526E47B84295384CCF190EB253A50540 // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_378343754E1CCCBA180B23B172B53FAD(); // Function ABP_Horklump.ABP_Horklump_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_378343754E1CCCBA180B23B172B53FAD // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_AE8ABB5B463F774CB6CC0A8F2DB59E57(); // Function ABP_Horklump.ABP_Horklump_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_AE8ABB5B463F774CB6CC0A8F2DB59E57 // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_89C17004488FD35633C7659D5FDA6FC5(); // Function ABP_Horklump.ABP_Horklump_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_89C17004488FD35633C7659D5FDA6FC5 // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_4D28BD96473AB2E6625BEBBC32EBDF59(); // Function ABP_Horklump.ABP_Horklump_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_4D28BD96473AB2E6625BEBBC32EBDF59 // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_767588804EC68C884E14C1AFFBE29794(); // Function ABP_Horklump.ABP_Horklump_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_767588804EC68C884E14C1AFFBE29794 // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_6B937A8B4512198F5A0C37B25CBD325C(); // Function ABP_Horklump.ABP_Horklump_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_6B937A8B4512198F5A0C37B25CBD325C // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_67CAC29748295B9DD9C22F88ACBB8F34(); // Function ABP_Horklump.ABP_Horklump_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_67CAC29748295B9DD9C22F88ACBB8F34 // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_19CCF14148F35D7C7C6203AFF58899D4(); // Function ABP_Horklump.ABP_Horklump_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_19CCF14148F35D7C7C6203AFF58899D4 // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_1C8660D546DC10B1C434B5814D689C49(); // Function ABP_Horklump.ABP_Horklump_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_1C8660D546DC10B1C434B5814D689C49 // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_CCAD02E04861BEC71B02D4AD1D973149(); // Function ABP_Horklump.ABP_Horklump_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_CCAD02E04861BEC71B02D4AD1D973149 // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_91285E0047A06C84435F30AD91946142(); // Function ABP_Horklump.ABP_Horklump_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_91285E0047A06C84435F30AD91946142 // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_68EB2F3243B333A4712B5AB07B65E9EE(); // Function ABP_Horklump.ABP_Horklump_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_68EB2F3243B333A4712B5AB07B65E9EE // (BlueprintEvent) // @ game+0x38a7480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_1D4F8DBE4A6E5AF04A729E9E97A8D470(); // Function ABP_Horklump.ABP_Horklump_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Horklump_AnimGraphNode_TransitionResult_1D4F8DBE4A6E5AF04A729E9E97A8D470 // (BlueprintEvent) // @ game+0x38a7480
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function ABP_Horklump.ABP_Horklump_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ResetFromCollectEvent(); // Function ABP_Horklump.ABP_Horklump_C.ResetFromCollectEvent // (BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_ABP_Horklump(int32_t EntryPoint); // Function ABP_Horklump.ABP_Horklump_C.ExecuteUbergraph_ABP_Horklump // (Final|UbergraphFunction) // @ game+0x38a7480
};

