// AnimBlueprintGeneratedClass ABP_FlyingBroom.ABP_FlyingBroom_C
// Size: 0x9f80 (Inherited: 0x2c0)
struct UABP_FlyingBroom_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c0(0x08)
	struct FAnimNode_LinkedInputPose AnimGraphNode_SubInput; // 0x2c8(0x118)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x3e0(0x20)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_34; // 0x400(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_33; // 0x840(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_32; // 0xc80(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_31; // 0x10c0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_30; // 0x1500(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_29; // 0x1940(0x440)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x1d80(0x20)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_28; // 0x1da0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_27; // 0x21e0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_26; // 0x2620(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_25; // 0x2a60(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_24; // 0x2ea0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_23; // 0x32e0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_22; // 0x3720(0x440)
	struct FAnimNode_SpringBone AnimGraphNode_SpringBone_3; // 0x3b60(0x128)
	char pad_3C88[0x8]; // 0x3c88(0x08)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_21; // 0x3c90(0x440)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x40d0(0x30)
	struct FAnimNode_Trail AnimGraphNode_Trail_3; // 0x4100(0x260)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_20; // 0x4360(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_19; // 0x47a0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_18; // 0x4be0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_17; // 0x5020(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_16; // 0x5460(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_15; // 0x58a0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_14; // 0x5ce0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_13; // 0x6120(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_12; // 0x6560(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_11; // 0x69a0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_10; // 0x6de0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_9; // 0x7220(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_8; // 0x7660(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_7; // 0x7aa0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_6; // 0x7ee0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_5; // 0x8320(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_4; // 0x8760(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_3; // 0x8ba0(0x440)
	struct FAnimNode_Trail AnimGraphNode_Trail_2; // 0x8fe0(0x260)
	struct FAnimNode_SpringBone AnimGraphNode_SpringBone_2; // 0x9240(0x128)
	char pad_9368[0x8]; // 0x9368(0x08)
	struct FAnimNode_Trail AnimGraphNode_Trail; // 0x9370(0x260)
	struct FAnimNode_SpringBone AnimGraphNode_SpringBone; // 0x95d0(0x128)
	char pad_96F8[0x8]; // 0x96f8(0x08)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_2; // 0x9700(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x9b40(0x440)

	void AnimGraph(struct FPoseLink InPose, struct FPoseLink& AnimGraph); // Function ABP_FlyingBroom.ABP_FlyingBroom_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_ABP_FlyingBroom(int32_t EntryPoint); // Function ABP_FlyingBroom.ABP_FlyingBroom_C.ExecuteUbergraph_ABP_FlyingBroom // (Final|UbergraphFunction) // @ game+0x38a7480
};

