// AnimBlueprintGeneratedClass ABP_World_Events_MagicKiteBattle_Badger.ABP_World_Events_MagicKiteBattle_Badger_C
// Size: 0x83d8 (Inherited: 0x2c0)
struct UABP_World_Events_MagicKiteBattle_Badger_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c0(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x2c8(0x30)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x2f8(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x318(0x20)
	char pad_338[0x8]; // 0x338(0x08)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_30; // 0x340(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_29; // 0x780(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_28; // 0xbc0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_27; // 0x1000(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_26; // 0x1440(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_25; // 0x1880(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_24; // 0x1cc0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_23; // 0x2100(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_22; // 0x2540(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_21; // 0x2980(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_20; // 0x2dc0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_19; // 0x3200(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_18; // 0x3640(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_17; // 0x3a80(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_16; // 0x3ec0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_15; // 0x4300(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_14; // 0x4740(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_13; // 0x4b80(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_12; // 0x4fc0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_11; // 0x5400(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_10; // 0x5840(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_9; // 0x5c80(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_8; // 0x60c0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_7; // 0x6500(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_6; // 0x6940(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_5; // 0x6d80(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_4; // 0x71c0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_3; // 0x7600(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_2; // 0x7a40(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x7e80(0x440)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x82c0(0x118)

	void AnimGraph(struct FPoseLink InPose, struct FPoseLink& AnimGraph); // Function ABP_World_Events_MagicKiteBattle_Badger.ABP_World_Events_MagicKiteBattle_Badger_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_ABP_World_Events_MagicKiteBattle_Badger(int32_t EntryPoint); // Function ABP_World_Events_MagicKiteBattle_Badger.ABP_World_Events_MagicKiteBattle_Badger_C.ExecuteUbergraph_ABP_World_Events_MagicKiteBattle_Badger // (Final|UbergraphFunction) // @ game+0x38a7480
};

