// AnimBlueprintGeneratedClass ABP_Professor_MudiwaOnai_PostProcess.ABP_Professor_MudiwaOnai_PostProcess_C
// Size: 0x5c40 (Inherited: 0x2c0)
struct UABP_Professor_MudiwaOnai_PostProcess_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c0(0x08)
	char pad_2C8[0x8]; // 0x2c8(0x08)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_6; // 0x2d0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_5; // 0x710(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_4; // 0xb50(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_3; // 0xf90(0x440)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x13d0(0x20)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_57; // 0x13f0(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_56; // 0x1508(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_55; // 0x1620(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_54; // 0x1738(0x118)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x1850(0x20)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_53; // 0x1870(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_52; // 0x1988(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_51; // 0x1aa0(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_50; // 0x1bb8(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_49; // 0x1cd0(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_48; // 0x1de8(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_47; // 0x1f00(0x118)
	char pad_2018[0x8]; // 0x2018(0x08)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_2; // 0x2020(0x440)
	struct FAnimNode_LinkedInputPose AnimGraphNode_SubInput; // 0x2460(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_46; // 0x2578(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_45; // 0x2690(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_44; // 0x27a8(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_43; // 0x28c0(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_42; // 0x29d8(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_41; // 0x2af0(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_40; // 0x2c08(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_39; // 0x2d20(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_38; // 0x2e38(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_37; // 0x2f50(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_36; // 0x3068(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_35; // 0x3180(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_34; // 0x3298(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_33; // 0x33b0(0x118)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x34c8(0x30)
	char pad_34F8[0x8]; // 0x34f8(0x08)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x3500(0x440)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_32; // 0x3940(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_31; // 0x3a58(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_30; // 0x3b70(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_29; // 0x3c88(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_28; // 0x3da0(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_27; // 0x3eb8(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_26; // 0x3fd0(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_25; // 0x40e8(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_24; // 0x4200(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_23; // 0x4318(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_22; // 0x4430(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_21; // 0x4548(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_20; // 0x4660(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_19; // 0x4778(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_18; // 0x4890(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_17; // 0x49a8(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_16; // 0x4ac0(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_15; // 0x4bd8(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_14; // 0x4cf0(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_13; // 0x4e08(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_12; // 0x4f20(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_11; // 0x5038(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_10; // 0x5150(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_9; // 0x5268(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_8; // 0x5380(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_7; // 0x5498(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_6; // 0x55b0(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_5; // 0x56c8(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_4; // 0x57e0(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_3; // 0x58f8(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_2; // 0x5a10(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController; // 0x5b28(0x118)

	void AnimGraph(struct FPoseLink InPose, struct FPoseLink& AnimGraph); // Function ABP_Professor_MudiwaOnai_PostProcess.ABP_Professor_MudiwaOnai_PostProcess_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_ABP_Professor_MudiwaOnai_PostProcess(int32_t EntryPoint); // Function ABP_Professor_MudiwaOnai_PostProcess.ABP_Professor_MudiwaOnai_PostProcess_C.ExecuteUbergraph_ABP_Professor_MudiwaOnai_PostProcess // (Final|UbergraphFunction) // @ game+0x38a7480
};

