// AnimBlueprintGeneratedClass ABP_World_Events_MagicKiteBattle_Lion.ABP_World_Events_MagicKiteBattle_Lion_C
// Size: 0xf698 (Inherited: 0x2c0)
struct UABP_World_Events_MagicKiteBattle_Lion_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c0(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x2c8(0x30)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x2f8(0x20)
	char pad_318[0x8]; // 0x318(0x08)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_57; // 0x320(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_56; // 0x760(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_55; // 0xba0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_54; // 0xfe0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_53; // 0x1420(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_52; // 0x1860(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_51; // 0x1ca0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_50; // 0x20e0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_49; // 0x2520(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_48; // 0x2960(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_47; // 0x2da0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_46; // 0x31e0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_45; // 0x3620(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_44; // 0x3a60(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_43; // 0x3ea0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_42; // 0x42e0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_41; // 0x4720(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_40; // 0x4b60(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_39; // 0x4fa0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_38; // 0x53e0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_37; // 0x5820(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_36; // 0x5c60(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_35; // 0x60a0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_34; // 0x64e0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_33; // 0x6920(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_32; // 0x6d60(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_31; // 0x71a0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_30; // 0x75e0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_29; // 0x7a20(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_28; // 0x7e60(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_27; // 0x82a0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_26; // 0x86e0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_25; // 0x8b20(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_24; // 0x8f60(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_23; // 0x93a0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_22; // 0x97e0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_21; // 0x9c20(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_20; // 0xa060(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_19; // 0xa4a0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_18; // 0xa8e0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_17; // 0xad20(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_16; // 0xb160(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_15; // 0xb5a0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_14; // 0xb9e0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_13; // 0xbe20(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_12; // 0xc260(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_11; // 0xc6a0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_10; // 0xcae0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_9; // 0xcf20(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_8; // 0xd360(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_7; // 0xd7a0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_6; // 0xdbe0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_5; // 0xe020(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_4; // 0xe460(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_3; // 0xe8a0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_2; // 0xece0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0xf120(0x440)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0xf560(0x118)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0xf678(0x20)

	void AnimGraph(struct FPoseLink InPose, struct FPoseLink& AnimGraph); // Function ABP_World_Events_MagicKiteBattle_Lion.ABP_World_Events_MagicKiteBattle_Lion_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_ABP_World_Events_MagicKiteBattle_Lion(int32_t EntryPoint); // Function ABP_World_Events_MagicKiteBattle_Lion.ABP_World_Events_MagicKiteBattle_Lion_C.ExecuteUbergraph_ABP_World_Events_MagicKiteBattle_Lion // (Final|UbergraphFunction) // @ game+0x38a7480
};

