// BlueprintGeneratedClass BP_BanditCamp_CrateStackA.BP_BanditCamp_CrateStackA_C
// Size: 0x2b0 (Inherited: 0x248)
struct ABP_BanditCamp_CrateStackA_C : AActor {
	struct UStaticMeshComponent* SM_HW_GenericTrunk_C2_StaticMeshComponent0; // 0x248(0x08)
	struct UStaticMeshComponent* SM_HW_GenericTrunk_A5_StaticMeshComponent0; // 0x250(0x08)
	struct UStaticMeshComponent* SM_Goblin_Crates_Medium_Blue_Metal2_StaticMeshComponent0; // 0x258(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse9; // 0x260(0x08)
	struct UStaticMeshComponent* SM_Goblin_Crates_Medium_Blue_Metal3_StaticMeshComponent0; // 0x268(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse7; // 0x270(0x08)
	struct UStaticMeshComponent* SM_HW_GenericTrunk_A3_StaticMeshComponent0; // 0x278(0x08)
	struct UStaticMeshComponent* SM_HW_GenericTrunk_A4_StaticMeshComponent0; // 0x280(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse6; // 0x288(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse4; // 0x290(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Large_001_W19_StaticMeshComponent0; // 0x298(0x08)
	struct UStaticMeshComponent* SM_HW_GenericTrunk_B3_StaticMeshComponent0; // 0x2a0(0x08)
	struct USceneComponent* SharedRoot; // 0x2a8(0x08)
};

