// BlueprintGeneratedClass BP_Bridge_Old_A.BP_Bridge_Old_A_C
// Size: 0x2e0 (Inherited: 0x248)
struct ABP_Bridge_Old_A_C : AActor {
	struct UStaticMeshComponent* SM_MERGED_BP_Bridge_Old_A_2_COL; // 0x248(0x08)
	struct UDecalComponent* MI_LargeDirt_231; // 0x250(0x08)
	struct UDecalComponent* MI_LargeDirt3_242; // 0x258(0x08)
	struct UDecalComponent* MI_LargeDirt_230; // 0x260(0x08)
	struct UDecalComponent* MI_P_Decal_Stain6_243; // 0x268(0x08)
	struct UDecalComponent* MI_LargeDirt3_241; // 0x270(0x08)
	struct UDecalComponent* MI_LargeDirt2_239; // 0x278(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_F3_235; // 0x280(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_F2_233; // 0x288(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_F_231; // 0x290(0x08)
	struct UDecalComponent* MI_LargeDirt_229; // 0x298(0x08)
	struct UDecalComponent* MI_P_Decal_Stain5_227; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_Bridge_Old_Path_A; // 0x2a8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_CastleRuins_1_Top_Trim_Cap_A; // 0x2b0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_1_Broken_End_Cap_A_a; // 0x2b8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_1_Bricks_A_m; // 0x2c0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_14SM_CastleRuins_1_Wall_Roof_Beam_A_b; // 0x2c8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_1_Bottom_Wall_Damaged_B; // 0x2d0(0x08)
	struct USceneComponent* SharedRoot; // 0x2d8(0x08)
};

