// BlueprintGeneratedClass BP_Bridge_Wide_A.BP_Bridge_Wide_A_C
// Size: 0x308 (Inherited: 0x248)
struct ABP_Bridge_Wide_A_C : AActor {
	struct UDecalComponent* M_Cairn_Wetness_drips_Inst; // 0x248(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_F4; // 0x250(0x08)
	struct UDecalComponent* MI_P_Decal_Stain8; // 0x258(0x08)
	struct UDecalComponent* MI_P_Decal_Stain7; // 0x260(0x08)
	struct UDecalComponent* MI_P_Decal_Stain17; // 0x268(0x08)
	struct UDecalComponent* MI_P_Decal_Stain6; // 0x270(0x08)
	struct UDecalComponent* MI_P_Decal_Stain16; // 0x278(0x08)
	struct UDecalComponent* MI_P_Decal_Stain5; // 0x280(0x08)
	struct UDecalComponent* MI_P_Decal_Stain15; // 0x288(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_F3; // 0x290(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_F2; // 0x298(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_F; // 0x2a0(0x08)
	struct UDecalComponent* MI_P_Decal_Stain14; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_Bridge_Wide_Base; // 0x2b0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_34SM_CastleRuins_2_Bricks_A_a; // 0x2b8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_CastleRuins_1_Wall_Roof_Beam_A_a; // 0x2c0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_42SM_CastleRuins_2_Bricks_A_n; // 0x2c8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_8SM_CastleRuins_1_Bottom_Brick_A; // 0x2d0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_22SM_CastleRuins_2_Bricks_A_r; // 0x2d8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_1_Wall_Roof_Beam_A_b; // 0x2e0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Bridge_Wide_Rail; // 0x2e8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_1_Broken_End_Cap_A_a1; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_Bridge_Wide_Trim; // 0x2f8(0x08)
	struct USceneComponent* SharedRoot; // 0x300(0x08)
};

