// BlueprintGeneratedClass BP_Bothy_C_Int_02.BP_Bothy_C_Int_02_C
// Size: 0x420 (Inherited: 0x248)
struct ABP_Bothy_C_Int_02_C : AActor {
	struct UStaticMeshComponent* Plane2; // 0x248(0x08)
	struct UStaticMeshComponent* Plane1; // 0x250(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeLashing_A1; // 0x258(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeLashing_A; // 0x260(0x08)
	struct UStaticMeshComponent* SM_Cairn_HangingVessels_B2_StaticMeshComponent0; // 0x268(0x08)
	struct UStaticMeshComponent* SM_BCProps_Wood_Chopped_Medium_001_StaticMeshComponent0; // 0x270(0x08)
	struct UStaticMeshComponent* SM_HM_Stacking_Cauldron_C_StaticMeshComponent1; // 0x278(0x08)
	struct UStaticMeshComponent* SM_HM_Cauldron_Cauldron_L_StaticMeshComponent0; // 0x280(0x08)
	struct UStaticMeshComponent* SM_HM_Stacking_Cauldron_E_StaticMeshComponent1; // 0x288(0x08)
	struct UStaticMeshComponent* SM_HM_Cauldron_Cauldron_I_StaticMeshComponent0; // 0x290(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeSpan_J_StaticMeshComponent0; // 0x298(0x08)
	struct UStaticMeshComponent* SM_HM_Stacking_Cauldron_F_StaticMeshComponent0; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_HM_Stacking_Cauldron_C_StaticMeshComponent0; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_HM_Stacking_Cauldron_B_StaticMeshComponent0; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_HM_Stacking_Cauldron_A_StaticMeshComponent0; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_HM_Potions_Cauldron_B_Small_StaticMeshComponent0; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_HM_Stacking_Cauldron_E_StaticMeshComponent0; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_HM_Stacking_Cauldron_C2_StaticMeshComponent0; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_CastleDun_GOB_Bottle_C2_StaticMeshComponent0; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_Cairn_WoodShelf_B_StaticMeshComponent0; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_Book_03_StaticMeshComponent0; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_WE_Newspaper_02_StaticMeshComponent0; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_Cav_MiningLamp_01_StaticMeshComponent0; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_HM_Pillow_A_StaticMeshComponent0; // 0x300(0x08)
	struct UStaticMeshComponent* SM_CampA_Int_Bed_01A_StaticMeshComponent0; // 0x308(0x08)
	struct UStaticMeshComponent* SM_HM_Mattress_B_StaticMeshComponent0; // 0x310(0x08)
	struct UStaticMeshComponent* SM_OVR_Kitchenware_item_F_StaticMeshComponent3; // 0x318(0x08)
	struct UStaticMeshComponent* SM_BCProps_Eyelet_A_StaticMeshComponent3; // 0x320(0x08)
	struct UStaticMeshComponent* SM_OVR_Kitchenware_item_F_StaticMeshComponent2; // 0x328(0x08)
	struct UStaticMeshComponent* SM_OVR_Kitchenware_item_F_StaticMeshComponent1; // 0x330(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_BroomstickRack_B2_StaticMeshComponent0; // 0x338(0x08)
	struct UStaticMeshComponent* SM_BCProps_Eyelet_A_StaticMeshComponent1; // 0x340(0x08)
	struct UStaticMeshComponent* SM_BCProps_Eyelet_A_StaticMeshComponent0; // 0x348(0x08)
	struct UStaticMeshComponent* SM_CampB_5m_PostA_StaticMeshComponent0; // 0x350(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Bottle_3_StaticMeshComponent0; // 0x358(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Bottle_2_StaticMeshComponent0; // 0x360(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Bottle_4_StaticMeshComponent0; // 0x368(0x08)
	struct UStaticMeshComponent* SM_HM_HogsHead_Table_StaticMeshComponent0; // 0x370(0x08)
	struct UStaticMeshComponent* SM_CastleDun_Stool_B_StaticMeshComponent0; // 0x378(0x08)
	struct UStaticMeshComponent* SM_CastleDun_Stool_B2_StaticMeshComponent0; // 0x380(0x08)
	struct UStaticMeshComponent* SM_OVR_Kitchenware_item_F_StaticMeshComponent0; // 0x388(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Frame_B_StaticMeshComponent0; // 0x390(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Frame_A_StaticMeshComponent0; // 0x398(0x08)
	struct UDecalComponent* MI_Sanc_BIO_Decal_Stain_Water_ExtraLarge_NewDecalComponent; // 0x3a0(0x08)
	struct UDecalComponent* MI_P_Decal_Stain15_NewDecalComponent1; // 0x3a8(0x08)
	struct UDecalComponent* MI_P_Decal_Stain15_NewDecalComponent; // 0x3b0(0x08)
	struct UDecalComponent* MI_P_Decal_Stain14_NewDecalComponent; // 0x3b8(0x08)
	struct UDecalComponent* MI_HW_Decal_Wood_WornPath_3_NewDecalComponent; // 0x3c0(0x08)
	struct UDecalComponent* MI_HW_Decal_Wood_WornPath_2_NewDecalComponent; // 0x3c8(0x08)
	struct UDecalComponent* MI_HW_Decal_Wood_WornPath_01_NewDecalComponent; // 0x3d0(0x08)
	struct UDecalComponent* MI_HM_Decal_Dirt_C1_NewDecalComponent; // 0x3d8(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Soot_A_NewDecalComponent1; // 0x3e0(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Soot_A_NewDecalComponent; // 0x3e8(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_LargeDirt_NewDecalComponent; // 0x3f0(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Dirt_A_NewDecalComponent; // 0x3f8(0x08)
	struct UDecalComponent* MI_BCProps_Decal_AshCircle_B_NewDecalComponent; // 0x400(0x08)
	struct UDecalComponent* MI_BCProps_Decal_Ash_A_NewDecalComponent; // 0x408(0x08)
	struct UStaticMeshComponent* SM_BCProps_Eyelet_A_StaticMeshComponent2; // 0x410(0x08)
	struct USceneComponent* SharedRoot; // 0x418(0x08)
};

