// BlueprintGeneratedClass BP_Bothy_A_Int_02.BP_Bothy_A_Int_02_C
// Size: 0x3d0 (Inherited: 0x248)
struct ABP_Bothy_A_Int_02_C : AActor {
	struct UStaticMeshComponent* Collision; // 0x248(0x08)
	struct UStaticMeshComponent* SM_HW_MC_Nail2_StaticMeshComponent0; // 0x250(0x08)
	struct UStaticMeshComponent* SM_HW_MC_Nail3_StaticMeshComponent0; // 0x258(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_BroomstickRack_B3_StaticMeshComponent0; // 0x260(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_BroomstickRack_B2_StaticMeshComponent0; // 0x268(0x08)
	struct UStaticMeshComponent* SM_HW_LetterCluster_F_StaticMeshComponent0; // 0x270(0x08)
	struct UStaticMeshComponent* SM_HW_TallBookStack_A_StaticMeshComponent0; // 0x278(0x08)
	struct UStaticMeshComponent* SM_HW_TallBookStack_C_StaticMeshComponent0; // 0x280(0x08)
	struct UStaticMeshComponent* SM_HW_TallBookStack_B_StaticMeshComponent0; // 0x288(0x08)
	struct UStaticMeshComponent* SM_Cav_MiningLamp_01_StaticMeshComponent0; // 0x290(0x08)
	struct UStaticMeshComponent* SM_HM_Pillow_A_StaticMeshComponent0; // 0x298(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Haystack_1Bale_001_W_StaticMeshComponent0; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_HM_Mattress_C_StaticMeshComponent0; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Haystack_1Bale_001_W2_StaticMeshComponent0; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_CampA_Int_BedRug_01B_StaticMeshComponent0; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_CastleDun_HayPile_C_StaticMeshComponent0; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeStake_C2_StaticMeshComponent0; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_HW_DAO_TribalMask_B_StaticMeshComponent0; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_HangingProps_Bags_004_W_StaticMeshComponent0; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_HM_FireWood_Stack_A_StaticMeshComponent0; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Bellows_003_W_StaticMeshComponent0; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeSpan_D2_StaticMeshComponent0; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeSpan_A_StaticMeshComponent0; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_HM_Rope_Candle_Lamp_B_StaticMeshComponent0; // 0x300(0x08)
	struct UStaticMeshComponent* SM_CastleDun_GOB_Cup_StaticMeshComponent0; // 0x308(0x08)
	struct UStaticMeshComponent* SM_HW_Book_StaticMeshComponent0; // 0x310(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Stool_001_D2_StaticMeshComponent0; // 0x318(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Log_Stump_001_D_StaticMeshComponent0; // 0x320(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Stool_001_D_StaticMeshComponent0; // 0x328(0x08)
	struct UDecalComponent* MI_Sanc_BIO_Decal_Stain_Water_ExtraLarge3_NewDecalComponent; // 0x330(0x08)
	struct UDecalComponent* MI_Sanc_BIO_Decal_Stain_Water_ExtraLarge2_NewDecalComponent; // 0x338(0x08)
	struct UDecalComponent* MI_Sanc_BIO_Decal_Stain_Water_ExtraLarge_NewDecalComponent; // 0x340(0x08)
	struct UDecalComponent* MI_P_Decal_Stain15_NewDecalComponent3; // 0x348(0x08)
	struct UDecalComponent* MI_P_Decal_Stain15_NewDecalComponent2; // 0x350(0x08)
	struct UDecalComponent* MI_P_Decal_Stain15_NewDecalComponent1; // 0x358(0x08)
	struct UDecalComponent* MI_P_Decal_Stain15_NewDecalComponent; // 0x360(0x08)
	struct UDecalComponent* MI_P_Decal_Stain14_NewDecalComponent; // 0x368(0x08)
	struct UDecalComponent* MI_HW_Decal_Wood_WornPath_01_NewDecalComponent; // 0x370(0x08)
	struct UDecalComponent* MI_HM_Decal_Dirt_C1_NewDecalComponent; // 0x378(0x08)
	struct UDecalComponent* MI_Castle_Ruin1_Decal_SootSmudge_5_NewDecalComponent; // 0x380(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Soot_A_NewDecalComponent; // 0x388(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Dirt_A_NewDecalComponent; // 0x390(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_AshCircle_B_2_NewDecalComponent; // 0x398(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_B_NewDecalComponent; // 0x3a0(0x08)
	struct UDecalComponent* MI_BCProps_Decal_Ash_A_NewDecalComponent; // 0x3a8(0x08)
	struct UDecalComponent* M_Cav_Decal_Dirt_01_NewDecalComponent; // 0x3b0(0x08)
	struct UDecalComponent* M_Cairn_Decal_grunge_G_Inst_NewDecalComponent; // 0x3b8(0x08)
	struct UStaticMeshComponent* SM_HW_MC_Nail_StaticMeshComponent0; // 0x3c0(0x08)
	struct USceneComponent* SharedRoot; // 0x3c8(0x08)
};

