// BlueprintGeneratedClass BP_BridgeTall_Pillar_B.BP_BridgeTall_Pillar_B_C
// Size: 0x2d0 (Inherited: 0x248)
struct ABP_BridgeTall_Pillar_B_C : AActor {
	struct UStaticMeshComponent* SM_CastleRuins_2_SquarePillars_A_b12; // 0x248(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_SquarePillars_A_b11; // 0x250(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_Relief_J1; // 0x258(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_Relief_J; // 0x260(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_SquarePillars_A_b10; // 0x268(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_SquarePillars_A_b9; // 0x270(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_SquarePillars_A_b8; // 0x278(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_SquarePillars_A_b7; // 0x280(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_SquarePillars_A_b6; // 0x288(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_SquarePillars_A_b5; // 0x290(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_SquarePillars_A_b4; // 0x298(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_SquarePillars_A_b3; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_SquarePillars_A_b2; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_SquarePillars_A_b1; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_SquarePillars_A_b; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_Tall_Pillar_A; // 0x2c0(0x08)
	struct USceneComponent* SharedRoot; // 0x2c8(0x08)
};

