// BlueprintGeneratedClass BP_Bothy_C.BP_Bothy_C_C
// Size: 0x5a0 (Inherited: 0x248)
struct ABP_Bothy_C_C : AActor {
	struct UPointLightComponent* PointLight1; // 0x248(0x08)
	struct UPointLightComponent* PointLight; // 0x250(0x08)
	struct UStaticMeshComponent* SM_BothyC_Windows_Int; // 0x258(0x08)
	struct UStaticMeshComponent* SM_BothyC_RockCorners; // 0x260(0x08)
	struct UStaticMeshComponent* SM_BothyC_INT_PL_COL1; // 0x268(0x08)
	struct USceneComponent* Scene; // 0x270(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_A3; // 0x278(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_A2; // 0x280(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_A; // 0x288(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Color_B6; // 0x290(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Color_B5; // 0x298(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Color_B4; // 0x2a0(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Color_B3; // 0x2a8(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Color_B2; // 0x2b0(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Color_B; // 0x2b8(0x08)
	struct UDecalComponent* MI_SanctumDun_Decal_Edge_B3; // 0x2c0(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_D2; // 0x2c8(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_D; // 0x2d0(0x08)
	struct UDecalComponent* MI_SanctumDun_Decal_Edge_B2; // 0x2d8(0x08)
	struct UDecalComponent* MI_SanctumDun_Decal_Edge_B1; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_HM_Roof_Shingle_E6; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_HM_Roof_Shingle_E5; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_HM_Roof_Shingle_E4; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_HM_Roof_Shingle_E3; // 0x300(0x08)
	struct UStaticMeshComponent* SM_HM_Roof_Shingle_E2; // 0x308(0x08)
	struct UStaticMeshComponent* SM_HM_Roof_Shingle_E1; // 0x310(0x08)
	struct UStaticMeshComponent* SM_BothyC_Fireplace; // 0x318(0x08)
	struct UStaticMeshComponent* SM_BothyC_RockEdge; // 0x320(0x08)
	struct UStaticMeshComponent* SM_BothyC_Walls; // 0x328(0x08)
	struct UStaticMeshComponent* SM_BothyC_Windows; // 0x330(0x08)
	struct UStaticMeshComponent* SM_BothyC_Ceiling; // 0x338(0x08)
	struct UStaticMeshComponent* SM_BothyC_Chimney; // 0x340(0x08)
	struct UStaticMeshComponent* SM_BothyC_Floor; // 0x348(0x08)
	struct UStaticMeshComponent* SM_BothyC_Roof; // 0x350(0x08)
	struct UStaticMeshComponent* SM_BothyC_Trims; // 0x358(0x08)
	struct UStaticMeshComponent* SM_Bothy_Twig_13; // 0x360(0x08)
	struct UStaticMeshComponent* SM_Bothy_Twig_12; // 0x368(0x08)
	struct UStaticMeshComponent* SM_Bothy_Twig_11; // 0x370(0x08)
	struct UStaticMeshComponent* SM_Bothy_Twig_10; // 0x378(0x08)
	struct UStaticMeshComponent* SM_Bothy_Twig_9; // 0x380(0x08)
	struct UStaticMeshComponent* SM_Bothy_Twig_02; // 0x388(0x08)
	struct UStaticMeshComponent* SM_HM_Stone_Trim_Corner_1sided_E4; // 0x390(0x08)
	struct UStaticMeshComponent* SM_HM_Stone_Trim_Corner_1sided_E3; // 0x398(0x08)
	struct UStaticMeshComponent* SM_HM_Stone_Trim_Corner_1sided_E2; // 0x3a0(0x08)
	struct UStaticMeshComponent* SM_HM_Stone_Trim_Corner_1sided_E; // 0x3a8(0x08)
	struct UStaticMeshComponent* SM_Overland_Rock_13; // 0x3b0(0x08)
	struct UStaticMeshComponent* SM_Overland_Rock_12; // 0x3b8(0x08)
	struct UStaticMeshComponent* SM_Overland_Rock_11; // 0x3c0(0x08)
	struct UStaticMeshComponent* SM_OL_Rock_SM_Light_J3; // 0x3c8(0x08)
	struct UStaticMeshComponent* SM_OL_Rock_SM_Light_J2; // 0x3d0(0x08)
	struct UStaticMeshComponent* SM_OL_Rock_SM_Light_J; // 0x3d8(0x08)
	struct UStaticMeshComponent* SM_OL_Rock_Md_Light_A11; // 0x3e0(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_A4; // 0x3e8(0x08)
	struct UStaticMeshComponent* SM_OL_Rock_Md_Light_A9; // 0x3f0(0x08)
	struct UStaticMeshComponent* SM_OL_Rock_Md_Light_A8; // 0x3f8(0x08)
	struct UStaticMeshComponent* SM_OL_Rock_Md_Light_A7; // 0x400(0x08)
	struct UStaticMeshComponent* SM_OL_Rock_Md_Light_A6; // 0x408(0x08)
	struct UStaticMeshComponent* SM_OL_Rock_Md_Light_A5; // 0x410(0x08)
	struct UStaticMeshComponent* SM_OL_Rock_Md_Light_A4; // 0x418(0x08)
	struct UStaticMeshComponent* SM_OL_Rock_Md_Light_A3; // 0x420(0x08)
	struct UStaticMeshComponent* SM_OL_Rock_Md_Light_A2; // 0x428(0x08)
	struct UStaticMeshComponent* SM_OL_Rock_Md_Light_A; // 0x430(0x08)
	struct UStaticMeshComponent* SM_OL_Rock_SM_Light_E2; // 0x438(0x08)
	struct UStaticMeshComponent* SM_OL_Rock_SM_Light_E; // 0x440(0x08)
	struct UStaticMeshComponent* SM_OL_Rock_SM_Light_B4; // 0x448(0x08)
	struct UStaticMeshComponent* SM_OL_Rock_SM_Light_B3; // 0x450(0x08)
	struct UStaticMeshComponent* SM_OL_Rock_SM_Light_B2; // 0x458(0x08)
	struct UStaticMeshComponent* SM_OL_Rock_SM_Light_B; // 0x460(0x08)
	struct UStaticMeshComponent* SM_OL_Rock_Md_Light_D8; // 0x468(0x08)
	struct UStaticMeshComponent* SM_OL_Rock_Md_Light_D7; // 0x470(0x08)
	struct UStaticMeshComponent* SM_OL_Rock_Md_Light_D6; // 0x478(0x08)
	struct UStaticMeshComponent* SM_OL_Rock_Md_Light_D5; // 0x480(0x08)
	struct UStaticMeshComponent* SM_OL_Rock_Md_Light_D4; // 0x488(0x08)
	struct UStaticMeshComponent* SM_OL_Rock_Md_Light_D3; // 0x490(0x08)
	struct UStaticMeshComponent* SM_OL_Rock_Md_Light_D2; // 0x498(0x08)
	struct UStaticMeshComponent* SM_OL_Rock_Md_Light_D; // 0x4a0(0x08)
	struct UStaticMeshComponent* SM_OL_DriftWoodLarge6; // 0x4a8(0x08)
	struct UStaticMeshComponent* SM_OL_DriftWoodLarge5; // 0x4b0(0x08)
	struct UStaticMeshComponent* SM_OL_DriftWoodLarge4; // 0x4b8(0x08)
	struct UStaticMeshComponent* SM_OL_DriftWoodLarge3; // 0x4c0(0x08)
	struct UStaticMeshComponent* SM_OL_DriftWoodLarge2; // 0x4c8(0x08)
	struct UStaticMeshComponent* SM_OL_DriftWoodLarge1; // 0x4d0(0x08)
	struct UStaticMeshComponent* SM_BothyC_RockInsert_01; // 0x4d8(0x08)
	struct UStaticMeshComponent* SM_OL_Rock_SM_Light_D2; // 0x4e0(0x08)
	struct UStaticMeshComponent* SM_Bothy_Twig_8; // 0x4e8(0x08)
	struct UStaticMeshComponent* SM_Bothy_Twig_7; // 0x4f0(0x08)
	struct UStaticMeshComponent* SM_Bothy_Twig_6; // 0x4f8(0x08)
	struct UStaticMeshComponent* SM_Bothy_Twig_04; // 0x500(0x08)
	struct UStaticMeshComponent* SM_BothyC_EXT_APL_COL; // 0x508(0x08)
	struct UStaticMeshComponent* SM_Bothy_Twig_5; // 0x510(0x08)
	struct UStaticMeshComponent* SM_Bothy_Twig_4; // 0x518(0x08)
	struct UStaticMeshComponent* SM_Bothy_Twig_3; // 0x520(0x08)
	struct UStaticMeshComponent* SM_Bothy_Twig_01; // 0x528(0x08)
	struct UStaticMeshComponent* SM_CliffTop_Med_C5; // 0x530(0x08)
	struct UStaticMeshComponent* SM_CliffTop_Med_C4; // 0x538(0x08)
	struct UStaticMeshComponent* SM_CliffTop_Med_C3; // 0x540(0x08)
	struct UStaticMeshComponent* SM_CliffTop_Med_C2; // 0x548(0x08)
	struct UStaticMeshComponent* SM_CliffTop_Med_C; // 0x550(0x08)
	struct UStaticMeshComponent* SM_BothyC_Walls_EXT; // 0x558(0x08)
	struct UStaticMeshComponent* SM_BothyC_Trims_EXT; // 0x560(0x08)
	struct UStaticMeshComponent* SM_BothyC_Windows_Glass; // 0x568(0x08)
	struct UStaticMeshComponent* SM_BothyC_EXT_PL_COL; // 0x570(0x08)
	struct UStaticMeshComponent* SM_BothyC_INT_APL_COL; // 0x578(0x08)
	struct UChildActorComponent* BP_WalkSpeedVolume; // 0x580(0x08)
	struct UChildActorComponent* BP_Door_Template; // 0x588(0x08)
	struct UChildActorComponent* BP_Bothy_Marker; // 0x590(0x08)
	struct UStaticMeshComponent* SM_OL_Rock_Md_Light_A10; // 0x598(0x08)
};

