// BlueprintGeneratedClass BP_BanditCamp_MetalTable.BP_BanditCamp_MetalTable_C
// Size: 0x328 (Inherited: 0x248)
struct ABP_BanditCamp_MetalTable_C : AActor {
	struct UStaticMeshComponent* SM_HM_Quill_Rolled_Parchment_Pile_C_StaticMeshComponent0; // 0x248(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_Rolled_Parchment_Pile_C2_StaticMeshComponent0; // 0x250(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse9; // 0x258(0x08)
	struct UStaticMeshComponent* SM_HM_Paper_D_StaticMeshComponent0; // 0x260(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse8; // 0x268(0x08)
	struct UStaticMeshComponent* SM_HM_Paper_H_StaticMeshComponent0; // 0x270(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse7; // 0x278(0x08)
	struct UStaticMeshComponent* SM_HM_Paper_H2_StaticMeshComponent0; // 0x280(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse6; // 0x288(0x08)
	struct UStaticMeshComponent* SM_HM_Tea_TeaTins_A2_StaticMeshComponent0; // 0x290(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse5; // 0x298(0x08)
	struct UStaticMeshComponent* SM_HM_Tea_TeaTins_A_StaticMeshComponent0; // 0x2a0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse4; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_HM_Tea_TeaTins_G_StaticMeshComponent0; // 0x2b0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse3; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_HM_TeaShop_TeaCup_A2_StaticMeshComponent0; // 0x2c0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse2; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_Rolled_Parchment_G_StaticMeshComponent0; // 0x2d0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse1; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_Rolled_Parchment_E_StaticMeshComponent0; // 0x2e0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_InkBottles_A_StaticMeshComponent0; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_HM_InkBottleWithQuills_A2_StaticMeshComponent0; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_HW_Trash_PaperScraps_B5_StaticMeshComponent0; // 0x300(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_Stamp_A_StaticMeshComponent0; // 0x308(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_Stand_StaticMeshComponent0; // 0x310(0x08)
	struct UStaticMeshComponent* SM_OVR_Table_01_StaticMeshComponent0; // 0x318(0x08)
	struct USceneComponent* SharedRoot; // 0x320(0x08)
};

