// BlueprintGeneratedClass BP_Bothy_B_Int_01.BP_Bothy_B_Int_01_C
// Size: 0x3a0 (Inherited: 0x248)
struct ABP_Bothy_B_Int_01_C : AActor {
	struct UStaticMeshComponent* Plane1; // 0x248(0x08)
	struct UStaticMeshComponent* Plane; // 0x250(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_B10_NewDecalComponent1; // 0x258(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_B12_NewDecalComponent; // 0x260(0x08)
	struct UStaticMeshComponent* SM_Cairn_WoodShelf_B_StaticMeshComponent0; // 0x268(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_B13_NewDecalComponent; // 0x270(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_B8_NewDecalComponent; // 0x278(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_B9_NewDecalComponent; // 0x280(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_B6_NewDecalComponent; // 0x288(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_B4_NewDecalComponent; // 0x290(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_B10_NewDecalComponent; // 0x298(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_B5_NewDecalComponent; // 0x2a0(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_B2_NewDecalComponent; // 0x2a8(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_B7_NewDecalComponent; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_Cav_Dungeon_Crate_04_StaticMeshComponent0; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_BCProps_Wood_Chopped_Small_001_StaticMeshComponent0; // 0x2c0(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_B_NewDecalComponent; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_HW_TrophyPlaque_huff_Gryff_StaticMeshComponent0; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_HM_Deer_Skull_A_StaticMeshComponent0; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_Cairn_WoodShelf_A_StaticMeshComponent0; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_CampA_Rug_Goat_StaticMeshComponent0; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_CampA_Int_Bed_01A_StaticMeshComponent0; // 0x2f0(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_B16_NewDecalComponent; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_CampA_Int_BedRug_01A_StaticMeshComponent0; // 0x300(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_B15_NewDecalComponent; // 0x308(0x08)
	struct UStaticMeshComponent* SM_HM_Pillow_A_StaticMeshComponent0; // 0x310(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_WoodTub_Large_001_W_StaticMeshComponent0; // 0x318(0x08)
	struct UStaticMeshComponent* SM_BCProps_FloorCloth_A_StaticMeshComponent0; // 0x320(0x08)
	struct UStaticMeshComponent* SM_HM_Cloth_04_StaticMeshComponent0; // 0x328(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_B14_NewDecalComponent; // 0x330(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_B11_NewDecalComponent; // 0x338(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Frame_C2_StaticMeshComponent0; // 0x340(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Frame_C_StaticMeshComponent0; // 0x348(0x08)
	struct UStaticMeshComponent* SM_Cav_MiningLamp_01_StaticMeshComponent0; // 0x350(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_B19_NewDecalComponent; // 0x358(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_B18_NewDecalComponent; // 0x360(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_B17_NewDecalComponent; // 0x368(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Stool_001_D_StaticMeshComponent0; // 0x370(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Table_Short_001_D_StaticMeshComponent0; // 0x378(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_B21_NewDecalComponent; // 0x380(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_B20_NewDecalComponent; // 0x388(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_B3_NewDecalComponent; // 0x390(0x08)
	struct USceneComponent* SharedRoot; // 0x398(0x08)
};

