// BlueprintGeneratedClass BP_Bothy_B.BP_Bothy_B_C
// Size: 0x570 (Inherited: 0x248)
struct ABP_Bothy_B_C : AActor {
	struct UPointLightComponent* PointLight; // 0x248(0x08)
	struct UStaticMeshComponent* SM_BothyA_Window_Glass_Int; // 0x250(0x08)
	struct UStaticMeshComponent* SM_OL_MossRock_Md_A_61; // 0x258(0x08)
	struct UStaticMeshComponent* SM_OL_MossRock_Md_A_60; // 0x260(0x08)
	struct UStaticMeshComponent* SM_OL_MossRock_Md_A_59; // 0x268(0x08)
	struct UStaticMeshComponent* SM_OL_MossRock_Md_A_58; // 0x270(0x08)
	struct UStaticMeshComponent* SM_OL_MossRock_Md_A_57; // 0x278(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Color_B5; // 0x280(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_A3; // 0x288(0x08)
	struct UDecalComponent* MI_SanctumDun_Decal_Edge_B2; // 0x290(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Color_B4; // 0x298(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Color_B3; // 0x2a0(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Color_B2; // 0x2a8(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_A2; // 0x2b0(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_D2; // 0x2b8(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_D; // 0x2c0(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_A; // 0x2c8(0x08)
	struct UDecalComponent* MI_SanctumDun_Decal_Edge_B1; // 0x2d0(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Color_B; // 0x2d8(0x08)
	struct UDecalComponent* MI_CavernDun_Decal_Algae_B3; // 0x2e0(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Edge_C; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_BothyB_Shingles_Merged2; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_Vault_Cave_RockPile_18; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_OL_MossRock_Md_A_56; // 0x300(0x08)
	struct UStaticMeshComponent* SM_OL_MossRock_Md_A_55; // 0x308(0x08)
	struct UStaticMeshComponent* SM_Vault_Cave_RockPile_17; // 0x310(0x08)
	struct UStaticMeshComponent* SM_OL_MossRock_Md_A_54; // 0x318(0x08)
	struct UStaticMeshComponent* SM_OL_MossRock_Md_A_53; // 0x320(0x08)
	struct UStaticMeshComponent* SM_OL_MossRock_Md_E_25; // 0x328(0x08)
	struct UStaticMeshComponent* SM_Vault_Cave_RockPile_16; // 0x330(0x08)
	struct UStaticMeshComponent* SM_OL_MossRock_Md_A_52; // 0x338(0x08)
	struct UStaticMeshComponent* SM_OL_MossRock_Md_E_24; // 0x340(0x08)
	struct UStaticMeshComponent* SM_Vault_Cave_RockPile_15; // 0x348(0x08)
	struct UStaticMeshComponent* SM_OL_MossRock_Md_A_51; // 0x350(0x08)
	struct UStaticMeshComponent* SM_OL_MossRock_Md_E_23; // 0x358(0x08)
	struct UStaticMeshComponent* SM_OL_MossRock_Md_E_22; // 0x360(0x08)
	struct UStaticMeshComponent* SM_Vault_Cave_RockPile_14; // 0x368(0x08)
	struct UStaticMeshComponent* SM_OL_MossRock_Md_A_50; // 0x370(0x08)
	struct UStaticMeshComponent* SM_OL_MossRock_Md_A_49; // 0x378(0x08)
	struct UStaticMeshComponent* SM_OL_MossRock_Md_E_21; // 0x380(0x08)
	struct UStaticMeshComponent* SM_OL_MossRock_Md_E_20; // 0x388(0x08)
	struct UStaticMeshComponent* SM_Vault_Cave_RockPile_13; // 0x390(0x08)
	struct UStaticMeshComponent* SM_OL_MossRock_Md_A_48; // 0x398(0x08)
	struct UStaticMeshComponent* SM_OL_MossRock_Md_A_47; // 0x3a0(0x08)
	struct UStaticMeshComponent* SM_OL_MossRock_Md_A_46; // 0x3a8(0x08)
	struct UStaticMeshComponent* SM_OL_Rock_Md_Light_D; // 0x3b0(0x08)
	struct UStaticMeshComponent* SM_Vault_Cave_RockPile_12; // 0x3b8(0x08)
	struct UStaticMeshComponent* SM_OL_MossRock_Md_A_45; // 0x3c0(0x08)
	struct UStaticMeshComponent* SM_OL_MossRock_Md_A_44; // 0x3c8(0x08)
	struct UStaticMeshComponent* SM_OL_MossRock_Md_E_19; // 0x3d0(0x08)
	struct UStaticMeshComponent* SM_Vault_Cave_RockPile_11; // 0x3d8(0x08)
	struct UStaticMeshComponent* SM_OL_MossRock_Md_A_43; // 0x3e0(0x08)
	struct UStaticMeshComponent* SM_OL_MossRock_Md_A_42; // 0x3e8(0x08)
	struct UStaticMeshComponent* SM_OL_MossRock_Md_A_41; // 0x3f0(0x08)
	struct UStaticMeshComponent* SM_OL_MossRock_Md_A_40; // 0x3f8(0x08)
	struct UStaticMeshComponent* SM_OL_MossRock_Md_E_18; // 0x400(0x08)
	struct UStaticMeshComponent* SM_Vault_Cave_RockPile_10; // 0x408(0x08)
	struct UStaticMeshComponent* SM_OL_MossRock_Md_A_39; // 0x410(0x08)
	struct UStaticMeshComponent* SM_OL_MossRock_Md_A_38; // 0x418(0x08)
	struct UStaticMeshComponent* SM_OL_MossRock_Md_A_37; // 0x420(0x08)
	struct UStaticMeshComponent* SM_Vault_Cave_RockPile_9; // 0x428(0x08)
	struct UStaticMeshComponent* SM_Vault_Cave_RockPile_8; // 0x430(0x08)
	struct UStaticMeshComponent* SM_OL_MossRock_Md_A_36; // 0x438(0x08)
	struct UStaticMeshComponent* SM_OL_MossRock_Md_A_35; // 0x440(0x08)
	struct UStaticMeshComponent* SM_OL_MossRock_Md_E_17; // 0x448(0x08)
	struct UStaticMeshComponent* SM_BothyB_RockCorners_A; // 0x450(0x08)
	struct UStaticMeshComponent* SM_BothyB_INT_PL_COL; // 0x458(0x08)
	struct UStaticMeshComponent* SM_BothyB_Walls_EXT; // 0x460(0x08)
	struct UStaticMeshComponent* SM_BothyB_Trims; // 0x468(0x08)
	struct UStaticMeshComponent* SM_BothyB_Roof; // 0x470(0x08)
	struct UStaticMeshComponent* SM_BothyB_RockEdge; // 0x478(0x08)
	struct UStaticMeshComponent* SM_BothyB_Window; // 0x480(0x08)
	struct UStaticMeshComponent* SM_BothyB_Ceiling; // 0x488(0x08)
	struct UStaticMeshComponent* SM_BothyB_Fireplace; // 0x490(0x08)
	struct UStaticMeshComponent* SM_BothyB_Floor; // 0x498(0x08)
	struct UStaticMeshComponent* SM_OL_MossRock_Md_A_34; // 0x4a0(0x08)
	struct UStaticMeshComponent* SM_BothyB_RockInsert_01; // 0x4a8(0x08)
	struct UStaticMeshComponent* SM_HM_Stone_trim_corner_1sided_B3; // 0x4b0(0x08)
	struct UStaticMeshComponent* SM_HM_Stone_trim_corner_1sided_B2; // 0x4b8(0x08)
	struct UStaticMeshComponent* SM_HM_Stone_trim_corner_1sided_B; // 0x4c0(0x08)
	struct UStaticMeshComponent* SM_HM_Stone_trim_corner_1sided_A2; // 0x4c8(0x08)
	struct UStaticMeshComponent* SM_HM_Stone_trim_corner_1sided_A; // 0x4d0(0x08)
	struct UStaticMeshComponent* SM_BothyB_Window_Glass; // 0x4d8(0x08)
	struct UStaticMeshComponent* SM_BothyB_EXT_APL_COL; // 0x4e0(0x08)
	struct UStaticMeshComponent* SM_BothyB_EXT_PL_COL; // 0x4e8(0x08)
	struct UStaticMeshComponent* SM_BothyB_INT_APL_COL; // 0x4f0(0x08)
	struct UStaticMeshComponent* SM_BothyB_RoofPlank; // 0x4f8(0x08)
	struct UStaticMeshComponent* SM_OL_MossRock_Md_A_33; // 0x500(0x08)
	struct UStaticMeshComponent* SM_BothyB_Chimney; // 0x508(0x08)
	struct UStaticMeshComponent* SM_OL_MossRock_Md_A_32; // 0x510(0x08)
	struct UStaticMeshComponent* SM_OL_MossRock_Md_A_31; // 0x518(0x08)
	struct UStaticMeshComponent* SM_OL_MossRock_Md_A_30; // 0x520(0x08)
	struct UStaticMeshComponent* SM_BothyB_Walls; // 0x528(0x08)
	struct UStaticMeshComponent* SM_Twigs_Merged_B_01; // 0x530(0x08)
	struct UStaticMeshComponent* SM_BothyB_Shingles_Merged1; // 0x538(0x08)
	struct UChildActorComponent* BP_WalkSpeedVolume; // 0x540(0x08)
	struct USceneComponent* Collision; // 0x548(0x08)
	struct USceneComponent* sign; // 0x550(0x08)
	struct UChildActorComponent* BP_Door_Template; // 0x558(0x08)
	struct UChildActorComponent* BP_Bothy_Marker; // 0x560(0x08)
	struct USceneComponent* SharedRoot; // 0x568(0x08)
};

