// BlueprintGeneratedClass BP_BanditCamp_ShelfD.BP_BanditCamp_ShelfD_C
// Size: 0x380 (Inherited: 0x248)
struct ABP_BanditCamp_ShelfD_C : AActor {
	struct UStaticMeshComponent* SM_Int_BCProps_Bucket_Water_001_W; // 0x248(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_Int_BCProps_Cauldron_001; // 0x250(0x08)
	struct UStaticMeshComponent* SM_CampB_2m_PlankD; // 0x258(0x08)
	struct UStaticMeshComponent* SM_CampB_2m_PlankB; // 0x260(0x08)
	struct UStaticMeshComponent* SM_CampB_2m_PlankC; // 0x268(0x08)
	struct UStaticMeshComponent* SM_BCProps_FoodBag_9bag_001; // 0x270(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_Bucket_Small_001_W; // 0x278(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_Int_BCProps_Bucket_Small_002_W; // 0x280(0x08)
	struct UStaticMeshComponent* SM_CampB_5m_PlankB; // 0x288(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Pot_002_W; // 0x290(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Pot_001_W; // 0x298(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_Jug_002_W; // 0x2a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_Jug_001_W; // 0x2a8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_CampB_5m_PlankD; // 0x2b0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CampB_5m_PlankC; // 0x2b8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_15SM_CampB_5m_PostA; // 0x2c0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_CampB_5m_PlankA; // 0x2c8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_9SM_Int_BCProps_Cauldron_002; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Pot_001_W15_StaticMeshComponent0; // 0x2d8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse9; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Pot_001_W12_StaticMeshComponent0; // 0x2e8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse8; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Pot_001_W18_StaticMeshComponent0; // 0x2f8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse7; // 0x300(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Bucket_Water_001_W5_StaticMeshComponent0; // 0x308(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse6; // 0x310(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_FoodBag_1bag_003_W_StaticMeshComponent0; // 0x318(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse5; // 0x320(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_FoodBag_1bag_001_W2_StaticMeshComponent0; // 0x328(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse4; // 0x330(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_FoodBag_1bag_001_W3_StaticMeshComponent0; // 0x338(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse3; // 0x340(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Cauldron_16_StaticMeshComponent0; // 0x348(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse2; // 0x350(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Lantern_10_StaticMeshComponent0; // 0x358(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse1; // 0x360(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Bucket_Water_001_W6_StaticMeshComponent0; // 0x368(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse; // 0x370(0x08)
	struct USceneComponent* SharedRoot; // 0x378(0x08)
};

