// BlueprintGeneratedClass BP_Bothy_D_Int_02.BP_Bothy_D_Int_02_C
// Size: 0x348 (Inherited: 0x248)
struct ABP_Bothy_D_Int_02_C : AActor {
	struct UStaticMeshComponent* SM_BothyD_Bottles_Merged; // 0x248(0x08)
	struct UStaticMeshComponent* SM_BothyD_Cauldrons_Merged; // 0x250(0x08)
	struct UStaticMeshComponent* SM_BothyD_Ropes_Merged; // 0x258(0x08)
	struct UStaticMeshComponent* SM_BothyD_Rugs_Merged; // 0x260(0x08)
	struct UStaticMeshComponent* SM_HamletB_P_Interior_WizardingChess_Merged; // 0x268(0x08)
	struct UDecalComponent* MI_P_Decal_Stain20_88; // 0x270(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_D2_86; // 0x278(0x08)
	struct UDecalComponent* MI_P_Decal_Stain19_82; // 0x280(0x08)
	struct UDecalComponent* MI_P_Decal_Stain16_70; // 0x288(0x08)
	struct UDecalComponent* MI_P_Decal_Stain14_68; // 0x290(0x08)
	struct UDecalComponent* MI_P_Decal_Stain15_66; // 0x298(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Soot_A_64; // 0x2a0(0x08)
	struct UDecalComponent* MI_BCProps_Decal_AshCircle_A_62; // 0x2a8(0x08)
	struct UDecalComponent* MI_BCProps_Decal_Ash_A_56; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Table_E_Chair_B1; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_Cairn_WoodShelf_A1; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_Cav_MiningLamp_02; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_HM_Deer_Skull_A1; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_Sanc_WallDetail_01_Mzoo1; // 0x2d8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_3Broom_BroomstickRack_B1; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_OVL_Sign_Hanger_C1; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_HM_Honeydukes_broom1; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_CampA_Int_BedRug_01B1; // 0x2f8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_FullBed_Twin_A1; // 0x300(0x08)
	struct UStaticMeshComponent* SM_HM_Salon_Hat_Rack1; // 0x308(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Log_Stump_001_D_DM_4; // 0x310(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Table_C_Chair_B1; // 0x318(0x08)
	struct UStaticMeshComponent* SM_BCProps_Wood_Chopped_Large_002; // 0x320(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_OVR_Kitchenware_item_D1; // 0x328(0x08)
	struct USceneComponent* BP_ChessBoard_DefaultSceneRoot; // 0x330(0x08)
	struct USceneComponent* BP_ChessBoard_SharedRoot; // 0x338(0x08)
	struct USceneComponent* SharedRoot; // 0x340(0x08)
};

