// BlueprintGeneratedClass BP_Bridge_Moon_B.BP_Bridge_Moon_B_C
// Size: 0x2c0 (Inherited: 0x248)
struct ABP_Bridge_Moon_B_C : AActor {
	struct UDecalComponent* MI_HW_Decal_RockDamage_2; // 0x248(0x08)
	struct UDecalComponent* MM_P_Decal_Wetness_drips; // 0x250(0x08)
	struct UDecalComponent* MI_P_Decal_Stain5; // 0x258(0x08)
	struct UStaticMeshComponent* Plane; // 0x260(0x08)
	struct UStaticMeshComponent* SM_CastleDun_Jail_Wall_High; // 0x268(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_26SM_CastleRuins_2_Bricks_A_s; // 0x270(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_8SM_CastleRuins_2_Broken_B_a; // 0x278(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_7SM_CastleRuins_2_Broken_E; // 0x280(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_2_Circular_A; // 0x288(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_CastleRuins_2_MainPillars_B_m; // 0x290(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_CastleRuins_2_MainPillars_B_n; // 0x298(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_20SM_CastleRuins_2_TheSlate_B_c; // 0x2a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_2_Wall_V; // 0x2a8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_19Cube; // 0x2b0(0x08)
	struct USceneComponent* SharedRoot; // 0x2b8(0x08)
};

