// BlueprintGeneratedClass BP_Bothy_B_Int_02.BP_Bothy_B_Int_02_C
// Size: 0x3b8 (Inherited: 0x248)
struct ABP_Bothy_B_Int_02_C : AActor {
	struct UStaticMeshComponent* SM_Int_BCProps_Broom_001_W_StaticMeshComponent0; // 0x248(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_BroomstickRack_B2_StaticMeshComponent0; // 0x250(0x08)
	struct UStaticMeshComponent* SM_OVL_Sign_Hanger_C_StaticMeshComponent0; // 0x258(0x08)
	struct UStaticMeshComponent* SM_CastleDun_BannerSet1_C_LOD_StaticMeshComponent0; // 0x260(0x08)
	struct UStaticMeshComponent* SM_HM_Honeydukes_Chair_A2_StaticMeshComponent0; // 0x268(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Chair_B_StaticMeshComponent0; // 0x270(0x08)
	struct UStaticMeshComponent* SM_HM_Rope_Candle_Lamp_B_StaticMeshComponent0; // 0x278(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_OpenCrate_Medium_A_StaticMeshComponent0; // 0x280(0x08)
	struct UStaticMeshComponent* SM_BCProps_Wood_Chopped_Small_002_StaticMeshComponent0; // 0x288(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeStake_C2_StaticMeshComponent0; // 0x290(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WallShield_F_StaticMeshComponent0; // 0x298(0x08)
	struct UStaticMeshComponent* SM_BCProps_FloorCloth_E_StaticMeshComponent0; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeLashing_A2_StaticMeshComponent0; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_HangingProps_Bags_001_F_StaticMeshComponent0; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_HM_Dogweed_HangingPots_B_StaticMeshComponent0; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Bucket_Water_001_W_StaticMeshComponent0; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_HM_Bed_A_StaticMeshComponent0; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_HM_Pillow_A_StaticMeshComponent0; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_HM_Mattress_A_StaticMeshComponent0; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeSpan_B_StaticMeshComponent0; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeSpan_A_StaticMeshComponent0; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeLashing_A_StaticMeshComponent0; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_CastleDun_BannerSet_Nologo_F_StaticMeshComponent0; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_HM_Pillow_A2_StaticMeshComponent0; // 0x300(0x08)
	struct UStaticMeshComponent* SM_HM_Bed_A2_StaticMeshComponent0; // 0x308(0x08)
	struct UStaticMeshComponent* SM_HM_Mattress_A2_StaticMeshComponent0; // 0x310(0x08)
	struct UDecalComponent* MI_SanctumDun_Decal_Dirt_C_NewDecalComponent; // 0x318(0x08)
	struct UDecalComponent* MI_SanctumDun_Decal_Dirt_B_NewDecalComponent; // 0x320(0x08)
	struct UDecalComponent* MI_P_Decal_Stain15_NewDecalComponent3; // 0x328(0x08)
	struct UDecalComponent* MI_P_Decal_Stain15_NewDecalComponent2; // 0x330(0x08)
	struct UDecalComponent* MI_P_Decal_Stain15_NewDecalComponent1; // 0x338(0x08)
	struct UDecalComponent* MI_P_Decal_Stain15_NewDecalComponent; // 0x340(0x08)
	struct UDecalComponent* MI_P_Decal_Puddle_1_NewDecalComponent; // 0x348(0x08)
	struct UDecalComponent* MI_HW_Decal_Wood_WornPath_01_NewDecalComponent1; // 0x350(0x08)
	struct UDecalComponent* MI_HW_Decal_Wood_WornPath_01_NewDecalComponent; // 0x358(0x08)
	struct UDecalComponent* MI_HM_Decal_Dirt_C1_NewDecalComponent; // 0x360(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Soot_A_NewDecalComponent1; // 0x368(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Soot_A_NewDecalComponent; // 0x370(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_AshCircle_B_2_NewDecalComponent; // 0x378(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_AshCircle_A_2_NewDecalComponent; // 0x380(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_B_NewDecalComponent; // 0x388(0x08)
	struct UDecalComponent* MI_BCProps_Decal_Ash_A_NewDecalComponent; // 0x390(0x08)
	struct UDecalComponent* M_Cav_Decal_Wet_Dolo_NewDecalComponent; // 0x398(0x08)
	struct UDecalComponent* M_Cav_Decal_Dirt_01_NewDecalComponent; // 0x3a0(0x08)
	struct UDecalComponent* MI_SanctumDun_Decal_LargeDirt_NewDecalComponent; // 0x3a8(0x08)
	struct USceneComponent* SharedRoot; // 0x3b0(0x08)
};

