// BlueprintGeneratedClass BP_Breakable_ManMade_M.BP_Breakable_ManMade_M_C
// Size: 0x288 (Inherited: 0x248)
struct ABP_Breakable_ManMade_M_C : AActor {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x248(0x08)
	struct UChildActorComponent* BP_Int_BCProps_OpenCrate_Small_001; // 0x250(0x08)
	struct UChildActorComponent* BP_Int_BCProps_CloseCrate_Medium_001; // 0x258(0x08)
	struct UChildActorComponent* BP_Prop_Barrel_Breakable_A1; // 0x260(0x08)
	struct UChildActorComponent* BP_Prop_Barrel_Breakable_A; // 0x268(0x08)
	struct UChildActorComponent* BP_BanditCamp_BreakableFloor; // 0x270(0x08)
	struct UChildActorComponent* BP_Int_BCProps_Bucket_Small_001; // 0x278(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x280(0x08)

	void ReceiveBeginPlay(); // Function BP_Breakable_ManMade_M.BP_Breakable_ManMade_M_C.ReceiveBeginPlay // (Event|Protected|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_BP_Breakable_ManMade_M(int32_t EntryPoint); // Function BP_Breakable_ManMade_M.BP_Breakable_ManMade_M_C.ExecuteUbergraph_BP_Breakable_ManMade_M // (Final|UbergraphFunction|HasDefaults) // @ game+0x38a7480
};

