// BlueprintGeneratedClass BP_Bothy_A.BP_Bothy_A_C
// Size: 0x3a8 (Inherited: 0x248)
struct ABP_Bothy_A_C : AActor {
	struct UPointLightComponent* PointLight; // 0x248(0x08)
	struct UStaticMeshComponent* SM_BothyA_Window_Glass_Int; // 0x250(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Color_B4; // 0x258(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Color_B3; // 0x260(0x08)
	struct UDecalComponent* MI_SanctumDun_Decal_Edge_B3; // 0x268(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Color_B2; // 0x270(0x08)
	struct UDecalComponent* MI_SanctumDun_Decal_Edge_B2; // 0x278(0x08)
	struct UDecalComponent* MI_CavernDun_Decal_Algae_B4; // 0x280(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_A2; // 0x288(0x08)
	struct UDecalComponent* MI_SanctumDun_Decal_Edge_B1; // 0x290(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_A; // 0x298(0x08)
	struct UDecalComponent* MI_CavernDun_Decal_Algae_B3; // 0x2a0(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Color_B; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_BothyA_RockCorners_A; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_BothyA_Shingles_merged; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_BothyA_EXT_PL_COL; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_BothyA_EXT_APL_COL; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_BothyA_Walls_EXT; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_BothyA_INT_APL_COL; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_BothyA_INT_PL_COL; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_BothyA_Floor; // 0x2e8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_Stone_trim_corner_1sided_A; // 0x2f0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_Stone_trim_flat_2sided_A; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_BothyA_Trims_EXT; // 0x300(0x08)
	struct UStaticMeshComponent* SM_BothyA_Walls; // 0x308(0x08)
	struct UStaticMeshComponent* SM_BothyA_Ceiling; // 0x310(0x08)
	struct UStaticMeshComponent* SM_BothyA_RockEdge; // 0x318(0x08)
	struct UStaticMeshComponent* SM_BothyA_Window; // 0x320(0x08)
	struct UStaticMeshComponent* SM_BothyA_Trims; // 0x328(0x08)
	struct UStaticMeshComponent* SM_BothyA_Roof; // 0x330(0x08)
	struct UStaticMeshComponent* SM_BothyA_Fireplace; // 0x338(0x08)
	struct UStaticMeshComponent* SM_BothyA_Chimney; // 0x340(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_Vault_Cave_RockPile_03; // 0x348(0x08)
	struct UStaticMeshComponent* SM_BothyA_Window_Glass; // 0x350(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_Vault_Cave_RockPile_02; // 0x358(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Vault_Cave_RockPile_01; // 0x360(0x08)
	struct UStaticMeshComponent* SM_Twigs_Merged_01; // 0x368(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_28SM_OL_MossRock_Md_A_3; // 0x370(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_14SM_OL_MossRock_Md_E_3; // 0x378(0x08)
	struct UStaticMeshComponent* SM_BothyA_RockInsert_03; // 0x380(0x08)
	struct UChildActorComponent* BP_WalkSpeedVolume; // 0x388(0x08)
	struct UChildActorComponent* BP_Door_Template; // 0x390(0x08)
	struct UChildActorComponent* BP_Bothy_Marker; // 0x398(0x08)
	struct USceneComponent* SharedRoot; // 0x3a0(0x08)
};

