// BlueprintGeneratedClass BP_Breakable_ManMade_L2.BP_Breakable_ManMade_L2_C
// Size: 0x298 (Inherited: 0x248)
struct ABP_Breakable_ManMade_L2_C : AActor {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x248(0x08)
	struct UChildActorComponent* BP_Int_BCProps_CloseCrate_Medium_001; // 0x250(0x08)
	struct UChildActorComponent* BP_Int_BCProps_OpenCrate_Small_002; // 0x258(0x08)
	struct UChildActorComponent* BP_Int_BCProps_CloseCrate_Large_002; // 0x260(0x08)
	struct UChildActorComponent* BP_Prop_Barrel_Breakable_A; // 0x268(0x08)
	struct UChildActorComponent* BP_Prop_Barrel_Breakable_A_2; // 0x270(0x08)
	struct UChildActorComponent* BP_Int_BCProps_WoodPile_Large_001; // 0x278(0x08)
	struct UChildActorComponent* BP_OPP_FlourSack; // 0x280(0x08)
	struct UChildActorComponent* BP_BanditCamp_BreakableFloor; // 0x288(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x290(0x08)

	void ReceiveBeginPlay(); // Function BP_Breakable_ManMade_L2.BP_Breakable_ManMade_L2_C.ReceiveBeginPlay // (Event|Protected|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_BP_Breakable_ManMade_L2(int32_t EntryPoint); // Function BP_Breakable_ManMade_L2.BP_Breakable_ManMade_L2_C.ExecuteUbergraph_BP_Breakable_ManMade_L2 // (Final|UbergraphFunction|HasDefaults) // @ game+0x38a7480
};

