// BlueprintGeneratedClass BP_BanditCamp_ShelfB.BP_BanditCamp_ShelfB_C
// Size: 0x3d0 (Inherited: 0x248)
struct ABP_BanditCamp_ShelfB_C : AActor {
	struct UStaticMeshComponent* SM_Int_BCProps_Jug_001_W70_StaticMeshComponent0; // 0x248(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse7; // 0x250(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Pot_002_W23_StaticMeshComponent0; // 0x258(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse6; // 0x260(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Jug_001_W69_StaticMeshComponent0; // 0x268(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse5; // 0x270(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Jug_001_W68_StaticMeshComponent0; // 0x278(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse4; // 0x280(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Pot_002_W24_StaticMeshComponent0; // 0x288(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse3; // 0x290(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_WoodPile_Large_16_StaticMeshComponent0; // 0x298(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse2; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Pot_002_W22_StaticMeshComponent0; // 0x2a8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse1; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_WoodTub_Medium_001_W6_StaticMeshComponent0; // 0x2b8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_CampB_5m_PlankC121_StaticMeshComponent0; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_CampB_5m_PlankC122_StaticMeshComponent0; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_CampB_5m_PostA774_StaticMeshComponent0; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_CampB_5m_PostA779_StaticMeshComponent0; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_CampB_5m_PostA778_StaticMeshComponent0; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_CampB_5m_PlankC126_StaticMeshComponent0; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_WoodPile_Large_15_StaticMeshComponent0; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_WoodPile_Large_12_StaticMeshComponent0; // 0x300(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_WoodPile_Large_13_StaticMeshComponent0; // 0x308(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_WoodPile_Large_14_StaticMeshComponent0; // 0x310(0x08)
	struct UStaticMeshComponent* SM_CampB_5m_PostA772_StaticMeshComponent0; // 0x318(0x08)
	struct UStaticMeshComponent* SM_CampB_5m_PlankC127_StaticMeshComponent0; // 0x320(0x08)
	struct UStaticMeshComponent* SM_CampB_5m_PostA773_StaticMeshComponent0; // 0x328(0x08)
	struct UStaticMeshComponent* SM_Folded_Cloth_100_StaticMeshComponent0; // 0x330(0x08)
	struct UStaticMeshComponent* SM_Folded_Cloth_99_StaticMeshComponent0; // 0x338(0x08)
	struct UStaticMeshComponent* SM_Folded_Cloth_101_StaticMeshComponent0; // 0x340(0x08)
	struct UStaticMeshComponent* SM_Folded_Cloth_102_StaticMeshComponent0; // 0x348(0x08)
	struct UStaticMeshComponent* SM_Folded_Cloth_111_StaticMeshComponent0; // 0x350(0x08)
	struct UStaticMeshComponent* SM_Folded_Cloth_105_StaticMeshComponent0; // 0x358(0x08)
	struct UStaticMeshComponent* SM_Folded_Cloth_104_StaticMeshComponent0; // 0x360(0x08)
	struct UStaticMeshComponent* SM_Folded_Cloth_103_StaticMeshComponent0; // 0x368(0x08)
	struct UStaticMeshComponent* SM_BCProps_FloorCloth_A12_StaticMeshComponent0; // 0x370(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Jug_001_W71_StaticMeshComponent0; // 0x378(0x08)
	struct UStaticMeshComponent* SM_CampB_5m_PlankC130_StaticMeshComponent0; // 0x380(0x08)
	struct UStaticMeshComponent* SM_CampB_5m_PlankC129_StaticMeshComponent0; // 0x388(0x08)
	struct UStaticMeshComponent* SM_CampB_5m_PostA771_StaticMeshComponent0; // 0x390(0x08)
	struct UStaticMeshComponent* SM_CampB_5m_PostA777_StaticMeshComponent0; // 0x398(0x08)
	struct UStaticMeshComponent* SM_CampB_5m_PostA776_StaticMeshComponent0; // 0x3a0(0x08)
	struct UStaticMeshComponent* SM_CampB_5m_PostA775_StaticMeshComponent0; // 0x3a8(0x08)
	struct UStaticMeshComponent* SM_CampB_5m_PostA770_StaticMeshComponent0; // 0x3b0(0x08)
	struct UStaticMeshComponent* SM_CampB_5m_PlankC125_StaticMeshComponent0; // 0x3b8(0x08)
	struct UStaticMeshComponent* SM_CampB_5m_PlankC124_StaticMeshComponent0; // 0x3c0(0x08)
	struct USceneComponent* SharedRoot; // 0x3c8(0x08)
};

