// BlueprintGeneratedClass BP_Bothy_D.BP_Bothy_D_C
// Size: 0x428 (Inherited: 0x248)
struct ABP_Bothy_D_C : AActor {
	struct UPointLightComponent* PointLight2; // 0x248(0x08)
	struct UPointLightComponent* PointLight1; // 0x250(0x08)
	struct UPointLightComponent* PointLight; // 0x258(0x08)
	struct UStaticMeshComponent* SM_BothyD_Windows_Glass_Int; // 0x260(0x08)
	struct UStaticMeshComponent* SM_BothyD_Ceiling; // 0x268(0x08)
	struct UStaticMeshComponent* SM_BothyD_Trims; // 0x270(0x08)
	struct UStaticMeshComponent* SM_BothyD_Walls; // 0x278(0x08)
	struct UChildActorComponent* BP_WalkSpeedVolume; // 0x280(0x08)
	struct USceneComponent* sign; // 0x288(0x08)
	struct UStaticMeshComponent* SM_BothyD_RockInsert_01; // 0x290(0x08)
	struct UStaticMeshComponent* SM_BothyD_Windows1; // 0x298(0x08)
	struct UStaticMeshComponent* SM_BothyD_Roof1; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_BothyD_Floor1; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_BothyD_Walls_EXT1; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_BothyD_RoofTrim_03; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_BothyD_Fireplace1; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_BothyD_RockEdge1; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_BothyD_RoofTrim_04; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_BothyD_Windows_Glass1; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_BothyD_Chimney1; // 0x2e0(0x08)
	struct USceneComponent* Structure; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_BothyD_INT_PL_COL1; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_BothyD_EXT_APL_COL1; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_BothyD_EXT_PL_COL1; // 0x300(0x08)
	struct UStaticMeshComponent* SM_BothyD_INT_APL_COL1; // 0x308(0x08)
	struct UDecalComponent* MI_SanctumDun_Decal_Edge_B2; // 0x310(0x08)
	struct UDecalComponent* MI_CavernDun_Decal_Algae_B3; // 0x318(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_A3; // 0x320(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_A2; // 0x328(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_A; // 0x330(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Edge_C; // 0x338(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Color_B4; // 0x340(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Color_B3; // 0x348(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Color_B2; // 0x350(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Color_B; // 0x358(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_D2; // 0x360(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_D; // 0x368(0x08)
	struct UDecalComponent* MI_SanctumDun_Decal_Edge_B1; // 0x370(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_OL_Rock_SM_Light_D1; // 0x378(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_Overland_Rock_12; // 0x380(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_9SM_OL_Rock_Md_Light_D1; // 0x388(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_OL_Rock_SM_Light_E1; // 0x390(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_OL_DriftWoodLarge3; // 0x398(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_OL_DriftWoodLarge2; // 0x3a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_OL_CliffRock_B8_3; // 0x3a8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_OL_CliffRock_B3_3; // 0x3b0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_16SM_OL_CliffRock_B2_3; // 0x3b8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_CliffTop_Med_D1; // 0x3c0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_13SM_OL_Rock_Md_Light_A1; // 0x3c8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_Bothy_Twig_02; // 0x3d0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_Bothy_Twig_05; // 0x3d8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_8SM_Bothy_Twig_03; // 0x3e0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_CliffTop_Med_C1; // 0x3e8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_17SM_HM_Roof_Shingle_E2; // 0x3f0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_HM_Stone_trim_corner_1sided_A1; // 0x3f8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_Stone_Trim_Corner_1sided_D1; // 0x400(0x08)
	struct USceneComponent* Collision; // 0x408(0x08)
	struct UChildActorComponent* BP_Door_Template; // 0x410(0x08)
	struct UChildActorComponent* BP_Bothy_Marker; // 0x418(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x420(0x08)
};

