// BlueprintGeneratedClass BP_BanditCamp_BroomStand.BP_BanditCamp_BroomStand_C
// Size: 0x290 (Inherited: 0x248)
struct ABP_BanditCamp_BroomStand_C : AActor {
	struct UStaticMeshComponent* SM_Int_BCProps_Broom_001_W7_StaticMeshComponent0; // 0x248(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse4; // 0x250(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_BroomStand_002_W2_StaticMeshComponent0; // 0x258(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse3; // 0x260(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Broom_001_W9_StaticMeshComponent0; // 0x268(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse2; // 0x270(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Broom_001_W8_StaticMeshComponent0; // 0x278(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse1; // 0x280(0x08)
	struct USceneComponent* SharedRoot; // 0x288(0x08)
};

