// BlueprintGeneratedClass BP_BarrelStack_Large_B.BP_BarrelStack_Large_B_C
// Size: 0x290 (Inherited: 0x248)
struct ABP_BarrelStack_Large_B_C : AActor {
	struct UPhysicalResponseComponent* PhysicalResponse4; // 0x248(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse3; // 0x250(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_Int_BCProps_Barrel_001_W; // 0x258(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_Barrel_Fat_001_W; // 0x260(0x08)
	struct UStaticMeshComponent* SM_BarrelRack_B; // 0x268(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse; // 0x270(0x08)
	struct UStaticMeshComponent* StaticMeshComponent34; // 0x278(0x08)
	struct UStaticMeshComponent* StaticMeshComponent33; // 0x280(0x08)
	struct USceneComponent* SharedRoot; // 0x288(0x08)
};

