// BlueprintGeneratedClass BP_Bridge_Moon_A.BP_Bridge_Moon_A_C
// Size: 0x310 (Inherited: 0x248)
struct ABP_Bridge_Moon_A_C : AActor {
	struct UStaticMeshComponent* SM_MERGED_BP_Bridge_Moon_A_COL; // 0x248(0x08)
	struct UDecalComponent* MI_LargeDirt8_18; // 0x250(0x08)
	struct UDecalComponent* MI_LargeDirt7_16; // 0x258(0x08)
	struct UDecalComponent* MI_LargeDirt6_14; // 0x260(0x08)
	struct UDecalComponent* MI_LargeDirt5; // 0x268(0x08)
	struct UDecalComponent* MI_LargeDirt4; // 0x270(0x08)
	struct UDecalComponent* MI_LargeDirt3; // 0x278(0x08)
	struct UDecalComponent* MI_LargeDirt2; // 0x280(0x08)
	struct UDecalComponent* MI_LargeDirt; // 0x288(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_2_Broken_B_c; // 0x290(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_9SM_CastleRuins_3_Broken_B_a; // 0x298(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_3_Broken_D_B; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_3_Broken_D_A; // 0x2a8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_CastleRuins_2_Broken_C_a; // 0x2b0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_2_Broken_B_a; // 0x2b8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_CastleRuins_2_Broken_B_b; // 0x2c0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_CastleRuins_3_Bricks_A_k; // 0x2c8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_CastleRuins_3_Bricks_A_n; // 0x2d0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_2_Broken_C_b; // 0x2d8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_8SM_CastleRuins_3_Bricks_A_i; // 0x2e0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_CastleRuins_3_Bricks_A_o; // 0x2e8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_3_Relief_E_b; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_bridge_moon; // 0x2f8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_CastleRuins_2_Bricks_A_m; // 0x300(0x08)
	struct USceneComponent* SharedRoot; // 0x308(0x08)
};

