// BlueprintGeneratedClass BP_Bothy_A_Int_01.BP_Bothy_A_Int_01_C
// Size: 0x390 (Inherited: 0x248)
struct ABP_Bothy_A_Int_01_C : AActor {
	struct UStaticMeshComponent* SM_BCProps_FloorCloth_E; // 0x248(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_B11_NewDecalComponent; // 0x250(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_B4_NewDecalComponent; // 0x258(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_B3_NewDecalComponent; // 0x260(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_B10_NewDecalComponent; // 0x268(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_B_NewDecalComponent; // 0x270(0x08)
	struct UStaticMeshComponent* SM_OVL_Sign_Hanger_C_StaticMeshComponent0; // 0x278(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_BroomstickRack_B2_StaticMeshComponent0; // 0x280(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_BroomstickRack_B_StaticMeshComponent0; // 0x288(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Broom_001_W_StaticMeshComponent0; // 0x290(0x08)
	struct UStaticMeshComponent* SM_Cairn_WoodShelf_B_StaticMeshComponent0; // 0x298(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeStake_C_StaticMeshComponent0; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeSpan_C_StaticMeshComponent0; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeSpan_D_StaticMeshComponent0; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeStake_C3_StaticMeshComponent0; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_OVR_Kitchenware_item_D_StaticMeshComponent0; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_OVR_Kitchenware_item_D2_StaticMeshComponent0; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeStake_C2_StaticMeshComponent0; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Axe_002_W_StaticMeshComponent0; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_BCProps_Wood_Chopped_Small_002_StaticMeshComponent0; // 0x2e0(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Soot_A_NewDecalComponent; // 0x2e8(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_B12_NewDecalComponent; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_Cav_MiningLamp_01_StaticMeshComponent0; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Chair_C_StaticMeshComponent0; // 0x300(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_B9_NewDecalComponent; // 0x308(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Bottle_001_StaticMeshComponent0; // 0x310(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_B13_NewDecalComponent; // 0x318(0x08)
	struct UStaticMeshComponent* SM_OVR_TableSmall_01_StaticMeshComponent0; // 0x320(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_B8_NewDecalComponent; // 0x328(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_B5_NewDecalComponent; // 0x330(0x08)
	struct UDecalComponent* MI_Castle_Ruin1_Decal_SootSmudge_5_NewDecalComponent; // 0x338(0x08)
	struct UDecalComponent* MI_BCProps_Decal_Ash_A_NewDecalComponent; // 0x340(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_B7_NewDecalComponent; // 0x348(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Bucket_Water_001_W_StaticMeshComponent0; // 0x350(0x08)
	struct UStaticMeshComponent* SM_HM_Dervish_Rag_StaticMeshComponent0; // 0x358(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_B2_NewDecalComponent; // 0x360(0x08)
	struct UStaticMeshComponent* SM_HM_Pillow_A_StaticMeshComponent0; // 0x368(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_B14_NewDecalComponent; // 0x370(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Cot_001_W_StaticMeshComponent0; // 0x378(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_AshCircle_B_2_NewDecalComponent; // 0x380(0x08)
	struct USceneComponent* SharedRoot; // 0x388(0x08)
};

