// BlueprintGeneratedClass BP_Bothy_D_Int_01.BP_Bothy_D_Int_01_C
// Size: 0x470 (Inherited: 0x248)
struct ABP_Bothy_D_Int_01_C : AActor {
	struct UStaticMeshComponent* SM_HM_3Broom_BroomstickRack_B2_StaticMeshComponent0; // 0x248(0x08)
	struct UStaticMeshComponent* SM_OVL_Sign_Hanger_G_StaticMeshComponent0; // 0x250(0x08)
	struct UStaticMeshComponent* SM_OVL_Sign_Hanger_A2_StaticMeshComponent0; // 0x258(0x08)
	struct UStaticMeshComponent* SM_OVL_Sign_Hanger_A_StaticMeshComponent0; // 0x260(0x08)
	struct UStaticMeshComponent* SM_OVL_Sign_Hanger_C_StaticMeshComponent0; // 0x268(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeStake_C5_StaticMeshComponent0; // 0x270(0x08)
	struct UStaticMeshComponent* SM_Inf01_BroomPlain_01_StaticMeshComponent0; // 0x278(0x08)
	struct UDecalComponent* MI_BCProps_Decal_Ash_A8_NewDecalComponent; // 0x280(0x08)
	struct UDecalComponent* MI_BCProps_Decal_Ash_A7_NewDecalComponent; // 0x288(0x08)
	struct UDecalComponent* MI_BCProps_Decal_Ash_A9_NewDecalComponent; // 0x290(0x08)
	struct UDecalComponent* MI_BCProps_Decal_Ash_A11_NewDecalComponent; // 0x298(0x08)
	struct UStaticMeshComponent* SM_CampA_Int_RailingPost_01A_StaticMeshComponent3; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_CampA_Int_RailingPost_01A_StaticMeshComponent2; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_HM_Pillow_A3_StaticMeshComponent0; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_CampA_Int_Bed_01A_StaticMeshComponent1; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_CampA_Int_BedRug_01A_StaticMeshComponent0; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_CampA_Int_RailingPost_01A_StaticMeshComponent1; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_CampA_Int_RailingPost_01A_StaticMeshComponent0; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_HW_RT_DormLadder_StaticMeshComponent0; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_CampA_Int_Bed_01A_StaticMeshComponent0; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_HM_Pillow_A2_StaticMeshComponent0; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_CampA_Int_BedRug_01B_StaticMeshComponent0; // 0x2f0(0x08)
	struct UDecalComponent* MI_BCProps_Decal_Ash_A15_NewDecalComponent; // 0x2f8(0x08)
	struct UDecalComponent* MI_BCProps_Decal_Ash_A12_NewDecalComponent; // 0x300(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Log_Stump_001_D_StaticMeshComponent0; // 0x308(0x08)
	struct UStaticMeshComponent* SM_Cav_MiningLamp_01_StaticMeshComponent0; // 0x310(0x08)
	struct UStaticMeshComponent* SM_CampA_Rug_Gazelle_StaticMeshComponent0; // 0x318(0x08)
	struct UStaticMeshComponent* SM_HM_Pillow_A_StaticMeshComponent0; // 0x320(0x08)
	struct UStaticMeshComponent* SM_Bed_Twin_Blanket_A_StaticMeshComponent0; // 0x328(0x08)
	struct UStaticMeshComponent* SM_CampA_Int_Bed_01A2_StaticMeshComponent0; // 0x330(0x08)
	struct UDecalComponent* MI_BCProps_Decal_Ash_A17_NewDecalComponent; // 0x338(0x08)
	struct UStaticMeshComponent* SM_HW_DAO_TribalMask_C_Expression_04_StaticMeshComponent0; // 0x340(0x08)
	struct UStaticMeshComponent* SM_HW_DAO_TribalMask_C_Expression_02_StaticMeshComponent0; // 0x348(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeStake_C4_StaticMeshComponent0; // 0x350(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeStake_C3_StaticMeshComponent0; // 0x358(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeStake_C2_StaticMeshComponent0; // 0x360(0x08)
	struct UStaticMeshComponent* SM_HW_DAO_TribalMask_C_Expression_01_StaticMeshComponent0; // 0x368(0x08)
	struct UDecalComponent* MI_BCProps_Decal_Ash_A18_NewDecalComponent; // 0x370(0x08)
	struct UStaticMeshComponent* SM_Cairn_WoodShelf_A2_StaticMeshComponent0; // 0x378(0x08)
	struct UDecalComponent* MI_BCProps_Decal_Ash_A10_NewDecalComponent; // 0x380(0x08)
	struct UDecalComponent* MI_BCProps_Decal_Ash_A14_NewDecalComponent; // 0x388(0x08)
	struct UDecalComponent* MI_BCProps_Decal_Ash_A13_NewDecalComponent; // 0x390(0x08)
	struct UStaticMeshComponent* SM_HM_Dervish_Rag_StaticMeshComponent0; // 0x398(0x08)
	struct UDecalComponent* MI_BCProps_Decal_Ash_A16_NewDecalComponent; // 0x3a0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Bottle_2_StaticMeshComponent0; // 0x3a8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Bottle_3_StaticMeshComponent0; // 0x3b0(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Table_A_Chair_BD_StaticMeshComponent0; // 0x3b8(0x08)
	struct UStaticMeshComponent* SM_Cairn_WoodShelf_A_StaticMeshComponent0; // 0x3c0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Bottle_001_StaticMeshComponent0; // 0x3c8(0x08)
	struct UStaticMeshComponent* SM_CastleDun_GOB_Bottle_C_StaticMeshComponent0; // 0x3d0(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeSpan_J_StaticMeshComponent0; // 0x3d8(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeSpan_D2_StaticMeshComponent0; // 0x3e0(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeSpan_A_StaticMeshComponent0; // 0x3e8(0x08)
	struct UStaticMeshComponent* SM_CastleDun_Kitchen_Ladle_A_StaticMeshComponent0; // 0x3f0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Cauldron_002_StaticMeshComponent0; // 0x3f8(0x08)
	struct UDecalComponent* MI_BCProps_Decal_Ash_A4_NewDecalComponent; // 0x400(0x08)
	struct UStaticMeshComponent* SM_HM_Stacking_Cauldron_F_StaticMeshComponent0; // 0x408(0x08)
	struct UDecalComponent* MI_BCProps_Decal_Ash_A_NewDecalComponent; // 0x410(0x08)
	struct UStaticMeshComponent* SM_HM_Stacking_Cauldron_E_StaticMeshComponent0; // 0x418(0x08)
	struct UDecalComponent* MI_BCProps_Decal_Ash_A3_NewDecalComponent; // 0x420(0x08)
	struct UStaticMeshComponent* SM_OVR_Kitchenware_item_D_StaticMeshComponent0; // 0x428(0x08)
	struct UDecalComponent* MI_BCProps_Decal_Ash_A2_NewDecalComponent; // 0x430(0x08)
	struct UDecalComponent* MI_BCProps_Decal_Ash_A6_NewDecalComponent; // 0x438(0x08)
	struct UDecalComponent* MI_BCProps_Decal_Ash_A5_NewDecalComponent; // 0x440(0x08)
	struct UStaticMeshComponent* SM_BCProps_Wood_Chopped_Small_003_StaticMeshComponent0; // 0x448(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_OpenCrate_Small_002_W_StaticMeshComponent0; // 0x450(0x08)
	struct UStaticMeshComponent* SM_BCProps_Wood_Chopped_Small_002_StaticMeshComponent0; // 0x458(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_BroomstickRack_B3_StaticMeshComponent0; // 0x460(0x08)
	struct USceneComponent* SharedRoot; // 0x468(0x08)
};

