// BlueprintGeneratedClass BP_Bothy_C_Int_01.BP_Bothy_C_Int_01_C
// Size: 0x358 (Inherited: 0x248)
struct ABP_Bothy_C_Int_01_C : AActor {
	struct UDecalComponent* MI_BCProps_Decal_Ash_A8_NewDecalComponent; // 0x248(0x08)
	struct UDecalComponent* MI_BCProps_Decal_Ash_A6_NewDecalComponent; // 0x250(0x08)
	struct UDecalComponent* MI_BCProps_Decal_Ash_A9_NewDecalComponent; // 0x258(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_BroomstickRack_B_StaticMeshComponent0; // 0x260(0x08)
	struct UStaticMeshComponent* SM_HGM_KioskPapers_StaticMeshComponent0; // 0x268(0x08)
	struct UStaticMeshComponent* SM_HM_Missing_Poster_StaticMeshComponent0; // 0x270(0x08)
	struct UStaticMeshComponent* SM_HM_Paper_G_StaticMeshComponent0; // 0x278(0x08)
	struct UStaticMeshComponent* SM_HW_Trash_PaperScraps_A_StaticMeshComponent0; // 0x280(0x08)
	struct UStaticMeshComponent* SM_Dare_Table_A_2_StaticMeshComponent0; // 0x288(0x08)
	struct UStaticMeshComponent* SM_CastleDun_GOB_Cup_StaticMeshComponent0; // 0x290(0x08)
	struct UStaticMeshComponent* SM_WE_ScrunchedPaper_StaticMeshComponent0; // 0x298(0x08)
	struct UDecalComponent* MI_BCProps_Decal_Ash_A11_NewDecalComponent; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_WE_Newspaper_3_StaticMeshComponent0; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_WE_Newspaper_02_StaticMeshComponent0; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Chair_D_StaticMeshComponent0; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_HM_Pillow_A2_StaticMeshComponent0; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_BCProps_FloorCloth_E_StaticMeshComponent0; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Cot_001_W_StaticMeshComponent0; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_BCProps_FloorCloth_D_StaticMeshComponent0; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_HM_Pillow_A_StaticMeshComponent0; // 0x2e0(0x08)
	struct UDecalComponent* MI_BCProps_Decal_Ash_A12_NewDecalComponent; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_HM_Rope_Candle_Lamp_B_StaticMeshComponent0; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_Cairn_WoodShelf_B_StaticMeshComponent0; // 0x2f8(0x08)
	struct UDecalComponent* MI_BCProps_Decal_Ash_A10_NewDecalComponent; // 0x300(0x08)
	struct UDecalComponent* MI_BCProps_Decal_Ash_A2_NewDecalComponent; // 0x308(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Bucket_Small_001_W_StaticMeshComponent0; // 0x310(0x08)
	struct UStaticMeshComponent* SM_CastleDun_GOB_Teapot_StaticMeshComponent0; // 0x318(0x08)
	struct UDecalComponent* MI_BCProps_Decal_Ash_A5_NewDecalComponent; // 0x320(0x08)
	struct UDecalComponent* MI_BCProps_Decal_Ash_A3_NewDecalComponent; // 0x328(0x08)
	struct UDecalComponent* MI_BCProps_Decal_Ash_A_NewDecalComponent; // 0x330(0x08)
	struct UStaticMeshComponent* SM_BCProps_Wood_Chopped_Small_001_StaticMeshComponent0; // 0x338(0x08)
	struct UDecalComponent* MI_BCProps_Decal_Ash_A4_NewDecalComponent; // 0x340(0x08)
	struct UDecalComponent* MI_BCProps_Decal_Ash_A7_NewDecalComponent; // 0x348(0x08)
	struct USceneComponent* SharedRoot; // 0x350(0x08)
};

