// BlueprintGeneratedClass BP_Cav_Ivy_02.BP_Cav_Ivy_02_C
// Size: 0x2c8 (Inherited: 0x248)
struct ABP_Cav_Ivy_02_C : AActor {
	struct UStaticMeshComponent* SM_BCProps_Ivy_Wall_Single_C1; // 0x248(0x08)
	struct UStaticMeshComponent* SM_BCProps_Ivy_Wall_Single_B; // 0x250(0x08)
	struct UStaticMeshComponent* SM_BCProps_Ivy_Wall_Hanging_C; // 0x258(0x08)
	struct UStaticMeshComponent* SM_Ivy_Kit_O2; // 0x260(0x08)
	struct UStaticMeshComponent* SM_BCProps_Ivy_Wall_Small_A; // 0x268(0x08)
	struct UStaticMeshComponent* SM_Ivy_Kit_P; // 0x270(0x08)
	struct UStaticMeshComponent* SM_Ivy_Kit_N1; // 0x278(0x08)
	struct UStaticMeshComponent* SM_Ivy_Kit_K1; // 0x280(0x08)
	struct UStaticMeshComponent* SM_BCProps_Ivy_Wall_Hanging_A; // 0x288(0x08)
	struct UStaticMeshComponent* SM_Ivy_Kit_K; // 0x290(0x08)
	struct UStaticMeshComponent* SM_BCProps_Ivy_Wall_Single_E; // 0x298(0x08)
	struct UStaticMeshComponent* SM_BCProps_Ivy_Wall_Single_C; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_Ivy_Kit_N; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_Ivy_Kit_O1; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_Ivy_Kit_O; // 0x2b8(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x2c0(0x08)
};

