// BlueprintGeneratedClass BP_Castle_Ruins_3_009.BP_Castle_Ruins_3_009_C
// Size: 0x2c0 (Inherited: 0x248)
struct ABP_Castle_Ruins_3_009_C : AActor {
	struct UStaticMeshComponent* SM_CastleRuins_3_Wall_Combined_E_StaticMeshComponent1; // 0x248(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_3_Wall_Combined_E_StaticMeshComponent0; // 0x250(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_3_Broken_F_1_StaticMeshComponent0; // 0x258(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_3_Broken_F_0_StaticMeshComponent0; // 0x260(0x08)
	struct UDecalComponent* MI_Castle_Ruin1_Decal_SootSmudge_5_NewDecalComponent5; // 0x268(0x08)
	struct UDecalComponent* MI_Castle_Ruin1_Decal_SootSmudge_5_NewDecalComponent4; // 0x270(0x08)
	struct UDecalComponent* MI_Castle_Ruin1_Decal_SootSmudge_5_NewDecalComponent3; // 0x278(0x08)
	struct UDecalComponent* MI_Castle_Ruin1_Decal_SootSmudge_5_NewDecalComponent2; // 0x280(0x08)
	struct UDecalComponent* MI_Castle_Ruin1_Decal_SootSmudge_5_NewDecalComponent1; // 0x288(0x08)
	struct UDecalComponent* MI_Castle_Ruin1_Decal_SootSmudge_5_NewDecalComponent; // 0x290(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_G_NewDecalComponent1; // 0x298(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_G_NewDecalComponent; // 0x2a0(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_E_NewDecalComponent; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_MERGED_SM_CastleRuins_3_Broken_D2_StaticMeshComponent0; // 0x2b0(0x08)
	struct USceneComponent* SharedRoot; // 0x2b8(0x08)
};

