// BlueprintGeneratedClass BP_Cluster_H.BP_Cluster_H_C
// Size: 0x410 (Inherited: 0x32a)
struct ABP_Cluster_H_C : ANone {
	char pad_32A[0x6]; // 0x32a(0x06)
	struct UCameraStackVolumeComponent* CameraStackVolume2; // 0x330(0x08)
	struct UBoxComponent* Box4; // 0x338(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_3_Broken_M_a; // 0x340(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_Broken_B_a; // 0x348(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_Broken_P_a1; // 0x350(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_Broken_P_a; // 0x358(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Debris_C4; // 0x360(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Debris_A1; // 0x368(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Debris_C3; // 0x370(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Debris_B2; // 0x378(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Debris_B1; // 0x380(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Debris_C2; // 0x388(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Debris_C1; // 0x390(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_3_Broken_M_c; // 0x398(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Debris_B; // 0x3a0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Debris_C; // 0x3a8(0x08)
	struct UChildActorComponent* BP_Small_CastleRuins_2_I; // 0x3b0(0x08)
	struct UChildActorComponent* BP_Small_CastleRuins_2_H; // 0x3b8(0x08)
	struct UChildActorComponent* BP_Small_CastleRuins_2_G; // 0x3c0(0x08)
	struct UChildActorComponent* BP_Small_CastleRuins_2_F; // 0x3c8(0x08)
	struct UChildActorComponent* BP_Small_CastleRuins_2_E; // 0x3d0(0x08)
	struct UChildActorComponent* BP_Small_CastleRuins_2_D; // 0x3d8(0x08)
	struct UChildActorComponent* BP_Small_CastleRuins_2_C; // 0x3e0(0x08)
	struct UChildActorComponent* BP_Small_CastleRuins_2_B; // 0x3e8(0x08)
	struct UChildActorComponent* BP_Small_CastleRuins_2_A; // 0x3f0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Debris_A; // 0x3f8(0x08)
	struct USceneComponent* Ruins; // 0x400(0x08)
	struct USceneComponent* SharedRoot; // 0x408(0x08)
};

