// BlueprintGeneratedClass BP_CastleRuins_1_Med_Built_Wall_Cap_B.BP_CastleRuins_1_Med_Built_Wall_Cap_B_C
// Size: 0x2c0 (Inherited: 0x248)
struct ABP_CastleRuins_1_Med_Built_Wall_Cap_B_C : AActor {
	struct UStaticMeshComponent* StaticMeshComponent011; // 0x248(0x08)
	struct UStaticMeshComponent* StaticMeshComponent010; // 0x250(0x08)
	struct UStaticMeshComponent* StaticMeshComponent09; // 0x258(0x08)
	struct UStaticMeshComponent* StaticMeshComponent08; // 0x260(0x08)
	struct UStaticMeshComponent* StaticMeshComponent07; // 0x268(0x08)
	struct UStaticMeshComponent* StaticMeshComponent06; // 0x270(0x08)
	struct UStaticMeshComponent* StaticMeshComponent012; // 0x278(0x08)
	struct UStaticMeshComponent* StaticMeshComponent04; // 0x280(0x08)
	struct UStaticMeshComponent* StaticMeshComponent03; // 0x288(0x08)
	struct UStaticMeshComponent* StaticMeshComponent02; // 0x290(0x08)
	struct UStaticMeshComponent* StaticMeshComponent01; // 0x298(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0; // 0x2a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent05; // 0x2a8(0x08)
	struct UBoxComponent* Box; // 0x2b0(0x08)
	struct USceneComponent* SharedRoot; // 0x2b8(0x08)
};

