// BlueprintGeneratedClass BP_CastleRuins1_StairsOutdoor_Wide.BP_CastleRuins1_StairsOutdoor_Wide_C
// Size: 0x290 (Inherited: 0x248)
struct ABP_CastleRuins1_StairsOutdoor_Wide_C : AActor {
	struct UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_A1; // 0x248(0x08)
	struct UStaticMeshComponent* SM_CastleRuin1_Stair_A2; // 0x250(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_A; // 0x258(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Arch_Pillar_A; // 0x260(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Arch_Pillar_A1; // 0x268(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Wall_Roof_Beam_A_b1; // 0x270(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Wall_Roof_Beam_A_b; // 0x278(0x08)
	struct UStaticMeshComponent* SM_CastleRuin1_Stair_A1; // 0x280(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x288(0x08)
};

