// BlueprintGeneratedClass BP_CastleRuins_3_Floor_E.BP_CastleRuins_3_Floor_E_C
// Size: 0x288 (Inherited: 0x248)
struct ABP_CastleRuins_3_Floor_E_C : AActor {
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_CastleRuins_3_Bricks_A_o; // 0x248(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_10SM_CastleRuins_3_Bricks_A_n; // 0x250(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_CastleRuins_3_Bricks_A_g; // 0x258(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_7SM_CastleRuins_3_Bricks_A_d; // 0x260(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_10SM_CastleRuins_3_Bricks_A_c; // 0x268(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_CastleRuins_3_Bricks_A_b; // 0x270(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_CastleRuins_3_Bricks_A_a; // 0x278(0x08)
	struct USceneComponent* SharedRoot; // 0x280(0x08)
};

