// BlueprintGeneratedClass BP_Cairn_HiddenDoor.BP_Cairn_HiddenDoor_C
// Size: 0x2d8 (Inherited: 0x248)
struct ABP_Cairn_HiddenDoor_C : AActor {
	struct UStaticMeshComponent* SM_Cairn_PillarBlock1; // 0x248(0x08)
	struct UStaticMeshComponent* SM_Cairn_PillarBlock; // 0x250(0x08)
	struct UStaticMeshComponent* StaticMeshComponent1; // 0x258(0x08)
	struct UStaticMeshComponent* StaticMeshComponent012; // 0x260(0x08)
	struct UStaticMeshComponent* StaticMeshComponent011; // 0x268(0x08)
	struct UStaticMeshComponent* StaticMeshComponent09; // 0x270(0x08)
	struct UStaticMeshComponent* StaticMeshComponent08; // 0x278(0x08)
	struct UStaticMeshComponent* StaticMeshComponent07; // 0x280(0x08)
	struct UStaticMeshComponent* StaticMeshComponent03; // 0x288(0x08)
	struct UStaticMeshComponent* StaticMeshComponent02; // 0x290(0x08)
	struct UStaticMeshComponent* StaticMeshComponent01; // 0x298(0x08)
	struct UStaticMeshComponent* StaticMeshComponent010; // 0x2a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent06; // 0x2a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0; // 0x2b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent05; // 0x2b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent04; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_Cairn_BoneContainerCover; // 0x2c8(0x08)
	struct USceneComponent* SharedRoot; // 0x2d0(0x08)
};

