// BlueprintGeneratedClass BP_Cav_06_DungeonEntrance_Open.BP_Cav_06_DungeonEntrance_Open_C
// Size: 0x350 (Inherited: 0x248)
struct ABP_Cav_06_DungeonEntrance_Open_C : AActor {
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2GC_Int_Cavern_2m_PlankA_Piece_05; // 0x248(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_OL_DangerSign_TurnBack_01; // 0x250(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_OL_DangerSign_SkullCross_02; // 0x258(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_OL_DangerSign_SkullCross_01; // 0x260(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_OL_DangerSign_ExtremeDanger_01; // 0x268(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_OL_DangerSign_DoNotEnter_01; // 0x270(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_FoodBag_1bag_001_W; // 0x278(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_Bucket_Small_001_W; // 0x280(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_8SM_Int_BCProps_Bottle_003; // 0x288(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_Int_BCProps_Bottle_001; // 0x290(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_HW_Birdcage_Round; // 0x298(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_HM_Beast_Cage_D; // 0x2a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_Beast_Cage_C; // 0x2a8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_7SM_HM_Beast_Cage_B; // 0x2b0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_HM_Beast_Cage_A; // 0x2b8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_GobMine_CoalPile_A; // 0x2c0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_19SM_CampB_5m_PlankD; // 0x2c8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_CampB_5m_PlankB; // 0x2d0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_7SM_CampB_2m_PlankC; // 0x2d8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_8SM_CampB_2_5x_Plank; // 0x2e0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_BCProps_RopeStake_C; // 0x2e8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_BCProps_RopeLashing_A; // 0x2f0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_BCProps_Eyelet_A; // 0x2f8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2GC_Int_Cavern_5m_PlankA_Piece_04; // 0x300(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2GC_Int_Cavern_2m_PlankA_Piece_13; // 0x308(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_OVL_Sign_Post_A; // 0x310(0x08)
	struct UStaticMeshComponent* SM_BCProps_FloorCloth_A; // 0x318(0x08)
	struct UStaticMeshComponent* SM_BCProps_Ropecoil_B; // 0x320(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeEnd_A; // 0x328(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeSpan_D; // 0x330(0x08)
	struct UStaticMeshComponent* SM_CampB_5m_PlankC; // 0x338(0x08)
	struct UStaticMeshComponent* SM_HM_Beast_Cage_Cover_C; // 0x340(0x08)
	struct USceneComponent* SharedRoot; // 0x348(0x08)
};

