// BlueprintGeneratedClass BP_Castle_Ruins_3_007.BP_Castle_Ruins_3_007_C
// Size: 0x2c8 (Inherited: 0x248)
struct ABP_Castle_Ruins_3_007_C : AActor {
	struct UStaticMeshComponent* SM_CastleRuins_3_Wall_Combined_E1; // 0x248(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_3_Wall_Combined_E; // 0x250(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* SM_CastleRuins_3_Wall_Corner_Cap_B (HISMA)_HierarchicalInstancedStaticMesh; // 0x258(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* SM_CastleRuins_3_Broken_K (HISMA)_HierarchicalInstancedStaticMesh; // 0x260(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* SM_CastleRuins_3_Broken_F (HISMA)_HierarchicalInstancedStaticMesh; // 0x268(0x08)
	struct UDecalComponent* MI_Castle_Ruin1_Decal_SootSmudge_5_NewDecalComponent3; // 0x270(0x08)
	struct UDecalComponent* MI_Castle_Ruin1_Decal_SootSmudge_5_NewDecalComponent2; // 0x278(0x08)
	struct UDecalComponent* MI_Castle_Ruin1_Decal_SootSmudge_5_NewDecalComponent1; // 0x280(0x08)
	struct UDecalComponent* MI_Castle_Ruin1_Decal_SootSmudge_5_NewDecalComponent; // 0x288(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* SM_CastleRuins_3_Wall_M (HISMA)_HierarchicalInstancedStaticMesh; // 0x290(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_D_NewDecalComponent2; // 0x298(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_C_NewDecalComponent3; // 0x2a0(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_C_NewDecalComponent; // 0x2a8(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_E_NewDecalComponent; // 0x2b0(0x08)
	struct USceneComponent* Scene; // 0x2b8(0x08)
	struct USceneComponent* SharedRoot; // 0x2c0(0x08)
};

