// BlueprintGeneratedClass BP_Cav_06_DungeonEntrance_Blocked.BP_Cav_06_DungeonEntrance_Blocked_C
// Size: 0x2e8 (Inherited: 0x248)
struct ABP_Cav_06_DungeonEntrance_Blocked_C : AActor {
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_OL_DangerSign_TurnBack_01; // 0x248(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_OL_DangerSign_SkullCross_02; // 0x250(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_OL_DangerSign_SkullCross_01; // 0x258(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_OL_DangerSign_ExtremeDanger_01; // 0x260(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_11SM_CampB_2m_PlankC; // 0x268(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_OL_DangerSign_DoNotEnter_01; // 0x270(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_MedStones2BlendLess; // 0x278(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_11SM_GobMine_CoalPile_A; // 0x280(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_21SM_CampB_5m_PlankD; // 0x288(0x08)
	struct UStaticMeshComponent* SM_HM_Beast_Cage_B; // 0x290(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_OVL_Sign_Post_A; // 0x298(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_BCProps_RopeStake_C; // 0x2a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_BCProps_RopeLashing_A; // 0x2a8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_BCProps_Eyelet_A; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_BCProps_FloorCloth_A; // 0x2b8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_8SM_CampB_2_5x_Plank; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_BCProps_Ropecoil_B; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeEnd_A; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeSpan_D1; // 0x2d8(0x08)
	struct USceneComponent* SharedRoot; // 0x2e0(0x08)
};

