// BlueprintGeneratedClass BP_CampA_TentC_Broken.BP_CampA_TentC_Broken_C
// Size: 0x2b8 (Inherited: 0x248)
struct ABP_CampA_TentC_Broken_C : AActor {
	struct UCameraStackVolumeComponent* CameraStackVolume1; // 0x248(0x08)
	struct UCapsuleComponent* Capsule; // 0x250(0x08)
	struct UStaticMeshComponent* StaticMeshComponent10; // 0x258(0x08)
	struct UStaticMeshComponent* StaticMeshComponent9; // 0x260(0x08)
	struct UStaticMeshComponent* StaticMeshComponent8; // 0x268(0x08)
	struct UStaticMeshComponent* StaticMeshComponent7; // 0x270(0x08)
	struct UStaticMeshComponent* StaticMeshComponent6; // 0x278(0x08)
	struct UStaticMeshComponent* StaticMeshComponent5; // 0x280(0x08)
	struct UStaticMeshComponent* StaticMeshComponent4; // 0x288(0x08)
	struct UStaticMeshComponent* StaticMeshComponent3; // 0x290(0x08)
	struct UStaticMeshComponent* StaticMeshComponent2; // 0x298(0x08)
	struct UStaticMeshComponent* StaticMeshComponent1; // 0x2a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0; // 0x2a8(0x08)
	struct USceneComponent* SharedRoot; // 0x2b0(0x08)
};

