// BlueprintGeneratedClass BP_CampB_TentA.BP_CampB_TentA_C
// Size: 0x2b0 (Inherited: 0x248)
struct ABP_CampB_TentA_C : AActor {
	struct UStaticMeshComponent* SM_COL_CampB_TentA; // 0x248(0x08)
	struct UStaticMeshComponent* SM_CampB_TentA_Beams; // 0x250(0x08)
	struct UStaticMeshComponent* SM_CampB_TentA_Roof; // 0x258(0x08)
	struct UStaticMeshComponent* SM_CampB_Chimney_B; // 0x260(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_14SM_CampB_Rope_C; // 0x268(0x08)
	struct UStaticMeshComponent* SM_CampB_TentA_Wall; // 0x270(0x08)
	struct UStaticMeshComponent* SM_CampB_Banner_D; // 0x278(0x08)
	struct UStaticMeshComponent* SM_CampB_Banner_C; // 0x280(0x08)
	struct UStaticMeshComponent* SM_CampB_Banner_B; // 0x288(0x08)
	struct UCameraStackVolumeComponent* CameraStackVolume2; // 0x290(0x08)
	struct UCapsuleComponent* Capsule1; // 0x298(0x08)
	struct USceneComponent* SharedRoot1; // 0x2a0(0x08)
	struct USceneComponent* SharedRoot; // 0x2a8(0x08)
};

