// BlueprintGeneratedClass BP_CastleRuins1_RuinPiece_C.BP_CastleRuins1_RuinPiece_C_C
// Size: 0x298 (Inherited: 0x248)
struct ABP_CastleRuins1_RuinPiece_C_C : AActor {
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_C4; // 0x248(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Stone_Table_A2_339; // 0x250(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_C3; // 0x258(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_C2; // 0x260(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Wall_Roof_Beam_A_a_335; // 0x268(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Stone_Table_A_333; // 0x270(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_C_331; // 0x278(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Pillar_Variant_A_329; // 0x280(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Wall_Corner_Decoration_A; // 0x288(0x08)
	struct USceneComponent* SharedRoot; // 0x290(0x08)
};

