// BlueprintGeneratedClass BP_CastleRuins_1_Built_Wall_C.BP_CastleRuins_1_Built_Wall_C_C
// Size: 0x2d8 (Inherited: 0x248)
struct ABP_CastleRuins_1_Built_Wall_C_C : AActor {
	struct UStaticMeshComponent* StaticMesh4; // 0x248(0x08)
	struct UStaticMeshComponent* StaticMesh3; // 0x250(0x08)
	struct UStaticMeshComponent* StaticMesh2; // 0x258(0x08)
	struct UStaticMeshComponent* StaticMesh1; // 0x260(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x268(0x08)
	struct UStaticMeshComponent* StaticMeshComponent09; // 0x270(0x08)
	struct UStaticMeshComponent* StaticMeshComponent08; // 0x278(0x08)
	struct UStaticMeshComponent* StaticMeshComponent07; // 0x280(0x08)
	struct UStaticMeshComponent* StaticMeshComponent06; // 0x288(0x08)
	struct UStaticMeshComponent* StaticMeshComponent05; // 0x290(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_C; // 0x298(0x08)
	struct UStaticMeshComponent* StaticMeshComponent03; // 0x2a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent02; // 0x2a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent01; // 0x2b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0; // 0x2b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent04; // 0x2c0(0x08)
	struct UBoxComponent* Box; // 0x2c8(0x08)
	struct USceneComponent* SharedRoot; // 0x2d0(0x08)
};

