// BlueprintGeneratedClass BP_Cluster_B.BP_Cluster_B_C
// Size: 0x878 (Inherited: 0x32a)
struct ABP_Cluster_B_C : ABP_ClusterRuin_Marker_C {
	char pad_32A[0x6]; // 0x32a(0x06)
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x330(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_C; // 0x338(0x08)
	struct UDecalComponent* MI_HM_Decal_Dirt_D2; // 0x340(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Dirt_D2; // 0x348(0x08)
	struct UDecalComponent* MI_HW_Decal_PlasterWear_02_118; // 0x350(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_D9_116; // 0x358(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_D8_114; // 0x360(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Edge_B_112; // 0x368(0x08)
	struct UDecalComponent* MI_HW_Decal_RockDamage_110; // 0x370(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_C6; // 0x378(0x08)
	struct UDecalComponent* MI_Cairn_Decal_MossPatch_A9_107; // 0x380(0x08)
	struct UDecalComponent* MI_Cairn_Decal_MossPatch_A8_105; // 0x388(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_C5; // 0x390(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_A2_102; // 0x398(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_D7_100; // 0x3a0(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Dirt_D; // 0x3a8(0x08)
	struct UDecalComponent* MI_HM_Decal_Dirt_D1; // 0x3b0(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_D2_96; // 0x3b8(0x08)
	struct UDecalComponent* MI_Cairn_Decal_MossPatch_A7_94; // 0x3c0(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_C4; // 0x3c8(0x08)
	struct UDecalComponent* MI_Cairn_Decal_MossPatch_A6_91; // 0x3d0(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_D6_89; // 0x3d8(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_B4_87; // 0x3e0(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_C2_85; // 0x3e8(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_F; // 0x3f0(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_D5_82; // 0x3f8(0x08)
	struct UDecalComponent* MI_Cairn_Decal_MossPatch_A5_80; // 0x400(0x08)
	struct UDecalComponent* MI_Cairn_Decal_MossPatch_A4_78; // 0x408(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_D4_76; // 0x410(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_A_74; // 0x418(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_B3_72; // 0x420(0x08)
	struct UDecalComponent* MI_Cairn_Decal_MossPatch_A3_70; // 0x428(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_D3_68; // 0x430(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Damage_B_3; // 0x438(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_D2_65; // 0x440(0x08)
	struct UDecalComponent* MI_Cairn_Decal_MossPatch_A2_63; // 0x448(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_D_61; // 0x450(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_B2_59; // 0x458(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_C_57; // 0x460(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_C3; // 0x468(0x08)
	struct UDecalComponent* MI_Cairn_Decal_MossPatch_A_54; // 0x470(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Wall_Corner_Decoration_A4_347; // 0x478(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_C13; // 0x480(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_Cap_A_a7_344; // 0x488(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Pillar_Variant_A6; // 0x490(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_TheSlate_D_a8; // 0x498(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_C12; // 0x4a0(0x08)
	struct UStaticMeshComponent* SM_CastleRuin1_Stones_A; // 0x4a8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Debris_B; // 0x4b0(0x08)
	struct UStaticMeshComponent* SM_CastleRuin1_DebrisMound_C_337; // 0x4b8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_TheSlate_D_a7; // 0x4c0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_C11; // 0x4c8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_Cap_A_a6_333; // 0x4d0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_Cap_A_a5_331; // 0x4d8(0x08)
	struct UStaticMeshComponent* SM_CastleRuin1_Stones_D_329; // 0x4e0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_A3_327; // 0x4e8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_TheSlate_D_a6; // 0x4f0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_TheSlate_D_a5; // 0x4f8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Wall_Roof_Beam_A_b2_323; // 0x500(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_TheSlate_D_a4; // 0x508(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_C10; // 0x510(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Tower_Top_Architecture_B6; // 0x518(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_C11_318; // 0x520(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_C9; // 0x528(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Wall_Roof_Beam_A_b_315; // 0x530(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_C10_313; // 0x538(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Pillar_Variant_A5_311; // 0x540(0x08)
	struct UStaticMeshComponent* SM_CastleRuin1_Stones_I; // 0x548(0x08)
	struct UStaticMeshComponent* SM_Overland_Rock_03; // 0x550(0x08)
	struct UStaticMeshComponent* SM_Overland_Rock_05; // 0x558(0x08)
	struct UStaticMeshComponent* SM_Overland_Rock_08; // 0x560(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Debris_C5; // 0x568(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bricks_A_f3; // 0x570(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_TheSlate_D_a3; // 0x578(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bricks_A_p4; // 0x580(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_TheSlate_D_a2; // 0x588(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_TheSlate_D_a; // 0x590(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Wall_Brick_Decoration_A15; // 0x598(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_C8_298; // 0x5a0(0x08)
	struct UStaticMeshComponent* SM_Overland_Rock_07; // 0x5a8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_C9_295; // 0x5b0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_C8_293; // 0x5b8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_C7_291; // 0x5c0(0x08)
	struct UStaticMeshComponent* Cube_289; // 0x5c8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Stone_Table_A_287; // 0x5d0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_C6_285; // 0x5d8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Wall_Damaged_A9; // 0x5e0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Pillar_Variant_A4_282; // 0x5e8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Wall_Damaged_A8; // 0x5f0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Wall_Damaged_A7; // 0x5f8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Wall_Damaged_A6; // 0x600(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Wall_Damaged_A5; // 0x608(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Wall_Damaged_A4_276; // 0x610(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Wall_Damaged_A3_274; // 0x618(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_C5_272; // 0x620(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Wall_Roof_Beam_A_a_270; // 0x628(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_Cap_A_b4_268; // 0x630(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_C4_266; // 0x638(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_Cap_A_b3_264; // 0x640(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_Cap_B4_262; // 0x648(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Pillar_Variant_A3_260; // 0x650(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_D3_258; // 0x658(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_Cap_B3_256; // 0x660(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Pillar_Variant_A2_254; // 0x668(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Wall_Brick_Decoration_A14; // 0x670(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_wall_N18; // 0x678(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_wall_N17; // 0x680(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_wall_N16; // 0x688(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Wall_Brick_Decoration_A13; // 0x690(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_wall_N15; // 0x698(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_wall_N14; // 0x6a0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_wall_N13; // 0x6a8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_wall_N12; // 0x6b0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_wall_N11; // 0x6b8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_wall_N10; // 0x6c0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_wall_N9; // 0x6c8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Tower_Top_Architecture_B5; // 0x6d0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Wall_Corner_Cap_A_A12; // 0x6d8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Wall_Brick_Decoration_A12; // 0x6e0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Wall_Corner_Cap_A_A11; // 0x6e8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_wall_N8; // 0x6f0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_wall_N7; // 0x6f8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Tower_Top_Architecture_A5; // 0x700(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Wall_Corner_Cap_A_A10; // 0x708(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Wall_Corner_Cap_A_A9; // 0x710(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_C7_231; // 0x718(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Tower_Top_Architecture_A4; // 0x720(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_wall_N6; // 0x728(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Wall_Brick_Decoration_A11; // 0x730(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Wall_Corner_Cap_A_A8; // 0x738(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Wall_Brick_Decoration_A10; // 0x740(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Wall_Brick_Decoration_A9; // 0x748(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Tower_Top_Architecture_B4; // 0x750(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Wall_Corner_Cap_A_A7; // 0x758(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Wall_Corner_Cap_A_A6; // 0x760(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_wall_N5; // 0x768(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Tower_Top_Architecture_A3; // 0x770(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Tower_Top_Architecture_A2; // 0x778(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Wall_Corner_Cap_A_A5; // 0x780(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Wall_Corner_Cap_A_A4; // 0x788(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_C6_215; // 0x790(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_C5_213; // 0x798(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_wall_N4; // 0x7a0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Wall_Brick_Decoration_A8; // 0x7a8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Wall_Corner_Cap_A_A3; // 0x7b0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Tower_Top_Architecture_B3; // 0x7b8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_B4_207; // 0x7c0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Wall_Brick_Decoration_A7; // 0x7c8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Wall_Brick_Decoration_A6; // 0x7d0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Wall_Brick_Decoration_A5; // 0x7d8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_C4_202; // 0x7e0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Tower_Top_Architecture_B2_200; // 0x7e8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_wall_N3; // 0x7f0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Wall_Brick_Decoration_A4; // 0x7f8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Wall_Corner_Cap_A_A2; // 0x800(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_wall_N2; // 0x808(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Wall_Corner_Cap_A_A; // 0x810(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_wall_N; // 0x818(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Wall_Brick_Decoration_A3; // 0x820(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Wall_Brick_Decoration_A2_191; // 0x828(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_C3_189; // 0x830(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Debris_C4; // 0x838(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Debris_C3; // 0x840(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Debris_C2; // 0x848(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_Cap_A_a4_184; // 0x850(0x08)
	struct UCameraStackVolumeComponent* CameraStackVolume; // 0x858(0x08)
	struct UBoxComponent* Box1; // 0x860(0x08)
	struct USceneComponent* Ruins; // 0x868(0x08)
	struct USceneComponent* SharedRoot; // 0x870(0x08)

	void ReceiveBeginPlay(); // Function BP_Cluster_B.BP_Cluster_B_C.ReceiveBeginPlay // (Event|Protected|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_BP_Cluster_B(int32_t EntryPoint); // Function BP_Cluster_B.BP_Cluster_B_C.ExecuteUbergraph_BP_Cluster_B // (Final|UbergraphFunction) // @ game+0x38a7480
};

