// BlueprintGeneratedClass BP_CastleRuins1_RuinPiece_D.BP_CastleRuins1_RuinPiece_D_C
// Size: 0x2a8 (Inherited: 0x248)
struct ABP_CastleRuins1_RuinPiece_D_C : AActor {
	struct UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_C6_364; // 0x248(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_C2_362; // 0x250(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_C_360; // 0x258(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Pillar_Variant_A_358; // 0x260(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_A_356; // 0x268(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_C5_354; // 0x270(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Wall_Damaged_A_352; // 0x278(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_C4_350; // 0x280(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_C3_348; // 0x288(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_C2_346; // 0x290(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_C_344; // 0x298(0x08)
	struct USceneComponent* SharedRoot; // 0x2a0(0x08)
};

