// BlueprintGeneratedClass BP_Castle_Ruins_3_011.BP_Castle_Ruins_3_011_C
// Size: 0x298 (Inherited: 0x248)
struct ABP_Castle_Ruins_3_011_C : AActor {
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_B; // 0x248(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_A; // 0x250(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_CastleRuins_3_Broken_B_c; // 0x258(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_3_Broken_B_a; // 0x260(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_CastleRuins_3_Relief_L_b; // 0x268(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_3_Broken_C; // 0x270(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_3_Broken_K; // 0x278(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_CastleRuins_3_Relief_L_a; // 0x280(0x08)
	struct USceneComponent* Scene; // 0x288(0x08)
	struct USceneComponent* SharedRoot; // 0x290(0x08)
};

