// BlueprintGeneratedClass BP_CampA_TentC.BP_CampA_TentC_C
// Size: 0x2c8 (Inherited: 0x248)
struct ABP_CampA_TentC_C : AActor {
	struct FNone* OdcNavMeshVolume5; // 0x248(0x08)
	struct UStaticMeshComponent* SM_COL_CampA_TentC; // 0x250(0x08)
	struct UStaticMeshComponent* SM_CampA_TentC_Roof; // 0x258(0x08)
	struct UStaticMeshComponent* SM_CampA_TentC_Wall; // 0x260(0x08)
	struct UStaticMeshComponent* SM_CampA_Rope_H; // 0x268(0x08)
	struct UStaticMeshComponent* SM_CampA_Rope_F; // 0x270(0x08)
	struct UStaticMeshComponent* SM_CampA_Rope_G; // 0x278(0x08)
	struct UStaticMeshComponent* SM_CampA_Rope_J; // 0x280(0x08)
	struct UStaticMeshComponent* SM_CampA_Rope_E; // 0x288(0x08)
	struct UStaticMeshComponent* SM_CampA_Chimney_C; // 0x290(0x08)
	struct UStaticMeshComponent* SM_CampA_TentC_Beams_Roof; // 0x298(0x08)
	struct UStaticMeshComponent* SM_CampA_TentC_Beams_Wall; // 0x2a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CampA_Rope_I; // 0x2a8(0x08)
	struct UCameraStackVolumeComponent* CameraStackVolume1; // 0x2b0(0x08)
	struct UCapsuleComponent* Capsule; // 0x2b8(0x08)
	struct USceneComponent* SharedRoot; // 0x2c0(0x08)
};

