// BlueprintGeneratedClass BP_CampB_TentB.BP_CampB_TentB_C
// Size: 0x2b8 (Inherited: 0x248)
struct ABP_CampB_TentB_C : AActor {
	struct UStaticMeshComponent* SM_COL_CampB_TentB; // 0x248(0x08)
	struct UStaticMeshComponent* SM_CampB_Chimney_B; // 0x250(0x08)
	struct UStaticMeshComponent* SM_CampB_TentB_Roof; // 0x258(0x08)
	struct UStaticMeshComponent* SM_CampB_TentB_Beams; // 0x260(0x08)
	struct UStaticMeshComponent* SM_CampB_TentB_Wall; // 0x268(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CampB_Rope_H; // 0x270(0x08)
	struct UStaticMeshComponent* SM_CampB_Rope_F; // 0x278(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_8SM_CampB_Rope_C; // 0x280(0x08)
	struct UStaticMeshComponent* SM_CampB_Banner_A; // 0x288(0x08)
	struct UStaticMeshComponent* SM_CampB_Banner_C; // 0x290(0x08)
	struct UStaticMeshComponent* SM_CampB_Rope_G; // 0x298(0x08)
	struct UCameraStackVolumeComponent* CameraStackVolume2; // 0x2a0(0x08)
	struct UCapsuleComponent* Capsule1; // 0x2a8(0x08)
	struct USceneComponent* SharedRoot; // 0x2b0(0x08)
};

