// BlueprintGeneratedClass BP_CavernDungeonBlocker_A.BP_CavernDungeonBlocker_A_C
// Size: 0x288 (Inherited: 0x248)
struct ABP_CavernDungeonBlocker_A_C : AActor {
	struct UStaticMeshComponent* SM_ScreePile_D; // 0x248(0x08)
	struct UChildActorComponent* BP_GM_MagicPickAxe1; // 0x250(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_GobMine_CoalPile_A_LOW; // 0x258(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_OL_CliffRock_B2_2; // 0x260(0x08)
	struct UChildActorComponent* BP_GM_MagicPickAxe; // 0x268(0x08)
	struct UBoxComponent* Box; // 0x270(0x08)
	struct UChildActorComponent* BP_GM_MagicPickAxe2; // 0x278(0x08)
	struct USceneComponent* SharedRoot; // 0x280(0x08)
};

