// BlueprintGeneratedClass BP_Cairn_Pillar_Puzzle_B.BP_Cairn_Pillar_Puzzle_B_C
// Size: 0x4f8 (Inherited: 0x248)
struct ABP_Cairn_Pillar_Puzzle_B_C : AActor {
	struct UStaticMeshComponent* SM_Moss_Lush_Master28; // 0x248(0x08)
	struct UStaticMeshComponent* SM_Moss_Lush_Master27; // 0x250(0x08)
	struct UStaticMeshComponent* SM_BeardMoss_C2; // 0x258(0x08)
	struct UStaticMeshComponent* SM_BeardMoss_C1; // 0x260(0x08)
	struct UStaticMeshComponent* SM_BeardMoss_C; // 0x268(0x08)
	struct UStaticMeshComponent* SM_Moss_Lush_Master26; // 0x270(0x08)
	struct UStaticMeshComponent* SM_Moss_Lush_Master25; // 0x278(0x08)
	struct UStaticMeshComponent* SM_Moss_Lush_Master24; // 0x280(0x08)
	struct UDecalComponent* e2; // 0x288(0x08)
	struct UStaticMeshComponent* ww15; // 0x290(0x08)
	struct UStaticMeshComponent* ww14; // 0x298(0x08)
	struct UDecalComponent* Decal15; // 0x2a0(0x08)
	struct UDecalComponent* Decal14; // 0x2a8(0x08)
	struct UDecalComponent* Decal13; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_Moss_Lush_Master23; // 0x2b8(0x08)
	struct UStaticMeshComponent* w3; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_Moss_Lush_Master22; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_Moss_Lush_Master21; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_Moss_Lush_Master20; // 0x2d8(0x08)
	struct UStaticMeshComponent* ww13; // 0x2e0(0x08)
	struct UStaticMeshComponent* ww12; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_BeardMoss_C_LOD3; // 0x2f0(0x08)
	struct UStaticMeshComponent* Cube4; // 0x2f8(0x08)
	struct UStaticMeshComponent* ww11; // 0x300(0x08)
	struct UStaticMeshComponent* ww10; // 0x308(0x08)
	struct UDecalComponent* Decal12; // 0x310(0x08)
	struct UDecalComponent* Decal11; // 0x318(0x08)
	struct UDecalComponent* Decal10; // 0x320(0x08)
	struct UStaticMeshComponent* SM_Moss_Lush_Master19; // 0x328(0x08)
	struct UStaticMeshComponent* w2; // 0x330(0x08)
	struct UStaticMeshComponent* SM_Moss_Lush_Master18; // 0x338(0x08)
	struct UStaticMeshComponent* SM_Moss_Lush_Master17; // 0x340(0x08)
	struct UStaticMeshComponent* SM_Moss_Lush_Master16; // 0x348(0x08)
	struct UStaticMeshComponent* ww9; // 0x350(0x08)
	struct UStaticMeshComponent* ww8; // 0x358(0x08)
	struct UStaticMeshComponent* SM_BeardMoss_C_LOD2; // 0x360(0x08)
	struct UStaticMeshComponent* Cube3; // 0x368(0x08)
	struct UStaticMeshComponent* ww7; // 0x370(0x08)
	struct UStaticMeshComponent* ww6; // 0x378(0x08)
	struct UDecalComponent* Decal8; // 0x380(0x08)
	struct UDecalComponent* Decal7; // 0x388(0x08)
	struct UDecalComponent* Decal6; // 0x390(0x08)
	struct UStaticMeshComponent* SM_Moss_Lush_Master15; // 0x398(0x08)
	struct UStaticMeshComponent* w1; // 0x3a0(0x08)
	struct UStaticMeshComponent* SM_Moss_Lush_Master14; // 0x3a8(0x08)
	struct UStaticMeshComponent* SM_Moss_Lush_Master13; // 0x3b0(0x08)
	struct UStaticMeshComponent* SM_Moss_Lush_Master12; // 0x3b8(0x08)
	struct UStaticMeshComponent* ww5; // 0x3c0(0x08)
	struct UStaticMeshComponent* ww4; // 0x3c8(0x08)
	struct UStaticMeshComponent* SM_BeardMoss_C_LOD1; // 0x3d0(0x08)
	struct UStaticMeshComponent* Cube2; // 0x3d8(0x08)
	struct UStaticMeshComponent* ww3; // 0x3e0(0x08)
	struct UStaticMeshComponent* ww2; // 0x3e8(0x08)
	struct UDecalComponent* Decal3; // 0x3f0(0x08)
	struct UDecalComponent* Decal2; // 0x3f8(0x08)
	struct UDecalComponent* Decal1; // 0x400(0x08)
	struct UDecalComponent* Decal; // 0x408(0x08)
	struct UStaticMeshComponent* SM_Moss_Lush_Master; // 0x410(0x08)
	struct UStaticMeshComponent* W; // 0x418(0x08)
	struct UStaticMeshComponent* SM_Moss_Lush_Master3; // 0x420(0x08)
	struct UStaticMeshComponent* SM_Moss_Lush_Master2; // 0x428(0x08)
	struct UStaticMeshComponent* SM_Moss_Lush_Master1; // 0x430(0x08)
	struct UStaticMeshComponent* ww1; // 0x438(0x08)
	struct UStaticMeshComponent* ww; // 0x440(0x08)
	struct UStaticMeshComponent* SM_BeardMoss_C_LOD; // 0x448(0x08)
	struct UStaticMeshComponent* Cube1; // 0x450(0x08)
	struct UStaticMeshComponent* SM_Moss_Lush_Master11; // 0x458(0x08)
	struct UStaticMeshComponent* SM_Moss_Lush_Master10; // 0x460(0x08)
	struct UStaticMeshComponent* SM_Moss_Lush_Master9; // 0x468(0x08)
	struct UStaticMeshComponent* SM_Moss_Lush_Master8; // 0x470(0x08)
	struct UStaticMeshComponent* SM_Moss_Lush_Master7; // 0x478(0x08)
	struct UStaticMeshComponent* SM_Moss_Lush_Master6; // 0x480(0x08)
	struct UStaticMeshComponent* SM_Moss_Lush_Master5; // 0x488(0x08)
	struct UStaticMeshComponent* SM_Moss_Lush_Master4; // 0x490(0x08)
	struct UDecalComponent* e1; // 0x498(0x08)
	struct UDecalComponent* E; // 0x4a0(0x08)
	struct UDecalComponent* Decal4; // 0x4a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent04; // 0x4b0(0x08)
	struct UStaticMeshComponent* Cube; // 0x4b8(0x08)
	struct UStaticMeshComponent* SM_Cairn_Platform_A; // 0x4c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent05; // 0x4c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent03; // 0x4d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent02; // 0x4d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent01; // 0x4e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0; // 0x4e8(0x08)
	struct USceneComponent* SharedRoot; // 0x4f0(0x08)
};

