// BlueprintGeneratedClass BP_CastleRuins2_Wall_I.BP_CastleRuins2_Wall_I_C
// Size: 0x308 (Inherited: 0x248)
struct ABP_CastleRuins2_Wall_I_C : AActor {
	struct UDecalComponent* MM_P_Decal_Wetness_drips_1021; // 0x248(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_C_1019; // 0x250(0x08)
	struct UDecalComponent* M_HW_Decal_grunge3_Dark3; // 0x258(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_B_1016; // 0x260(0x08)
	struct UDecalComponent* M_HW_Decal_grunge3_Dark2; // 0x268(0x08)
	struct UDecalComponent* M_HW_Decal_grunge3_Dark; // 0x270(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_A; // 0x278(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_CastleRuins_2_Broken_F_b; // 0x280(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_Broken_E; // 0x288(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_CastleRuins_2_Relief_B_b; // 0x290(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_CastleRuins_2_Relief_B_c; // 0x298(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_CastleRuins_2_Relief_L_a; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_Relief_A1_c; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_Broken_B_a; // 0x2b0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_2_Wall_A; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_Relief_B1_c; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_Relief_B1_b; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_Relief_A_e; // 0x2d0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_CastleRuins_2_Relief_A1_a; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_Relief_A1_b; // 0x2e0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_2_Relief_L_b; // 0x2e8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_2_Relief_A_b; // 0x2f0(0x08)
	struct USceneComponent* Scene; // 0x2f8(0x08)
	struct USceneComponent* SharedRoot; // 0x300(0x08)
};

