// BlueprintGeneratedClass BP_CastleRuins2_SM_Tower_B.BP_CastleRuins2_SM_Tower_B_C
// Size: 0x2a0 (Inherited: 0x248)
struct ABP_CastleRuins2_SM_Tower_B_C : AActor {
	struct UStaticMeshComponent* SM_HS_CastleRoom_Roof_E_COL_StaticMeshComponent0; // 0x248(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_3_Relief_J_b_StaticMeshComponent0; // 0x250(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* SM_CastleRuins_3_Relief_I_a (HISMA)_HierarchicalInstancedStaticMesh; // 0x258(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_3_Door_I_StaticMeshComponent0; // 0x260(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* SM_CastleRuins_3_Bricks_A_p (HISMA)_HierarchicalInstancedStaticMesh; // 0x268(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_3_Bricks_A_b_StaticMeshComponent0; // 0x270(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_TowerDetail_C_StaticMeshComponent0; // 0x278(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_TowerDetail_B_StaticMeshComponent0; // 0x280(0x08)
	struct UStaticMeshComponent* SM_Castle_HS_CastleB_Wall_1_A_StaticMeshComponent0; // 0x288(0x08)
	struct UStaticMeshComponent* SM_Castle_HS_CastleB_Trim_A_StaticMeshComponent0; // 0x290(0x08)
	struct USceneComponent* SharedRoot; // 0x298(0x08)
};

