// BlueprintGeneratedClass BP_CampB_TentC_Broken.BP_CampB_TentC_Broken_C
// Size: 0x2b8 (Inherited: 0x248)
struct ABP_CampB_TentC_Broken_C : AActor {
	struct FNone* OdcNavMeshVolume1; // 0x248(0x08)
	struct FNone* OdcNavMeshVolume; // 0x250(0x08)
	struct UStaticMeshComponent* SM_COL_CampB_TentC_Broken; // 0x258(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_CampB_Rope_H_Broken1; // 0x260(0x08)
	struct UStaticMeshComponent* SM_CampB_Peg_Broken1; // 0x268(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_CampB_Rope_G_Broken1; // 0x270(0x08)
	struct UStaticMeshComponent* SM_CampB_Rope_J_Broken1; // 0x278(0x08)
	struct UStaticMeshComponent* SM_CampB_Rope_F_Broken1; // 0x280(0x08)
	struct UStaticMeshComponent* SM_CampB_TentC_Roof_Broken1; // 0x288(0x08)
	struct UStaticMeshComponent* SM_CampB_Chimney_A_Broken1; // 0x290(0x08)
	struct UStaticMeshComponent* SM_CampB_Wall_Broken1; // 0x298(0x08)
	struct UStaticMeshComponent* SM_CampB_TentC_Entrance_Broken1; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_CampB_TentC_Beams_Broken1; // 0x2a8(0x08)
	struct USceneComponent* SharedRoot; // 0x2b0(0x08)
};

