// BlueprintGeneratedClass BP_CampB_TentD.BP_CampB_TentD_C
// Size: 0x328 (Inherited: 0x248)
struct ABP_CampB_TentD_C : AActor {
	struct UStaticMeshComponent* SM_COL_CampB_TentD1; // 0x248(0x08)
	struct UStaticMeshComponent* SM_CampB_TentD_Beams_Middle; // 0x250(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CampB_TentD_Beams_Left; // 0x258(0x08)
	struct UStaticMeshComponent* SM_CampB_TentD_Wall_Rear; // 0x260(0x08)
	struct UStaticMeshComponent* SM_CampB_TentD_Beams_Entrance; // 0x268(0x08)
	struct UStaticMeshComponent* SM_CampB_TentD_Wall_Right; // 0x270(0x08)
	struct UStaticMeshComponent* SM_CampB_TentD_Roof_Left; // 0x278(0x08)
	struct UStaticMeshComponent* SM_CampB_TentD_Roof_Right; // 0x280(0x08)
	struct UStaticMeshComponent* SM_CampB_TentD_Roof_Middle; // 0x288(0x08)
	struct UStaticMeshComponent* SM_CampB_Chimney_A; // 0x290(0x08)
	struct UStaticMeshComponent* SM_CampB_Chimney_B; // 0x298(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CampB_Banner_B; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_CampB_Banner_D; // 0x2a8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CampB_Banner_A; // 0x2b0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CampB_Banner_C; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_CampB_TentD_Entrance; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_CampB_TentD_Wall_Left; // 0x2c8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CampB_Rope_A; // 0x2d0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_12SM_CampB_Rope_B; // 0x2d8(0x08)
	struct UCameraStackVolumeComponent* CameraStackVolume1; // 0x2e0(0x08)
	struct UBoxComponent* Box2; // 0x2e8(0x08)
	struct UCameraStackVolumeComponent* CameraStackVolume; // 0x2f0(0x08)
	struct UBoxComponent* Box1; // 0x2f8(0x08)
	struct UCameraStackVolumeComponent* CameraStackVolume3; // 0x300(0x08)
	struct UCapsuleComponent* Capsule2; // 0x308(0x08)
	struct UCameraStackVolumeComponent* CameraStackVolume2; // 0x310(0x08)
	struct UCapsuleComponent* Capsule1; // 0x318(0x08)
	struct USceneComponent* SharedRoot; // 0x320(0x08)
};

