// BlueprintGeneratedClass BP_CastleRuins_3_43.BP_CastleRuins_3_42_C
// Size: 0x2a8 (Inherited: 0x248)
struct ABP_CastleRuins_3_42_C : AActor {
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_3_Broken_L_A; // 0x248(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_3_Broken_F; // 0x250(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_CastleRuins_3_Broken_C; // 0x258(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_3_Broken_D_C; // 0x260(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_3_Broken_E; // 0x268(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_CastleRuins_3_TheSteps_B; // 0x270(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_CastleRuins_3_Wall_A_b; // 0x278(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_3_Broken_B_c; // 0x280(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_CastleRuins_3_Broken_M_b; // 0x288(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_3_Relief_K; // 0x290(0x08)
	struct USceneComponent* Scene; // 0x298(0x08)
	struct USceneComponent* SharedRoot; // 0x2a0(0x08)
};

