// BlueprintGeneratedClass BP_Cav_03_DungeonEntrance_Blocked.BP_Cav_03_DungeonEntrance_Blocked_C
// Size: 0x320 (Inherited: 0x248)
struct ABP_Cav_03_DungeonEntrance_Blocked_C : AActor {
	struct UStaticMeshComponent* StaticMeshActor-SM_OL_DangerSign_SkullCross_17_StaticMeshComponent0; // 0x248(0x08)
	struct UStaticMeshComponent* StaticMeshActor-SM_OL_DangerSign_BewareSpiders_7_StaticMeshComponent0; // 0x250(0x08)
	struct UStaticMeshComponent* StaticMeshActor-SM_OL_DangerSign_BewareSpiders_6_StaticMeshComponent0; // 0x258(0x08)
	struct UStaticMeshComponent* StaticMeshActor-SM_CastleDun_TableShort5_StaticMeshComponent0; // 0x260(0x08)
	struct UStaticMeshComponent* StaticMeshActor-SM_CastleDun_Table5_StaticMeshComponent0; // 0x268(0x08)
	struct UStaticMeshComponent* StaticMeshActor-SM_CastleDun_GOB_PotionContainer_C5_StaticMeshComponent0; // 0x270(0x08)
	struct UStaticMeshComponent* StaticMeshActor-SM_CastleDun_GOB_PotionContainer_A5_StaticMeshComponent0; // 0x278(0x08)
	struct UStaticMeshComponent* StaticMeshActor-SM_CampA_CanopyC_broken5_StaticMeshComponent0; // 0x280(0x08)
	struct UStaticMeshComponent* StaticMeshActor-SM_BCProps_Tentpole_A5_StaticMeshComponent0; // 0x288(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Actor-SM_HW_Trash_HomeworkPaperHISMA_250_HierarchicalInstancedStaticMesh; // 0x290(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Actor-SM_HW_LetterCluster_FHISMA_247_HierarchicalInstancedStaticMesh; // 0x298(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Actor-SM_HW_K_HangingHerbs_AHISMA_HierarchicalInstancedStaticMesh; // 0x2a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Actor-SM_HM_PotionBottle12HISMA_245_HierarchicalInstancedStaticMesh; // 0x2a8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Actor-SM_HM_PotionBottle1_EmptyHISMA_252_HierarchicalInstancedStaticMesh; // 0x2b0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Actor-SM_GobMine_Beam_CAP_A_RustHISMA_243_HierarchicalInstancedStaticMesh; // 0x2b8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Actor-SM_FF_Bunting_01CHISMA3_HierarchicalInstancedStaticMesh; // 0x2c0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Actor-SM_CastleDun_WoodenBeam_AHISMA_254_HierarchicalInstancedStaticMesh; // 0x2c8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Actor-SM_CampB_5m_PlankAHISMA_241_HierarchicalInstancedStaticMesh; // 0x2d0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Actor-SM_BCProps_RopeKnot_AHISMA_239_HierarchicalInstancedStaticMesh; // 0x2d8(0x08)
	struct USceneComponent* BP_Cav_MiningLamp_01_C-BP_Cav_MiningLamp_01_SharedRoot; // 0x2e0(0x08)
	struct UStaticMeshComponent* StaticMeshActor-SM_BCProps_FloorCloth_G5_StaticMeshComponent0; // 0x2e8(0x08)
	struct UNiagaraComponent* BP_Cav_MiningLamp_01_C-BP_Cav_MiningLamp_01_Niagara; // 0x2f0(0x08)
	struct UAnimatedLightComponent* BP_Cav_MiningLamp_01_C-BP_Cav_MiningLamp_01_AnimatedLight4; // 0x2f8(0x08)
	struct UStaticMeshComponent* BP_Cav_MiningLamp_01_C-BP_Cav_MiningLamp_01_StaticMeshComponent0; // 0x300(0x08)
	struct UAkComponent* BP_Cav_MiningLamp_01_C-BP_Cav_MiningLamp_01_Ak_BP_Cav_Mining_Lamp_01; // 0x308(0x08)
	struct UPointLightComponent* BP_Cav_MiningLamp_01_C-BP_Cav_MiningLamp_01_LightComponent0; // 0x310(0x08)
	struct USceneComponent* SharedRoot; // 0x318(0x08)
};

