// BlueprintGeneratedClass BP_Cav_03_DungeonEntrance_Open.BP_Cav_03_DungeonEntrance_Open_C
// Size: 0x418 (Inherited: 0x248)
struct ABP_Cav_03_DungeonEntrance_Open_C : AActor {
	struct UStaticMeshComponent* StaticMeshActor-SM_Cav_Dungeon_HangingSpiderSack_2_StaticMeshComponent0; // 0x248(0x08)
	struct UStaticMeshComponent* StaticMeshActor-SM_CastleDun_TableShort4_StaticMeshComponent0; // 0x250(0x08)
	struct UStaticMeshComponent* StaticMeshActor-SM_CastleDun_Table4_StaticMeshComponent0; // 0x258(0x08)
	struct UStaticMeshComponent* StaticMeshActor-SM_CastleDun_GOB_PotionContainer_C4_StaticMeshComponent0; // 0x260(0x08)
	struct UStaticMeshComponent* StaticMeshActor-SM_CastleDun_GOB_PotionContainer_A4_StaticMeshComponent0; // 0x268(0x08)
	struct UStaticMeshComponent* StaticMeshActor-SM_CampB_5m_PlankC2_StaticMeshComponent0; // 0x270(0x08)
	struct UStaticMeshComponent* StaticMeshActor-SM_CampA_CanopyC_broken4_StaticMeshComponent0; // 0x278(0x08)
	struct UStaticMeshComponent* StaticMeshActor-SM_BCProps_Tentpole_A4_StaticMeshComponent0; // 0x280(0x08)
	struct UStaticMeshComponent* StaticMeshActor-SM_BCProps_FloorCloth_G4_StaticMeshComponent0; // 0x288(0x08)
	struct UDecalComponent* DecalActor-M_MC_Decal_Dirt_4_NewDecalComponent; // 0x290(0x08)
	struct UDecalComponent* DecalActor-M_MC_Decal_Dirt_3_NewDecalComponent; // 0x298(0x08)
	struct UDecalComponent* DecalActor-M_Cav_Decal_Spiderweb_58_NewDecalComponent; // 0x2a0(0x08)
	struct UDecalComponent* DecalActor-M_Cav_Decal_Spiderweb_57_NewDecalComponent; // 0x2a8(0x08)
	struct UDecalComponent* DecalActor-M_Cav_Decal_Spiderweb_56_NewDecalComponent; // 0x2b0(0x08)
	struct UDecalComponent* DecalActor-M_Cav_Decal_Spiderweb_55_NewDecalComponent; // 0x2b8(0x08)
	struct UDecalComponent* DecalActor-M_Cav_Decal_Spiderweb_54_NewDecalComponent; // 0x2c0(0x08)
	struct UDecalComponent* DecalActor-M_Cav_Decal_Spiderweb_53_NewDecalComponent; // 0x2c8(0x08)
	struct UDecalComponent* DecalActor-M_Cav_Decal_Spiderweb_52_NewDecalComponent; // 0x2d0(0x08)
	struct UDecalComponent* DecalActor-M_Cav_Decal_Spiderweb_51_NewDecalComponent; // 0x2d8(0x08)
	struct UDecalComponent* DecalActor-M_Cav_Decal_Spiderweb_50_NewDecalComponent; // 0x2e0(0x08)
	struct UDecalComponent* DecalActor-M_Cav_Decal_Spiderweb_49_NewDecalComponent; // 0x2e8(0x08)
	struct UDecalComponent* DecalActor-M_Cav_Decal_Spiderweb_48_NewDecalComponent; // 0x2f0(0x08)
	struct UDecalComponent* DecalActor-M_Cav_Decal_Spiderweb_47_NewDecalComponent; // 0x2f8(0x08)
	struct UDecalComponent* DecalActor-M_Cav_Decal_Spiderweb_46_NewDecalComponent; // 0x300(0x08)
	struct UDecalComponent* DecalActor-M_Cav_Decal_Spiderweb_45_NewDecalComponent; // 0x308(0x08)
	struct UDecalComponent* DecalActor-M_Cav_Decal_Spiderweb_44_NewDecalComponent; // 0x310(0x08)
	struct UDecalComponent* DecalActor-M_Cav_Decal_Spiderweb_43_NewDecalComponent; // 0x318(0x08)
	struct UDecalComponent* DecalActor-M_Cav_Decal_Spiderweb_42_NewDecalComponent; // 0x320(0x08)
	struct UDecalComponent* DecalActor-M_Cav_Decal_Spiderweb_41_NewDecalComponent; // 0x328(0x08)
	struct UDecalComponent* DecalActor-M_Cav_Decal_Spiderweb_40_NewDecalComponent; // 0x330(0x08)
	struct UDecalComponent* DecalActor-M_Cav_Decal_Spiderweb_39_NewDecalComponent; // 0x338(0x08)
	struct UDecalComponent* DecalActor-M_Cav_Decal_Spiderweb_38_NewDecalComponent; // 0x340(0x08)
	struct UDecalComponent* DecalActor-M_Cav_Decal_Spiderweb_37_NewDecalComponent; // 0x348(0x08)
	struct UDecalComponent* DecalActor-M_Cav_Decal_Spiderweb_36_NewDecalComponent; // 0x350(0x08)
	struct UDecalComponent* DecalActor-M_Cav_Decal_Spiderweb_35_NewDecalComponent; // 0x358(0x08)
	struct USceneComponent* BP_Cav_MiningLamp_01_C-BP_Cav_MiningLamp_01_SharedRoot; // 0x360(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Actor-SM_HW_Trash_HomeworkPaperHISMA_HierarchicalInstancedStaticMesh; // 0x368(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Actor-SM_HW_LetterCluster_FHISMA_HierarchicalInstancedStaticMesh; // 0x370(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Actor-SM_HM_PotionBottle12HISMA_HierarchicalInstancedStaticMesh; // 0x378(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Actor-SM_HM_PotionBottle1_EmptyHISMA_HierarchicalInstancedStaticMesh; // 0x380(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Actor-SM_GobMine_Beam_CAP_A_RustHISMA_HierarchicalInstancedStaticMesh; // 0x388(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Actor-SM_CobwebThin_Strands_05HISMA_HierarchicalInstancedStaticMesh; // 0x390(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Actor-SM_Cav_SpiderSpitter_01HISMA_HierarchicalInstancedStaticMesh; // 0x398(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Actor-SM_Cav_HangingBody_01HISMA_HierarchicalInstancedStaticMesh; // 0x3a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Actor-SM_Cav_Dungeon_SpiderHole_02HISMA_HierarchicalInstancedStaticMesh; // 0x3a8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Actor-SM_Cav_Dungeon_SpiderEggsBase_01HISMA_HierarchicalInstancedStaticMesh; // 0x3b0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Actor-SM_CastleDun_WoodenBeam_AHISMA_HierarchicalInstancedStaticMesh; // 0x3b8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Actor-SM_CampB_5m_PlankAHISMA_HierarchicalInstancedStaticMesh; // 0x3c0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Actor-SM_BCProps_RopeKnot_AHISMA_HierarchicalInstancedStaticMesh; // 0x3c8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Actor-GC_CampB_2m_PlankA_Piece_08HISMA_HierarchicalInstancedStaticMesh; // 0x3d0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Actor-GC_CampB_2m_PlankA_Piece_01HISMA_HierarchicalInstancedStaticMesh; // 0x3d8(0x08)
	struct UStaticMeshComponent* StaticMeshActor-SM_CobwebThin_Strands_5_StaticMeshComponent0; // 0x3e0(0x08)
	struct UNiagaraComponent* BP_Cav_MiningLamp_01_C-BP_Cav_MiningLamp_01_Niagara; // 0x3e8(0x08)
	struct UAnimatedLightComponent* BP_Cav_MiningLamp_01_C-BP_Cav_MiningLamp_01_AnimatedLight4; // 0x3f0(0x08)
	struct UStaticMeshComponent* BP_Cav_MiningLamp_01_C-BP_Cav_MiningLamp_01_StaticMeshComponent0; // 0x3f8(0x08)
	struct UAkComponent* BP_Cav_MiningLamp_01_C-BP_Cav_MiningLamp_01_Ak_BP_Cav_Mining_Lamp_01; // 0x400(0x08)
	struct UPointLightComponent* BP_Cav_MiningLamp_01_C-BP_Cav_MiningLamp_01_LightComponent0; // 0x408(0x08)
	struct USceneComponent* SharedRoot; // 0x410(0x08)
};

