// BlueprintGeneratedClass BP_CastleRuins_2_Tower_J.BP_CastleRuins_2_Tower_J_C
// Size: 0x2b0 (Inherited: 0x248)
struct ABP_CastleRuins_2_Tower_J_C : AActor {
	struct UDecalComponent* MM_P_Decal_Wetness_drips5_471; // 0x248(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_E2; // 0x250(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_G2_468; // 0x258(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_G_466; // 0x260(0x08)
	struct UDecalComponent* MM_P_Decal_Wetness_drips4_464; // 0x268(0x08)
	struct UDecalComponent* MM_P_Decal_Wetness_drips3_462; // 0x270(0x08)
	struct UDecalComponent* MM_P_Decal_Wetness_drips2_460; // 0x278(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_E; // 0x280(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_Broken_B_b; // 0x288(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_Broken_H; // 0x290(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_2_MainPillars_D_a; // 0x298(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_2_MainPillars_D_b; // 0x2a0(0x08)
	struct USceneComponent* SharedRoot; // 0x2a8(0x08)
};

