// BlueprintGeneratedClass BP_Cav_Ivy_01.BP_Cav_Ivy_01_C
// Size: 0x290 (Inherited: 0x248)
struct ABP_Cav_Ivy_01_C : AActor {
	struct UStaticMeshComponent* SM_Ivy_Kit_K1; // 0x248(0x08)
	struct UStaticMeshComponent* SM_BCProps_Ivy_Wall_Hanging_A; // 0x250(0x08)
	struct UStaticMeshComponent* SM_Ivy_Kit_K; // 0x258(0x08)
	struct UStaticMeshComponent* SM_BCProps_Ivy_Wall_Single_E; // 0x260(0x08)
	struct UStaticMeshComponent* SM_BCProps_Ivy_Wall_Single_C; // 0x268(0x08)
	struct UStaticMeshComponent* SM_Ivy_Kit_N; // 0x270(0x08)
	struct UStaticMeshComponent* SM_Ivy_Kit_O1; // 0x278(0x08)
	struct UStaticMeshComponent* SM_Ivy_Kit_O; // 0x280(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x288(0x08)
};

