// BlueprintGeneratedClass BP_CampB_TentE.BP_CampB_TentE_C
// Size: 0x320 (Inherited: 0x248)
struct ABP_CampB_TentE_C : AActor {
	struct FNone* OdcNavMeshVolume; // 0x248(0x08)
	struct UStaticMeshComponent* SM_COL_CampB_TentE; // 0x250(0x08)
	struct UStaticMeshComponent* SM_CampB_TentE_Beams_Entrance; // 0x258(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_36SM_CampB_Rope_A; // 0x260(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CampB_TentE_Wall_Left; // 0x268(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CampB_Banner_C; // 0x270(0x08)
	struct UStaticMeshComponent* SM_CampB_TentE_Wall_Rear; // 0x278(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CampB_Banner_A; // 0x280(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_CampB_Banner_D; // 0x288(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_CampB_Banner_B; // 0x290(0x08)
	struct UStaticMeshComponent* SM_CampB_TentE_Roof_Middle; // 0x298(0x08)
	struct UStaticMeshComponent* SM_CampB_TentE_Entrance; // 0x2a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CampB_TentE_Roof_Left; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_CampB_Chimney_C; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_CampB_Chimney_D; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_CampB_TentE_Beams_Middle; // 0x2c0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CampB_TentE_Beams_Left; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_CampB_TentE_Wall_Front; // 0x2d0(0x08)
	struct UCameraStackVolumeComponent* CameraStackVolume4; // 0x2d8(0x08)
	struct UBoxComponent* Box3; // 0x2e0(0x08)
	struct UCameraStackVolumeComponent* CameraStackVolume1; // 0x2e8(0x08)
	struct UBoxComponent* Box2; // 0x2f0(0x08)
	struct UCameraStackVolumeComponent* CameraStackVolume3; // 0x2f8(0x08)
	struct UCapsuleComponent* Capsule2; // 0x300(0x08)
	struct UCameraStackVolumeComponent* CameraStackVolume2; // 0x308(0x08)
	struct UCapsuleComponent* Capsule1; // 0x310(0x08)
	struct USceneComponent* SharedRoot; // 0x318(0x08)
};

