// BlueprintGeneratedClass BP_CastleRuins1_Wall_G.BP_CastleRuins1_Wall_G_C
// Size: 0x2e0 (Inherited: 0x248)
struct ABP_CastleRuins1_Wall_G_C : AActor {
	struct UDecalComponent* MI_Castle_Ruin1_WhiteLichen2_154; // 0x248(0x08)
	struct UDecalComponent* MI_Castle_Ruin1_Wetness_drips_152; // 0x250(0x08)
	struct UDecalComponent* MI_Castle_Ruin1_WhiteLichen1_150; // 0x258(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_C_254; // 0x260(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Wall_Damaged_A1; // 0x268(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_C3_251; // 0x270(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_C2_249; // 0x278(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_C_247; // 0x280(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_E_245; // 0x288(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_wall_M1; // 0x290(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_Cap_B_242; // 0x298(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_wall_M_03; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Wall_Brick_Decoration_A_239; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Arch_Pillar_B_237; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Arch_Pillar_A_235; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_Cap_A_b_233; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Arch_Doorway_A_231; // 0x2c8(0x08)
	struct USceneComponent* Scene; // 0x2d0(0x08)
	struct USceneComponent* SharedRoot; // 0x2d8(0x08)
};

