// BlueprintGeneratedClass BP_Crates_D.BP_Crates_D_C
// Size: 0x2d8 (Inherited: 0x248)
struct ABP_Crates_D_C : AActor {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x248(0x08)
	struct UStaticMeshComponent* StaticMeshComponent10; // 0x250(0x08)
	struct UStaticMeshComponent* StaticMeshComponent9; // 0x258(0x08)
	struct UStaticMeshComponent* StaticMeshComponent6; // 0x260(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse4; // 0x268(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse3; // 0x270(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse2; // 0x278(0x08)
	struct UStaticMeshComponent* StaticMeshComponent12; // 0x280(0x08)
	struct UStaticMeshComponent* StaticMeshComponent11; // 0x288(0x08)
	struct UStaticMeshComponent* StaticMeshComponent8; // 0x290(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0; // 0x298(0x08)
	struct UStaticMeshComponent* StaticMeshComponent5; // 0x2a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent4; // 0x2a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent3; // 0x2b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent7; // 0x2b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent2; // 0x2c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent1; // 0x2c8(0x08)
	struct USceneComponent* SharedRoot; // 0x2d0(0x08)

	void ExecuteUbergraph_BP_Crates_D(int32_t EntryPoint); // Function BP_Crates_D.BP_Crates_D_C.ExecuteUbergraph_BP_Crates_D // (Final|UbergraphFunction) // @ game+0x38a7480
};

