// BlueprintGeneratedClass BP_CastleRuins_3_Floor_Radial.BP_CastleRuins_3_Floor_Radial_C
// Size: 0x2a0 (Inherited: 0x248)
struct ABP_CastleRuins_3_Floor_Radial_C : AActor {
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_CastleRuins_3_Bricks_A_a; // 0x248(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_3_Bricks_A_c; // 0x250(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_3_Bricks_A_p; // 0x258(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_3_Bricks_A_b; // 0x260(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_CastleRuins_3_Bricks_A_f; // 0x268(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_9SM_CastleRuins_3_Bricks_A_h; // 0x270(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_9SM_CastleRuins_3_Bricks_A_g; // 0x278(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_CastleRuins_3_Bricks_A_m; // 0x280(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_CastleRuins_3_Bricks_A_e; // 0x288(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_7SM_CastleRuins_3_Bricks_A_d; // 0x290(0x08)
	struct USceneComponent* SharedRoot; // 0x298(0x08)
};

