// BlueprintGeneratedClass BP_CampA_TentA.BP_CampA_TentA_C
// Size: 0x2a8 (Inherited: 0x248)
struct ABP_CampA_TentA_C : AActor {
	struct UStaticMeshComponent* SM_COL_CampA_TentA; // 0x248(0x08)
	struct UStaticMeshComponent* SM_CampA_TentA_Wall; // 0x250(0x08)
	struct UStaticMeshComponent* SM_CampA_Rope_C; // 0x258(0x08)
	struct UStaticMeshComponent* SM_CampA_Rope_A; // 0x260(0x08)
	struct UStaticMeshComponent* SM_CampA_TentA_Roof; // 0x268(0x08)
	struct UStaticMeshComponent* SM_CampA_Chimney_A; // 0x270(0x08)
	struct UStaticMeshComponent* SM_CampA_TentA_Beams_Wall; // 0x278(0x08)
	struct UStaticMeshComponent* SM_CampA_TentA_Beams_Roof; // 0x280(0x08)
	struct UStaticMeshComponent* SM_CampA_Rope_B; // 0x288(0x08)
	struct UCameraStackVolumeComponent* CameraStackVolume1; // 0x290(0x08)
	struct UCapsuleComponent* Capsule; // 0x298(0x08)
	struct USceneComponent* SharedRoot; // 0x2a0(0x08)
};

