// BlueprintGeneratedClass BP_CastleRuins_2_Column_A.BP_CastleRuins_2_Column_A_C
// Size: 0x2c8 (Inherited: 0x248)
struct ABP_CastleRuins_2_Column_A_C : AActor {
	struct UDecalComponent* MM_P_Decal_Wetness_drips3; // 0x248(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_B; // 0x250(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_C; // 0x258(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_G3; // 0x260(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_G2; // 0x268(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_G; // 0x270(0x08)
	struct UDecalComponent* MM_P_Decal_Wetness_drips2; // 0x278(0x08)
	struct UDecalComponent* MM_P_Decal_Wetness_drips; // 0x280(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_CastleRuins_2_Bricks_A_l; // 0x288(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_10SM_CastleRuins_2_Bricks_A_o; // 0x290(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_SquarePillars_A_bb; // 0x298(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_2_Bricks_A_n; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_SquarePillars_A_aa; // 0x2a8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_CastleRuins_2_Bricks_A_f; // 0x2b0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_CastleRuins_2_Bricks_A_a; // 0x2b8(0x08)
	struct USceneComponent* SharedRoot; // 0x2c0(0x08)
};

