// BlueprintGeneratedClass BP_Cairn_BonePile_B_51.BP_Cairn_BonePile_B_50_C
// Size: 0x3e8 (Inherited: 0x248)
struct ABP_Cairn_BonePile_B_50_C : AActor {
	struct USkeletalMeshComponentBudgeted* SkeletalMeshComponentBudgeted; // 0x248(0x08)
	struct UStaticMeshComponent* StaticMesh1; // 0x250(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x258(0x08)
	struct UStaticMeshComponent* SM_Cairn_Bone_Spine_A; // 0x260(0x08)
	struct UStaticMeshComponent* StaticMeshComponent046; // 0x268(0x08)
	struct UStaticMeshComponent* StaticMeshComponent045; // 0x270(0x08)
	struct UStaticMeshComponent* StaticMeshComponent044; // 0x278(0x08)
	struct UStaticMeshComponent* StaticMeshComponent043; // 0x280(0x08)
	struct UStaticMeshComponent* StaticMeshComponent042; // 0x288(0x08)
	struct UStaticMeshComponent* StaticMeshComponent041; // 0x290(0x08)
	struct UStaticMeshComponent* StaticMeshComponent040; // 0x298(0x08)
	struct UStaticMeshComponent* StaticMeshComponent039; // 0x2a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent038; // 0x2a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent037; // 0x2b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent036; // 0x2b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent035; // 0x2c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent034; // 0x2c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent033; // 0x2d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent032; // 0x2d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent031; // 0x2e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent030; // 0x2e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent029; // 0x2f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent028; // 0x2f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent027; // 0x300(0x08)
	struct UStaticMeshComponent* StaticMeshComponent026; // 0x308(0x08)
	struct UStaticMeshComponent* StaticMeshComponent025; // 0x310(0x08)
	struct UStaticMeshComponent* StaticMeshComponent024; // 0x318(0x08)
	struct UStaticMeshComponent* StaticMeshComponent023; // 0x320(0x08)
	struct UStaticMeshComponent* StaticMeshComponent022; // 0x328(0x08)
	struct UStaticMeshComponent* StaticMeshComponent021; // 0x330(0x08)
	struct UStaticMeshComponent* StaticMeshComponent020; // 0x338(0x08)
	struct UStaticMeshComponent* StaticMeshComponent019; // 0x340(0x08)
	struct UStaticMeshComponent* StaticMeshComponent018; // 0x348(0x08)
	struct UStaticMeshComponent* StaticMeshComponent017; // 0x350(0x08)
	struct UStaticMeshComponent* StaticMeshComponent016; // 0x358(0x08)
	struct UStaticMeshComponent* StaticMeshComponent015; // 0x360(0x08)
	struct UStaticMeshComponent* StaticMeshComponent014; // 0x368(0x08)
	struct UStaticMeshComponent* StaticMeshComponent013; // 0x370(0x08)
	struct UStaticMeshComponent* StaticMeshComponent012; // 0x378(0x08)
	struct UStaticMeshComponent* StaticMeshComponent011; // 0x380(0x08)
	struct UStaticMeshComponent* StaticMeshComponent010; // 0x388(0x08)
	struct UStaticMeshComponent* StaticMeshComponent09; // 0x390(0x08)
	struct UStaticMeshComponent* StaticMeshComponent08; // 0x398(0x08)
	struct UStaticMeshComponent* StaticMeshComponent07; // 0x3a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent06; // 0x3a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent05; // 0x3b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent04; // 0x3b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent03; // 0x3c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent02; // 0x3c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent01; // 0x3d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0; // 0x3d8(0x08)
	struct USceneComponent* SharedRoot; // 0x3e0(0x08)
};

