// BlueprintGeneratedClass BP_CastleRuins_2_Tower_E.BP_CastleRuins_2_Tower_E_C
// Size: 0x2d0 (Inherited: 0x248)
struct ABP_CastleRuins_2_Tower_E_C : AActor {
	struct UDecalComponent* MM_P_Decal_Wetness_drips6_397; // 0x248(0x08)
	struct UDecalComponent* MM_P_Decal_Wetness_drips5_395; // 0x250(0x08)
	struct UDecalComponent* MM_P_Decal_Wetness_drips4_393; // 0x258(0x08)
	struct UDecalComponent* MM_P_Decal_Wetness_drips3_391; // 0x260(0x08)
	struct UDecalComponent* MM_P_Decal_Wetness_drips2_389; // 0x268(0x08)
	struct UDecalComponent* MM_P_Decal_Wetness_drips_387; // 0x270(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_G2_385; // 0x278(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_G_383; // 0x280(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_MainPillars_C_c; // 0x288(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_2_MainPillars_C_f; // 0x290(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_2_MainPillars_C_g; // 0x298(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_2_MainPillars_C_h; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_MainPillars_C_j; // 0x2a8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_CastleRuins_2_Relief_L_a; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_MainPillars_C_a; // 0x2b8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_10SM_CastleRuins_2_Relief_L_b; // 0x2c0(0x08)
	struct USceneComponent* SharedRoot; // 0x2c8(0x08)
};

