// BlueprintGeneratedClass BP_Castle_Ruins_3_026.BP_Castle_Ruins_3_026_C
// Size: 0x2d8 (Inherited: 0x248)
struct ABP_Castle_Ruins_3_026_C : AActor {
	struct UStaticMeshComponent* SM_MERGED_SM_CastleRuins_3_Relief_L_StaticMeshComponent0; // 0x248(0x08)
	struct UStaticMeshComponent* SM_MERGED_SM_CastleRuins_3_Broken_M_StaticMeshComponent0; // 0x250(0x08)
	struct UStaticMeshComponent* SM_MERGED_SM_CastleRuins_2_Relief_F_StaticMeshComponent0; // 0x258(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_3_Wall_H_Merged_A_1_StaticMeshComponent0; // 0x260(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_3_Wall_Corner_Cap_Merge_A_1_StaticMeshComponent0; // 0x268(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_3_Relief_D_1_StaticMeshComponent0; // 0x270(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_3_Relief_C_1_StaticMeshComponent0; // 0x278(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_3_Door_B (HISMA)_1_StaticMeshComponent0; // 0x280(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_3_Door_B (HISMA)_0_StaticMeshComponent0; // 0x288(0x08)
	struct UDecalComponent* MI_Castle_Ruin1_Decal_SootSmudge_5_NewDecalComponent1; // 0x290(0x08)
	struct UDecalComponent* MI_Castle_Ruin1_Decal_SootSmudge_5_NewDecalComponent; // 0x298(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_G_NewDecalComponent3; // 0x2a0(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_G_NewDecalComponent2; // 0x2a8(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_G_NewDecalComponent1; // 0x2b0(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_G_NewDecalComponent; // 0x2b8(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_C_NewDecalComponent; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_SM_CastleRuins_2_Relief_Merged_A_1_StaticMeshComponent0; // 0x2c8(0x08)
	struct USceneComponent* SharedRoot; // 0x2d0(0x08)
};

