// BlueprintGeneratedClass BP_Crates_F.BP_Crates_F_C
// Size: 0x2a8 (Inherited: 0x248)
struct ABP_Crates_F_C : AActor {
	struct UStaticMeshComponent* StaticMesh7; // 0x248(0x08)
	struct UStaticMeshComponent* StaticMesh4; // 0x250(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse3; // 0x258(0x08)
	struct UStaticMeshComponent* StaticMesh5; // 0x260(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse2; // 0x268(0x08)
	struct UStaticMeshComponent* StaticMesh6; // 0x270(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse1; // 0x278(0x08)
	struct UStaticMeshComponent* StaticMesh3; // 0x280(0x08)
	struct UStaticMeshComponent* StaticMesh2; // 0x288(0x08)
	struct UStaticMeshComponent* StaticMesh1; // 0x290(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x298(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x2a0(0x08)
};

