// BlueprintGeneratedClass BP_CampB_5x_8m_TowerC.BP_CampB_5x_8m_TowerC_C
// Size: 0x290 (Inherited: 0x248)
struct ABP_CampB_5x_8m_TowerC_C : AActor {
	struct UStaticMeshComponent* SM_CampB_5x_Frame2; // 0x248(0x08)
	struct UStaticMeshComponent* SM_CampB_5x_2m_BaseF1; // 0x250(0x08)
	struct UStaticMeshComponent* SM_CampB_5x_2m_BaseF; // 0x258(0x08)
	struct UStaticMeshComponent* SM_CampB_5x_4m_BaseB1; // 0x260(0x08)
	struct UStaticMeshComponent* SM_CampB_5x_Frame1; // 0x268(0x08)
	struct UStaticMeshComponent* SM_CampB_5x_Frame; // 0x270(0x08)
	struct UStaticMeshComponent* SM_CampB_5x_2m_PlatformA_4; // 0x278(0x08)
	struct UStaticMeshComponent* SM_CampB_5x_4m_BaseB; // 0x280(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x288(0x08)
};

