// BlueprintGeneratedClass BP_CampA_TentDome_B.BP_CampA_TentDome_B_C
// Size: 0x288 (Inherited: 0x248)
struct ABP_CampA_TentDome_B_C : AActor {
	struct UStaticMeshComponent* SM_COL_CampA_TentDome_B; // 0x248(0x08)
	struct UStaticMeshComponent* SM_CampA_TentDome_B_Beams; // 0x250(0x08)
	struct UStaticMeshComponent* SM_CampA_TentDome_B_Roof1; // 0x258(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_19SM_CampA_Rope_Y; // 0x260(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_17SM_CampA_Rope_X; // 0x268(0x08)
	struct UCameraStackVolumeComponent* CameraStackVolume; // 0x270(0x08)
	struct UBoxComponent* Box1; // 0x278(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x280(0x08)
};

