// BlueprintGeneratedClass BP_CastleRuins_1_Wall_K.BP_CastleRuins_1_Wall_K_C
// Size: 0x2e0 (Inherited: 0x248)
struct ABP_CastleRuins_1_Wall_K_C : AActor {
	struct UDecalComponent* MI_Castle_Ruin1_Decal_SootSmudge_85; // 0x248(0x08)
	struct UDecalComponent* MI_Castle_Ruin1_Wetness_drips_83; // 0x250(0x08)
	struct UDecalComponent* MI_Castle_Ruin1_Wetness_drips_81; // 0x258(0x08)
	struct UDecalComponent* MI_Castle_Ruin1_Wetness_drips_79; // 0x260(0x08)
	struct UDecalComponent* MI_Castle_Ruin1_Wetness_drips_77; // 0x268(0x08)
	struct UDecalComponent* MI_Castle_Ruin1_Wetness_drips_75; // 0x270(0x08)
	struct UDecalComponent* MI_Castle_Ruin1_Wetness_drips_73; // 0x278(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Wall_Corner_Decoration_A1; // 0x280(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_1_wall_A1; // 0x288(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_CastleRuins_1_Broken_End_Cap_A_b1; // 0x290(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_C1; // 0x298(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_9SM_CastleRuins_1_Top_Trim_Cap_B1; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_D1; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Wall_Roof_Beam_A_a1; // 0x2b0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_1_wall_K; // 0x2b8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_CastleRuins_1_Broken_End_Cap_A_a1; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Arch_Doorway_C1; // 0x2c8(0x08)
	struct USceneComponent* Scene; // 0x2d0(0x08)
	struct USceneComponent* SharedRoot; // 0x2d8(0x08)
};

