// BlueprintGeneratedClass BP_CampB_TentC.BP_CampB_TentC_C
// Size: 0x2c8 (Inherited: 0x248)
struct ABP_CampB_TentC_C : AActor {
	struct UStaticMeshComponent* SM_COL_CampB_TentC; // 0x248(0x08)
	struct UStaticMeshComponent* SM_CampB_TentC_Wall; // 0x250(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CampB_Banner_B; // 0x258(0x08)
	struct UStaticMeshComponent* SM_CampB_Chimney_D; // 0x260(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CampB_Banner_D; // 0x268(0x08)
	struct UStaticMeshComponent* SM_CampB_Banner_A; // 0x270(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_22SM_CampB_Rope_A; // 0x278(0x08)
	struct UStaticMeshComponent* SM_CampB_TentC_Entrance; // 0x280(0x08)
	struct UStaticMeshComponent* SM_CampB_TentC_Roof; // 0x288(0x08)
	struct UStaticMeshComponent* SM_CampB_TentC_Beams; // 0x290(0x08)
	struct UStaticMeshComponent* SM_CampB_Banner_C; // 0x298(0x08)
	struct UCameraStackVolumeComponent* CameraStackVolume; // 0x2a0(0x08)
	struct UBoxComponent* Box1; // 0x2a8(0x08)
	struct UCameraStackVolumeComponent* CameraStackVolume2; // 0x2b0(0x08)
	struct UCapsuleComponent* Capsule1; // 0x2b8(0x08)
	struct USceneComponent* SharedRoot; // 0x2c0(0x08)
};

