// BlueprintGeneratedClass BP_Cav_SpiderEggPile_02.BP_Cav_SpiderEggPile_02_C
// Size: 0x2a0 (Inherited: 0x248)
struct ABP_Cav_SpiderEggPile_02_C : AActor {
	struct UStaticMeshComponent* SM_Cav_Dungeon_SpiderEgg_01; // 0x248(0x08)
	struct UStaticMeshComponent* SM_Cav_Dungeon_SpiderEgg_010; // 0x250(0x08)
	struct UStaticMeshComponent* SM_Cav_Dungeon_SpiderEgg_09; // 0x258(0x08)
	struct UStaticMeshComponent* SM_Cav_Dungeon_SpiderEgg_08; // 0x260(0x08)
	struct UStaticMeshComponent* SM_Cav_Dungeon_SpiderEgg_07; // 0x268(0x08)
	struct UStaticMeshComponent* SM_Cav_Dungeon_SpiderEgg_06; // 0x270(0x08)
	struct UStaticMeshComponent* SM_Cav_Dungeon_SpiderEgg_05; // 0x278(0x08)
	struct UStaticMeshComponent* SM_Cav_Dungeon_SpiderEgg_04; // 0x280(0x08)
	struct UStaticMeshComponent* SM_Cav_Dungeon_SpiderEgg_03; // 0x288(0x08)
	struct UStaticMeshComponent* SM_Cav_Dungeon_SpiderEgg_02; // 0x290(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x298(0x08)
};

