// BlueprintGeneratedClass BP_CampB_TentA_Broken.BP_CampB_TentA_Broken_C
// Size: 0x298 (Inherited: 0x248)
struct ABP_CampB_TentA_Broken_C : AActor {
	struct UStaticMeshComponent* SM_COL_CampB_TentA_Broken; // 0x248(0x08)
	struct UStaticMeshComponent* SM_CampB_TentA_Wall_Broken; // 0x250(0x08)
	struct UStaticMeshComponent* SM_CampB_TentA_Beams_Broken; // 0x258(0x08)
	struct UStaticMeshComponent* SM_CampB_Rope_I_Broken; // 0x260(0x08)
	struct UStaticMeshComponent* SM_CampB_TentA_Roof_Broken; // 0x268(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_CampB_Rope_B_Broken; // 0x270(0x08)
	struct UStaticMeshComponent* SM_CampB_Banner_C; // 0x278(0x08)
	struct UStaticMeshComponent* SM_CampB_Banner_B; // 0x280(0x08)
	struct UStaticMeshComponent* SM_CampB_Banner_D; // 0x288(0x08)
	struct USceneComponent* SharedRoot; // 0x290(0x08)
};

