// BlueprintGeneratedClass BP_CampB_TentF.BP_CampB_TentF_C
// Size: 0x348 (Inherited: 0x248)
struct ABP_CampB_TentF_C : AActor {
	struct UStaticMeshComponent* SM_COL_CampB_TentF; // 0x248(0x08)
	struct UStaticMeshComponent* SM_CampB_TentF_Entrance; // 0x250(0x08)
	struct UStaticMeshComponent* SM_CampB_TentF_Wall_Left_Mirrored; // 0x258(0x08)
	struct UStaticMeshComponent* SM_CampB_TentF_Roof_Left_Mirrored; // 0x260(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_CampB_Banner_A; // 0x268(0x08)
	struct UStaticMeshComponent* SM_CampB_TentF_Wall_Rear; // 0x270(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CampB_Banner_D; // 0x278(0x08)
	struct UStaticMeshComponent* SM_CampB_TentF_Roof_Middle; // 0x280(0x08)
	struct UStaticMeshComponent* SM_CampB_TentF_Wall_Left; // 0x288(0x08)
	struct UStaticMeshComponent* SM_CampB_TentF_Roof_Left; // 0x290(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CampB_Decal_A; // 0x298(0x08)
	struct UStaticMeshComponent* SM_CampB_Decal_C; // 0x2a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CampB_Banner_C; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_CampB_Chimney_B; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_CampB_TentF_Beams_Left; // 0x2b8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CampB_Banner_B; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_CampB_Rope_I; // 0x2c8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_12SM_CampB_Rope_C; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_CampB_Chimney_A; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_CampB_TentF_Beams_Middle; // 0x2e0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_CampB_Rope_A; // 0x2e8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_CampB_Rope_J; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_CampB_TentF_Beams_Left_Mirrored; // 0x2f8(0x08)
	struct UCameraStackVolumeComponent* CameraStackVolume4; // 0x300(0x08)
	struct UBoxComponent* Box3; // 0x308(0x08)
	struct UCameraStackVolumeComponent* CameraStackVolume1; // 0x310(0x08)
	struct UBoxComponent* Box2; // 0x318(0x08)
	struct UCameraStackVolumeComponent* CameraStackVolume3; // 0x320(0x08)
	struct UCapsuleComponent* Capsule2; // 0x328(0x08)
	struct UCameraStackVolumeComponent* CameraStackVolume2; // 0x330(0x08)
	struct UCapsuleComponent* Capsule1; // 0x338(0x08)
	struct USceneComponent* SharedRoot; // 0x340(0x08)
};

