// BlueprintGeneratedClass BP_CampA_TentD.BP_CampA_TentD_C
// Size: 0x330 (Inherited: 0x248)
struct ABP_CampA_TentD_C : AActor {
	struct FNone* OdcNavMeshVolume; // 0x248(0x08)
	struct UStaticMeshComponent* SM_COL_CampA_TentD; // 0x250(0x08)
	struct UStaticMeshComponent* SM_CampA_TentD_Roof_Left1; // 0x258(0x08)
	struct UStaticMeshComponent* SM_CampA_TentD_Wall_Left2; // 0x260(0x08)
	struct UStaticMeshComponent* SM_CampA_TentD_Rags_Left1; // 0x268(0x08)
	struct UStaticMeshComponent* SM_CampA_TentD_Beams_Left2; // 0x270(0x08)
	struct UStaticMeshComponent* SM_CampA_TentD_Roof_Left; // 0x278(0x08)
	struct UStaticMeshComponent* SM_CampA_TentD_Roof_Middle; // 0x280(0x08)
	struct UStaticMeshComponent* SM_CampA_TentD_Wall_Front; // 0x288(0x08)
	struct UStaticMeshComponent* SM_CampA_TentD_Rags_Left; // 0x290(0x08)
	struct UStaticMeshComponent* SM_CampA_TentD_Wall_Left; // 0x298(0x08)
	struct UStaticMeshComponent* SM_CampA_Rope_N; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_CampA_Rope_M; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_CampA_Chimney_D; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_CampA_Chimney_E; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_CampA_Rope_K; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_CampA_Rope_L; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_CampA_TentD_Beams_Middle; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_CampA_TentD_Beams_Left; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_CampA_TentD_Wall_Rear; // 0x2e0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_CampA_Rope_D; // 0x2e8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CampA_Peg; // 0x2f0(0x08)
	struct UCameraStackVolumeComponent* CameraStackVolume; // 0x2f8(0x08)
	struct UBoxComponent* Box1; // 0x300(0x08)
	struct UCameraStackVolumeComponent* CameraStackVolume2; // 0x308(0x08)
	struct UCapsuleComponent* Capsule1; // 0x310(0x08)
	struct UCameraStackVolumeComponent* CameraStackVolume1; // 0x318(0x08)
	struct UCapsuleComponent* Capsule; // 0x320(0x08)
	struct USceneComponent* SharedRoot; // 0x328(0x08)
};

