// BlueprintGeneratedClass BP_CampA_TentD_Broken.BP_CampA_TentD_Broken_C
// Size: 0x318 (Inherited: 0x248)
struct ABP_CampA_TentD_Broken_C : AActor {
	struct UStaticMeshComponent* SM_COL_CampA_TentD_Broken; // 0x248(0x08)
	struct UStaticMeshComponent* SM_CampA_TentD_Roof_Middle_Broken; // 0x250(0x08)
	struct UStaticMeshComponent* SM_CampA_Chimney_C_Broken; // 0x258(0x08)
	struct UStaticMeshComponent* SM_CampA_TentD_Beams_Right_Broken; // 0x260(0x08)
	struct UStaticMeshComponent* SM_CampA_TentD_Wall_Front_Broken; // 0x268(0x08)
	struct UStaticMeshComponent* SM_CampA_Rope_H_Broken; // 0x270(0x08)
	struct UStaticMeshComponent* SM_CampA_TentD_Beams_Middle_Broken; // 0x278(0x08)
	struct UStaticMeshComponent* SM_CampA_Rope_G_Broken; // 0x280(0x08)
	struct UStaticMeshComponent* SM_CampA_TentD_Rag_A_Broken; // 0x288(0x08)
	struct UStaticMeshComponent* SM_CampA_TentD_Roof_Left_Broken; // 0x290(0x08)
	struct UStaticMeshComponent* SM_CampA_Rope_I_Broken; // 0x298(0x08)
	struct UStaticMeshComponent* SM_CampA_TentD_Wall_Rear_Broken; // 0x2a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CampA_Rope_D_Broken; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_CampA_TentD_Rag_C_Broken; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_CampA_TentD_Beams_Left_Broken; // 0x2b8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CampA_Rope_E; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_CampA_Chimney_E; // 0x2c8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_CampA_Peg; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_CampA_TentD_Rag_B_Broken; // 0x2d8(0x08)
	struct UCameraStackVolumeComponent* CameraStackVolume; // 0x2e0(0x08)
	struct UBoxComponent* Box1; // 0x2e8(0x08)
	struct UCameraStackVolumeComponent* CameraStackVolume2; // 0x2f0(0x08)
	struct UCapsuleComponent* Capsule1; // 0x2f8(0x08)
	struct UCameraStackVolumeComponent* CameraStackVolume1; // 0x300(0x08)
	struct UCapsuleComponent* Capsule; // 0x308(0x08)
	struct USceneComponent* SharedRoot; // 0x310(0x08)
};

