// BlueprintGeneratedClass BP_CastleRuin1_TopBroken_B.BP_CastleRuin1_TopBroken_B_C
// Size: 0x288 (Inherited: 0x248)
struct ABP_CastleRuin1_TopBroken_B_C : AActor {
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_1_Wall_Corner_Cap_A_B1; // 0x248(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_CastleRuins_1_Top_Trim_Cap_C1; // 0x250(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_TopBroken_C1; // 0x258(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_8SM_CastleRuins_1_Broken_End_cap_C1; // 0x260(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_1_Broken_End_cap_D1; // 0x268(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_TopBroken_wall_A1; // 0x270(0x08)
	struct USceneComponent* SharedRoot; // 0x278(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x280(0x08)
};

