// BlueprintGeneratedClass BP_DungeonEntrance_Cairn_B.BP_DungeonEntrance_Cairn_B_C
// Size: 0x3c0 (Inherited: 0x248)
struct ABP_DungeonEntrance_Cairn_B_C : AActor {
	struct UStaticMeshComponent* SM_DungeonEntrance_Cairn_B_Floor; // 0x248(0x08)
	struct UStaticMeshComponent* SM_Cairn_Column_SideHall_A; // 0x250(0x08)
	struct UStaticMeshComponent* SM_Cairn_Column_SideHall_B; // 0x258(0x08)
	struct UStaticMeshComponent* SM_Cairn_MainHall_Wall_A_7; // 0x260(0x08)
	struct UStaticMeshComponent* SM_Cairn_MainHall_Wall_A_6; // 0x268(0x08)
	struct UStaticMeshComponent* SM_Cairn_MainHall_Wall_A_5; // 0x270(0x08)
	struct UStaticMeshComponent* SM_Cairn_MainHall_Wall_A_4; // 0x278(0x08)
	struct UStaticMeshComponent* SM_Cairn_MainHall_Wall_A_3; // 0x280(0x08)
	struct UStaticMeshComponent* SM_Cairn_MainHall_Wall_A_2; // 0x288(0x08)
	struct UStaticMeshComponent* SM_Cairn_Wall_Flat_A; // 0x290(0x08)
	struct UStaticMeshComponent* SM_Cairn_Column_MainHall_A7; // 0x298(0x08)
	struct UStaticMeshComponent* SM_Cairn_Column_MainHall_A6; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_Cairn_Column_MainHall_A5; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_Cairn_Column_MainHall_A4; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_Cairn_Column_MainHall_A3; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_Cairn_Column_MainHall_A2; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_Cairn_Column_MainHall_A1; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_Cairn_Column_MainHall_A; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_Cairn_MainHall_Wall_Trim_B_7; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_Cairn_MainHall_Wall_Trim_B_6; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_Cairn_MainHall_Wall_Trim_B_5; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_Cairn_MainHall_Wall_Trim_B_4; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_Cairn_MainHall_Wall_Trim_B_3; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_Cairn_MainHall_Wall_Trim_B_2; // 0x300(0x08)
	struct UStaticMeshComponent* SM_Cairn_MainHall_RoofTrim_A_5; // 0x308(0x08)
	struct UStaticMeshComponent* SM_Cairn_MainHall_Roof_A_5; // 0x310(0x08)
	struct UStaticMeshComponent* SM_Cairn_MainHall_Roof_A_4; // 0x318(0x08)
	struct UStaticMeshComponent* SM_Cairn_MainHall_RoofTrim_A_4; // 0x320(0x08)
	struct UStaticMeshComponent* SM_Cairn_MainHall_Roof_A_3; // 0x328(0x08)
	struct UStaticMeshComponent* SM_Cairn_MainHall_RoofTrim_A_3; // 0x330(0x08)
	struct UStaticMeshComponent* SM_Cairn_MainHall_Roof_A_2; // 0x338(0x08)
	struct UStaticMeshComponent* SM_Cairn_MainHall_RoofTrim_A_2; // 0x340(0x08)
	struct UStaticMeshComponent* SM_Cairn_Column_SideHall_C; // 0x348(0x08)
	struct UStaticMeshComponent* SM_Cairn_Column_StoneSlab_A; // 0x350(0x08)
	struct UStaticMeshComponent* SM_Cairn_StoneDebris07; // 0x358(0x08)
	struct UStaticMeshComponent* SM_Cairn_StoneDebris06; // 0x360(0x08)
	struct UStaticMeshComponent* SM_Cairn_RoughTrimB2; // 0x368(0x08)
	struct UStaticMeshComponent* SM_Cairn_RoughTrimB1; // 0x370(0x08)
	struct UStaticMeshComponent* SM_Cairn_RockPile_A_001; // 0x378(0x08)
	struct UStaticMeshComponent* SM_Cairn_RockPile_B_001; // 0x380(0x08)
	struct UStaticMeshComponent* SM_Cairn_RockPile_D_001; // 0x388(0x08)
	struct UStaticMeshComponent* SM_Cairn_RockDebris07_A; // 0x390(0x08)
	struct UStaticMeshComponent* SM_Cairn_RockDebris05B; // 0x398(0x08)
	struct UStaticMeshComponent* SM_Cairn_Column_Trim_D1; // 0x3a0(0x08)
	struct UStaticMeshComponent* SM_Cairn_Column_Trim_D; // 0x3a8(0x08)
	struct UStaticMeshComponent* SM_Cairn_RoughTrimD1; // 0x3b0(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x3b8(0x08)
};

