// BlueprintGeneratedClass BP_DeadNPC_Dressing_PotionOfLivingDeath.BP_DeadNPC_Dressing_PotionOfLivingDeath_C
// Size: 0x298 (Inherited: 0x250)
struct ABP_DeadNPC_Dressing_PotionOfLivingDeath_C : ABP_DeadNPC_Dressing_C {
	struct UStaticMeshComponent* SM_OV_Trunk_GladstoneBag_Open2; // 0x250(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Potion_05; // 0x258(0x08)
	struct UStaticMeshComponent* SM_Potion_WormwoodTable; // 0x260(0x08)
	struct UStaticMeshComponent* SM_Asphodel_Stage3; // 0x268(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Asphodel_Stage4; // 0x270(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_Valerian_Stage4; // 0x278(0x08)
	struct UStaticMeshComponent* SM_PotionSpoon; // 0x280(0x08)
	struct UStaticMeshComponent* SM_HM_Cauldron_Cauldrons_O; // 0x288(0x08)
	struct UStaticMeshComponent* SM_Int_GoblinCrates_Small_W1; // 0x290(0x08)
};

