// BlueprintGeneratedClass BP_DungeonEntrance_Cave_A.BP_DungeonEntrance_Cave_A_C
// Size: 0x2d8 (Inherited: 0x248)
struct ABP_DungeonEntrance_Cave_A_C : AActor {
	struct UStaticMeshComponent* SM_DungeonEnterance_Cave_A; // 0x248(0x08)
	struct UDecalComponent* NewDecalComponent13; // 0x250(0x08)
	struct UDecalComponent* NewDecalComponent12; // 0x258(0x08)
	struct UDecalComponent* NewDecalComponent11; // 0x260(0x08)
	struct UDecalComponent* NewDecalComponent10; // 0x268(0x08)
	struct UDecalComponent* NewDecalComponent9; // 0x270(0x08)
	struct UDecalComponent* NewDecalComponent8; // 0x278(0x08)
	struct UDecalComponent* NewDecalComponent7; // 0x280(0x08)
	struct UDecalComponent* NewDecalComponent6; // 0x288(0x08)
	struct UDecalComponent* NewDecalComponent5; // 0x290(0x08)
	struct UDecalComponent* NewDecalComponent4; // 0x298(0x08)
	struct UDecalComponent* NewDecalComponent3; // 0x2a0(0x08)
	struct UDecalComponent* NewDecalComponent2; // 0x2a8(0x08)
	struct UDecalComponent* NewDecalComponent1; // 0x2b0(0x08)
	struct UDecalComponent* NewDecalComponent; // 0x2b8(0x08)
	struct UDecalComponent* NewDecalComponent14; // 0x2c0(0x08)
	struct USceneComponent* SharedRoot; // 0x2c8(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x2d0(0x08)
};

