// BlueprintGeneratedClass BP_DeadNPC_Dressing_Fireworks.BP_DeadNPC_Dressing_Fireworks_C
// Size: 0x348 (Inherited: 0x250)
struct ABP_DeadNPC_Dressing_Fireworks_C : ABP_DeadNPC_Dressing_C {
	struct USceneComponent* FW; // 0x250(0x08)
	struct UStaticMeshComponent* Paper_Trash_11; // 0x258(0x08)
	struct UStaticMeshComponent* Paper_Trash; // 0x260(0x08)
	struct UStaticMeshComponent* SM_OV_Trunk_Sml_GladstoneBag; // 0x268(0x08)
	struct UDecalComponent* Decals; // 0x270(0x08)
	struct UStaticMeshComponent* Fireworks; // 0x278(0x08)
	struct UStaticMeshComponent* SM_Zonkos_Firework_12; // 0x280(0x08)
	struct UStaticMeshComponent* SM_Zonkos_Firework_01; // 0x288(0x08)
	struct UStaticMeshComponent* Paper_Trash_03; // 0x290(0x08)
	struct UStaticMeshComponent* Paper_Trash_05; // 0x298(0x08)
	struct UStaticMeshComponent* Paper_Trash_12; // 0x2a0(0x08)
	struct UStaticMeshComponent* Paper_Trash_09; // 0x2a8(0x08)
	struct UStaticMeshComponent* Paper_Trash_08; // 0x2b0(0x08)
	struct UStaticMeshComponent* Paper_Trash_07; // 0x2b8(0x08)
	struct UStaticMeshComponent* Paper_Trash_06; // 0x2c0(0x08)
	struct UStaticMeshComponent* Paper_Trash_01; // 0x2c8(0x08)
	struct UStaticMeshComponent* Paper_Trash_04; // 0x2d0(0x08)
	struct UStaticMeshComponent* Paper_Trash_02; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle14; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle9; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle3; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_HM_Paper_F; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_Potion_16; // 0x300(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle11; // 0x308(0x08)
	struct UStaticMeshComponent* SM_Cav_Dungeon_SatchelBag_01; // 0x310(0x08)
	struct UDecalComponent* Scorch_Floor_01; // 0x318(0x08)
	struct UDecalComponent* Dirt_Decal_01; // 0x320(0x08)
	struct UDecalComponent* Blood_Decal_02; // 0x328(0x08)
	struct UDecalComponent* Scorch_Floor_02; // 0x330(0x08)
	struct UDecalComponent* Blood_Decal_01; // 0x338(0x08)
	struct UDecalComponent* Potion_Residue; // 0x340(0x08)
};

