// BlueprintGeneratedClass BP_DeadNPC_Stretcher.BP_DeadNPC_Stretcher_C
// Size: 0x290 (Inherited: 0x248)
struct ABP_DeadNPC_Stretcher_C : AActor {
	struct UDecalComponent* Dirt_Decal_01; // 0x248(0x08)
	struct USceneComponent* Scene; // 0x250(0x08)
	struct UDecalComponent* Dirt_Decal_02; // 0x258(0x08)
	struct UDecalComponent* Dirt_Decal_04; // 0x260(0x08)
	struct UDecalComponent* Dirt_Decal_03; // 0x268(0x08)
	struct UStaticMeshComponent* Bed; // 0x270(0x08)
	struct UStaticMeshComponent* SM_WE_DeadNPC_ClothonBody; // 0x278(0x08)
	struct UStaticMeshComponent* SM_DeadNPC_CharredBody; // 0x280(0x08)
	struct UBP_WorldEvent_DropActorToGround_C* BP_WorldEvent_DropActorToGround; // 0x288(0x08)
};

