// BlueprintGeneratedClass BP_DungeonEntrance_Cairn_C.BP_DungeonEntrance_Cairn_C_C
// Size: 0x390 (Inherited: 0x248)
struct ABP_DungeonEntrance_Cairn_C_C : AActor {
	struct UStaticMeshComponent* SM_DungeonEntrance_Cairn_C_Floor; // 0x248(0x08)
	struct UStaticMeshComponent* SM_Cairn_MainHall_Wall_A_10; // 0x250(0x08)
	struct UStaticMeshComponent* SM_Cairn_MainHall_Wall_A_9; // 0x258(0x08)
	struct UStaticMeshComponent* SM_Cairn_MainHall_Wall_A_8; // 0x260(0x08)
	struct UStaticMeshComponent* SM_Cairn_MainHall_Wall_A_7; // 0x268(0x08)
	struct UStaticMeshComponent* SM_Cairn_MainHall_Wall_A_6; // 0x270(0x08)
	struct UStaticMeshComponent* SM_Cairn_MainHall_Wall_A_5; // 0x278(0x08)
	struct UStaticMeshComponent* SM_Cairn_MainHall_Wall_A_4; // 0x280(0x08)
	struct UStaticMeshComponent* SM_Cairn_MainHall_half1; // 0x288(0x08)
	struct UStaticMeshComponent* SM_Cairn_MainHall_half; // 0x290(0x08)
	struct UStaticMeshComponent* SM_Cairn_Wall_Flat_A; // 0x298(0x08)
	struct UStaticMeshComponent* SM_Cairn_Column_SideHall_A5; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_Cairn_Column_SideHall_C5; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_Cairn_Column_SideHall_C4; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_Cairn_Column_SideHall_A4; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_Cairn_SideHall_Roof_C_7; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_Cairn_SideHall_Roof_A_10; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_Cairn_SideHall_Roof_A_9; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_Cairn_SideHall_Roof_C_6; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_Cairn_SideHall_Roof_A_8; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_Cairn_Column_SideHall_C3; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_Cairn_Column_SideHall_A3; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_Cairn_SideHall_Roof_C_5; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_Cairn_SideHall_Roof_A_7; // 0x300(0x08)
	struct UStaticMeshComponent* SM_Cairn_SideHall_Roof_A_6; // 0x308(0x08)
	struct UStaticMeshComponent* SM_Cairn_Column_SideHall_C2; // 0x310(0x08)
	struct UStaticMeshComponent* SM_Cairn_Column_SideHall_A2; // 0x318(0x08)
	struct UStaticMeshComponent* SM_Cairn_SideHall_Roof_A_5; // 0x320(0x08)
	struct UStaticMeshComponent* SM_Cairn_SideHall_Roof_C_4; // 0x328(0x08)
	struct UStaticMeshComponent* SM_Cairn_Column_SideHall_C1; // 0x330(0x08)
	struct UStaticMeshComponent* SM_Cairn_Column_SideHall_A1; // 0x338(0x08)
	struct UStaticMeshComponent* SM_Cairn_SideHall_Roof_A_4; // 0x340(0x08)
	struct UStaticMeshComponent* SM_Cairn_SideHall_Roof_C_3; // 0x348(0x08)
	struct UStaticMeshComponent* SM_Cairn_SideHall_Roof_A_3; // 0x350(0x08)
	struct UStaticMeshComponent* SM_Cairn_MainHall_Wall_A_3; // 0x358(0x08)
	struct UStaticMeshComponent* SM_Cairn_MainHall_Wall_A_2; // 0x360(0x08)
	struct UStaticMeshComponent* SM_Cairn_SideHall_Roof_A_2; // 0x368(0x08)
	struct UStaticMeshComponent* SM_Cairn_SideHall_Roof_C_2; // 0x370(0x08)
	struct UStaticMeshComponent* SM_Cairn_Column_SideHall_C; // 0x378(0x08)
	struct UStaticMeshComponent* SM_Cairn_Column_SideHall_A; // 0x380(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x388(0x08)
};

