// BlueprintGeneratedClass BP_DeadNPC_Dressing_Werewolf.BP_DeadNPC_Dressing_Werewolf_C
// Size: 0x2b0 (Inherited: 0x250)
struct ABP_DeadNPC_Dressing_Werewolf_C : ABP_DeadNPC_Dressing_C {
	struct UStaticMeshComponent* SM_OV_Trunk_GladstoneBag_Open2; // 0x250(0x08)
	struct UStaticMeshComponent* SM_OV_Trunk_Sml_GladstoneBag; // 0x258(0x08)
	struct UStaticMeshComponent* SM_HM_OwlPost_Packages_Unique_A; // 0x260(0x08)
	struct UStaticMeshComponent* SM_CastleDun_Stool; // 0x268(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Firepit_001_LOD; // 0x270(0x08)
	struct UStaticMeshComponent* SM_Bottle_Empty; // 0x278(0x08)
	struct UStaticMeshComponent* SM_CastleDun_GOB_Cup; // 0x280(0x08)
	struct UStaticMeshComponent* SM_AncientMagicBook_Closed; // 0x288(0x08)
	struct UStaticMeshComponent* SM_Book_03; // 0x290(0x08)
	struct UStaticMeshComponent* SM_HM_HogsHead_Bottle_D; // 0x298(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Bottle_B; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_Rolled_Parchment_D; // 0x2a8(0x08)
};

