// BlueprintGeneratedClass BP_DeadNPC_Dressing_UnbreakableVowGrave.BP_DeadNPC_Dressing_UnbreakableVowGrave_C
// Size: 0x2c0 (Inherited: 0x250)
struct ABP_DeadNPC_Dressing_UnbreakableVowGrave_C : ABP_DeadNPC_Dressing_C {
	struct UChildActorComponent* Loot; // 0x250(0x08)
	struct UDecalComponent* Decal; // 0x258(0x08)
	struct UDecalComponent* Rock_Decals; // 0x260(0x08)
	struct UDecalComponent* Dirt_Decal_02; // 0x268(0x08)
	struct UDecalComponent* Dirt_Decal_03; // 0x270(0x08)
	struct UDecalComponent* Dirt_Decal_01; // 0x278(0x08)
	struct USkeletalMeshComponent* SK_WE_Busker_Hat; // 0x280(0x08)
	struct UStaticMeshComponent* SM_DryGrass_09_DM; // 0x288(0x08)
	struct UStaticMeshComponent* SM_GrassSmallMain_Fall; // 0x290(0x08)
	struct UStaticMeshComponent* SM_GrassMain_Fall; // 0x298(0x08)
	struct UStaticMeshComponent* SM_FloweringWeed_D; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Shovel_001_W; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_GrassMain_Fall1; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_WE_DirtPile; // 0x2b8(0x08)
};

