// BlueprintGeneratedClass BP_DeadNPC_Dressing_TravellingMedic.BP_DeadNPC_Dressing_TravellingMedic_C
// Size: 0x310 (Inherited: 0x250)
struct ABP_DeadNPC_Dressing_TravellingMedic_C : ABP_DeadNPC_Dressing_C {
	struct UStaticMeshComponent* SM_BCProps_Lantern_001; // 0x250(0x08)
	struct UStaticMeshComponent* SM_HM_TeaShop_Pillows_E; // 0x258(0x08)
	struct UStaticMeshComponent* Cart; // 0x260(0x08)
	struct UBoxComponent* Box; // 0x268(0x08)
	struct UStaticMeshComponent* SM_HW_SB_Bridge_Ropes_ChainAnchor1; // 0x270(0x08)
	struct UStaticMeshComponent* SM_HW_SB_Bridge_Ropes_ChainAnchor; // 0x278(0x08)
	struct UStaticMeshComponent* SM_Herb_DaleStudy_Chest; // 0x280(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Cauldron_001_LOD; // 0x288(0x08)
	struct UStaticMeshComponent* SM_HM_Potions_HangingPot_B; // 0x290(0x08)
	struct UStaticMeshComponent* SM_Potion_12; // 0x298(0x08)
	struct UStaticMeshComponent* SM_CastleDun_GOB_PotionContainer_A; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_TallGrass_01_Master; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_GrassMain; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_HM_Cloth_04_CProp; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Bucket_Small_001_W1; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Medium_B; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_HangingProps_Bags_007_F; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Tongs_003; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_BCProps_Ropecoil_A; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Bottle_001; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_FoodBag_1bag_003_W; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_FoodBag_1bag_001_W; // 0x2f8(0x08)
	struct UChildActorComponent* PotionStation; // 0x300(0x08)
	struct UChildActorComponent* Stretcher; // 0x308(0x08)
};

