// BlueprintGeneratedClass BP_DeadNPC_Dressing_MandrakePatch.BP_DeadNPC_Dressing_MandrakePatch_C
// Size: 0x2a0 (Inherited: 0x250)
struct ABP_DeadNPC_Dressing_MandrakePatch_C : ABP_DeadNPC_Dressing_C {
	struct UChildActorComponent* Mandrake3; // 0x250(0x08)
	struct UChildActorComponent* Mandrake2; // 0x258(0x08)
	struct UChildActorComponent* Mandrake1; // 0x260(0x08)
	struct UStaticMeshComponent* SM_WE_SoilMound_02; // 0x268(0x08)
	struct USkeletalMeshComponent* SK_Feedcan_Mandrake; // 0x270(0x08)
	struct UStaticMeshComponent* SM_Mandrake_Leaf; // 0x278(0x08)
	struct UStaticMeshComponent* SM_HM_Neep_Shovel_A; // 0x280(0x08)
	struct UStaticMeshComponent* SM_WE_SoilMound_01; // 0x288(0x08)
	struct UStaticMeshComponent* SM_Mandrake_Leaf2; // 0x290(0x08)
	struct UStaticMeshComponent* SM_Mandrake_Leaf1; // 0x298(0x08)
};

