// BlueprintGeneratedClass BP_FastTravel_Wall_01.BP_FastTravel_Wall_01_C
// Size: 0x328 (Inherited: 0x248)
struct ABP_FastTravel_Wall_01_C : AActor {
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_B_NewDecalComponent; // 0x248(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_Cap_B5_StaticMeshComponent0; // 0x250(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_Cap_B6_StaticMeshComponent0; // 0x258(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_C5_StaticMeshComponent0; // 0x260(0x08)
	struct UStaticMeshComponent* SM_HW_MC_RockInsert_B3_StaticMeshComponent0; // 0x268(0x08)
	struct UStaticMeshComponent* SM_HW_MC_RockInsert_G3_StaticMeshComponent0; // 0x270(0x08)
	struct UStaticMeshComponent* SM_HW_MC_RockInsert_E3_StaticMeshComponent0; // 0x278(0x08)
	struct UStaticMeshComponent* SM_HW_MC_RockInsert_F2_StaticMeshComponent0; // 0x280(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_C_NewDecalComponent; // 0x288(0x08)
	struct UStaticMeshComponent* SM_HW_MC_RockInsert_E2_StaticMeshComponent0; // 0x290(0x08)
	struct UStaticMeshComponent* SM_HW_MC_RockInsert_B4_StaticMeshComponent0; // 0x298(0x08)
	struct UStaticMeshComponent* SM_HW_MC_RockInsert_F3_StaticMeshComponent0; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_FastTravel_Wall_01_StaticMeshComponent0; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_HW_MC_RockInsert_D2_StaticMeshComponent0; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_D4_StaticMeshComponent0; // 0x2b8(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_B3_NewDecalComponent; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_HW_MC_RockInsert_D_StaticMeshComponent0; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_Cap_B4_StaticMeshComponent0; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_C4_StaticMeshComponent0; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_HW_MC_RockInsert_B2_StaticMeshComponent0; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_HW_MC_RockInsert_E_StaticMeshComponent0; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_HW_MC_RockInsert_F_StaticMeshComponent0; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_HW_MC_RockInsert_G2_StaticMeshComponent0; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_HW_MC_RockInsert_B_StaticMeshComponent0; // 0x300(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_Cap_A_b3_StaticMeshComponent0; // 0x308(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_D5_StaticMeshComponent0; // 0x310(0x08)
	struct USceneComponent* Scene; // 0x318(0x08)
	struct USceneComponent* SharedRoot; // 0x320(0x08)
};

