// BlueprintGeneratedClass BP_FF_HeroTree02_Blueprint.BP_FF_HeroTree02_Blueprint_C
// Size: 0x338 (Inherited: 0x248)
struct ABP_FF_HeroTree02_Blueprint_C : AActor {
	struct USeasonSelectorComponent* SeasonSelector7; // 0x248(0x08)
	struct USeasonSelectorComponent* SeasonSelector6; // 0x250(0x08)
	struct USeasonSelectorComponent* SeasonSelector5; // 0x258(0x08)
	struct USeasonSelectorComponent* SeasonSelector4; // 0x260(0x08)
	struct USeasonSelectorComponent* SeasonSelector3; // 0x268(0x08)
	struct USeasonSelectorComponent* SeasonSelector2; // 0x270(0x08)
	struct USeasonSelectorComponent* SeasonSelector1; // 0x278(0x08)
	struct USeasonSelectorComponent* SeasonSelector; // 0x280(0x08)
	struct UCreaturePerchComponent* CreaturePerch10; // 0x288(0x08)
	struct UCreaturePerchComponent* CreaturePerch9; // 0x290(0x08)
	struct UCreaturePerchComponent* CreaturePerch8; // 0x298(0x08)
	struct UCreaturePerchComponent* CreaturePerch7; // 0x2a0(0x08)
	struct UCreaturePerchComponent* CreaturePerch6; // 0x2a8(0x08)
	struct UCreaturePerchComponent* CreaturePerch5; // 0x2b0(0x08)
	struct UCreaturePerchComponent* CreaturePerch4; // 0x2b8(0x08)
	struct UCreaturePerchComponent* CreaturePerch3; // 0x2c0(0x08)
	struct UCreaturePerchComponent* CreaturePerch2; // 0x2c8(0x08)
	struct UCreaturePerchComponent* CreaturePerch1; // 0x2d0(0x08)
	struct UCreaturePerchComponent* CreaturePerch; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_FF_HeroTree02_A_Leaves_Canopy_08; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_FF_HeroTree02_A_Leaves_Canopy_07; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_FF_HeroTree02_A_Leaves_Canopy_06; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_FF_HeroTree02_A_Leaves_Canopy_05; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_FF_HeroTree02_A_Leaves_Canopy_04; // 0x300(0x08)
	struct UStaticMeshComponent* SM_FF_HeroTree02_A_Leaves_Canopy_03; // 0x308(0x08)
	struct UStaticMeshComponent* SM_FF_HeroTree02_A_Leaves_Canopy_02; // 0x310(0x08)
	struct UStaticMeshComponent* SM_FF_HeroTree02_A_Leaves_Canopy_01; // 0x318(0x08)
	struct UStaticMeshComponent* SM_FF_HeroTree02_B; // 0x320(0x08)
	struct UStaticMeshComponent* SM_FF_HeroTree02_A; // 0x328(0x08)
	struct USceneComponent* SharedRoot; // 0x330(0x08)
};

