// BlueprintGeneratedClass BP_FF_HeroTree03_Blueprint.BP_FF_HeroTree03_Blueprint_C
// Size: 0x2c8 (Inherited: 0x248)
struct ABP_FF_HeroTree03_Blueprint_C : AActor {
	struct USeasonSelectorComponent* SeasonSelector6; // 0x248(0x08)
	struct USeasonSelectorComponent* SeasonSelector5; // 0x250(0x08)
	struct USeasonSelectorComponent* SeasonSelector4; // 0x258(0x08)
	struct USeasonSelectorComponent* SeasonSelector3; // 0x260(0x08)
	struct USeasonSelectorComponent* SeasonSelector2; // 0x268(0x08)
	struct USeasonSelectorComponent* SeasonSelector1; // 0x270(0x08)
	struct USeasonSelectorComponent* SeasonSelector; // 0x278(0x08)
	struct UStaticMeshComponent* SM_FF_HeroTree03_A_Leaves_Canopy_07; // 0x280(0x08)
	struct UStaticMeshComponent* SM_FF_HeroTree03_A_Leaves_Canopy_06; // 0x288(0x08)
	struct UStaticMeshComponent* SM_FF_HeroTree03_A_Leaves_Canopy_05; // 0x290(0x08)
	struct UStaticMeshComponent* SM_FF_HeroTree03_A_Leaves_Canopy_04; // 0x298(0x08)
	struct UStaticMeshComponent* SM_FF_HeroTree03_A_Leaves_Canopy_03; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_FF_HeroTree03_A_Leaves_Canopy_02; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_FF_HeroTree03_A_Leaves_Canopy_01; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_FF_HeroTree03_A; // 0x2b8(0x08)
	struct USceneComponent* SharedRoot; // 0x2c0(0x08)
};

