// BlueprintGeneratedClass BP_Forageable_Leaping_Toadstool_Mound.BP_Forageable_Leaping_Toadstool_Mound_C
// Size: 0x310 (Inherited: 0x2c0)
struct ABP_Forageable_Leaping_Toadstool_Mound_C : AForagable {
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_DeadLeafThick_01_Master; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_DeadLeafThin_01_Master; // 0x2c8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_25SM_Forageable_Leaping_Toadstools_H1; // 0x2d0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_15SM_DeadLeafThick_01_Fall2; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_Toadstools_Mound_Round1; // 0x2e0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_19SM_Forageable_Leaping_Toadstools_I1; // 0x2e8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_11SM_KidneyWeed_06; // 0x2f0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_17SM_Forageable_Leaping_Toadstools_G1; // 0x2f8(0x08)
	struct UChildActorComponent* BP_LeapingToadstool; // 0x300(0x08)
	struct USceneComponent* SharedRoot; // 0x308(0x08)
};

