// BlueprintGeneratedClass BP_Frontend_Table.BP_Frontend_Table_C
// Size: 0x290 (Inherited: 0x248)
struct ABP_Frontend_Table_C : AActor {
	struct UStaticMeshComponent* SM_HW_LetterBundle_A1; // 0x248(0x08)
	struct UStaticMeshComponent* SM_HW_LetterBundle_A; // 0x250(0x08)
	struct UStaticMeshComponent* SM_HW_L_BookStand; // 0x258(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_Rolled_Parchment_D1; // 0x260(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_Rolled_Parchment_D; // 0x268(0x08)
	struct UStaticMeshComponent* SM_HW_GenericTrunk_A; // 0x270(0x08)
	struct UStaticMeshComponent* SM_HW_Laundry_Chair_E; // 0x278(0x08)
	struct UStaticMeshComponent* SM_FrontEnd_Desk_01; // 0x280(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x288(0x08)
};

