// BlueprintGeneratedClass BP_FastTravel_Chimney_01.BP_FastTravel_Chimney_01_C
// Size: 0x2a0 (Inherited: 0x248)
struct ABP_FastTravel_Chimney_01_C : AActor {
	struct UStaticMeshComponent* Cube; // 0x248(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_Cap_A_b5_StaticMeshComponent0; // 0x250(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_D10_StaticMeshComponent0; // 0x258(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_Cap_A_b4_StaticMeshComponent0; // 0x260(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_D9_StaticMeshComponent0; // 0x268(0x08)
	struct UStaticMeshComponent* SM_FastTravel_Chimney_01_StaticMeshComponent0; // 0x270(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_C3_StaticMeshComponent0; // 0x278(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_Cap_A_b3_StaticMeshComponent0; // 0x280(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_C7_StaticMeshComponent0; // 0x288(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_B3_NewDecalComponent; // 0x290(0x08)
	struct USceneComponent* SharedRoot; // 0x298(0x08)
};

