// BlueprintGeneratedClass BP_GC_PR_L_BookRow_Half_A.BP_GC_PR_L_BookRow_Half_A_C
// Size: 0x2b8 (Inherited: 0x248)
struct ABP_GC_PR_L_BookRow_Half_A_C : AActor {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x248(0x08)
	struct UStaticMeshComponent* GC_PR_L_BookRow_Half_A_Piece_02; // 0x250(0x08)
	struct UStaticMeshComponent* GC_PR_L_BookRow_Half_A_Piece_07; // 0x258(0x08)
	struct UStaticMeshComponent* GC_PR_L_BookRow_Half_A_Piece_03; // 0x260(0x08)
	struct UStaticMeshComponent* GC_PR_L_BookRow_Half_A_Piece_05; // 0x268(0x08)
	struct UStaticMeshComponent* GC_PR_L_BookRow_Half_A_Piece_09; // 0x270(0x08)
	struct UStaticMeshComponent* GC_PR_L_BookRow_Half_A_Piece_04; // 0x278(0x08)
	struct UStaticMeshComponent* GC_PR_L_BookRow_Half_A_Piece_08; // 0x280(0x08)
	struct UStaticMeshComponent* GC_PR_L_BookRow_Half_A_Piece_06; // 0x288(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse08; // 0x290(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse06; // 0x298(0x08)
	struct UStaticMeshComponent* GC_PR_L_BookRow_Half_A_Piece_01; // 0x2a0(0x08)
	struct UPhysicalResponseComponent* Phys response main; // 0x2a8(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x2b0(0x08)

	void ObjectPhysicalResponseImpact(float ImpactIntensity, struct FName SpellName, struct FName ResponseConfigName, struct FVector& ImpactLocation); // Function BP_GC_PR_L_BookRow_Half_A.BP_GC_PR_L_BookRow_Half_A_C.ObjectPhysicalResponseImpact // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_BP_GC_PR_L_BookRow_Half_A(int32_t EntryPoint); // Function BP_GC_PR_L_BookRow_Half_A.BP_GC_PR_L_BookRow_Half_A_C.ExecuteUbergraph_BP_GC_PR_L_BookRow_Half_A // (Final|UbergraphFunction) // @ game+0x38a7480
};

