// BlueprintGeneratedClass BP_Goblin_Crates_ConstructionB.BP_Goblin_Crates_ConstructionB_C
// Size: 0x298 (Inherited: 0x248)
struct ABP_Goblin_Crates_ConstructionB_C : AActor {
	struct UStaticMeshComponent* SM_GobMine_Pipe_200L_V1_A9_StaticMeshComponent0; // 0x248(0x08)
	struct UStaticMeshComponent* SM_GobMine_Pipe_200L_V1_A8_StaticMeshComponent0; // 0x250(0x08)
	struct UStaticMeshComponent* SM_GobMine_Generator_Gear_B2_StaticMeshComponent0; // 0x258(0x08)
	struct UStaticMeshComponent* SM_GobMine_TankMachine_Wheel_D2_StaticMeshComponent0; // 0x260(0x08)
	struct UStaticMeshComponent* SM_GobMine_Boiler_Gear_A3_StaticMeshComponent0; // 0x268(0x08)
	struct UStaticMeshComponent* SM_GobMine_PipeAddon_Valve_B_StaticMeshComponent0; // 0x270(0x08)
	struct UStaticMeshComponent* SM_GobMine_Tank_Gear_A3_StaticMeshComponent0; // 0x278(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_OpenCrate_Medium_001_W_StaticMeshComponent0; // 0x280(0x08)
	struct UStaticMeshComponent* SM_GobMine_Lift_Gear_B_StaticMeshComponent0; // 0x288(0x08)
	struct USceneComponent* SharedRoot; // 0x290(0x08)
};

