// BlueprintGeneratedClass BP_Goblin_Crates_F.BP_Goblin_Crates_F_C
// Size: 0x290 (Inherited: 0x248)
struct ABP_Goblin_Crates_F_C : AActor {
	struct UStaticMeshComponent* StaticMeshComponent3; // 0x248(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0; // 0x250(0x08)
	struct UStaticMeshComponent* StaticMeshComponent2; // 0x258(0x08)
	struct UStaticMeshComponent* StaticMeshComponent7; // 0x260(0x08)
	struct UStaticMeshComponent* StaticMeshComponent6; // 0x268(0x08)
	struct UStaticMeshComponent* StaticMeshComponent5; // 0x270(0x08)
	struct UStaticMeshComponent* StaticMeshComponent4; // 0x278(0x08)
	struct UStaticMeshComponent* StaticMeshComponent1; // 0x280(0x08)
	struct USceneComponent* SharedRoot; // 0x288(0x08)
};

