// BlueprintGeneratedClass BP_GobMine_Bunbeds_01.BP_GobMine_Bunbeds_01_C
// Size: 0x298 (Inherited: 0x248)
struct ABP_GobMine_Bunbeds_01_C : AActor {
	struct UStaticMeshComponent* SM_HM_Mattress_C; // 0x248(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_GobMine_Vic_Column_Top_A; // 0x250(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_GobMine_Vic_Column_5M+Cap_D; // 0x258(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_GobMine_Vic_Column_Top_B; // 0x260(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_GobMine_Vic_Column_Base_E; // 0x268(0x08)
	struct UStaticMeshComponent* SM_HM_Pillow_A; // 0x270(0x08)
	struct UStaticMeshComponent* SM_HM_Bed_C; // 0x278(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_GobMine_Vic_Column_1M_B; // 0x280(0x08)
	struct USceneComponent* SharedRoot; // 0x288(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x290(0x08)
};

