// BlueprintGeneratedClass BP_GobMine_Forge_Small_B.BP_GobMine_Forge_Small_B_C
// Size: 0x2b0 (Inherited: 0x248)
struct ABP_GobMine_Forge_Small_B_C : AActor {
	struct UStaticMeshComponent* SM_Int_BCProps_Firepit_001; // 0x248(0x08)
	struct UStaticMeshComponent* SM_GobMine_Pipe_Cap_B; // 0x250(0x08)
	struct UStaticMeshComponent* SM_CastleDun_Ember_B; // 0x258(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Anvil_002; // 0x260(0x08)
	struct UStaticMeshComponent* SM_BCProps_Furnace_001; // 0x268(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_Hammer_001_W; // 0x270(0x08)
	struct UStaticMeshComponent* SM_CastleDun_GOB_SwordMold_B; // 0x278(0x08)
	struct UStaticMeshComponent* SM_CastleDun_GOB_Bottle_C; // 0x280(0x08)
	struct UStaticMeshComponent* SM_CastleDun_GOB_Bottle_B; // 0x288(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CookingPot_001; // 0x290(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_CastleDun_GOB_Crucibles_B; // 0x298(0x08)
	struct UStaticMeshComponent* SM_CastleDun_GobTable01; // 0x2a0(0x08)
	struct USceneComponent* SharedRoot; // 0x2a8(0x08)
};

