// BlueprintGeneratedClass BP_Goblin_Crates_Construction_A.BP_Goblin_Crates_Construction_A_C
// Size: 0x290 (Inherited: 0x248)
struct ABP_Goblin_Crates_Construction_A_C : AActor {
	struct UStaticMeshComponent* SM_GobMine_MedDoor_Gear_01_StaticMeshComponent0; // 0x248(0x08)
	struct UStaticMeshComponent* SM_CastleDun_HayPile_D2_StaticMeshComponent0; // 0x250(0x08)
	struct UStaticMeshComponent* SM_CastleDun_HayPile_D3_StaticMeshComponent0; // 0x258(0x08)
	struct UStaticMeshComponent* SM_GobMine_Lift_Gear_C_StaticMeshComponent0; // 0x260(0x08)
	struct UStaticMeshComponent* SM_GobMine_Pipe_200L_V1_A10_StaticMeshComponent0; // 0x268(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_OpenCrate_Medium_A_StaticMeshComponent0; // 0x270(0x08)
	struct UStaticMeshComponent* SM_GobMine_PipeAddon_Cap_A2_StaticMeshComponent0; // 0x278(0x08)
	struct UStaticMeshComponent* SM_GobMine_Pipe_Cap_B17_StaticMeshComponent0; // 0x280(0x08)
	struct USceneComponent* SharedRoot; // 0x288(0x08)
};

