// BlueprintGeneratedClass BP_Goblin_Pipes_05.BP_Goblin_Pipes_05_C
// Size: 0x2c0 (Inherited: 0x248)
struct ABP_Goblin_Pipes_05_C : AActor {
	struct UBoxComponent* Box; // 0x248(0x08)
	struct UStaticMeshComponent* SM_GobMine_Pipe_Cap_A1; // 0x250(0x08)
	struct UStaticMeshComponent* SM_GobMine_Pipe_Cap_A; // 0x258(0x08)
	struct UStaticMeshComponent* SM_GobMine_Pipe_200L_V2_A_4; // 0x260(0x08)
	struct UStaticMeshComponent* SM_GobMine_Pipe_100L_V2_A2; // 0x268(0x08)
	struct UStaticMeshComponent* SM_GobMine_Pipe_Corner_V2_A1; // 0x270(0x08)
	struct UStaticMeshComponent* SM_GobMine_Pipe_TShape_V2_A1; // 0x278(0x08)
	struct UStaticMeshComponent* SM_GobMine_Pipe_100L_V2_A1; // 0x280(0x08)
	struct UStaticMeshComponent* SM_GobMine_Pipe_100L_V2_A; // 0x288(0x08)
	struct UStaticMeshComponent* SM_GobMine_Pipe_200L_V2_A_3; // 0x290(0x08)
	struct UStaticMeshComponent* SM_GobMine_Pipe_Corner_V2_A; // 0x298(0x08)
	struct UStaticMeshComponent* SM_GobMine_Pipe_TShape_V2_A; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_GobMine_PipeAddon_Valve_A1; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_GobMine_PipeAddon_Cap_D; // 0x2b0(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x2b8(0x08)
};

