// BlueprintGeneratedClass BP_GobMine_CaseWeapons_B.BP_GobMine_CaseWeapons_B_C
// Size: 0x2e0 (Inherited: 0x248)
struct ABP_GobMine_CaseWeapons_B_C : AActor {
	struct UStaticMeshComponent* SM_Int_GoblinCrates_small_Red_W; // 0x248(0x08)
	struct UStaticMeshComponent* WP_GoblinSword_01; // 0x250(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_OpenCrate_Medium_001_W; // 0x258(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_FoodBag_1bag_002_W; // 0x260(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Medium_B; // 0x268(0x08)
	struct UStaticMeshComponent* SM_WP_Goblin_Shield; // 0x270(0x08)
	struct UStaticMeshComponent* SM_CastleDun_HayPile_A; // 0x278(0x08)
	struct UStaticMeshComponent* SM_Int_GoblinCrates_LG_Red_Metal_W; // 0x280(0x08)
	struct UStaticMeshComponent* SM_Int_GoblinCrates_Long_W; // 0x288(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_FoodBag_1bag_001_W; // 0x290(0x08)
	struct UStaticMeshComponent* SM_Int_GoblinCrates_LG_W; // 0x298(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_GoblinCrates_Small_Metal_W; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_BCProps_FoodBag_3bag_001; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_Int_Goblin_Crates_Medium_Metal_W; // 0x2b0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_Goblin_Crates_Medium_W; // 0x2b8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_WP_Goblin_Spear; // 0x2c0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_CastleDun_HayPile_C; // 0x2c8(0x08)
	struct USceneComponent* SharedRoot; // 0x2d0(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x2d8(0x08)
};

