// BlueprintGeneratedClass BP_GoblinDoor_03_Steam.BP_GoblinDoor_03_Steam_C
// Size: 0x2b0 (Inherited: 0x248)
struct ABP_GoblinDoor_03_Steam_C : AActor {
	struct UStaticMeshComponent* SM_GobMine_BrickWall_Corner_A5; // 0x248(0x08)
	struct UStaticMeshComponent* SM_GobMine_BrickWall_Corner_A4; // 0x250(0x08)
	struct UStaticMeshComponent* SM_GobMine_BrickWall_500Hx500W_C; // 0x258(0x08)
	struct UStaticMeshComponent* SM_GobMine_BrickWall_Corner_A3; // 0x260(0x08)
	struct UStaticMeshComponent* SM_GobMine_BrickWall_Corner_A2; // 0x268(0x08)
	struct UStaticMeshComponent* SM_GobMine_BrickWall_Corner_A1; // 0x270(0x08)
	struct UStaticMeshComponent* SM_GobMine_BrickWall_Corner_A; // 0x278(0x08)
	struct UStaticMeshComponent* SM_GobMine_Ground_500Hx500W_A; // 0x280(0x08)
	struct UStaticMeshComponent* SM_GobMine_BrickWall_500Hx500W_B3; // 0x288(0x08)
	struct UStaticMeshComponent* SM_GobMine_BrickWall_500Hx500W_B2; // 0x290(0x08)
	struct UStaticMeshComponent* SM_GobMine_BrickWall_500Hx500W_A; // 0x298(0x08)
	struct UStaticMeshComponent* SM_CastleDun_Jail_Wall_High; // 0x2a0(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x2a8(0x08)
};

