// BlueprintGeneratedClass BP_GobMin_Barrel_A.BP_GobMin_Barrel_A_C
// Size: 0x298 (Inherited: 0x248)
struct ABP_GobMin_Barrel_A_C : AActor {
	struct UDecalComponent* MI_CastleDun_Decal_Hay_A; // 0x248(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Barrel_001_W; // 0x250(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Basket_Small_001_W; // 0x258(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleDun_HayPile_B; // 0x260(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_13SM_Int_BCProps_FoodBag_1bag_001_W; // 0x268(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Basket_Small_003_W; // 0x270(0x08)
	struct UStaticMeshComponent* SM_CastleDun_HayPile_C; // 0x278(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_7SM_BCProps_Apple_B; // 0x280(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_BCProps_Plum_A; // 0x288(0x08)
	struct USceneComponent* SharedRoot; // 0x290(0x08)
};

