// BlueprintGeneratedClass BP_GobMine_Wash_Station.BP_GobMine_Wash_Station_C
// Size: 0x288 (Inherited: 0x248)
struct ABP_GobMine_Wash_Station_C : AActor {
	struct UStaticMeshComponent* SM_Int_BCProps_Table_Medium_001_D1; // 0x248(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_Bucket_Small_002_W; // 0x250(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_7SM_HW_Food_Dishware_Old_R; // 0x258(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_14SM_HW_Food_Dishware_Old_D; // 0x260(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Table_Short_001_D1; // 0x268(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_HW_Food_Dishware_Old_A; // 0x270(0x08)
	struct UStaticMeshComponent* SM_HW_BS_WaterSpout_A1; // 0x278(0x08)
	struct USceneComponent* SharedRoot; // 0x280(0x08)
};

