// BlueprintGeneratedClass BP_GOB_TableFood_B.BP_GOB_TableFood_B_C
// Size: 0x2b8 (Inherited: 0x248)
struct ABP_GOB_TableFood_B_C : AActor {
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_HW_Food_Singles_TurkeyLeg; // 0x248(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Main_AH; // 0x250(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_9SM_Int_BCProps_Plate_001; // 0x258(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleDun_GOB_Chair_B1; // 0x260(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_Int_BCProps_Fork_002; // 0x268(0x08)
	struct UStaticMeshComponent* SM_Int_CastleDun_Goblin_RoundTable_W1; // 0x270(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_CastleDun_GOB_Chair_A1; // 0x278(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_Meat_Brisket; // 0x280(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_CastleDun_GOB_Cup; // 0x288(0x08)
	struct UStaticMeshComponent* SM_CastleDun_GOB_Bottle_C1; // 0x290(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_CastleDun_GOB_Bottle_B; // 0x298(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_WoodTub_Small_001_W1; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Jug_001_W1; // 0x2a8(0x08)
	struct USceneComponent* SharedRoot; // 0x2b0(0x08)
};

