// BlueprintGeneratedClass BP_GobMine_WoodPils.BP_GobMine_WoodPils_C
// Size: 0x290 (Inherited: 0x248)
struct ABP_GobMine_WoodPils_C : AActor {
	struct UStaticMeshComponent* SM_BCProps_Wood_Chopped_Single_A_Station; // 0x248(0x08)
	struct UStaticMeshComponent* SM_BCProps_Wood_Chopped_Small_002; // 0x250(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_Int_BCProps_WoodPile_Large_001; // 0x258(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Broom_001_W; // 0x260(0x08)
	struct UStaticMeshComponent* SM_BCProps_Wood_Chopped_Small_001; // 0x268(0x08)
	struct UStaticMeshComponent* SM_CastleDun_HayPile_A; // 0x270(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_BCProps_Wood_Chopped_Single_A; // 0x278(0x08)
	struct UStaticMeshComponent* SM_BCProps_Wood_Chopped_Single_B; // 0x280(0x08)
	struct USceneComponent* SharedRoot; // 0x288(0x08)
};

