// BlueprintGeneratedClass BP_Gob_CampTemp_Tower_A.BP_Gob_CampTemp_Tower_A_C
// Size: 0x2c0 (Inherited: 0x248)
struct ABP_Gob_CampTemp_Tower_A_C : AActor {
	struct UHierarchicalInstancedStaticMeshComponent* HISM_8SM_GobMine_Beam_90D_C_Rust; // 0x248(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_CampB_5m_PostA; // 0x250(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_GobMine_Beam_400Hx50W_Rust; // 0x258(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_GobMine_BeamBase_B; // 0x260(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_21SM_GobMine_Beam_CAP_A_Rust1; // 0x268(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_GobMine_BeamConnector_V1_A; // 0x270(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_8SM_GobMine_BeamSupport_C1; // 0x278(0x08)
	struct UStaticMeshComponent* SM_Gob_CampTemp_Tower_A_Top1; // 0x280(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_GobMine_Vic_Arch_Big_A; // 0x288(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_GobMine_Beam_400Hx25W_A_Rust; // 0x290(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_9SM_GobMine_Vic_Arch_Single_C; // 0x298(0x08)
	struct UStaticMeshComponent* SM_GobMine_WarBanner_B; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_GobMin_Floor_5M_Kit_01_A; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_Gob_CampTemp_Tower_A_Chain_02; // 0x2b0(0x08)
	struct USceneComponent* SharedRoot; // 0x2b8(0x08)
};

