// BlueprintGeneratedClass BP_Goblin_Table_Mining02.BP_Goblin_Table_Mining02_C
// Size: 0x288 (Inherited: 0x248)
struct ABP_Goblin_Table_Mining02_C : AActor {
	struct UStaticMeshComponent* SM_Int_BCProps_Rope_002_W; // 0x248(0x08)
	struct UBoxComponent* Box; // 0x250(0x08)
	struct UStaticMeshComponent* StaticMeshComponent7; // 0x258(0x08)
	struct UStaticMeshComponent* StaticMeshComponent6; // 0x260(0x08)
	struct UStaticMeshComponent* StaticMeshComponent5; // 0x268(0x08)
	struct UStaticMeshComponent* StaticMeshComponent2; // 0x270(0x08)
	struct UStaticMeshComponent* StaticMeshComponent1; // 0x278(0x08)
	struct USceneComponent* SharedRoot; // 0x280(0x08)
};

