// BlueprintGeneratedClass BP_GoblinDoor_02.BP_GoblinDoor_02_C
// Size: 0x290 (Inherited: 0x248)
struct ABP_GoblinDoor_02_C : AActor {
	struct UStaticMeshComponent* SM_GobMine_BrickWall_500Hx500W_A1; // 0x248(0x08)
	struct UStaticMeshComponent* SM_GobMine_Ground_500Hx500W_A; // 0x250(0x08)
	struct UStaticMeshComponent* SM_GobMine_BrickWall_500Hx500W_B3; // 0x258(0x08)
	struct UStaticMeshComponent* SM_GobMine_BrickWall_500Hx500W_B2; // 0x260(0x08)
	struct UStaticMeshComponent* SM_GobMine_BrickWall_500Hx500W_A; // 0x268(0x08)
	struct UStaticMeshComponent* SM_CastleDun_Jail_Wall_High; // 0x270(0x08)
	struct UStaticMeshComponent* SM_GobMine_BrickWall_500Hx500W_B1; // 0x278(0x08)
	struct UStaticMeshComponent* SM_GobMine_BrickWall_500Hx500W_B; // 0x280(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x288(0x08)
};

