// BlueprintGeneratedClass BP_GobMine_CaseWeapons_A.BP_GobMine_CaseWeapons_A_C
// Size: 0x310 (Inherited: 0x248)
struct ABP_GobMine_CaseWeapons_A_C : AActor {
	struct UDecalComponent* MI_CastleDun_Decal_Hay_A2; // 0x248(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Hay_A; // 0x250(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Large_002_W; // 0x258(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_OpenCrate_Medium_001_W; // 0x260(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_WP_GoblinDagger01; // 0x268(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Large_001_W; // 0x270(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_FoodBag_1bag_002_W; // 0x278(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_Int_BCProps_FoodBag_1bag_001_W; // 0x280(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Medium_C; // 0x288(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2WP_GoblinSword_01; // 0x290(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Medium_A; // 0x298(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Medium_003_W; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_OpenCrate_Medium_C1; // 0x2a8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_WP_Goblin_Spear; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Barrel_Short_001_W; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Medium_B; // 0x2c0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2WP_BattleAxe; // 0x2c8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_Barrel_001_W; // 0x2d0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_CastleDun_HayPile_C; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_CastleDun_HayPile_A; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_BCProps_FoodBag_3bag_001; // 0x2e8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_CastleDun_HayPile_D; // 0x2f0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_WP_Goblin_Shield; // 0x2f8(0x08)
	struct UBoxComponent* Box; // 0x300(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x308(0x08)
};

