// BlueprintGeneratedClass BP_Goblin_Pipes_03.BP_Goblin_Pipes_03_C
// Size: 0x348 (Inherited: 0x248)
struct ABP_Goblin_Pipes_03_C : AActor {
	struct UStaticMeshComponent* SM_GobMine_Pipe_Cap_B1; // 0x248(0x08)
	struct UStaticMeshComponent* SM_GobMine_Pipe_Cap_B; // 0x250(0x08)
	struct UStaticMeshComponent* SM_GobMine_PipeAddon_Handle_A; // 0x258(0x08)
	struct UStaticMeshComponent* SM_GobMine_PipeAddon_Valve_A1; // 0x260(0x08)
	struct UStaticMeshComponent* SM_GobMine_PipeAddon_Cap_D; // 0x268(0x08)
	struct UStaticMeshComponent* SM_GobMine_Pipe_100L_V1_A10; // 0x270(0x08)
	struct UStaticMeshComponent* SM_GobMine_Pipe_100L_V1_A9; // 0x278(0x08)
	struct UStaticMeshComponent* SM_GobMine_Pipe_Corner_V1_A8; // 0x280(0x08)
	struct UStaticMeshComponent* SM_GobMine_Pipe_Corner_V1_A7; // 0x288(0x08)
	struct UStaticMeshComponent* SM_GobMine_Pipe_TShape_V1_A2; // 0x290(0x08)
	struct UStaticMeshComponent* SM_GobMine_Pipe_100L_V1_A8; // 0x298(0x08)
	struct UStaticMeshComponent* SM_GobMine_Pipe_Corner_V1_A6; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_GobMine_Pipe_100L_V1_A7; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_GobMine_Pipe_Corner_V1_A5; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_GobMine_Pipe_100L_V1_A6; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_GobMine_Pipe_100L_V1_A5; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_GobMine_Pipe_Corner_V1_A4; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_GobMine_Pipe_100L_V1_A4; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_GobMine_Pipe_Corner_V1_A3; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_GobMine_Pipe_200L_V1_A3; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_GobMine_Pipe_TShape_V1_A1; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_GobMine_Pipe_100L_V1_A3; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_GobMine_Pipe_Corner_V1_A2; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_GobMine_Pipe_100L_V1_A2; // 0x300(0x08)
	struct UStaticMeshComponent* SM_GobMine_Pipe_100L_V1_A1; // 0x308(0x08)
	struct UStaticMeshComponent* SM_GobMine_Pipe_Corner_V1_A1; // 0x310(0x08)
	struct UStaticMeshComponent* SM_GobMine_Pipe_200L_V1_A1; // 0x318(0x08)
	struct UStaticMeshComponent* SM_GobMine_Pipe_TShape_V1_A; // 0x320(0x08)
	struct UStaticMeshComponent* SM_GobMine_Pipe_Corner_V1_A; // 0x328(0x08)
	struct UStaticMeshComponent* SM_GobMine_Pipe_100L_V1_B; // 0x330(0x08)
	struct UStaticMeshComponent* SM_GobMine_Pipe_100L_V1_A; // 0x338(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x340(0x08)
};

