// BlueprintGeneratedClass BP_Goblin_Crates_A.BP_Goblin_Crates_A_C
// Size: 0x288 (Inherited: 0x248)
struct ABP_Goblin_Crates_A_C : AActor {
	struct UStaticMeshComponent* SM_GoblinCrates_LG_Old_Metal; // 0x248(0x08)
	struct UStaticMeshComponent* SM_Goblin_Crates_Medium_Blue_Metal; // 0x250(0x08)
	struct UStaticMeshComponent* Crate2; // 0x258(0x08)
	struct UStaticMeshComponent* Crate; // 0x260(0x08)
	struct UStaticMeshComponent* Crate5; // 0x268(0x08)
	struct UStaticMeshComponent* Crate4; // 0x270(0x08)
	struct UStaticMeshComponent* Crate1; // 0x278(0x08)
	struct USceneComponent* SharedRoot; // 0x280(0x08)
};

