// BlueprintGeneratedClass BP_GobMine_Cart_C.BP_GobMine_Cart_C_C
// Size: 0x290 (Inherited: 0x248)
struct ABP_GobMine_Cart_C_C : AActor {
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_OpenCrate_Medium_A; // 0x248(0x08)
	struct UStaticMeshComponent* SM_GobMine_Train_A; // 0x250(0x08)
	struct UStaticMeshComponent* SM_WP_Goblin_Spear; // 0x258(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleDun_HayPile_E; // 0x260(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_WP_Goblin_Shield; // 0x268(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_GobMine_HayPile_Box_A; // 0x270(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_8WP_GoblinSword_02; // 0x278(0x08)
	struct USceneComponent* Scene; // 0x280(0x08)
	struct USceneComponent* SharedRoot; // 0x288(0x08)
};

