// BlueprintGeneratedClass BP_HamletClassB_Interior_M2.BP_HamletClassB_Interior_M2_C
// Size: 0x4c0 (Inherited: 0x248)
struct ABP_HamletClassB_Interior_M2_C : AActor {
	struct UDecalComponent* MI_HW_Decal_Wood_WornStep2; // 0x248(0x08)
	struct UDecalComponent* MI_HW_Decal_Wood_WornStep01; // 0x250(0x08)
	struct UDecalComponent* MI_HW_Decal_PlasterWear_03; // 0x258(0x08)
	struct UDecalComponent* MI_HW_Decal_Wood_WornPath_3; // 0x260(0x08)
	struct UDecalComponent* MI_HW_Decal_Wood_WornPath_01; // 0x268(0x08)
	struct UStaticMeshComponent* SM_HM_Picture_Frame_A3; // 0x270(0x08)
	struct UStaticMeshComponent* SM_HW_LRA_CatalogShelf_B4; // 0x278(0x08)
	struct UStaticMeshComponent* SM_HW_LRA_CatalogShelf_B3; // 0x280(0x08)
	struct UStaticMeshComponent* SM_HW_LRA_CatalogShelf_B2; // 0x288(0x08)
	struct UStaticMeshComponent* SM_HW_LRA_CatalogShelf_B; // 0x290(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Bottle_B; // 0x298(0x08)
	struct UStaticMeshComponent* SM_HM_2Hand_Standing_Mirror; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_HW_Laundry_Coatrack_B; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_HM_Dogweed_Table; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_HW_L_Chair_B; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_DisplayShelf_B4; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_DisplayShelf_B3; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_DisplayShelf_B2; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_DisplayShelf_B; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_HM_Quidditch_Counter; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Firepit_001; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_HW_Vase_B; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_Sanc_Planter_Jars_Potnr; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_HW_GT_Fireplace_Grate; // 0x300(0x08)
	struct UStaticMeshComponent* SM_HM_Picture_Frame_A2; // 0x308(0x08)
	struct UStaticMeshComponent* SM_ArmChair_Leather_4s2; // 0x310(0x08)
	struct UStaticMeshComponent* SM_ArmChair_Leather_4s; // 0x318(0x08)
	struct UStaticMeshComponent* SM_HamletB_M2_Interior_Rugs_Merged; // 0x320(0x08)
	struct UStaticMeshComponent* SM_HM_Picture_Frame_A; // 0x328(0x08)
	struct UStaticMeshComponent* SM_HM_Tea_TeaTins_E; // 0x330(0x08)
	struct UStaticMeshComponent* SM_HM_Tea_TeaTins_A; // 0x338(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Stool_001_D; // 0x340(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_FoodBag_1bag_003_W; // 0x348(0x08)
	struct UStaticMeshComponent* SM_BCProps_FoodBag_Top_001; // 0x350(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Piano; // 0x358(0x08)
	struct UStaticMeshComponent* SM_HW_Chair_Footstool_A; // 0x360(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Frame_B; // 0x368(0x08)
	struct UStaticMeshComponent* SM_BogCotton_B_Master; // 0x370(0x08)
	struct UStaticMeshComponent* SM_HW_TrashCan; // 0x378(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_PianoStool; // 0x380(0x08)
	struct UStaticMeshComponent* SM_HW_L_BookShelfFurniture2; // 0x388(0x08)
	struct UStaticMeshComponent* SM_HW_L_BookShelfFurniture; // 0x390(0x08)
	struct UStaticMeshComponent* SM_HM_FullBed_Queen_E; // 0x398(0x08)
	struct UStaticMeshComponent* SM_HW_TableDiv; // 0x3a0(0x08)
	struct UStaticMeshComponent* SM_HW_L_BookRow_Half_B2; // 0x3a8(0x08)
	struct UStaticMeshComponent* SM_HW_L_BookRow_Half_B; // 0x3b0(0x08)
	struct UStaticMeshComponent* SM_HM_Paper_A3; // 0x3b8(0x08)
	struct UStaticMeshComponent* SM_HM_Paper_A2; // 0x3c0(0x08)
	struct UStaticMeshComponent* SM_HM_Paper_A; // 0x3c8(0x08)
	struct UStaticMeshComponent* SM_HM_Paper_C; // 0x3d0(0x08)
	struct UStaticMeshComponent* SM_HW_TableDivSpreadA; // 0x3d8(0x08)
	struct UStaticMeshComponent* SM_HM_Neep_Pumpkin_B; // 0x3e0(0x08)
	struct UStaticMeshComponent* SM_HM_Neep_Pumpkin_D; // 0x3e8(0x08)
	struct UStaticMeshComponent* SM_HW_Vase_C; // 0x3f0(0x08)
	struct UStaticMeshComponent* SM_HW_Lamp_Floor_D2; // 0x3f8(0x08)
	struct UStaticMeshComponent* SM_HW_Lamp_Floor_D; // 0x400(0x08)
	struct UStaticMeshComponent* SM_HM_Paper_J; // 0x408(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_InkBottles_A2; // 0x410(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_InkBottles_A; // 0x418(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Basket_Square_Small_002_W; // 0x420(0x08)
	struct UStaticMeshComponent* SM_HW_Trash_CrumpledBall4; // 0x428(0x08)
	struct UStaticMeshComponent* SM_HW_Trash_CrumpledBall3; // 0x430(0x08)
	struct UStaticMeshComponent* SM_HW_Trash_CrumpledBall2; // 0x438(0x08)
	struct UStaticMeshComponent* SM_HW_Trash_CrumpledBall; // 0x440(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeStake_C3; // 0x448(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeStake_C2; // 0x450(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeStake_C; // 0x458(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Bottle_A2; // 0x460(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Bottle_A; // 0x468(0x08)
	struct UStaticMeshComponent* SM_Sanc_WindowCurtains_6x4_Potnr4; // 0x470(0x08)
	struct UStaticMeshComponent* SM_Sanc_WindowCurtains_6x4_Potnr3; // 0x478(0x08)
	struct UStaticMeshComponent* SM_Sanc_WindowCurtains_6x4_Potnr2; // 0x480(0x08)
	struct UStaticMeshComponent* SM_Sanc_WindowCurtains_6x4_Potnr; // 0x488(0x08)
	struct UStaticMeshComponent* SM_HamletB_M2_Interior_Music_Merged; // 0x490(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Bottle_D; // 0x498(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Bottle_C; // 0x4a0(0x08)
	struct UStaticMeshComponent* SM_HamletB_M2_Interior_Dishware_Merged; // 0x4a8(0x08)
	struct UStaticMeshComponent* SM_HM_Music_MusicStand1; // 0x4b0(0x08)
	struct USceneComponent* SharedRoot; // 0x4b8(0x08)
};

