// BlueprintGeneratedClass BP_Hamlet_Class_A5_Interior_A.BP_Hamlet_Class_A5_Interior_A_C
// Size: 0x3b8 (Inherited: 0x248)
struct ABP_Hamlet_Class_A5_Interior_A_C : AActor {
	struct UChildActorComponent* BP_HW_Nuts_Bowl_A; // 0x248(0x08)
	struct UDecalComponent* MI_HW_Decal_SootSmudge_6; // 0x250(0x08)
	struct UDecalComponent* MI_HW_Decal_PlasterWear_02_4; // 0x258(0x08)
	struct UStaticMeshComponent* SM_HamletA_05_A_Bottles_Merged; // 0x260(0x08)
	struct UStaticMeshComponent* SM_HamletA_05_A_Wood_Merged; // 0x268(0x08)
	struct UStaticMeshComponent* SM_HamletA_05_A_Rope_Merged; // 0x270(0x08)
	struct UStaticMeshComponent* SM_HM_Quidditch_Shelves_A; // 0x278(0x08)
	struct UStaticMeshComponent* SM_HM_Cauldron_Cauldron_B; // 0x280(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeCloth_B; // 0x288(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_DisplayShelf_A; // 0x290(0x08)
	struct UStaticMeshComponent* SM_DB_GR_Desk; // 0x298(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_BroomstickRack_A; // 0x2a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_HM_3Broom_Chair_D; // 0x2a8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_3Broom_Curtains; // 0x2b0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_FirePlaceCrane_B; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_HM_FireWood_Stack_B; // 0x2c0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_GEN_CedarChest_B; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_HM_GEN_EndTable_E; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_HM_Grandfather_Wall_Clock; // 0x2d8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_Quill_Shelf_A; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_HM_Table_A; // 0x2e8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_TeaShop_Pillows_B; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_HW_Curtain_Sm_B; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_HW_HB_Couch_B; // 0x300(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HW_SD_Armchair_B; // 0x308(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_8SM_Int_BCProps_Barrel_001_W; // 0x310(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Basket_Small_002_W; // 0x318(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Bucket_Small_002_W; // 0x320(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_Int_BCProps_FoodBag_1bag_001_W; // 0x328(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Jug_001_W; // 0x330(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_Jug_002_W; // 0x338(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_OpenCrate_Medium_B; // 0x340(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Pitchfork_001_W; // 0x348(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Pot_001_W; // 0x350(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Rake_001_W; // 0x358(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Shovel_001_W; // 0x360(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_WoodTub_Small_001_W; // 0x368(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_OVR_TableCloth_01; // 0x370(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_Stacking_Cauldron_E; // 0x378(0x08)
	struct UStaticMeshComponent* SM_HamletA_05_A_HangingPlants_Merged; // 0x380(0x08)
	struct UStaticMeshComponent* SM_HamletA_05_A_KitchenItems_Merged; // 0x388(0x08)
	struct UStaticMeshComponent* SM_HamletA_05_A_Book_Merged; // 0x390(0x08)
	struct UStaticMeshComponent* SM_HamletA_05_A_Rugs_Merged; // 0x398(0x08)
	struct UStaticMeshComponent* SM_HamletA_05_A_ShelfDressing_Merged1; // 0x3a0(0x08)
	struct UWorldFXAudioComponent* WorldFXAudio-Amb_3D_Cauldron_Boiling_Loop; // 0x3a8(0x08)
	struct USceneComponent* SharedRoot; // 0x3b0(0x08)
};

