// BlueprintGeneratedClass BP_Hamlet_Class_A2_Interior_B.BP_Hamlet_Class_A2_Interior_B_C
// Size: 0x3c0 (Inherited: 0x248)
struct ABP_Hamlet_Class_A2_Interior_B_C : AActor {
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_3Broom_Chair_B2; // 0x248(0x08)
	struct UStaticMeshComponent* SM_HM_TeaShop_Pillows_A2; // 0x250(0x08)
	struct UStaticMeshComponent* SM_HamletB_02_Merged_Potionbottles_02; // 0x258(0x08)
	struct UDecalComponent* MI_HW_Decal_PlasterWear_03_31; // 0x260(0x08)
	struct UDecalComponent* MI_HW_Decal_SootSmudge_29; // 0x268(0x08)
	struct UStaticMeshComponent* SM_HM_Cobweb_Chandelier_Chain_1ft_pTorus16_401; // 0x270(0x08)
	struct UStaticMeshComponent* SM_HM_HogsHead_Bench_C_397; // 0x278(0x08)
	struct UStaticMeshComponent* SM_HamletB_02_Merged_HangingProps; // 0x280(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_10SM_BCProps_Eyelet_A1; // 0x288(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CampB_5m_PostA1; // 0x290(0x08)
	struct UStaticMeshComponent* SM_CampB_NonClimbableWall_Cloth_4m_A1; // 0x298(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D1; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_D_GobMine_Chaines_SM_GobMine_Chaine_D1; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_D_GobMine_Chaines_SM_GobMine_Chaine_E1; // 0x2b0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Hamlet_Floor1; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_HM_Cauldron_Counter1; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_HM_FirePlaceCrane_A1; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_HM_FirePlaceSpit_B1; // 0x2d0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_HM_FireWood_Stack_B1; // 0x2d8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_3Broom_Chair_B1; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_HM_potions_cabinet_main1; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_HM_potions_cabinet_narrow1; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_HM_Potions_SmallTubesRack1; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_HM_Table_B1; // 0x300(0x08)
	struct UStaticMeshComponent* SM_HM_TeaShop_Pillows_A1; // 0x308(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_GEN_Mirror_A1; // 0x310(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_HM_BeastHorn_2B1; // 0x318(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HW_GenericTrunk_B1; // 0x320(0x08)
	struct UStaticMeshComponent* SM_HW_Magnifier_A1; // 0x328(0x08)
	struct UStaticMeshComponent* SM_HW_RugRoundA1; // 0x330(0x08)
	struct UStaticMeshComponent* SM_HW_Scale_A1; // 0x338(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_BroomStand_001_W1; // 0x340(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_ToolBox_001_W1; // 0x348(0x08)
	struct UStaticMeshComponent* SM_OVR_Armchair_02; // 0x350(0x08)
	struct UStaticMeshComponent* SM_HamletB_02_Merged_3BroomJars; // 0x358(0x08)
	struct UStaticMeshComponent* SM_HamletB_02_Merged_Baskets; // 0x360(0x08)
	struct UStaticMeshComponent* SM_HamletB_02_Merged_Books; // 0x368(0x08)
	struct UStaticMeshComponent* SM_HamletB_02_Merged_Cauldrons; // 0x370(0x08)
	struct UStaticMeshComponent* SM_HamletB_02_Merged_Kitchenware; // 0x378(0x08)
	struct UStaticMeshComponent* SM_HamletB_02_Merged_Paper; // 0x380(0x08)
	struct UStaticMeshComponent* SM_HamletB_02_Merged_Parcels; // 0x388(0x08)
	struct UStaticMeshComponent* SM_HamletB_02_Merged_Pots; // 0x390(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HW_3Broom_Table_E1; // 0x398(0x08)
	struct UStaticMeshComponent* SM_HamletB_02_Merged_Frames; // 0x3a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_OpenCrate_Medium_C1; // 0x3a8(0x08)
	struct UStaticMeshComponent* SM_HamletB_02_Merged_Tools; // 0x3b0(0x08)
	struct USceneComponent* SharedRoot; // 0x3b8(0x08)
};

