// BlueprintGeneratedClass BP_Hamlet_Class_A1_Interior_B.BP_Hamlet_Class_A1_Interior_B_C
// Size: 0x460 (Inherited: 0x248)
struct ABP_Hamlet_Class_A1_Interior_B_C : AActor {
	struct UStaticMeshComponent* SM_HamletA_01_Merged_HangingProps; // 0x248(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_HM_Pastry_A; // 0x250(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_7SM_Int_BCProps_Fork_001; // 0x258(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_OwlPost_Package_L; // 0x260(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HOG_BannerRod; // 0x268(0x08)
	struct UStaticMeshComponent* SM_CampA_Int_LargeCurtain_01A; // 0x270(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_9SM_HM_potions_shelf_floating; // 0x278(0x08)
	struct UStaticMeshComponent* Plane4; // 0x280(0x08)
	struct UStaticMeshComponent* SM_HW_3Broom_Table_C; // 0x288(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_CastleDun_Bookcase_Shelf_A_W_01; // 0x290(0x08)
	struct UStaticMeshComponent* Plane3; // 0x298(0x08)
	struct UStaticMeshComponent* Plane2; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_OvalFrameOrnate; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_Sanc_WindowCurtains_6x4_Dwiz; // 0x2b0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_Int_BCProps_FoodBag_1bag_001_W; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_HM_GEN_Mirror_A; // 0x2c0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_WoodTub_Medium_001_W; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_HW_SD_Armchair_A; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_HW_Scale_A; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_OpenCrate_Small_002_W; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_HM_TeaShop_Cake_D; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_HM_TeaShop_Cake_B; // 0x2f0(0x08)
	struct UStaticMeshComponent* Plane1; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_HW_RugRoundB; // 0x300(0x08)
	struct UStaticMeshComponent* SM_HM_Potions_SmallTubesRack; // 0x308(0x08)
	struct UStaticMeshComponent* Plane; // 0x310(0x08)
	struct UStaticMeshComponent* SM_HW_L_Chair_B; // 0x318(0x08)
	struct UStaticMeshComponent* SM_HW_HB_Couch_B; // 0x320(0x08)
	struct UStaticMeshComponent* SM_HW_L_BookRow_Large_C; // 0x328(0x08)
	struct UStaticMeshComponent* SM_HM_Table_B; // 0x330(0x08)
	struct UStaticMeshComponent* SM_HM_TeaShop_PastryStand_A; // 0x338(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_DisplayShelf_B; // 0x340(0x08)
	struct UStaticMeshComponent* SM_HM_Potions_Table; // 0x348(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_HM_Potions_HangingPot_Rope_A; // 0x350(0x08)
	struct UStaticMeshComponent* SM_HM_Potions_corner_table; // 0x358(0x08)
	struct UStaticMeshComponent* SM_HM_Grandfather_Wall_Clock; // 0x360(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_HM_Honeydukes_Chair_A; // 0x368(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_GEN_CedarChest_A; // 0x370(0x08)
	struct UStaticMeshComponent* SM_HM_FireWood_Stack_A; // 0x378(0x08)
	struct UStaticMeshComponent* SM_HM_FirePlaceCrane_B; // 0x380(0x08)
	struct UStaticMeshComponent* SM_HM_Cauldron_FireStoker_A; // 0x388(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Table_D; // 0x390(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_3Broom_PianoStool; // 0x398(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Piano; // 0x3a0(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_BroomstickRack_A; // 0x3a8(0x08)
	struct UStaticMeshComponent* SM_Desk_RAV_01; // 0x3b0(0x08)
	struct UStaticMeshComponent* SM_HamletA_01_Merged_3BroomsJars; // 0x3b8(0x08)
	struct UStaticMeshComponent* SM_HamletA_01_Merged_Pots; // 0x3c0(0x08)
	struct UStaticMeshComponent* SM_HamletA_01_Merged_ThreadSpool; // 0x3c8(0x08)
	struct UStaticMeshComponent* SM_HamletA_01_Merged_Kitchenware; // 0x3d0(0x08)
	struct UStaticMeshComponent* SM_HamletA_01_Merged_Food_02; // 0x3d8(0x08)
	struct UStaticMeshComponent* SM_HamletA_01_Merged_3BroomsBottles; // 0x3e0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_Cauldron_Cauldron_A; // 0x3e8(0x08)
	struct UStaticMeshComponent* SM_HamletA_01_Merged_Frames_02; // 0x3f0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_7SM_HW_Dishes_Goblet_A; // 0x3f8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_Stacking_Cauldron_E; // 0x400(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_Int_BCProps_CloseCrate_Large_001_W; // 0x408(0x08)
	struct UStaticMeshComponent* SM_HamletA_01_Merged_Parchment1; // 0x410(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_InkBottleWithQuills_A; // 0x418(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HW_GenericTrunk_A; // 0x420(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_Int_BCProps_Basket_Small_002_W; // 0x428(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_Barrel_001_W; // 0x430(0x08)
	struct UChildActorComponent* BP_HW_Apple_Bowl_Red; // 0x438(0x08)
	struct UChildActorComponent* BP_HW_Candy_Bowl_A; // 0x440(0x08)
	struct UChildActorComponent* BP_Spitton_Interact; // 0x448(0x08)
	struct UPhysicalResponseComponent* AppleBowl; // 0x450(0x08)
	struct USceneComponent* SharedRoot; // 0x458(0x08)
};

