// BlueprintGeneratedClass BP_Hamlet_Class_A1_Interior_A.BP_Hamlet_Class_A1_Interior_A_C
// Size: 0x350 (Inherited: 0x248)
struct ABP_Hamlet_Class_A1_Interior_A_C : AActor {
	struct UStaticMeshComponent* SM_HM_potions_cabinet_narrow1; // 0x248(0x08)
	struct UStaticMeshComponent* SM_HamletA_01_interior_A_Books_Merged; // 0x250(0x08)
	struct UStaticMeshComponent* SM_HamletA_01_interior_A_BottlesandJars_Merged; // 0x258(0x08)
	struct UStaticMeshComponent* SM_OVR_Table_01; // 0x260(0x08)
	struct UStaticMeshComponent* SM_HM_potions_cabinet_window; // 0x268(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Table_E_Chair_D; // 0x270(0x08)
	struct UStaticMeshComponent* SM_HM_potions_cabinet_narrow; // 0x278(0x08)
	struct UStaticMeshComponent* SM_Dresser_GRF; // 0x280(0x08)
	struct UStaticMeshComponent* SM_HW_SD_Couch_B; // 0x288(0x08)
	struct UStaticMeshComponent* SM_HW_SD_CR_Rug_B; // 0x290(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_WoodTub_Medium_001_W; // 0x298(0x08)
	struct UStaticMeshComponent* SM_Desk_GRF; // 0x2a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_Armchair_Leather_4s; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_HM_Deer_Skull_A; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Basket_Small_001_W; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_ToolBox_001_W; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Basket_Small_002_W; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Tongs_001; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Bellows_002_W; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Tongs_003; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Jug_002_W; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_Int_CastleDun_Kitchen_Pot_A; // 0x2f0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_Pot_002_W; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Pot_001_W; // 0x300(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_Int_BCProps_WoodPile_Large_001; // 0x308(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_OVR_Table_01_Stool; // 0x310(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Basket_Medium_001_W; // 0x318(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_Int_BCProps_Jug_001_W; // 0x320(0x08)
	struct UStaticMeshComponent* SM_HM_Gladrags_Hat_Stand_A; // 0x328(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_Stool_001_D; // 0x330(0x08)
	struct UChildActorComponent* Bottles2; // 0x338(0x08)
	struct UChildActorComponent* Bottles1; // 0x340(0x08)
	struct USceneComponent* SharedRoot; // 0x348(0x08)
};

