// BlueprintGeneratedClass BP_HamletC_Gen_C.BP_HamletC_Gen_C_C
// Size: 0x470 (Inherited: 0x257)
struct ABP_HamletC_Gen_C_C : ABP_Hamlet_Base_C {
	char pad_257[0x1]; // 0x257(0x01)
	struct UPointLightComponent* PointLight8; // 0x258(0x08)
	struct UPointLightComponent* PointLight7; // 0x260(0x08)
	struct UPointLightComponent* PointLight6; // 0x268(0x08)
	struct UPointLightComponent* PointLight5; // 0x270(0x08)
	struct UPointLightComponent* PointLight4; // 0x278(0x08)
	struct UPointLightComponent* PointLight3; // 0x280(0x08)
	struct UPointLightComponent* PointLight2; // 0x288(0x08)
	struct UPointLightComponent* PointLight1; // 0x290(0x08)
	struct UPointLightComponent* PointLight; // 0x298(0x08)
	struct UChildActorComponent* BP_WalkSpeedVolume6; // 0x2a0(0x08)
	struct UChildActorComponent* BP_WalkSpeedVolume5; // 0x2a8(0x08)
	struct UChildActorComponent* BP_WalkSpeedVolume4; // 0x2b0(0x08)
	struct UChildActorComponent* BP_WalkSpeedVolume3; // 0x2b8(0x08)
	struct UChildActorComponent* BP_WalkSpeedVolume2; // 0x2c0(0x08)
	struct UChildActorComponent* BP_WalkSpeedVolume1; // 0x2c8(0x08)
	struct UChildActorComponent* BP_WalkSpeedVolume; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_HM_GEN_C_int_windows_glass_a1; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_HM_GEN_C_int_stairs_B1; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_HM_GEN_C_ext_Side_Steps; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_HamletC_Gen_C_EXT_PL2_COL; // 0x2f0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_HM_WoodTrim_Cap_B; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_HM_Roof_Shingle_Face_E1; // 0x300(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_HM_Roof_Shingle_Face_D; // 0x308(0x08)
	struct UStaticMeshComponent* SM_HM_GEN_C_EXT_APL_COL1; // 0x310(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_HM_WindowsStyleC_Retangle_Double_B; // 0x318(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_WindowsStyleC_Retangle_Double_A; // 0x320(0x08)
	struct UStaticMeshComponent* SM_HM_GEN_C_int_wood1; // 0x328(0x08)
	struct UStaticMeshComponent* SM_HM_GEN_C_EXT_PL_Steps_COL1; // 0x330(0x08)
	struct UStaticMeshComponent* SM_HM_GEN_C_int_floor1; // 0x338(0x08)
	struct UStaticMeshComponent* SM_HM_GEN_C_ext_roof_trim1; // 0x340(0x08)
	struct UStaticMeshComponent* SM_HM_Gen_C_INT1_APL_COL1; // 0x348(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_59SM_HM_Roof_Shingle_Pitch_A1; // 0x350(0x08)
	struct UStaticMeshComponent* SM_HM_Gen_C_INT2_APL_COL1; // 0x358(0x08)
	struct UStaticMeshComponent* SM_HM_Gen_C_INT3_APL_COL1; // 0x360(0x08)
	struct UStaticMeshComponent* SM_HM_GEN_C_ext_Stairs; // 0x368(0x08)
	struct UStaticMeshComponent* SM_HM_Gen_C_INT2_Floor_PL_COL1; // 0x370(0x08)
	struct UStaticMeshComponent* SM_HM_GEN_C_ext_trim1; // 0x378(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_7SM_HM_Roof_Shingle_Face_A; // 0x380(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_24SM_HM_WoodTrim_Cap_C; // 0x388(0x08)
	struct UStaticMeshComponent* SM_HM_GEN_C_EXT_PL_COL1; // 0x390(0x08)
	struct UStaticMeshComponent* SM_HM_GEN_C_ext_walls1; // 0x398(0x08)
	struct UStaticMeshComponent* SM_HamletC_GenC_int_walls_3; // 0x3a0(0x08)
	struct UStaticMeshComponent* SM_HM_Stone_Trim_Flat_1sided_E1; // 0x3a8(0x08)
	struct UStaticMeshComponent* SM_HM_Gen_C_INT3_PL_COL1; // 0x3b0(0x08)
	struct UStaticMeshComponent* SM_HM_Stone_Trim_Corner_1sided_F1; // 0x3b8(0x08)
	struct UStaticMeshComponent* SM_HM_Stone_Trim_Flat_1sided_H1; // 0x3c0(0x08)
	struct UStaticMeshComponent* SM_HM_GEN_C_ext_windows_glass_a1; // 0x3c8(0x08)
	struct UStaticMeshComponent* SM_HM_GEN_C_ext_windows1; // 0x3d0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_Roof_Shingle_Face_G; // 0x3d8(0x08)
	struct UStaticMeshComponent* SM_HM_Stone_FrontSteps_A1; // 0x3e0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_HM_Stone_trim_corner_1sided_A; // 0x3e8(0x08)
	struct UStaticMeshComponent* SM_HM_GEN_C_EXT_Decals1; // 0x3f0(0x08)
	struct UStaticMeshComponent* SM_HamletC_Gen_C_INT2_PL_COL; // 0x3f8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_HM_Roof_Shingle_Pitch_E; // 0x400(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_HM_Stone_Trim_Corner_1sided_D; // 0x408(0x08)
	struct UStaticMeshComponent* SM_HM_Gen_C_INT1_PL_COL1; // 0x410(0x08)
	struct UStaticMeshComponent* SM_HM_Gen_C_INT3_Floor_PL_COL1; // 0x418(0x08)
	struct UStaticMeshComponent* SM_HM_Gen_C_INT1_Floor_PL_COL1; // 0x420(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_HM_Stone_trim_corner_1sided_C; // 0x428(0x08)
	struct UStaticMeshComponent* SM_HM_GEN_C_ext_roof1; // 0x430(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_HM_Stone_Trim_Corner_1sided_E; // 0x438(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_40SM_HM_Roof_Shingle_Pitch_B; // 0x440(0x08)
	struct UStaticMeshComponent* SM_HM_GEN_C_ext_chimney1; // 0x448(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_HM_Stone_trim_corner_1sided_B; // 0x450(0x08)
	struct UStaticMeshComponent* SM_HM_Stone_trim_flat_2sided_B1; // 0x458(0x08)
	struct UChildActorComponent* ChildActor1; // 0x460(0x08)
	struct UChildActorComponent* ChildActor; // 0x468(0x08)
};

