// BlueprintGeneratedClass BP_Hamlet_Class_A_09.BP_Hamlet_Class_A_09_C
// Size: 0x470 (Inherited: 0x257)
struct ABP_Hamlet_Class_A_09_C : ABP_Hamlet_Base_C {
	char pad_257[0x1]; // 0x257(0x01)
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x258(0x08)
	struct UStaticMeshComponent* SM_HW_Doorway_Closet_A; // 0x260(0x08)
	struct UStaticMeshComponent* SM_COL_INT_PL; // 0x268(0x08)
	struct UStaticMeshComponent* SM_COL_EXT_APL; // 0x270(0x08)
	struct UStaticMeshComponent* SM_COL_EXT_PL; // 0x278(0x08)
	struct UStaticMeshComponent* SM_COL_INT_APL; // 0x280(0x08)
	struct UDecalComponent* MI_CastleDun_FrescoCreatures_A_33; // 0x288(0x08)
	struct UDecalComponent* MI_HW_Decal_Rock3_31; // 0x290(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Edge_B_29; // 0x298(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Damage_A_27; // 0x2a0(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Damage_A_25; // 0x2a8(0x08)
	struct UDecalComponent* MI_HW_Decal_RockDamage_23; // 0x2b0(0x08)
	struct UDecalComponent* MI_HW_Decal_Rock2_21; // 0x2b8(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Damage_A_19; // 0x2c0(0x08)
	struct UDecalComponent* MI_HW_Decal_Rock1_17; // 0x2c8(0x08)
	struct UDecalComponent* MI_CastleDun_FrescoCreatures_H_15; // 0x2d0(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_C_13; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_3_Door_A_INT_EXT; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_Hamlet_Chimney_A; // 0x2e8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_8SM_CastleRuins_2_Relief_L_a; // 0x2f0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_18SM_CastleRuins_3_Relief_L_b_INT; // 0x2f8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_10SM_CastleRuins_3_Relief_I_a_INT; // 0x300(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_CastleRuins_3_Broken_K; // 0x308(0x08)
	struct UStaticMeshComponent* SM_HamletA_09_Roof_EXT; // 0x310(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_7SM_CastleRuins_3_Wall_L; // 0x318(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_CastleRuins_3_Broken_M_c_INT_EXT; // 0x320(0x08)
	struct UStaticMeshComponent* SM_HamletA_09_Walls_INT; // 0x328(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_10SM_CastleRuins_3_Broken_B_a; // 0x330(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_CastleRuins_3_Broken_O_B_INT_EXT; // 0x338(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_CastleRuins_3_Wall_A_b1; // 0x340(0x08)
	struct UStaticMeshComponent* SM_HamletA_09_Trims_EXT; // 0x348(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_CastleRuins_3_Relief_L_a; // 0x350(0x08)
	struct UStaticMeshComponent* SM_HamletA_09_Walls_EXT; // 0x358(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_CastleRuins_3_TheSteps_B; // 0x360(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_3_Wall_M_a; // 0x368(0x08)
	struct UStaticMeshComponent* SM_HamletA_09_Roof_INT; // 0x370(0x08)
	struct UStaticMeshComponent* SM_HamletA_09_Windows_Frame_INT_EXT; // 0x378(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_3_Wall_L_a; // 0x380(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_3_RoofShingle_A3; // 0x388(0x08)
	struct UStaticMeshComponent* SM_HamletA_09_Rockedge; // 0x390(0x08)
	struct UStaticMeshComponent* SM_HamletA_09_Trims_INT; // 0x398(0x08)
	struct UStaticMeshComponent* SM_HamletA_09_Windows_Glass_EXT; // 0x3a0(0x08)
	struct UStaticMeshComponent* SM_HamletA_09_Windows_Glass_Int; // 0x3a8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_2_Relief_F_d; // 0x3b0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_3_Broken_E; // 0x3b8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_3_Wall_H; // 0x3c0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_CastleRuins_2_TheSlate_C; // 0x3c8(0x08)
	struct UStaticMeshComponent* SM_HamletA_09_Floor_INT; // 0x3d0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_CastleRuins_3_Wall_A_b; // 0x3d8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_3_Door_INT_EXT; // 0x3e0(0x08)
	struct UStaticMeshComponent* SM_HamletA_09_Fireplace_INT; // 0x3e8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_2_Relief_F_a; // 0x3f0(0x08)
	struct UChildActorComponent* BP_WalkSpeedVolume; // 0x3f8(0x08)
	struct UPointLightComponent* Window_Light5; // 0x400(0x08)
	struct UPointLightComponent* Window_Light4; // 0x408(0x08)
	struct UPointLightComponent* Window_Light3; // 0x410(0x08)
	struct UPointLightComponent* Window_Light2; // 0x418(0x08)
	struct UPointLightComponent* Window_Light1; // 0x420(0x08)
	struct UPointLightComponent* Window_Light; // 0x428(0x08)
	struct UChildActorComponent* BP_Door_Template; // 0x430(0x08)
	struct UChildActorComponent* BP_Door_Template1; // 0x438(0x08)
	struct USceneComponent* Scene; // 0x440(0x08)
	struct USceneComponent* Collision; // 0x448(0x08)
	struct USceneComponent* Ruins; // 0x450(0x08)
	struct UCameraStackVolumeComponent* CameraStackVolume2; // 0x458(0x08)
	struct UBoxComponent* Box3; // 0x460(0x08)
	struct USceneComponent* SharedRoot; // 0x468(0x08)

	void UserConstructionScript(); // Function BP_Hamlet_Class_A_09.BP_Hamlet_Class_A_09_C.UserConstructionScript // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void ReceiveBeginPlay(); // Function BP_Hamlet_Class_A_09.BP_Hamlet_Class_A_09_C.ReceiveBeginPlay // (Event|Protected|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_BP_Hamlet_Class_A_09(int32_t EntryPoint); // Function BP_Hamlet_Class_A_09.BP_Hamlet_Class_A_09_C.ExecuteUbergraph_BP_Hamlet_Class_A_09 // (Final|UbergraphFunction) // @ game+0x38a7480
};

