// BlueprintGeneratedClass BP_HW_K_PR_Cauldron_03C.BP_HW_K_PR_Cauldron_03C_C
// Size: 0x2c0 (Inherited: 0x248)
struct ABP_HW_K_PR_Cauldron_03C_C : AActor {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x248(0x08)
	struct UObjectStateComponent* ObjectState; // 0x250(0x08)
	struct UPhysicalResponseComponent* PhysResp; // 0x258(0x08)
	struct UStaticMeshComponent* SM_HW_K_PR_Cauldron_B_3_07; // 0x260(0x08)
	struct UStaticMeshComponent* SM_HW_K_PR_Cauldron_B_3_06; // 0x268(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse4; // 0x270(0x08)
	struct UStaticMeshComponent* SM_HW_K_PR_Cauldron_B_3_04; // 0x278(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse5; // 0x280(0x08)
	struct UStaticMeshComponent* SM_HW_K_PR_Cauldron_B_3_09; // 0x288(0x08)
	struct UStaticMeshComponent* SM_HW_K_PR_Cauldron_B_3_08; // 0x290(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse1; // 0x298(0x08)
	struct UStaticMeshComponent* SM_HW_K_PR_Cauldron_B_3_05; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_HW_K_PR_Cauldron_B_3_03; // 0x2a8(0x08)
	struct UPhysicalResponseComponent* Phys response main; // 0x2b0(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x2b8(0x08)

	void ObjectPhysicalResponseImpact(float ImpactIntensity, struct FName SpellName, struct FName ResponseConfigName, struct FVector& ImpactLocation); // Function BP_HW_K_PR_Cauldron_03C.BP_HW_K_PR_Cauldron_03C_C.ObjectPhysicalResponseImpact // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_BP_HW_K_PR_Cauldron_03C(int32_t EntryPoint); // Function BP_HW_K_PR_Cauldron_03C.BP_HW_K_PR_Cauldron_03C_C.ExecuteUbergraph_BP_HW_K_PR_Cauldron_03C // (Final|UbergraphFunction) // @ game+0x38a7480
};

