// BlueprintGeneratedClass BP_Hamlet_Brewery_POI.BP_Hamlet_Brewery_POI_C
// Size: 0x490 (Inherited: 0x248)
struct ABP_Hamlet_Brewery_POI_C : AActor {
	struct UStaticMeshComponent* SM_MERGED_5m_PostA2; // 0x248(0x08)
	struct UStaticMeshComponent* SM_MERGED_PlankA_COL3; // 0x250(0x08)
	struct UStaticMeshComponent* SM_MERGED_PlankA_COL2; // 0x258(0x08)
	struct UStaticMeshComponent* SM_MERGED_PlankA_COL1; // 0x260(0x08)
	struct UStaticMeshComponent* SM_MERGED_BroomStone_Trim_Set_SHORT; // 0x268(0x08)
	struct UStaticMeshComponent* SM_MERGED_BroomStone_Trim_Set_MED; // 0x270(0x08)
	struct UStaticMeshComponent* SM_MERGED_WoodenBeamC; // 0x278(0x08)
	struct UStaticMeshComponent* SM_MERGED_Trim_WoodDecor_B; // 0x280(0x08)
	struct UStaticMeshComponent* SM_MERGED_Trim_WoodDecor_A; // 0x288(0x08)
	struct UStaticMeshComponent* SM_MERGED_RoofTile; // 0x290(0x08)
	struct UStaticMeshComponent* SM_MERGED_PlankB; // 0x298(0x08)
	struct UStaticMeshComponent* SM_MERGED_PlankA; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_MERGED_RopeLashing_B; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_MERGED_RopeLashing_A; // 0x2b0(0x08)
	struct UPointLightComponent* PointLight9; // 0x2b8(0x08)
	struct UPointLightComponent* PointLight8; // 0x2c0(0x08)
	struct UPointLightComponent* PointLight7; // 0x2c8(0x08)
	struct UPointLightComponent* PointLight6; // 0x2d0(0x08)
	struct UPointLightComponent* PointLight5; // 0x2d8(0x08)
	struct UPointLightComponent* PointLight4; // 0x2e0(0x08)
	struct UPointLightComponent* PointLight3; // 0x2e8(0x08)
	struct UPointLightComponent* PointLight2; // 0x2f0(0x08)
	struct UPointLightComponent* PointLight1; // 0x2f8(0x08)
	struct UPointLightComponent* PointLight; // 0x300(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* SM_HM_Honeydukes_barrel_B (HISMA)_HierarchicalInstancedStaticMesh; // 0x308(0x08)
	struct UStaticMeshComponent* SM_HM_Door5a_StaticMeshComponent0; // 0x310(0x08)
	struct UStaticMeshComponent* SM_HM_Dogweed_HangingPots_B_StaticMeshComponent0; // 0x318(0x08)
	struct UStaticMeshComponent* SM_HM_Dogweed_HangingPots_A_StaticMeshComponent0; // 0x320(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* SM_HM_Curb_Stone_B (HISMA)_HierarchicalInstancedStaticMesh; // 0x328(0x08)
	struct UStaticMeshComponent* SM_HM_BLDG_TeaShop_Flowers_D_StaticMeshComponent0; // 0x330(0x08)
	struct UStaticMeshComponent* SM_HM_BarrelStack_Large_B7_StaticMeshComponent0; // 0x338(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* SM_HM_3Broom_Stone_P (HISMA)_HierarchicalInstancedStaticMesh; // 0x340(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* SM_HM_3Broom_Stone_K (HISMA)_HierarchicalInstancedStaticMesh; // 0x348(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* SM_HM_3Broom_ext_trim_stone (HISMA)_HierarchicalInstancedStaticMesh; // 0x350(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* SM_HM_3Broom_ext_barrels_sign (HISMA)_HierarchicalInstancedStaticMesh; // 0x358(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_ext_barrels_StaticMeshComponent0; // 0x360(0x08)
	struct UStaticMeshComponent* SM_Hamlet_Brewery_Wood_Trims_Ext_StaticMeshComponent0; // 0x368(0x08)
	struct UStaticMeshComponent* SM_Hamlet_Brewery_Windows_Ext_StaticMeshComponent0; // 0x370(0x08)
	struct UStaticMeshComponent* SM_Hamlet_Brewery_Walls_Int_StaticMeshComponent0; // 0x378(0x08)
	struct UStaticMeshComponent* SM_Hamlet_Brewery_Walls_Ext_StaticMeshComponent0; // 0x380(0x08)
	struct UStaticMeshComponent* SM_Hamlet_Brewery_Supports_Ext_StaticMeshComponent0; // 0x388(0x08)
	struct UStaticMeshComponent* SM_Hamlet_Brewery_StoneSteps_Ext_StaticMeshComponent0; // 0x390(0x08)
	struct UStaticMeshComponent* SM_Hamlet_Brewery_Roof_Ext_StaticMeshComponent0; // 0x398(0x08)
	struct UStaticMeshComponent* SM_Hamlet_Brewery_Platform_D_Ext_StaticMeshComponent0; // 0x3a0(0x08)
	struct UStaticMeshComponent* SM_Hamlet_Brewery_Platform_C_Ext_StaticMeshComponent0; // 0x3a8(0x08)
	struct UStaticMeshComponent* SM_Hamlet_Brewery_Platform_B_Ext_StaticMeshComponent0; // 0x3b0(0x08)
	struct UStaticMeshComponent* SM_Hamlet_Brewery_Platform_A_Ext_StaticMeshComponent0; // 0x3b8(0x08)
	struct UStaticMeshComponent* SM_Hamlet_Brewery_Metal_Ext_StaticMeshComponent0; // 0x3c0(0x08)
	struct UStaticMeshComponent* SM_Hamlet_Brewery_Hoist_StaticMeshComponent0; // 0x3c8(0x08)
	struct UStaticMeshComponent* SM_Hamlet_Brewery_Glass_Ext_StaticMeshComponent0; // 0x3d0(0x08)
	struct UStaticMeshComponent* SM_Hamlet_Brewery_Foundation_Ext_StaticMeshComponent0; // 0x3d8(0x08)
	struct UStaticMeshComponent* SM_Hamlet_Brewery_Decals_Ext_StaticMeshComponent0; // 0x3e0(0x08)
	struct UStaticMeshComponent* SM_Hamlet_Brewery_Chimney_Ext_StaticMeshComponent0; // 0x3e8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* SM_HamletB_D_DoorFrame (HISMA)_HierarchicalInstancedStaticMesh; // 0x3f0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* SM_Dun_PurpleMooreGrass_A_Master (HISMA)_HierarchicalInstancedStaticMesh; // 0x3f8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* SM_Dun_FloweringWeed_A (HISMA)_HierarchicalInstancedStaticMesh; // 0x400(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* SM_Dun_Fern_Var1_Master (HISMA)_HierarchicalInstancedStaticMesh; // 0x408(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* SM_Cav_Dungeon_MiningLamp_Bracket_01 (HISMA)_HierarchicalInstancedStaticMesh; // 0x410(0x08)
	struct UStaticMeshComponent* SM_CampB_2m_PlankD_StaticMeshComponent0; // 0x418(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeSpan_J_StaticMeshComponent0; // 0x420(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* SM_BCProps_RopeSpan7m_Flags_A (HISMA)_HierarchicalInstancedStaticMesh; // 0x428(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeLashing_A_StaticMeshComponent0; // 0x430(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeHanging_A_StaticMeshComponent0; // 0x438(0x08)
	struct USkeletalMeshComponent* SK_Rag_Window_4_SkeletalMeshComponent0; // 0x440(0x08)
	struct USkeletalMeshComponent* SK_Rag_Window_3_SkeletalMeshComponent0; // 0x448(0x08)
	struct USkeletalMeshComponent* SK_Rag_Window_02_SkeletalMeshComponent0; // 0x450(0x08)
	struct USkeletalMeshComponent* SK_Rag_Fence_02_SkeletalMeshComponent0; // 0x458(0x08)
	struct USkeletalMeshComponent* SK_Rag_Fence_2_SkeletalMeshComponent0; // 0x460(0x08)
	struct USkeletalMeshComponent* SK_Rag_Fence_01_SkeletalMeshComponent0; // 0x468(0x08)
	struct UStaticMeshComponent* BP_CampB_4m_StairsA_SM_CampB_5x2_Wall_CoverA; // 0x470(0x08)
	struct USceneComponent* BP_CampB_4m_StairsA_DefaultSceneRoot; // 0x478(0x08)
	struct UObjectStateComponent* BP_CampB_4m_StairsA_ObjectState; // 0x480(0x08)
	struct USceneComponent* SharedRoot; // 0x488(0x08)
};

