// BlueprintGeneratedClass BP_Hamlet_Vendor_Hunter_02.BP_Hamlet_Vendor_Hunter_02_C
// Size: 0x360 (Inherited: 0x248)
struct ABP_Hamlet_Vendor_Hunter_02_C : AActor {
	struct UStaticMeshComponent* SM_Hamlet_Vendor_Hunter_02_Merged_03; // 0x248(0x08)
	struct UStaticMeshComponent* SM_Hamlet_Vendor_Hunter_02_Merged_02; // 0x250(0x08)
	struct UStaticMeshComponent* SM_Hamlet_Vendor_Hunter_02_Merged_01; // 0x258(0x08)
	struct UStaticMeshComponent* SM_WE_Chalkboard_DefenceDarkArts_Decal_01; // 0x260(0x08)
	struct UStaticMeshComponent* SM_Hamlet_Vendor_ChalkBoardSign; // 0x268(0x08)
	struct UStaticMeshComponent* SM_WP_Troll_Club_StaticMeshComponent0; // 0x270(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Stool_001_D3_StaticMeshComponent0; // 0x278(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Barrel_001_W3_StaticMeshComponent0; // 0x280(0x08)
	struct UStaticMeshComponent* SM_HW_DADA_DragonBones_A_StaticMeshComponent0; // 0x288(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeSpan7m_Flags_B_StaticMeshComponent0; // 0x290(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeSpan7m_Flags_A_StaticMeshComponent0; // 0x298(0x08)
	struct UStaticMeshComponent* SM_Leg_4_StaticMeshComponent0; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_Leg_3_StaticMeshComponent0; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_Leg_2_StaticMeshComponent0; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_Gear_Bag_StaticMeshComponent0; // 0x2b8(0x08)
	struct UDecalComponent* MI_HM_Decal_Dirt_C1_NewDecalComponent; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Lantern_3_StaticMeshComponent0; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_HW_DADA_DragonBones_K_StaticMeshComponent0; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_HM_Honeydukes_cash_register2_StaticMeshComponent0; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_Hamlet_Vendor_Water_StaticMeshComponent0; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_BCProps_FloorCloth_A2_StaticMeshComponent0; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_HW_DAO_DriedWolfBaby_A3_StaticMeshComponent0; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_Potion_FlobberwormMucus3_StaticMeshComponent0; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_CampA_Int_BedRug_01A_StaticMeshComponent0; // 0x300(0x08)
	struct UStaticMeshComponent* SM_Int_CastleDun_TableLong2_StaticMeshComponent0; // 0x308(0x08)
	struct UStaticMeshComponent* SM_Hamlet_Vendor_Frame_02_StaticMeshComponent0; // 0x310(0x08)
	struct UStaticMeshComponent* SM_HW_BS_Trap_C2_StaticMeshComponent0; // 0x318(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Medium_001_W2_StaticMeshComponent0; // 0x320(0x08)
	struct UStaticMeshComponent* SM_sanctum_Scrolls_D3_StaticMeshComponent0; // 0x328(0x08)
	struct UStaticMeshComponent* SM_HW_BS_Trap_A2_StaticMeshComponent0; // 0x330(0x08)
	struct UStaticMeshComponent* SM_Prop_Barrel_Unbreakable_B3_StaticMeshComponent0; // 0x338(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_WoodTub_Large_001_W3_StaticMeshComponent0; // 0x340(0x08)
	struct UStaticMeshComponent* SM_Hamlet_Vendor_Tarp_02_StaticMeshComponent0; // 0x348(0x08)
	struct USceneComponent* Scene; // 0x350(0x08)
	struct USceneComponent* SharedRoot; // 0x358(0x08)
};

