// BlueprintGeneratedClass BP_Hamlet_Vendor_Potions_01.BP_Hamlet_Vendor_Potions_01_C
// Size: 0x360 (Inherited: 0x248)
struct ABP_Hamlet_Vendor_Potions_01_C : AActor {
	struct UWorldFXAudioComponent* WorldFXAudio-Amb_3D_Fire_Magic_Loop; // 0x248(0x08)
	struct UWorldFXAudioComponent* WorldFXAudio-Amb_3D_Cauldron_Boiling_Loop_3; // 0x250(0x08)
	struct UWorldFXAudioComponent* WorldFXAudio-Amb_3D_Cauldron_Boiling_Loop_2; // 0x258(0x08)
	struct UStaticMeshComponent* SM_Hamlet_Vendor_Potions_Merged_02; // 0x260(0x08)
	struct UStaticMeshComponent* SM_Hamlet_Vendor_Potions_Merged_01; // 0x268(0x08)
	struct UDecalComponent* Decal2; // 0x270(0x08)
	struct UDecalComponent* Decal1; // 0x278(0x08)
	struct UDecalComponent* Decal; // 0x280(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Spoon_002; // 0x288(0x08)
	struct UStaticMeshComponent* SM_Potion_LionfishSpines_01; // 0x290(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeSpan7m_Flags_A; // 0x298(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeKnot_A; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_WE_Chalkboard_Decal_02; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_BCProps_Tentpole_A; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_Hamlet_Vendor_ChalkBoardSign; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_HW_Pillow_B_StaticMeshComponent0; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Chair_C2_StaticMeshComponent0; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_HW_ParchmentScroll_TableLong_A_StaticMeshComponent0; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_HM_NeepCart2_StaticMeshComponent0; // 0x2d8(0x08)
	struct UParticleSystemComponent* VFX_P_Potion_Brewing_Green2_ParticleSystemComponent0; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_CashRegister_2_StaticMeshComponent0; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_VAL_Loot_Pottery_MinitureA5_StaticMeshComponent0; // 0x2f0(0x08)
	struct UStaticMeshComponent* Water4_StaticMeshComponent0; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_BCProps_FloorCloth_B_StaticMeshComponent0; // 0x300(0x08)
	struct UStaticMeshComponent* SM_BCProps_FloorCloth_A3_StaticMeshComponent0; // 0x308(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Table_D2_StaticMeshComponent0; // 0x310(0x08)
	struct UStaticMeshComponent* SM_Hamlet_Vendor_Tarp_01_StaticMeshComponent0; // 0x318(0x08)
	struct UStaticMeshComponent* SM_Hamlet_Vendor_Frame_01_StaticMeshComponent0; // 0x320(0x08)
	struct UParticleSystemComponent* VFX_P_Fire_Torch_Lrg_Blue_ParticleSystemComponent0; // 0x328(0x08)
	struct UParticleSystemComponent* VFX_P_Potion_Brewing_Green_ParticleSystemComponent0; // 0x330(0x08)
	struct UStaticMeshComponent* SM_Sanc_GlassDistilery_01A_StaticMeshComponent0; // 0x338(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_OpenCrate_Small_001_W4_StaticMeshComponent0; // 0x340(0x08)
	struct UStaticMeshComponent* SM_BCProps_CloseCrate_Medium_D3_StaticMeshComponent0; // 0x348(0x08)
	struct USceneComponent* Scene; // 0x350(0x08)
	struct USceneComponent* SharedRoot; // 0x358(0x08)
};

