// BlueprintGeneratedClass BP_HamletC_Gen_C_Int.BP_HamletC_Gen_C_Int_C
// Size: 0x380 (Inherited: 0x248)
struct ABP_HamletC_Gen_C_Int_C : AActor {
	struct UStaticMeshComponent* SM_HM_Gen_C_INT2_Ramp_PL_COL; // 0x248(0x08)
	struct UStaticMeshComponent* SM_HamletC_Gen_C_Interior_Dishware_Old_Merged; // 0x250(0x08)
	struct UStaticMeshComponent* SM_HamletC_Gen_C_Interior_Spindle_Merged; // 0x258(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_Cauldron_Cauldron_D; // 0x260(0x08)
	struct UStaticMeshComponent* SM_OVR_KitchenHutch_01; // 0x268(0x08)
	struct UStaticMeshComponent* SM_HW_L_Book_Small_C; // 0x270(0x08)
	struct UStaticMeshComponent* SM_HW_Laundry_Chair_A; // 0x278(0x08)
	struct UStaticMeshComponent* SM_OVR_ChairWood_02; // 0x280(0x08)
	struct UStaticMeshComponent* SM_OVR_Armchair_01; // 0x288(0x08)
	struct UStaticMeshComponent* SM_HW_Fireplace_Coals_Sm_B; // 0x290(0x08)
	struct UStaticMeshComponent* SM_HM_Cauldron_Cauldrons_N; // 0x298(0x08)
	struct UStaticMeshComponent* SM_HM_Picture_Frame_F; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_HM_Wardrobes_D; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_HM_Cauldron_Cauldron_C; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_HM_Salon_Hat_Rack; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_Desk_A; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_Desk; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_HM_2Hand_Standing_Mirror; // 0x2d0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_Picture_Frame_A1; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_HM_HogsHead_Fireplace; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_HM_Grandfather_Wall_Clock; // 0x2e8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_HM_GEN_EndTable_C; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_HM_GEN_C_int_stairs; // 0x2f8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_Picture_Frame_A; // 0x300(0x08)
	struct UStaticMeshComponent* SM_HM_Picture_Frame_J; // 0x308(0x08)
	struct UStaticMeshComponent* SM_HM_Picture_Frame_A; // 0x310(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Rug_B; // 0x318(0x08)
	struct UStaticMeshComponent* SM_HM_Honeydukes_Table_A; // 0x320(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_PianoStool; // 0x328(0x08)
	struct UStaticMeshComponent* SM_HM_FullBed_Queen_F; // 0x330(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_3Broom_Rug_A; // 0x338(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Couch_A; // 0x340(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_HM_3Broom_Chair_D; // 0x348(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_HM_2Hand_Wig_Stand_Female; // 0x350(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HW_L_BookRow_Half_A; // 0x358(0x08)
	struct UStaticMeshComponent* SM_HW_TallBookStack_B; // 0x360(0x08)
	struct UStaticMeshComponent* SM_HW_Trashcan_Simple1; // 0x368(0x08)
	struct UChildActorComponent* BP_HW_Piano_Interact; // 0x370(0x08)
	struct USceneComponent* SharedRoot; // 0x378(0x08)
};

