// BlueprintGeneratedClass BP_Hamlet_Vendor_Hunter_01.BP_Hamlet_Vendor_Hunter_01_C
// Size: 0x308 (Inherited: 0x248)
struct ABP_Hamlet_Vendor_Hunter_01_C : AActor {
	struct UStaticMeshComponent* SM_Hamlet_Vendor_Hunter_Merged_03; // 0x248(0x08)
	struct UStaticMeshComponent* SM_Hamlet_Vendor_Hunter_Merged_02; // 0x250(0x08)
	struct UStaticMeshComponent* SM_Hamlet_Vendor_Hunter_Merged_01; // 0x258(0x08)
	struct UStaticMeshComponent* SM_WE_Chalkboard_DefenceDarkArts_Decal_01; // 0x260(0x08)
	struct UStaticMeshComponent* SM_Hamlet_Vendor_ChalkBoardSign; // 0x268(0x08)
	struct UStaticMeshComponent* SM_WP_Troll_Club_StaticMeshComponent0; // 0x270(0x08)
	struct UParticleSystemComponent* P_fireflies_ParticleSystemComponent0; // 0x278(0x08)
	struct UDecalComponent* MI_HM_Decal_Dirt_C1_NewDecalComponent; // 0x280(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Lantern_3_StaticMeshComponent0; // 0x288(0x08)
	struct UStaticMeshComponent* SM_HM_Honeydukes_cash_register2_StaticMeshComponent0; // 0x290(0x08)
	struct UStaticMeshComponent* SM_VAL_Loot_Pottery_MinitureD2_StaticMeshComponent0; // 0x298(0x08)
	struct UStaticMeshComponent* SM_Hamlet_Vendor_Water_StaticMeshComponent0; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_BCProps_FloorCloth_A2_StaticMeshComponent0; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_VAL_Loot_Pottery_MinitureF2_StaticMeshComponent0; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_CampA_Int_BedRug_01A_StaticMeshComponent0; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_Int_CastleDun_TableLong2_StaticMeshComponent0; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_Hamlet_Vendor_Frame_02_StaticMeshComponent0; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeSpan_E4_StaticMeshComponent0; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeSpan_E3_StaticMeshComponent0; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_HW_BS_Trap_C2_StaticMeshComponent0; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_HW_BS_Trap_A2_StaticMeshComponent0; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_Hamlet_Vendor_Tarp_02_StaticMeshComponent0; // 0x2f0(0x08)
	struct USceneComponent* Scene; // 0x2f8(0x08)
	struct USceneComponent* SharedRoot; // 0x300(0x08)
};

