// BlueprintGeneratedClass BP_Hamlet_Class_A3_Interior_A.BP_Hamlet_Class_A3_Interior_A_C
// Size: 0x3d0 (Inherited: 0x248)
struct ABP_Hamlet_Class_A3_Interior_A_C : AActor {
	struct UDecalComponent* MI_HW_Decal_PlasterWear_03; // 0x248(0x08)
	struct UDecalComponent* MI_HW_Decal_SootSmudge_5; // 0x250(0x08)
	struct UDecalComponent* MI_HW_Lightpatch_2; // 0x258(0x08)
	struct UStaticMeshComponent* SM_HM_Cauldron_Cauldron_A2; // 0x260(0x08)
	struct UStaticMeshComponent* SM_HM_Cauldron_Cauldron_A; // 0x268(0x08)
	struct UStaticMeshComponent* SM_OVR_ChairWood_6; // 0x270(0x08)
	struct UStaticMeshComponent* SM_OVR_ChairWood_4; // 0x278(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Bin_ApplesGreen; // 0x280(0x08)
	struct UStaticMeshComponent* SM_BCProps_Eyelet_A3; // 0x288(0x08)
	struct UStaticMeshComponent* SM_BCProps_Eyelet_A2; // 0x290(0x08)
	struct UStaticMeshComponent* SM_BCProps_Eyelet_A; // 0x298(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Singles_BreadRound; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_HM_Cauldron_FireStoker_A; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_CampA_Int_ClothLine_01A; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_DisplayShelf_C3; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_DisplayShelf_C2; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_DisplayShelf_C; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_Hamlet_03_Merged_Kitchenware; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Table_D; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_HM_Gladrags_WardrobeB; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_HW_FrameArithmancyDiagram_B; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_HM_Gladrags_Corner_Dresser2; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_HM_Gladrags_Corner_Dresser; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_BroomStand_001_W; // 0x300(0x08)
	struct UStaticMeshComponent* SM_HW_Birdcage_Round_B; // 0x308(0x08)
	struct UStaticMeshComponent* SM_D_GobMine_Chaines_SM_GobMine_Chaine_B; // 0x310(0x08)
	struct UStaticMeshComponent* SM_HM_GEN_EndTable_D; // 0x318(0x08)
	struct UStaticMeshComponent* SM_Hamlet_03_Merged_Curtains; // 0x320(0x08)
	struct UStaticMeshComponent* SM_HM_Honeydukes_barrel_A2; // 0x328(0x08)
	struct UStaticMeshComponent* SM_HM_Honeydukes_barrel_A; // 0x330(0x08)
	struct UStaticMeshComponent* SM_HM_OwlPost_2x2_Stand_A; // 0x338(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Couch_A; // 0x340(0x08)
	struct UStaticMeshComponent* SM_HM_FirePlaceCrane_B; // 0x348(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_OpenCrate_Medium_B; // 0x350(0x08)
	struct UStaticMeshComponent* SM_HM_FireWood_Stack_A2; // 0x358(0x08)
	struct UStaticMeshComponent* SM_HM_FireWood_Stack_A; // 0x360(0x08)
	struct UStaticMeshComponent* SM_CampA_CarpetSmallA; // 0x368(0x08)
	struct UStaticMeshComponent* SM_Hamlet_03_Merged_HangingProps; // 0x370(0x08)
	struct UStaticMeshComponent* SM_Hamlet_03_Merged_Bags; // 0x378(0x08)
	struct UStaticMeshComponent* SM_HW_HB_Plant_B_Sm3; // 0x380(0x08)
	struct UStaticMeshComponent* SM_HW_HB_Plant_B_Sm2; // 0x388(0x08)
	struct UStaticMeshComponent* SM_HW_HB_Plant_B_Sm; // 0x390(0x08)
	struct UStaticMeshComponent* SM_HM_Quidditch_Shelves_BL; // 0x398(0x08)
	struct UStaticMeshComponent* SM_Hamlet_03_Merged_Books; // 0x3a0(0x08)
	struct UStaticMeshComponent* SM_Hamlet_03_Merged_StampBox; // 0x3a8(0x08)
	struct UStaticMeshComponent* SM_Hamlet_03_Merged_ThreadSpools1; // 0x3b0(0x08)
	struct UChildActorComponent* BP_HW_Nuts_Bowl_A; // 0x3b8(0x08)
	struct UChildActorComponent* BP_Spitton_Interact; // 0x3c0(0x08)
	struct USceneComponent* SharedRoot; // 0x3c8(0x08)
};

