// BlueprintGeneratedClass BP_Hamlet_Class_A_07_IsadoraRuins.BP_Hamlet_Class_A_07_IsadoraRuins_C
// Size: 0xaa8 (Inherited: 0x248)
struct ABP_Hamlet_Class_A_07_IsadoraRuins_C : AActor {
	struct UStaticMeshComponent* SM_Hamlet_Chimney_A; // 0x248(0x08)
	struct UStaticMeshComponent* Cube; // 0x250(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_B1; // 0x258(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_B; // 0x260(0x08)
	struct UDecalComponent* Decal24; // 0x268(0x08)
	struct UDecalComponent* Decal23; // 0x270(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Brick_A30; // 0x278(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_B_c7; // 0x280(0x08)
	struct UDecalComponent* Decal22; // 0x288(0x08)
	struct UStaticMeshComponent* SM_CampB_ScrapWood_C1; // 0x290(0x08)
	struct UStaticMeshComponent* SM_Int_CampB_4m_StairsA1; // 0x298(0x08)
	struct UStaticMeshComponent* SM_Int_CampB_4m_StairsA; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_CastleDun_BrokenBench_C; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Debris_C1; // 0x2b0(0x08)
	struct UDecalComponent* Decal21; // 0x2b8(0x08)
	struct UDecalComponent* Decal20; // 0x2c0(0x08)
	struct UDecalComponent* Decal19; // 0x2c8(0x08)
	struct UDecalComponent* Decal18; // 0x2d0(0x08)
	struct UDecalComponent* Decal17; // 0x2d8(0x08)
	struct UDecalComponent* Decal16; // 0x2e0(0x08)
	struct UDecalComponent* Decal15; // 0x2e8(0x08)
	struct UDecalComponent* Decal14; // 0x2f0(0x08)
	struct UDecalComponent* Decal13; // 0x2f8(0x08)
	struct UDecalComponent* Decal12; // 0x300(0x08)
	struct UDecalComponent* Decal11; // 0x308(0x08)
	struct UDecalComponent* Decal10; // 0x310(0x08)
	struct UDecalComponent* Decal9; // 0x318(0x08)
	struct UDecalComponent* Decal8; // 0x320(0x08)
	struct UDecalComponent* Decal7; // 0x328(0x08)
	struct UDecalComponent* Decal6; // 0x330(0x08)
	struct UDecalComponent* Decal5; // 0x338(0x08)
	struct UDecalComponent* Decal4; // 0x340(0x08)
	struct UDecalComponent* Decal3; // 0x348(0x08)
	struct UDecalComponent* Decal2; // 0x350(0x08)
	struct UDecalComponent* Decal1; // 0x358(0x08)
	struct UDecalComponent* Decal; // 0x360(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Wall_Corner_Cap_A_B4; // 0x368(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Wall_Corner_Cap_A_B3; // 0x370(0x08)
	struct UChildActorComponent* BP_NavCrawl; // 0x378(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Basket_Medium_001_W; // 0x380(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Medium_003_W; // 0x388(0x08)
	struct UStaticMeshComponent* SM_HM_Stacking_Cauldron_D; // 0x390(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_CartWheel; // 0x398(0x08)
	struct UStaticMeshComponent* SM_BCProps_Wood_Chopped_Small_002; // 0x3a0(0x08)
	struct UStaticMeshComponent* SM_HM_Cauldron_Cauldron_A; // 0x3a8(0x08)
	struct UStaticMeshComponent* SM_HM_FirePlaceCrane_B; // 0x3b0(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Chair_C_3; // 0x3b8(0x08)
	struct UStaticMeshComponent* SM_HW_L_New_Book_Small_C1; // 0x3c0(0x08)
	struct UStaticMeshComponent* SM_HW_L_New_Book_Large_A; // 0x3c8(0x08)
	struct UStaticMeshComponent* SM_HW_Trash_PaperScraps_A1; // 0x3d0(0x08)
	struct UStaticMeshComponent* SM_HW_L_Book_Medium_C; // 0x3d8(0x08)
	struct UStaticMeshComponent* SM_HW_L_Book_Large_C; // 0x3e0(0x08)
	struct UStaticMeshComponent* SM_HW_LetterCluster_D1; // 0x3e8(0x08)
	struct UStaticMeshComponent* SM_HW_LetterCluster_A1; // 0x3f0(0x08)
	struct UStaticMeshComponent* SM_HW_L_New_Book_Small_B; // 0x3f8(0x08)
	struct UStaticMeshComponent* SM_HW_L_New_Book_Medium_A; // 0x400(0x08)
	struct UStaticMeshComponent* GC_HS_BookPile_B_Piece_54; // 0x408(0x08)
	struct UStaticMeshComponent* SM_HW_L_Book_Small_B; // 0x410(0x08)
	struct UStaticMeshComponent* SM_HW_L_New_Book_Small_A; // 0x418(0x08)
	struct UStaticMeshComponent* SM_HW_L_New_Book_Small_C; // 0x420(0x08)
	struct UStaticMeshComponent* SM_HW_LetterCluster_A; // 0x428(0x08)
	struct UStaticMeshComponent* SM_HW_LetterCluster_D; // 0x430(0x08)
	struct UStaticMeshComponent* SM_HW_LetterCluster_E; // 0x438(0x08)
	struct UStaticMeshComponent* SM_HW_LetterCluster_F; // 0x440(0x08)
	struct UStaticMeshComponent* SM_HW_LetterCluster_C; // 0x448(0x08)
	struct UStaticMeshComponent* SM_HW_Trash_PaperScraps_A; // 0x450(0x08)
	struct UStaticMeshComponent* GC_HS_BookPile_E_Piece_41; // 0x458(0x08)
	struct UStaticMeshComponent* SM_Int_CastleDun_TableShort_W; // 0x460(0x08)
	struct UStaticMeshComponent* SM_CastleDun_Table; // 0x468(0x08)
	struct UStaticMeshComponent* SM_CastleDun_TableLongTop_A; // 0x470(0x08)
	struct USceneComponent* Interior; // 0x478(0x08)
	struct UStaticMeshComponent* SM_CastleRuin1_Block_G2; // 0x480(0x08)
	struct UStaticMeshComponent* SM_CastleRuin1_Block_J2; // 0x488(0x08)
	struct UStaticMeshComponent* SM_CastleRuin1_Block_G1; // 0x490(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Debris_C; // 0x498(0x08)
	struct UStaticMeshComponent* SM_CastleRuin1_Block_M1; // 0x4a0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_C5; // 0x4a8(0x08)
	struct UStaticMeshComponent* SM_CastleRuin1_Block_E1; // 0x4b0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Debris_A1; // 0x4b8(0x08)
	struct UStaticMeshComponent* SM_CastleRuin1_Block_M; // 0x4c0(0x08)
	struct UStaticMeshComponent* SM_CastleRuin1_Block_A; // 0x4c8(0x08)
	struct UStaticMeshComponent* SM_CastleRuin1_Block_G; // 0x4d0(0x08)
	struct UStaticMeshComponent* SM_CastleRuin1_Block_J1; // 0x4d8(0x08)
	struct UStaticMeshComponent* SM_CastleRuin1_Block_E; // 0x4e0(0x08)
	struct UStaticMeshComponent* SM_CastleRuin1_Block_B; // 0x4e8(0x08)
	struct UStaticMeshComponent* SM_CastleRuin1_Block_F; // 0x4f0(0x08)
	struct UStaticMeshComponent* SM_CastleRuin1_Block_C; // 0x4f8(0x08)
	struct UStaticMeshComponent* SM_CastleRuin1_DebrisMound_A5; // 0x500(0x08)
	struct UStaticMeshComponent* SM_CastleRuin1_DebrisMound_A4; // 0x508(0x08)
	struct UStaticMeshComponent* SM_CastleRuin1_DebrisMound_A3; // 0x510(0x08)
	struct UStaticMeshComponent* SM_CastleRuin1_DebrisMound_A2; // 0x518(0x08)
	struct UStaticMeshComponent* SM_CastleRuin1_Block_J; // 0x520(0x08)
	struct UStaticMeshComponent* SM_CampB_5m_PlankA4; // 0x528(0x08)
	struct UStaticMeshComponent* SM_CampB_5m_PlankA3; // 0x530(0x08)
	struct UStaticMeshComponent* SM_CampB_5m_PlankA2; // 0x538(0x08)
	struct UStaticMeshComponent* SM_CampB_5m_PlankB3; // 0x540(0x08)
	struct UStaticMeshComponent* SM_CampB_5m_PlankB2; // 0x548(0x08)
	struct UStaticMeshComponent* SM_CampB_2m_PlankD6; // 0x550(0x08)
	struct UStaticMeshComponent* SM_CampB_2m_PlankD5; // 0x558(0x08)
	struct UStaticMeshComponent* SM_CampB_5m_PlankA1; // 0x560(0x08)
	struct UStaticMeshComponent* SM_CampB_5m_PlankB1; // 0x568(0x08)
	struct UStaticMeshComponent* SM_CampB_5m_PlankC2; // 0x570(0x08)
	struct UStaticMeshComponent* SM_CastleRuin1_DebrisMound_A1; // 0x578(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Debris_B; // 0x580(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Debris_A; // 0x588(0x08)
	struct UStaticMeshComponent* SM_CastleRuin1_DebrisMound_C; // 0x590(0x08)
	struct UStaticMeshComponent* SM_CastleRuin1_DebrisMound_A; // 0x598(0x08)
	struct UStaticMeshComponent* SM_CastleDun_Broken_Wood_B1; // 0x5a0(0x08)
	struct UStaticMeshComponent* SM_CampB_5m_PlankC1; // 0x5a8(0x08)
	struct UStaticMeshComponent* SM_CampB_2m_PlankD4; // 0x5b0(0x08)
	struct UStaticMeshComponent* SM_CampB_2m_PlankC1; // 0x5b8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_B_a9; // 0x5c0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_B_c6; // 0x5c8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_D12; // 0x5d0(0x08)
	struct UStaticMeshComponent* GC_Overland_WoodBridge_Piece_16; // 0x5d8(0x08)
	struct UStaticMeshComponent* GC_Overland_WoodBridge_Piece_06; // 0x5e0(0x08)
	struct UStaticMeshComponent* GC_Overland_WoodBridge_Piece_24; // 0x5e8(0x08)
	struct UStaticMeshComponent* SM_CampB_2m_PlankD3; // 0x5f0(0x08)
	struct UStaticMeshComponent* SM_CampB_5m_PlankB; // 0x5f8(0x08)
	struct UStaticMeshComponent* SM_CampB_5m_PlankA; // 0x600(0x08)
	struct UStaticMeshComponent* SM_CampB_2m_PlankD2; // 0x608(0x08)
	struct UStaticMeshComponent* SM_CampB_2m_PlankD1; // 0x610(0x08)
	struct UStaticMeshComponent* SM_CampB_5m_PlankC; // 0x618(0x08)
	struct UStaticMeshComponent* SM_CampB_2m_PlankC; // 0x620(0x08)
	struct UStaticMeshComponent* SM_CastleDun_Broken_Wood_B; // 0x628(0x08)
	struct UStaticMeshComponent* SM_CampB_5m_PlankD; // 0x630(0x08)
	struct UStaticMeshComponent* SM_CastleDun_Broken_Wood_C; // 0x638(0x08)
	struct UStaticMeshComponent* SM_CampB_2m_PlankD; // 0x640(0x08)
	struct UStaticMeshComponent* SM_Overland_Rock_011; // 0x648(0x08)
	struct UStaticMeshComponent* SM_Overland_Rock_010; // 0x650(0x08)
	struct UStaticMeshComponent* SM_Overland_Rock_09; // 0x658(0x08)
	struct UStaticMeshComponent* SM_Overland_Rock_16; // 0x660(0x08)
	struct UStaticMeshComponent* SM_Overland_Rock_07; // 0x668(0x08)
	struct UStaticMeshComponent* SM_Overland_Rock_06; // 0x670(0x08)
	struct UStaticMeshComponent* SM_Overland_Rock_03; // 0x678(0x08)
	struct UStaticMeshComponent* SM_Overland_Rock_02; // 0x680(0x08)
	struct UStaticMeshComponent* SM_Overland_Rock_05; // 0x688(0x08)
	struct UStaticMeshComponent* SM_Overland_Rock_15; // 0x690(0x08)
	struct UStaticMeshComponent* SM_Overland_Rock_11; // 0x698(0x08)
	struct UStaticMeshComponent* SM_Overland_Rock_12; // 0x6a0(0x08)
	struct UStaticMeshComponent* SM_Overland_Rock_08; // 0x6a8(0x08)
	struct UStaticMeshComponent* SM_Overland_Rock_14; // 0x6b0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Wall_Corner_Cap_A_B2; // 0x6b8(0x08)
	struct UStaticMeshComponent* SM_CampB_ScrapWood_D; // 0x6c0(0x08)
	struct UStaticMeshComponent* SM_CampB_ScrapWood_C; // 0x6c8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_B_b6; // 0x6d0(0x08)
	struct UStaticMeshComponent* SM_Overland_Rock_04; // 0x6d8(0x08)
	struct UStaticMeshComponent* GC_Overland_WoodBridge_Piece_21; // 0x6e0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_F_a12; // 0x6e8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_F_a11; // 0x6f0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_C1; // 0x6f8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_F_b4; // 0x700(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_B_c5; // 0x708(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_C; // 0x710(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_F_b3; // 0x718(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Brick_A29; // 0x720(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_D11; // 0x728(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_D10; // 0x730(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_B_c4; // 0x738(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_B_b5; // 0x740(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Brick_A28; // 0x748(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Brick_A27; // 0x750(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Brick_A26; // 0x758(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_B_a8; // 0x760(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_D9; // 0x768(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_B_a7; // 0x770(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Brick_A25; // 0x778(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_D8; // 0x780(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Brick_A24; // 0x788(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_D7; // 0x790(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_D6; // 0x798(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_B_a6; // 0x7a0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_B_a5; // 0x7a8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_F_a10; // 0x7b0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_C_b5; // 0x7b8(0x08)
	struct UStaticMeshComponent* SM_Overland_Rock_01; // 0x7c0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_C_b4; // 0x7c8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Brick_A23; // 0x7d0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_B_c3; // 0x7d8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_C4; // 0x7e0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_B_b4; // 0x7e8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_F_a9; // 0x7f0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_B_a4; // 0x7f8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_C3; // 0x800(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_F_a8; // 0x808(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Brick_A22; // 0x810(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_B_a3; // 0x818(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Wall_Corner_Cap_A1_B; // 0x820(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Wall_Corner_Decoration_A1; // 0x828(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_B_b3; // 0x830(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Arched_Window_G; // 0x838(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_B_b2; // 0x840(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_F_a7; // 0x848(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_C_b3; // 0x850(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_C_b2; // 0x858(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Brick_A21; // 0x860(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_B_a2; // 0x868(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_C_b1; // 0x870(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_F_a6; // 0x878(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Brick_A20; // 0x880(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Brick_A19; // 0x888(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_B_b1; // 0x890(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_C_a1; // 0x898(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Arch_PillarTop_A; // 0x8a0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Brick_A18; // 0x8a8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Brick_A17; // 0x8b0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_Cap_A_a4; // 0x8b8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_B_c2; // 0x8c0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_F_b2; // 0x8c8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Brick_A16; // 0x8d0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_D5; // 0x8d8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_C2; // 0x8e0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Brick_A15; // 0x8e8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Brick_A14; // 0x8f0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_D4; // 0x8f8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Brick_A13; // 0x900(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Brick_A12; // 0x908(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_D3; // 0x910(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_D2; // 0x918(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Brick_A11; // 0x920(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Brick_A10; // 0x928(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Brick_A9; // 0x930(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_C1; // 0x938(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_B_c1; // 0x940(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_B_a1; // 0x948(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Wall_Roof_Beam_A_b; // 0x950(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Wall_Roof_Beam_A_a; // 0x958(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Wall_Corner_Cap_A_B1; // 0x960(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_F_a5; // 0x968(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_Cap_A_a3; // 0x970(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_B1; // 0x978(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_F_a4; // 0x980(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_B; // 0x988(0x08)
	struct UStaticMeshComponent* SM_HamletA_07_IsadoraRuin_Window_Broken; // 0x990(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_F_a3; // 0x998(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_F_a2; // 0x9a0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_F_b1; // 0x9a8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Wall_Corner_Cap_A_B; // 0x9b0(0x08)
	struct UStaticMeshComponent* SM_Overland_Rock_13; // 0x9b8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_D1; // 0x9c0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_C; // 0x9c8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Wall_Corner_Decoration_A; // 0x9d0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_D; // 0x9d8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Brick_A8; // 0x9e0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Brick_A7; // 0x9e8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Brick_A6; // 0x9f0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Brick_A5; // 0x9f8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Brick_A4; // 0xa00(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Brick_A3; // 0xa08(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Brick_A2; // 0xa10(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Brick_A1; // 0xa18(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_F_a1; // 0xa20(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Brick_A; // 0xa28(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Wall_Damaged_B1; // 0xa30(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Wall_Damaged_B; // 0xa38(0x08)
	struct USceneComponent* Ruins; // 0xa40(0x08)
	struct UStaticMeshComponent* SM_HamletA_07_IsadoraRuin_Windows; // 0xa48(0x08)
	struct UStaticMeshComponent* SM_HamletA_07_IsadoraRuin_Rockedge_02; // 0xa50(0x08)
	struct UStaticMeshComponent* SM_COL_INT_PL; // 0xa58(0x08)
	struct UStaticMeshComponent* SM_COL_INT_APL; // 0xa60(0x08)
	struct USceneComponent* Collision; // 0xa68(0x08)
	struct UStaticMeshComponent* SM_HamletA_07_IsadoraRuin_Walls_StaticMeshComponent0; // 0xa70(0x08)
	struct UStaticMeshComponent* SM_HamletA_07_IsadoraRuin_Trims_StaticMeshComponent0; // 0xa78(0x08)
	struct UStaticMeshComponent* SM_HamletA_07_IsadoraRuin_Threshold_StaticMeshComponent0; // 0xa80(0x08)
	struct UStaticMeshComponent* SM_HamletA_07_IsadoraRuin_Rockedge_StaticMeshComponent0; // 0xa88(0x08)
	struct UStaticMeshComponent* SM_HamletA_07_IsadoraRuin_Floors_StaticMeshComponent0; // 0xa90(0x08)
	struct UStaticMeshComponent* SM_HamletA_07_IsadoraRuin_Fireplace_StaticMeshComponent0; // 0xa98(0x08)
	struct USceneComponent* SharedRoot; // 0xaa0(0x08)
};

