// BlueprintGeneratedClass BP_HamletB_M.BP_HamletB_M_C
// Size: 0x5b2 (Inherited: 0x257)
struct ABP_HamletB_M_C : ABP_Hamlet_Base_C {
	char pad_257[0x1]; // 0x257(0x01)
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x258(0x08)
	struct UStaticMeshComponent* Collision Cube; // 0x260(0x08)
	struct UStaticMeshComponent* SM_HamletB_M_Windows_Glass_Int; // 0x268(0x08)
	struct UPointLightComponent* Window_Light11; // 0x270(0x08)
	struct UPointLightComponent* Window_Light10; // 0x278(0x08)
	struct UPointLightComponent* Window_Light9; // 0x280(0x08)
	struct UPointLightComponent* Window_Light7; // 0x288(0x08)
	struct UPointLightComponent* Window_Light6; // 0x290(0x08)
	struct UPointLightComponent* Window_Light5; // 0x298(0x08)
	struct UPointLightComponent* Window_Light4; // 0x2a0(0x08)
	struct UPointLightComponent* Window_Light3; // 0x2a8(0x08)
	struct UPointLightComponent* Window_Light2; // 0x2b0(0x08)
	struct UPointLightComponent* Window_Light; // 0x2b8(0x08)
	struct UChildActorComponent* BP_WalkSpeedVolume1; // 0x2c0(0x08)
	struct UChildActorComponent* BP_WalkSpeedVolume; // 0x2c8(0x08)
	struct UDecalComponent* MI_P_Decal_Stain30_252; // 0x2d0(0x08)
	struct UDecalComponent* MI_P_Decal_Stain4_250; // 0x2d8(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Wetness_drips_A4_248; // 0x2e0(0x08)
	struct UDecalComponent* MI_P_Decal_Stain29_246; // 0x2e8(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Wetness_drips_B3_244; // 0x2f0(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Wetness_drips_C2_242; // 0x2f8(0x08)
	struct UDecalComponent* MI_P_Decal_Stain28_240; // 0x300(0x08)
	struct UDecalComponent* MI_P_Decal_Stain3_238; // 0x308(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_E5_236; // 0x310(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_E4_234; // 0x318(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_E3_232; // 0x320(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_E2_230; // 0x328(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Wetness_drips_B2_228; // 0x330(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_E_226; // 0x338(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_A_224; // 0x340(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Wetness_drips_B_222; // 0x348(0x08)
	struct UDecalComponent* MI_CastleDun_grungeG_B_220; // 0x350(0x08)
	struct UDecalComponent* MI_CastleDun_grungeB_B2_218; // 0x358(0x08)
	struct UDecalComponent* MI_CastleDun_grungeB_B_216; // 0x360(0x08)
	struct UDecalComponent* MI_CastleDun_DeadLeafs_C2_214; // 0x368(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Wetness_drips_C_212; // 0x370(0x08)
	struct UDecalComponent* MI_CastleDun_DeadLeafs_C_210; // 0x378(0x08)
	struct UDecalComponent* MI_CastleDun_DeadLeafs_B_208; // 0x380(0x08)
	struct UDecalComponent* MI_P_Decal_Stain15_206; // 0x388(0x08)
	struct UDecalComponent* MI_P_Decal_Stain27_204; // 0x390(0x08)
	struct UDecalComponent* MI_P_Decal_Stain26_202; // 0x398(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Wetness_drips_A3_200; // 0x3a0(0x08)
	struct UDecalComponent* MI_P_Decal_Stain25_198; // 0x3a8(0x08)
	struct UDecalComponent* MI_P_Decal_Stain24_196; // 0x3b0(0x08)
	struct UDecalComponent* MI_P_Decal_Stain14_194; // 0x3b8(0x08)
	struct UDecalComponent* MI_P_Decal_Stain23_192; // 0x3c0(0x08)
	struct UDecalComponent* MI_P_Decal_Stain22_190; // 0x3c8(0x08)
	struct UDecalComponent* MI_P_Decal_Stain13_188; // 0x3d0(0x08)
	struct UDecalComponent* MI_P_Decal_Stain12_186; // 0x3d8(0x08)
	struct UDecalComponent* MI_P_Decal_Stain21_184; // 0x3e0(0x08)
	struct UDecalComponent* MI_P_Decal_Stain20_182; // 0x3e8(0x08)
	struct UDecalComponent* MI_P_Decal_Stain2_180; // 0x3f0(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_AshCircle_A_178; // 0x3f8(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Soot_A2_176; // 0x400(0x08)
	struct UDecalComponent* MI_P_Decal_Stain1_174; // 0x408(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Wetness_drips_A2_172; // 0x410(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_AshCircle_B_170; // 0x418(0x08)
	struct UDecalComponent* MI_P_Decal_Stain19_168; // 0x420(0x08)
	struct UDecalComponent* MI_P_Decal_Stain18_166; // 0x428(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Wetness_drips_A_164; // 0x430(0x08)
	struct UDecalComponent* MI_P_Decal_Stain17_162; // 0x438(0x08)
	struct UDecalComponent* MI_CavernDun_Decal_ForestFloor_01_160; // 0x440(0x08)
	struct UStaticMeshComponent* SM_COL_EXT_PL; // 0x448(0x08)
	struct UStaticMeshComponent* SM_HamletB_M_Walls1; // 0x450(0x08)
	struct UStaticMeshComponent* SM_HamletB_M_Trims1; // 0x458(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_BeardMoss_A1; // 0x460(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HW_PC_Pipe_Straight_0_5M1; // 0x468(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_9SM_HW_PC_Pipe_Elbow1; // 0x470(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_32SM_HW_EH_EXT_RainRoofGutter1; // 0x478(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_12SM_HW_PC_Pipe_Straight_1M1; // 0x480(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_CampB_2m_PlankD1; // 0x488(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_CampB_5m_PlankA1; // 0x490(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_CampB_5m_PlankD1; // 0x498(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_36SM_HW_Toilet_Pipe_Connector1; // 0x4a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_HamletB_WoodShingleStrip_A1; // 0x4a8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_18SM_HamletB_WoodShingleStrip_G1; // 0x4b0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_20SM_HamletB_WoodShingleStrip_H1; // 0x4b8(0x08)
	struct UStaticMeshComponent* SM_COL_INT_PL; // 0x4c0(0x08)
	struct UStaticMeshComponent* SM_COL_EXT_APL; // 0x4c8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_22SM_HamletB_WoodShingleStrip_Short_C1; // 0x4d0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_HamletB_WoodShingleStrip_Short_A1; // 0x4d8(0x08)
	struct UStaticMeshComponent* SM_HamletB_WoodShingleStrip_D1; // 0x4e0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_HamletB_WoodShingleStrip_C1; // 0x4e8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_11SM_HamletB_WoodShingleStrip_B1; // 0x4f0(0x08)
	struct UStaticMeshComponent* SM_HamletB_M_Windows_Frames1; // 0x4f8(0x08)
	struct UStaticMeshComponent* SM_HamletB_M_Windows_Glass1; // 0x500(0x08)
	struct UStaticMeshComponent* SM_HamletB_M_Door1; // 0x508(0x08)
	struct UStaticMeshComponent* SM_HamletB_M_Floor1; // 0x510(0x08)
	struct UStaticMeshComponent* SM_HamletB_M_Chimney1; // 0x518(0x08)
	struct UStaticMeshComponent* SM_HamletB_M_Trims_Int1; // 0x520(0x08)
	struct UStaticMeshComponent* SM_HamletB_M_Walls_Int1; // 0x528(0x08)
	struct UStaticMeshComponent* SM_HamletB_M_Stairs1; // 0x530(0x08)
	struct UStaticMeshComponent* SM_HamletB_M_Roof1; // 0x538(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_9SM_BeardMoss_C; // 0x540(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_HamletB_WoodShingleStrip_D; // 0x548(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_10SM_HamletB_WoodShingleStrip_F; // 0x550(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_HamletB_WoodShingleStrip_Short_B; // 0x558(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_7SM_HamletB_WoodShingleStrip_E; // 0x560(0x08)
	struct USceneComponent*  Collision; // 0x568(0x08)
	struct UChildActorComponent* BP_HamletB_FrontDoorStep_03; // 0x570(0x08)
	struct UChildActorComponent* BP_HamletB_FrontDoorStep_01; // 0x578(0x08)
	struct UChildActorComponent* BP_HamletB_FrontDoorStep_02; // 0x580(0x08)
	struct UBoxComponent* Box1; // 0x588(0x08)
	struct UChildActorComponent* BP_Door_Template; // 0x590(0x08)
	struct UCameraStackVolumeComponent* CameraStackVolume; // 0x598(0x08)
	struct USceneComponent* decor; // 0x5a0(0x08)
	struct USceneComponent* Hamlet; // 0x5a8(0x08)
	enum class EDoorState Set Lock A Door State; // 0x5b0(0x01)
	enum class ELockDifficulty Set Lock A Difficulty; // 0x5b1(0x01)

	void UserConstructionScript(); // Function BP_HamletB_M.BP_HamletB_M_C.UserConstructionScript // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void ReceiveBeginPlay(); // Function BP_HamletB_M.BP_HamletB_M_C.ReceiveBeginPlay // (Event|Protected|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_BP_HamletB_M(int32_t EntryPoint); // Function BP_HamletB_M.BP_HamletB_M_C.ExecuteUbergraph_BP_HamletB_M // (Final|UbergraphFunction) // @ game+0x38a7480
};

