// BlueprintGeneratedClass BP_Hamlet_Class_A6_Interior_A.BP_Hamlet_Class_A6_Interior_A_C
// Size: 0x3e0 (Inherited: 0x248)
struct ABP_Hamlet_Class_A6_Interior_A_C : AActor {
	struct UStaticMeshComponent* SM_HM_Cauldron_Cauldrons_N; // 0x248(0x08)
	struct UDecalComponent* MI_HW_Decal_SootSmudge_5; // 0x250(0x08)
	struct UDecalComponent* MI_HW_Decal_PlasterWear_02; // 0x258(0x08)
	struct UDecalComponent* MI_HW_Decal_PlasterWear_03_9; // 0x260(0x08)
	struct UDecalComponent* MI_HW_Decal_SootSmudge_4; // 0x268(0x08)
	struct UDecalComponent* MI_HW_Decal_Wood_WornStep01_6; // 0x270(0x08)
	struct UDecalComponent* MI_HW_OrangeLichen2; // 0x278(0x08)
	struct UDecalComponent* MI_HW_OrangeLichen; // 0x280(0x08)
	struct UDecalComponent* MI_HW_WhiteLichen2; // 0x288(0x08)
	struct UDecalComponent* MI_HW_WhiteLichen; // 0x290(0x08)
	struct UStaticMeshComponent* SM_HamletA_06_Interior_HangingPlants_02_Merged; // 0x298(0x08)
	struct UStaticMeshComponent* SM_HM_BeastHorn_1A; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_HM_Quidditch_Shelves_F; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_CampB_5m_PostA; // 0x2b0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_CampB_5m_PostA; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_HM_Cauldron_Cauldron_H; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_HM_Cauldron_Ladles_B; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_C_DUN_BrazierEmbers; // 0x2d0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_HM_3Broom_Chair_D; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Curtains; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_HamletA_06_Interior_Jugs_Merged; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_HamletA_06_Interior_HangingPlants_Merged; // 0x2f0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_Quidditch_Counter; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_HM_FeatherDuster; // 0x300(0x08)
	struct UStaticMeshComponent* SM_HM_FirePlaceCrane_B; // 0x308(0x08)
	struct UStaticMeshComponent* SM_HM_GEN_CedarChest_B; // 0x310(0x08)
	struct UStaticMeshComponent* SM_HM_GEN_Mirror_C; // 0x318(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_Barrel_001_W; // 0x320(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Barrel_Short_001_W; // 0x328(0x08)
	struct UStaticMeshComponent* SM_HM_Honeydukes_Int_Olivia_Drapes; // 0x330(0x08)
	struct UStaticMeshComponent* SM_HM_Honeydukes_Table_A; // 0x338(0x08)
	struct UStaticMeshComponent* SM_HM_Honeydukes_wall_shelf_R_endcap; // 0x340(0x08)
	struct UStaticMeshComponent* SM_HamletA_06_Interior_PotionBottles_Merged; // 0x348(0x08)
	struct UStaticMeshComponent* SM_HW_Bathtub_C; // 0x350(0x08)
	struct UStaticMeshComponent* SM_HM_Grandfather_Clock; // 0x358(0x08)
	struct UStaticMeshComponent* SM_HW_RugRoundB; // 0x360(0x08)
	struct UStaticMeshComponent* SM_HM_BeastHorn_Bucket_A; // 0x368(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_OpenCrate_Medium_C; // 0x370(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_Int_BCProps_WoodPile_Large_001; // 0x378(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_Int_BCProps_WoodTub_Medium_001_W; // 0x380(0x08)
	struct UStaticMeshComponent* SM_OVR_Armchair_01; // 0x388(0x08)
	struct UStaticMeshComponent* SM_HW_PC_PotionTable_Rack_A; // 0x390(0x08)
	struct UStaticMeshComponent* SM_OVR_KitchenHutch_01; // 0x398(0x08)
	struct UStaticMeshComponent* SM_HamletA_06_Interior_KitchenWare_Merged; // 0x3a0(0x08)
	struct UStaticMeshComponent* SM_OVR_Table_01; // 0x3a8(0x08)
	struct UStaticMeshComponent* SM_OVR_Wood_Stove; // 0x3b0(0x08)
	struct UStaticMeshComponent* SM_HamletA_06_Interior_BooksandScrolls_Merged; // 0x3b8(0x08)
	struct UStaticMeshComponent* SM_HamletA_06_Interior_Rug; // 0x3c0(0x08)
	struct UStaticMeshComponent* SM_HamletA_06_Interior_TeaSet_Merged1; // 0x3c8(0x08)
	struct UChildActorComponent* BP_HW_Apple_Bowl_Red; // 0x3d0(0x08)
	struct USceneComponent* SharedRoot; // 0x3d8(0x08)
};

