// BlueprintGeneratedClass BP_Hamlet_Class_A4_Interior_B.BP_Hamlet_Class_A4_Interior_B_C
// Size: 0x3f8 (Inherited: 0x248)
struct ABP_Hamlet_Class_A4_Interior_B_C : AActor {
	struct UChildActorComponent* BP_HW_Fireplace_Interact_Grate; // 0x248(0x08)
	struct UChildActorComponent* BP_HW_Pastries_B; // 0x250(0x08)
	struct UStaticMeshComponent* SM_HamletB_04_Merged_HangingProps_07; // 0x258(0x08)
	struct UDecalComponent* MI_HW_Decal_SootSmudge_3; // 0x260(0x08)
	struct UStaticMeshComponent* SM_HOG_BannerRod2_97; // 0x268(0x08)
	struct UStaticMeshComponent* SM_HOG_BannerRod_95; // 0x270(0x08)
	struct UStaticMeshComponent* SM_HW_SD_Curtain01A_93; // 0x278(0x08)
	struct UStaticMeshComponent* SM_HW_SD_Curtain02A_91; // 0x280(0x08)
	struct UStaticMeshComponent* SM_HW_RugS_End_87; // 0x288(0x08)
	struct UStaticMeshComponent* SM_HamletB_04_Merged_Boxes1; // 0x290(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HW_L_Chair_B1; // 0x298(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_BCProps_RopeLashing_A; // 0x2a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_7SM_BCProps_RopeSpan_J; // 0x2a8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_BookShelfTopA; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_CampB_5m_PostA; // 0x2b8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_HM_3Broom_Bottle_E; // 0x2c0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_3Broom_Chair_D1; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_HM_Cauldron_Cauldron_A; // 0x2d0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_FirePlaceCrane_B; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_HM_FireWood_Stack_B; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_HM_Grandfather_Wall_Clock; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_HM_Honeydukes_Table_A; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_HM_Neep_Hanging_Basket_B; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_HM_Neep_Pumpkin_B; // 0x300(0x08)
	struct UStaticMeshComponent* SM_HM_potions_cabinet_main; // 0x308(0x08)
	struct UStaticMeshComponent* SM_HM_potions_cabinet_narrow; // 0x310(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HOG_BannerRod; // 0x318(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HW_3Broom_Table_C; // 0x320(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HW_3Broom_Table_E; // 0x328(0x08)
	struct UStaticMeshComponent* SM_HW_RugS_End; // 0x330(0x08)
	struct UStaticMeshComponent* SM_HW_RugS_Middle; // 0x338(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_HW_RugTassleE; // 0x340(0x08)
	struct UStaticMeshComponent* SM_HW_SD_Couch_B; // 0x348(0x08)
	struct UStaticMeshComponent* SM_HW_SD_Curtain03A; // 0x350(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_7SM_Int_BCProps_Barrel_001_W; // 0x358(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_FoodBag_1bag_001_W; // 0x360(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_FoodBag_1bag_003_W; // 0x368(0x08)
	struct UStaticMeshComponent* SM_OVR_Wood_Stove; // 0x370(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HW_GenericTrunk_B; // 0x378(0x08)
	struct UStaticMeshComponent* SM_PortraitFrame_02; // 0x380(0x08)
	struct UStaticMeshComponent* SM_PortraitFrame_04; // 0x388(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_Bucket_Small_002_W; // 0x390(0x08)
	struct UStaticMeshComponent* SM_HamletB_04_Merged_Books1; // 0x398(0x08)
	struct UStaticMeshComponent* SM_HamletB_04_Merged_Food1; // 0x3a0(0x08)
	struct UStaticMeshComponent* SM_HamletB_04_Merged_Kitchenware1; // 0x3a8(0x08)
	struct UStaticMeshComponent* SM_HamletB_04_Merged_Parcels1; // 0x3b0(0x08)
	struct UStaticMeshComponent* SM_HamletB_04_Merged_Pots1; // 0x3b8(0x08)
	struct UStaticMeshComponent* SM_HamletB_04_Merged_TeaSet1; // 0x3c0(0x08)
	struct UStaticMeshComponent* SM_HamletB_04_Merged_HangingProps_06; // 0x3c8(0x08)
	struct UStaticMeshComponent* SM_HamletB_04_Merged_HangingProps_05; // 0x3d0(0x08)
	struct UStaticMeshComponent* SM_HamletB_04_Merged_ThreadSpools1; // 0x3d8(0x08)
	struct UStaticMeshComponent* SM_HamletB_04_Merged_HangingProps_04; // 0x3e0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_Wardrobes_B; // 0x3e8(0x08)
	struct USceneComponent* SharedRoot; // 0x3f0(0x08)
};

