// BlueprintGeneratedClass BP_Hamlet_HangBarrel.BP_Hamlet_HangBarrel_C
// Size: 0x2c8 (Inherited: 0x248)
struct ABP_Hamlet_HangBarrel_C : AActor {
	struct UStaticMeshComponent* SM_Int_BCProps_Barrel_001_W_StaticMeshComponent6; // 0x248(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Barrel_001_W_StaticMeshComponent5; // 0x250(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Barrel_001_W_StaticMeshComponent4; // 0x258(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Barrel_001_W_StaticMeshComponent3; // 0x260(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Barrel_001_W_StaticMeshComponent2; // 0x268(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Barrel_001_W_StaticMeshComponent1; // 0x270(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Barrel_001_W2_StaticMeshComponent0; // 0x278(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Barrel_001_W_StaticMeshComponent0; // 0x280(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeSpan_J_StaticMeshComponent3; // 0x288(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeSpan_J_StaticMeshComponent2; // 0x290(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeSpan_J_StaticMeshComponent1; // 0x298(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeSpan_J_StaticMeshComponent0; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeLashing_A_StaticMeshComponent1; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeLashing_A_StaticMeshComponent0; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_CampB_5m_PostA_StaticMeshComponent0; // 0x2b8(0x08)
	struct USceneComponent* SharedRoot; // 0x2c0(0x08)
};

