// BlueprintGeneratedClass BP_Hamlet_Class_AKB_Interior_02.BP_Hamlet_Class_AKB_Interior_02_C
// Size: 0x440 (Inherited: 0x248)
struct ABP_Hamlet_Class_AKB_Interior_02_C : AActor {
	struct UWorldFXAudioComponent* WorldFXAudio-Amb_3D_Greenhouse_Pond_Loop; // 0x248(0x08)
	struct UWorldFXAudioComponent* WorldFXAudio-Amb_3D_Fire_Burning_Loop; // 0x250(0x08)
	struct UDecalComponent* MI_HW_Decal_Brick_6; // 0x258(0x08)
	struct UDecalComponent* M_Cairn_Wetness_drips_B; // 0x260(0x08)
	struct UDecalComponent* MI_HW_Decal_Brick_5; // 0x268(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Edge_C; // 0x270(0x08)
	struct UDecalComponent* M_Cav_Decal_Grunge_01; // 0x278(0x08)
	struct UDecalComponent* M_Cairn_Decal_grunge_G_Inst; // 0x280(0x08)
	struct UDecalComponent* MI_HW_Decal_Wood_WornStep2; // 0x288(0x08)
	struct UDecalComponent* MI_HW_Decal_Wood_WornStep01; // 0x290(0x08)
	struct UDecalComponent* MI_Castle_Ruin1_Decal_SootSmudge_6; // 0x298(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Wetness_A; // 0x2a0(0x08)
	struct UDecalComponent* MI_P_Decal_Puddle_2; // 0x2a8(0x08)
	struct UDecalComponent* MI_HW_Decal_Brick_4; // 0x2b0(0x08)
	struct UDecalComponent* MI_HW_Decal_Brick_02; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_HamletA_05_KB_Rope_Merged; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_HamletA_05_KB_Rug_Merged; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_HamletA_05_KB_Bottles_Merged; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_HamletA_05_KB_Jugs_Merged; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_HamletA_05_KB_Pipe_Merged; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_Hamlet_Distillery_Beer; // 0x2e8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Heather2_A; // 0x2f0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HW_K_HangingHerbs_StringA; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_HangingProps_Bags_002_W; // 0x300(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_BCProps_FoodBag_3bag_001; // 0x308(0x08)
	struct UStaticMeshComponent* SM_BCProps_FoodBag_5bag_001; // 0x310(0x08)
	struct UStaticMeshComponent* SM_Intro_Ladder_01; // 0x318(0x08)
	struct UStaticMeshComponent* SM_HM_Anvil_Hammer; // 0x320(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Chair_B_3; // 0x328(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_BCProps_FoodBag_2bag_001; // 0x330(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_HM_Quill_DisplayShelf_A; // 0x338(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_HW_K_HangingHerbs_StringB; // 0x340(0x08)
	struct UStaticMeshComponent* SM_CastleDun_HayFloor_A; // 0x348(0x08)
	struct UStaticMeshComponent* SM_CastleDun_HayPile_A; // 0x350(0x08)
	struct UStaticMeshComponent* SM_Sanc_Beehive_01_Hbgst; // 0x358(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_HW_TrophyPlaque_ServicestoSchool; // 0x360(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_HM_Deer_Skull_A; // 0x368(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_FoodBag_1bag_001_W; // 0x370(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_WoodTub_Medium_001_W; // 0x378(0x08)
	struct UStaticMeshComponent* SM_HW_GT_Fireplace_Grate; // 0x380(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_HangingProps_Bags_005_W; // 0x388(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Sanc_BIO_COAST_Heather_01A; // 0x390(0x08)
	struct UStaticMeshComponent* SM_PlantingPotMed_01; // 0x398(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_HangingProps_Bags_007_F; // 0x3a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_Basket_Small_001_W; // 0x3a8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Bellows_001_W; // 0x3b0(0x08)
	struct UStaticMeshComponent* SM_HW_Fireplace_Coals_Sm_B; // 0x3b8(0x08)
	struct UStaticMeshComponent* SM_HM_Cauldron_Int_Fireplace; // 0x3c0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_CampB_2m_PlankD; // 0x3c8(0x08)
	struct UStaticMeshComponent* SM_WE_Newspaper_pile; // 0x3d0(0x08)
	struct UStaticMeshComponent* SM_WE_Newspaper_02; // 0x3d8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_HM_3Broom_Chair_A; // 0x3e0(0x08)
	struct UStaticMeshComponent* SM_DB_GR_Desk; // 0x3e8(0x08)
	struct UStaticMeshComponent* SM_HM_HogsHead_Big_Barrel; // 0x3f0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_HM_Quill_DisplayShelf_B; // 0x3f8(0x08)
	struct UStaticMeshComponent* SM_HM_Picture_Frame_A1; // 0x400(0x08)
	struct UStaticMeshComponent* SM_HM_Picture_Frame_C; // 0x408(0x08)
	struct UStaticMeshComponent* SM_OVL_Sign_H; // 0x410(0x08)
	struct UStaticMeshComponent* SM_OVL_Sign_G; // 0x418(0x08)
	struct UStaticMeshComponent* SM_HM_Picture_Frame_A; // 0x420(0x08)
	struct UStaticMeshComponent* SM_HW_Laundry_Coatrack_B; // 0x428(0x08)
	struct UStaticMeshComponent* SM_HM_Picture_Frame_B1; // 0x430(0x08)
	struct USceneComponent* SharedRoot; // 0x438(0x08)
};

