// BlueprintGeneratedClass BP_Hamlet_HangBasket.BP_Hamlet_HangBasket_C
// Size: 0x290 (Inherited: 0x248)
struct ABP_Hamlet_HangBasket_C : AActor {
	struct UStaticMeshComponent* SM_BCProps_RopeLashing_A6_StaticMeshComponent0; // 0x248(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Basket_Small_001_W_StaticMeshComponent0; // 0x250(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Bucket_Small_001_W_StaticMeshComponent1; // 0x258(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Bucket_Small_001_W_StaticMeshComponent0; // 0x260(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Basket_Medium_001_W_StaticMeshComponent1; // 0x268(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Basket_Medium_001_W_StaticMeshComponent0; // 0x270(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeSpan_K_StaticMeshComponent0; // 0x278(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeLashing_A5_StaticMeshComponent0; // 0x280(0x08)
	struct USceneComponent* SharedRoot; // 0x288(0x08)
};

