// BlueprintGeneratedClass BP_Hamlet_Class_A5_Interior_B.BP_Hamlet_Class_A5_Interior_B_C
// Size: 0x440 (Inherited: 0x248)
struct ABP_Hamlet_Class_A5_Interior_B_C : AActor {
	struct UWorldFXAudioComponent* WorldFXAudio-Amb_3D_Stove_Burning_Loop; // 0x248(0x08)
	struct UWorldFXAudioComponent* WorldFXAudio-Amb_3D_Cauldron_Boiling_Loop; // 0x250(0x08)
	struct UBoxComponent* Box1; // 0x258(0x08)
	struct UBoxComponent* Box; // 0x260(0x08)
	struct UDecalComponent* MI_P_Decal_Stain3_6; // 0x268(0x08)
	struct UDecalComponent* MI_P_Decal_Puddle_4; // 0x270(0x08)
	struct UStaticMeshComponent* SM_HamletA_05_Interior_B_SideDressing_Merged; // 0x278(0x08)
	struct UStaticMeshComponent* SM_HamletA_05_Interior_B_NeepPlants_Merged; // 0x280(0x08)
	struct UStaticMeshComponent* SM_HamletA_05_Interior_B_KitchenWares_Merged; // 0x288(0x08)
	struct UStaticMeshComponent* SM_HamletA_05_Interior_B_Bottles_Merged; // 0x290(0x08)
	struct UStaticMeshComponent* SM_HamletA_05_Interior_B_Wood_Merged; // 0x298(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Small_001_W; // 0x2a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_Stacking_Cauldron_D; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_FoodBag_1bag_003_W; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_HW_L_BookRow_Medium_B; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Jug_002_W; // 0x2c0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_Pot_001_W; // 0x2c8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_OpenCrate_Medium_C; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_HM_Stacking_Cauldron_E; // 0x2d8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_OwlPost_Package_O; // 0x2e0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HW_HB_Couch_B; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_HW_GenericTrunk_A; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_HW_GenericTrunk_C; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Large_001_W; // 0x300(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_Int_BCProps_CloseCrate_Medium_001_W; // 0x308(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_BCProps_RopeSpan_H; // 0x310(0x08)
	struct UStaticMeshComponent* SM_OVR_Wood_Stove; // 0x318(0x08)
	struct UStaticMeshComponent* SM_OVR_TableSmall_01; // 0x320(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_WoodPile_Large_001; // 0x328(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Pot_002_W; // 0x330(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Jug_001_W; // 0x338(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_FoodBag_1bag_001_W; // 0x340(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_FoodBag_1bag_002_W; // 0x348(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Basket_Small_002_W; // 0x350(0x08)
	struct UStaticMeshComponent* SM_HW_SD_Armchair_B; // 0x358(0x08)
	struct UStaticMeshComponent* SM_HW_RugRoundA; // 0x360(0x08)
	struct UStaticMeshComponent* SM_HW_BS_DiagramsAndOddities_C; // 0x368(0x08)
	struct UStaticMeshComponent* SM_HW_BS_DiagramsAndOddities_B; // 0x370(0x08)
	struct UStaticMeshComponent* SM_HW_BS_DiagramsAndOddities_A; // 0x378(0x08)
	struct UStaticMeshComponent* SM_HW_3Broom_Table_C; // 0x380(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_Shelf_C; // 0x388(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_DisplayShelf_A; // 0x390(0x08)
	struct UStaticMeshComponent* SM_HM_Quidditch_Counter; // 0x398(0x08)
	struct UStaticMeshComponent* SM_HM_FireWood_Stack_B; // 0x3a0(0x08)
	struct UStaticMeshComponent* SM_HM_FireWood_Stack_A; // 0x3a8(0x08)
	struct UStaticMeshComponent* SM_HM_FirePlaceCrane_A; // 0x3b0(0x08)
	struct UStaticMeshComponent* SM_HM_Cauldron_Cauldrons_O; // 0x3b8(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Table_A_Chair_BD; // 0x3c0(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Chair_A; // 0x3c8(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_BroomstickRack_A; // 0x3d0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_DB_GR_Desk; // 0x3d8(0x08)
	struct UStaticMeshComponent* SM_C_DUN_BrazierEmbers; // 0x3e0(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeCloth_A; // 0x3e8(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeCloth_B; // 0x3f0(0x08)
	struct UStaticMeshComponent* SM_CampA_Int_ClothLine_01B; // 0x3f8(0x08)
	struct UStaticMeshComponent* SM_HM_Cauldron_Cauldron_A; // 0x400(0x08)
	struct UStaticMeshComponent* SM_HM_OwlPost_Package_F; // 0x408(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Medium_003_W1; // 0x410(0x08)
	struct UChildActorComponent* BP_HW_Cup_interact_Water_B; // 0x418(0x08)
	struct UChildActorComponent* BP_HW_Cup_interact_Water_A; // 0x420(0x08)
	struct UChildActorComponent* BP_HW_Pastries_C; // 0x428(0x08)
	struct USceneComponent* Fire; // 0x430(0x08)
	struct USceneComponent* Scene; // 0x438(0x08)
};

