// BlueprintGeneratedClass BP_HamletB_J.BP_HamletB_J_C
// Size: 0x45a (Inherited: 0x257)
struct ABP_HamletB_J_C : ABP_Hamlet_Base_C {
	char pad_257[0x1]; // 0x257(0x01)
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x258(0x08)
	struct UStaticMeshComponent* SM_MERGED_Stone_trimBLDG_J; // 0x260(0x08)
	struct UStaticMeshComponent* SM_HamletB_J_Window_Glass_Int; // 0x268(0x08)
	struct UPointLightComponent* Window_Light10; // 0x270(0x08)
	struct UPointLightComponent* Window_Light9; // 0x278(0x08)
	struct UPointLightComponent* Window_Light8; // 0x280(0x08)
	struct UPointLightComponent* Window_Light7; // 0x288(0x08)
	struct UPointLightComponent* Window_Light6; // 0x290(0x08)
	struct UPointLightComponent* Window_Light5; // 0x298(0x08)
	struct UPointLightComponent* Window_Light4; // 0x2a0(0x08)
	struct UPointLightComponent* Window_Light3; // 0x2a8(0x08)
	struct UPointLightComponent* Window_Light2; // 0x2b0(0x08)
	struct UPointLightComponent* Window_Light1; // 0x2b8(0x08)
	struct UPointLightComponent* Window_Light; // 0x2c0(0x08)
	struct UChildActorComponent* BP_WalkSpeedVolume2; // 0x2c8(0x08)
	struct UChildActorComponent* BP_WalkSpeedVolume1; // 0x2d0(0x08)
	struct UChildActorComponent* BP_WalkSpeedVolume; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_COL_EXT_APL; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_COL_INT_PL; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_COL_INT_APL; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_COL_EXT_PL; // 0x2f8(0x08)
	struct USceneComponent* Collision; // 0x300(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_StoneStep_B; // 0x308(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_StoneStep_H; // 0x310(0x08)
	struct UChildActorComponent* BP_HamletB_Stairs_01; // 0x318(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_DefensiveTower_CrenulationBase_Broken_A8; // 0x320(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_DefensiveTower_CrenulationBase_A7; // 0x328(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_DefensiveTower_CrenulationBase_A6; // 0x330(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_DefensiveTower_CrenulationBase_Broken_A7; // 0x338(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_DefensiveTower_CrenulationBase_Broken_A6; // 0x340(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_DefensiveTower_CrenulationBase_Broken_A5; // 0x348(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_DefensiveTower_CrenulationBase_A5; // 0x350(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_DefensiveTower_CrenulationBase_Broken_A4; // 0x358(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_DefensiveTower_CrenulationBase_Broken_A3; // 0x360(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_DefensiveTower_CrenulationBase_A4; // 0x368(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_DefensiveTower_CrenulationBase_Broken_A2; // 0x370(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_DefensiveTower_CrenulationBase_A3; // 0x378(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_DefensiveTower_CrenulationBase_A2; // 0x380(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_DefensiveTower_CrenulationBase_Broken_A1; // 0x388(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_DefensiveTower_CrenulationBase_A1; // 0x390(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_DefensiveTower_CrenulationBase_A; // 0x398(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_DefensiveTower_CrenulationBase_Broken_A; // 0x3a0(0x08)
	struct UStaticMeshComponent* SM_HamletB_J_Window_Frame; // 0x3a8(0x08)
	struct UStaticMeshComponent* SM_HamletB_J_Walls_INT; // 0x3b0(0x08)
	struct UStaticMeshComponent* SM_HamletB_J_Walls_EXT; // 0x3b8(0x08)
	struct UStaticMeshComponent* SM_HamletB_J_Trims_INT; // 0x3c0(0x08)
	struct UStaticMeshComponent* SM_HamletB_J_Trims_EXT; // 0x3c8(0x08)
	struct UStaticMeshComponent* SM_HamletB_J_Stairs; // 0x3d0(0x08)
	struct UStaticMeshComponent* SM_HamletB_J_Window_Glass; // 0x3d8(0x08)
	struct UStaticMeshComponent* SM_HamletB_J_Roof_EXT; // 0x3e0(0x08)
	struct UStaticMeshComponent* SM_HamletB_J_Floor; // 0x3e8(0x08)
	struct UStaticMeshComponent* SM_HamletB_J_DoorFrame; // 0x3f0(0x08)
	struct UStaticMeshComponent* SM_HamletB_J_Chimney; // 0x3f8(0x08)
	struct UChildActorComponent* BP_Door_Template; // 0x400(0x08)
	struct UStaticMeshComponent* SM_HamletB_J_Roof_INT; // 0x408(0x08)
	struct USceneComponent* Hamlet; // 0x410(0x08)
	struct UCameraStackVolumeComponent* CameraStackVolume3; // 0x418(0x08)
	struct UCapsuleComponent* Capsule; // 0x420(0x08)
	struct UCameraStackVolumeComponent* CameraStackVolume2; // 0x428(0x08)
	struct UCameraStackVolumeComponent* CameraStackVolume1; // 0x430(0x08)
	struct UCameraStackVolumeComponent* CameraStackVolume; // 0x438(0x08)
	struct UBoxComponent* Box2; // 0x440(0x08)
	struct UBoxComponent* Box1; // 0x448(0x08)
	struct UBoxComponent* Box; // 0x450(0x08)
	enum class EDoorState Set Lock A Door State; // 0x458(0x01)
	enum class ELockDifficulty Set Lock A Difficulty; // 0x459(0x01)

	void UserConstructionScript(); // Function BP_HamletB_J.BP_HamletB_J_C.UserConstructionScript // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void ReceiveBeginPlay(); // Function BP_HamletB_J.BP_HamletB_J_C.ReceiveBeginPlay // (Event|Protected|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_BP_HamletB_J(int32_t EntryPoint); // Function BP_HamletB_J.BP_HamletB_J_C.ExecuteUbergraph_BP_HamletB_J // (Final|UbergraphFunction) // @ game+0x38a7480
};

