// BlueprintGeneratedClass BP_HM_Stacking_CauldronB.BP_HM_Stacking_CauldronB_C
// Size: 0x2e0 (Inherited: 0x248)
struct ABP_HM_Stacking_CauldronB_C : AActor {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x248(0x08)
	struct UObjectStateComponent* ObjectState; // 0x250(0x08)
	struct UStaticMeshComponent* SM_HM_Stacking_Cauldron_B_B_12; // 0x258(0x08)
	struct UStaticMeshComponent* SM_HM_Stacking_Cauldron_B_D_16; // 0x260(0x08)
	struct UStaticMeshComponent* SM_HM_Stacking_Cauldron_B_E_12; // 0x268(0x08)
	struct UStaticMeshComponent* SM_HM_Stacking_Cauldron_B_A_15; // 0x270(0x08)
	struct UStaticMeshComponent* SM_HM_Stacking_Cauldron_B_D_17; // 0x278(0x08)
	struct UStaticMeshComponent* SM_HM_Stacking_Cauldron_B_F_7; // 0x280(0x08)
	struct UStaticMeshComponent* SM_HM_Stacking_Cauldron_B_B_13; // 0x288(0x08)
	struct UStaticMeshComponent* SM_HM_Stacking_Cauldron_B_C_13; // 0x290(0x08)
	struct UPhysicalResponseComponent* PhysicalResponseD17; // 0x298(0x08)
	struct UStaticMeshComponent* SM_HM_Stacking_Cauldron_B_D_18; // 0x2a0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponseE12; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_HM_Stacking_Cauldron_B_E_13; // 0x2b0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponseC11; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_HM_Stacking_Cauldron_B_C_12; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_HM_Stacking_Cauldron_B_A_14; // 0x2c8(0x08)
	struct UPhysicalResponseComponent* Phys response main; // 0x2d0(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x2d8(0x08)

	void ObjectPhysicalResponseImpact(float ImpactIntensity, struct FName SpellName, struct FName ResponseConfigName, struct FVector& ImpactLocation); // Function BP_HM_Stacking_CauldronB.BP_HM_Stacking_CauldronB_C.ObjectPhysicalResponseImpact // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_BP_HM_Stacking_CauldronB(int32_t EntryPoint); // Function BP_HM_Stacking_CauldronB.BP_HM_Stacking_CauldronB_C.ExecuteUbergraph_BP_HM_Stacking_CauldronB // (Final|UbergraphFunction) // @ game+0x38a7480
};

