// BlueprintGeneratedClass BP_Hamlet_Class_A3_Interior_B.BP_Hamlet_Class_A3_Interior_B_C
// Size: 0x3f0 (Inherited: 0x248)
struct ABP_Hamlet_Class_A3_Interior_B_C : AActor {
	struct UDecalComponent* MI_HW_Decal_SootSmudge_3; // 0x248(0x08)
	struct UStaticMeshComponent* SM_HamletB_03_Merged_Firewood; // 0x250(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_Int_BCProps_CloseCrate_Medium_B1; // 0x258(0x08)
	struct UStaticMeshComponent* SM_HamletB_03_Merged_Parcels; // 0x260(0x08)
	struct UStaticMeshComponent* SM_HamletB_03_Merged_HangingProps; // 0x268(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_WoodTub_Medium_001_W1; // 0x270(0x08)
	struct UStaticMeshComponent* SM_HamletB_03_Merged_Books; // 0x278(0x08)
	struct UStaticMeshComponent* SM_HamletB_03_Merged_Kitchenware; // 0x280(0x08)
	struct UStaticMeshComponent* SM_HamletB_03_Merged_Bottles; // 0x288(0x08)
	struct UStaticMeshComponent* SM_HamletB_03_Merged_ThreadSpool; // 0x290(0x08)
	struct UStaticMeshComponent* SM_HamletB_03_Merged_Pots; // 0x298(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HW_3Broom_Table_E1; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_HamletB_03_Merged_Food1; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_HamletB_03_Merged_Vegetables; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_HamletB_03_Merged_Cauldrons; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_PaintFaceA_BkGrnd1; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Basket_Small_003_W1; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Stall_001_D1; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_Int_CastleDun_Bookcase_Shelf_A_W_03; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Stool_001_D1; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_StallRoof_001_D1; // 0x2e8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_Bucket_Small_002_W1; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_OpenCrate_Medium_B1; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_BroomStand_001_W1; // 0x300(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Bellows_003_W1; // 0x308(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_Bench_Long_001_D1; // 0x310(0x08)
	struct UStaticMeshComponent* SM_HM_potions_cabinet_narrow1; // 0x318(0x08)
	struct UStaticMeshComponent* SM_HW_SD_Couch_LeatherA1; // 0x320(0x08)
	struct UStaticMeshComponent* SM_HW_Rectangular_Rug_02; // 0x328(0x08)
	struct UStaticMeshComponent* SM_HW_3Broom_Table_C1; // 0x330(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_HM_TeaShop_TeaCup_A1; // 0x338(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_TeaShop_Pillows_A1; // 0x340(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_HM_Stacking_Cauldron_D1; // 0x348(0x08)
	struct UStaticMeshComponent* SM_HM_potions_cabinet_main1; // 0x350(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_Honeydukes_railing_E1; // 0x358(0x08)
	struct UStaticMeshComponent* SM_HM_Honeydukes_railing_D1; // 0x360(0x08)
	struct UStaticMeshComponent* SM_HM_Grandfather_Wall_Clock1; // 0x368(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_Gladrags_Thread_Spool_C1; // 0x370(0x08)
	struct UStaticMeshComponent* SM_HM_GEN_Mirror_C1; // 0x378(0x08)
	struct UStaticMeshComponent* SM_HM_GEN_EndTable_D1; // 0x380(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_FirePlaceCrane_B1; // 0x388(0x08)
	struct UStaticMeshComponent* SM_HM_Cauldron_FireStoker_A1; // 0x390(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Table_C_Chair_B1; // 0x398(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Jug_A1; // 0x3a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_HM_3Broom_Curtains1; // 0x3a8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_CampB_5m_PostA1; // 0x3b0(0x08)
	struct UStaticMeshComponent* SM_CampB_5x_Plank_A1; // 0x3b8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_BCProps_Eyelet_A1; // 0x3c0(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Frame_A1; // 0x3c8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_Hamlet_Floor1; // 0x3d0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_16SM_HW_Dishes_Goblet_A; // 0x3d8(0x08)
	struct UChildActorComponent* BP_HW_Cup_interact_Jug_B; // 0x3e0(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x3e8(0x08)
};

