// BlueprintGeneratedClass BP_Hamlet_Class_A6_Interior_B.BP_Hamlet_Class_A6_Interior_B_C
// Size: 0x3e8 (Inherited: 0x248)
struct ABP_Hamlet_Class_A6_Interior_B_C : AActor {
	struct UBoxComponent* SM_HW_Curtain_Sm_A_ExtraCollision; // 0x248(0x08)
	struct UStaticMeshComponent* SM_HamletA_06_B_Interior_Food_Merged; // 0x250(0x08)
	struct UStaticMeshComponent* SM_HW_Curtain_Sm_A; // 0x258(0x08)
	struct UStaticMeshComponent* SM_HamletA_06_B_Interior_Packages_Merged; // 0x260(0x08)
	struct UStaticMeshComponent* SM_HM_Grandfather_Wall_Clock; // 0x268(0x08)
	struct UStaticMeshComponent* SM_HamletA_06_B_Interior_Frames_Merged; // 0x270(0x08)
	struct UStaticMeshComponent* SM_HW_OpenBook_A; // 0x278(0x08)
	struct UStaticMeshComponent* SM_HM_Cauldron_Cauldron_D; // 0x280(0x08)
	struct UStaticMeshComponent* SM_Desk_SLY; // 0x288(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_BroomstickRack_A; // 0x290(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Table_D; // 0x298(0x08)
	struct UStaticMeshComponent* SM_HM_Cauldron_Cauldrons_O; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_HW_L_Book_Large_B; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_HM_FirePlaceCrane_B; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_HM_HogsHead_Bench_A; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_HM_Honeydukes_main_counter; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_HM_Quidditch_Counter; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_HamletA_06_B_Interior_Teashop_Merged; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_HM_Wardrobes_D; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_HW_HB_Chair_A; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_HW_LetterBundle_A; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_HW_ShavingStand; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_HW_SD_Couch_LeatherA; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_HamletA_06_B_Interior_HangingPlants_Merged; // 0x300(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Jug_002_W; // 0x308(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_ToolBox_001_W; // 0x310(0x08)
	struct UStaticMeshComponent* SM_HamletA_06_B_Interior_KitchenWare_Merged; // 0x318(0x08)
	struct UStaticMeshComponent* SM_OVR_Wood_Stove; // 0x320(0x08)
	struct UStaticMeshComponent* SM_HM_Cauldron_Cauldron_A; // 0x328(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Shovel_001_W; // 0x330(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Rake_001_W; // 0x338(0x08)
	struct UStaticMeshComponent* SM_HamletA_06_B_Interior_Rugs_Merged; // 0x340(0x08)
	struct UStaticMeshComponent* SM_HamletA_06_B_Interior_RopeandWood_Merged; // 0x348(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Pot_002_W; // 0x350(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_Bucket_Small_001_W; // 0x358(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_Int_BCProps_FoodBag_1bag_001_W; // 0x360(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_FoodBag_1bag_003_W; // 0x368(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_Bench_Medium_001_D; // 0x370(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_9SM_Int_BCProps_Barrel_001_W; // 0x378(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_Potions_Table; // 0x380(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_Cauldron_Cauldron_C; // 0x388(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_HM_3Broom_Chair_C; // 0x390(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_Quill_DisplayShelf_C; // 0x398(0x08)
	struct UStaticMeshComponent* SM_HamletA_06_B_Interior_Pumpkins_Merged; // 0x3a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_Int_BCProps_Pot_001_W; // 0x3a8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_HW_LetterCluster_A; // 0x3b0(0x08)
	struct UChildActorComponent* BP_FakeFog; // 0x3b8(0x08)
	struct UChildActorComponent* BP_HW_Cup_interact_Water_B; // 0x3c0(0x08)
	struct UWorldFXAudioComponent* WorldFXAudio-Amb_3D_Stove_Burning_Loop; // 0x3c8(0x08)
	struct UWorldFXAudioComponent* WorldFXAudio-Amb_3D_Cauldron_Boiling_Loop; // 0x3d0(0x08)
	struct UChildActorComponent* BP_HW_Pastries_C; // 0x3d8(0x08)
	struct USceneComponent* DefaultSceneRoot1; // 0x3e0(0x08)
};

