// BlueprintGeneratedClass BP_HW_VC_SolidTrim_Post_A.BP_HW_VC_SolidTrim_Post_A_C
// Size: 0x310 (Inherited: 0x248)
struct ABP_HW_VC_SolidTrim_Post_A_C : AActor {
	struct UStaticMeshComponent* SM_HW_GroundsQ_Brick_G7; // 0x248(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_Brick_H10; // 0x250(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_Brick_H9; // 0x258(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_Brick_G6; // 0x260(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_Brick_G5; // 0x268(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_Brick_H8; // 0x270(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_Brick_H7; // 0x278(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_Brick_H6; // 0x280(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_Brick_G4; // 0x288(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_Brick_G3; // 0x290(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_Brick_G2; // 0x298(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_Brick_G1; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_Brick_H5; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_Brick_H4; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_Brick_H3; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_Brick_H2; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_Brick_H1; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_Brick_H; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_Brick_G; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_DefensiveTower_Corner_G3; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_DefensiveTower_Corner_G2; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_DefensiveTower_Corner_G1; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_DefensiveTower_Corner_G; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_HW_VC_SolidTrim_Post; // 0x300(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x308(0x08)
};

