// BlueprintGeneratedClass BP_Hamlet_Class_AKB_Interior_01.BP_Hamlet_Class_AKB_Interior_01_C
// Size: 0x3a0 (Inherited: 0x248)
struct ABP_Hamlet_Class_AKB_Interior_01_C : AActor {
	struct UDecalComponent* MI_HW_Darkmosslichen1; // 0x248(0x08)
	struct UDecalComponent* MI_HW_Decal_Wood_WornStep2; // 0x250(0x08)
	struct UDecalComponent* MI_HW_Decal_Wood_WornStep01; // 0x258(0x08)
	struct UDecalComponent* MI_HW_Decal_PlasterWear_03; // 0x260(0x08)
	struct UStaticMeshComponent* SM_HamletA_01_AKB_PlantsandHanging_Merged; // 0x268(0x08)
	struct UStaticMeshComponent* SM_HamletA_01_AKB_Rocks_Merged; // 0x270(0x08)
	struct UStaticMeshComponent* SM_HamletA_01_AKB_Books_Merged; // 0x278(0x08)
	struct UStaticMeshComponent* SM_HamletA_01_AKB_Wood_Merged; // 0x280(0x08)
	struct UStaticMeshComponent* SM_PaintFaceA_BkGrnd; // 0x288(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Frame_A; // 0x290(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleDun_Jail_TreeRoots_A; // 0x298(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_BroomStand_001_W; // 0x2a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_HM_FireWood_Stack_B; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_HM_GEN_Mirror_C; // 0x2b0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_HW_3Broom_Table_E; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_HW_SD_Couch_LeatherA; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Bench_Medium_001_D; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Small_001_W; // 0x2d0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_CloseCrate_Small_002_W; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_StallRoof_001_D; // 0x2e0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_3Broom_Chair_A; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_HM_FullBed_Twin_D; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Stall_001_D; // 0x2f8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_Int_BCProps_CloseCrate_Large_002_W; // 0x300(0x08)
	struct UStaticMeshComponent* SM_HamletKeenbridge_Tree_COL; // 0x308(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_OL_FF_PineRoots_A1; // 0x310(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HW_3Broom_Table_C; // 0x318(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HW_Trash_CrumpledBall; // 0x320(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HW_UH_WoodBrace; // 0x328(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HW_Trash_PaperScraps_A; // 0x330(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_LonelyTower_Support_A; // 0x338(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_HM_3Broom_Curtains; // 0x340(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_HW_Garden_Planter_Dirt_B; // 0x348(0x08)
	struct UStaticMeshComponent* SM_OVR_TableCloth_01; // 0x350(0x08)
	struct UStaticMeshComponent* SM_HamletA_01_AKB_Cauldrons_Merged; // 0x358(0x08)
	struct UStaticMeshComponent* SM_HamletA_01_AKB_Rug_Merged; // 0x360(0x08)
	struct UStaticMeshComponent* SM_HamletA_01_AKB_Chains_Merged; // 0x368(0x08)
	struct UStaticMeshComponent* SM_HamletA_01_AKB_CupsandBottles_Merged; // 0x370(0x08)
	struct UStaticMeshComponent* SM_HamletA_01_AKB_OwlPost_Merged; // 0x378(0x08)
	struct UStaticMeshComponent* SM_HamletA_01_AKB_SecondFloor_Merged1; // 0x380(0x08)
	struct UChildActorComponent* BP_Hamlet_HangBarrel; // 0x388(0x08)
	struct UChildActorComponent* BP_Hamlet_HangBasket; // 0x390(0x08)
	struct USceneComponent* SharedRoot; // 0x398(0x08)
};

