// BlueprintGeneratedClass BP_HamletClassB_Interior_C4.BP_HamletClassB_Interior_C4_C
// Size: 0x6d8 (Inherited: 0x248)
struct ABP_HamletClassB_Interior_C4_C : AActor {
	struct UBoxComponent* Box; // 0x248(0x08)
	struct UDecalComponent* MI_OL_Decal_Spiderweb_C18_216; // 0x250(0x08)
	struct UDecalComponent* MI_P_Decal_Stain13_214; // 0x258(0x08)
	struct UDecalComponent* M_Cav_Decal_ChalkStain_212; // 0x260(0x08)
	struct UDecalComponent* M_Cav_Decal_ChalkStain_210; // 0x268(0x08)
	struct UDecalComponent* M_Cav_Decal_ChalkStain_208; // 0x270(0x08)
	struct UDecalComponent* M_Cav_Decal_ChalkStain_206; // 0x278(0x08)
	struct UDecalComponent* MI_CliffFaceIronDeposits_Decal2_204; // 0x280(0x08)
	struct UDecalComponent* MI_HW_Decal_Leak_202; // 0x288(0x08)
	struct UDecalComponent* MI_P_Decal_Stain14_200; // 0x290(0x08)
	struct UDecalComponent* MI_CliffFaceIronDeposits_Decal_198; // 0x298(0x08)
	struct UDecalComponent* MI_HW_Decal_Wood_WornStep6_196; // 0x2a0(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_A_194; // 0x2a8(0x08)
	struct UDecalComponent* MI_CavernDun_Decal_Algae_B2_192; // 0x2b0(0x08)
	struct UDecalComponent* M_Cav_Decal_ChalkStain_03_190; // 0x2b8(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Soot_A_188; // 0x2c0(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_AshCircle_B_186; // 0x2c8(0x08)
	struct UDecalComponent* MI_OL_Decal_Spiderweb_C17_184; // 0x2d0(0x08)
	struct UDecalComponent* MI_OL_Decal_Spiderweb_C16_182; // 0x2d8(0x08)
	struct UDecalComponent* MI_OL_Decal_Spiderweb_C15_180; // 0x2e0(0x08)
	struct UDecalComponent* MI_OL_Decal_Spiderweb_C14_178; // 0x2e8(0x08)
	struct UDecalComponent* MI_OL_Decal_Spiderweb_C13_176; // 0x2f0(0x08)
	struct UDecalComponent* MI_OL_Decal_Spiderweb_C12_174; // 0x2f8(0x08)
	struct UDecalComponent* MI_OL_Decal_Spiderweb_C11_172; // 0x300(0x08)
	struct UDecalComponent* MI_OL_Decal_Spiderweb_C10_170; // 0x308(0x08)
	struct UDecalComponent* MI_OL_Decal_Spiderweb_C9_168; // 0x310(0x08)
	struct UDecalComponent* MI_HW_Decal_Wood_WornStep5_166; // 0x318(0x08)
	struct UDecalComponent* MI_HW_Decal_Wood_WornStep4_164; // 0x320(0x08)
	struct UDecalComponent* MI_OL_Decal_Spiderweb_C8_162; // 0x328(0x08)
	struct UDecalComponent* MI_OL_Decal_Spiderweb_C7_160; // 0x330(0x08)
	struct UDecalComponent* MI_OL_Decal_Spiderweb_C6_158; // 0x338(0x08)
	struct UDecalComponent* MI_OL_Decal_Spiderweb_C5_156; // 0x340(0x08)
	struct UDecalComponent* MI_OL_Decal_Spiderweb_C4_154; // 0x348(0x08)
	struct UDecalComponent* MI_OL_Decal_Spiderweb_C3_152; // 0x350(0x08)
	struct UDecalComponent* MI_OL_Decal_Spiderweb_C2_150; // 0x358(0x08)
	struct UDecalComponent* MI_HW_Decal_Wood_WornStep3_148; // 0x360(0x08)
	struct UDecalComponent* MI_HW_Decal_Wood_WornStep2_146; // 0x368(0x08)
	struct UDecalComponent* MI_OL_Decal_Spiderweb_C_144; // 0x370(0x08)
	struct UDecalComponent* MI_HW_Decal_Wood_WornStep01_142; // 0x378(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_HM_Quid_BallBox_Quaffle_B1; // 0x380(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_Pillow_C1; // 0x388(0x08)
	struct UStaticMeshComponent* SM_HM_Mattress_E1; // 0x390(0x08)
	struct UStaticMeshComponent* SM_OVR_Kitchenware_item_A1; // 0x398(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_Cauldron_002; // 0x3a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_HW_Food_Dishware_E1; // 0x3a8(0x08)
	struct UStaticMeshComponent* SM_OVR_Kitchenware_item_C1; // 0x3b0(0x08)
	struct UStaticMeshComponent* SM_HW_RugBraided_C1; // 0x3b8(0x08)
	struct UStaticMeshComponent* SM_HM_Picture_Frame_G_HORIZ1; // 0x3c0(0x08)
	struct UStaticMeshComponent* SM_Rug_Persian01_Center1; // 0x3c8(0x08)
	struct UStaticMeshComponent* SM_Potion_WormwoodTable1; // 0x3d0(0x08)
	struct UStaticMeshComponent* SM_OVR_Kitchenware_item_A_lid1; // 0x3d8(0x08)
	struct UStaticMeshComponent* SM_HW_QuidditchPitch_Emblems_A1; // 0x3e0(0x08)
	struct UStaticMeshComponent* SM_Muggle_Compass1; // 0x3e8(0x08)
	struct UStaticMeshComponent* SM_HM_FirePlaceCrane_A1; // 0x3f0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_OpenCrate_Small_001_W1; // 0x3f8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Knife_002; // 0x400(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_FoodBag_1bag_003_W1; // 0x408(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_FoodBag_1bag_001_W1; // 0x410(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_Broomstick1; // 0x418(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_Basket_Square_Small_002_W1; // 0x420(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Basket_Small_002_W1; // 0x428(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Basket_Medium_001_W1; // 0x430(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HW_RugTassleE1; // 0x438(0x08)
	struct UStaticMeshComponent* SM_HW_RugBraided_D1; // 0x440(0x08)
	struct UStaticMeshComponent* SM_HW_RugBraided_A1; // 0x448(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HW_RoomDivider_B1; // 0x450(0x08)
	struct UStaticMeshComponent* SM_HW_QuidditchPitch_SmallFlags_Stripe1; // 0x458(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_HW_QuidditchPitch_SmallFlags_C1; // 0x460(0x08)
	struct UStaticMeshComponent* SM_HW_QuidditchPitch_Emblems_C1; // 0x468(0x08)
	struct UStaticMeshComponent* SM_HM_InkBottleWithQuills_B1; // 0x470(0x08)
	struct UStaticMeshComponent* SM_WE_Newspaper_02; // 0x478(0x08)
	struct UStaticMeshComponent* SM_HW_LetterCluster_E1; // 0x480(0x08)
	struct UStaticMeshComponent* SM_HW_LetterCluster_A1; // 0x488(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HW_L_Chair_C1; // 0x490(0x08)
	struct UStaticMeshComponent* SM_HW_QuidditchPitch_Banners_A1; // 0x498(0x08)
	struct UStaticMeshComponent* SM_HM_Quid_Snitch3; // 0x4a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_3Broom_BroomstickRack_B1; // 0x4a8(0x08)
	struct UStaticMeshComponent* SM_HM_BeaterStands_A1; // 0x4b0(0x08)
	struct UStaticMeshComponent* SM_HW_L_New_Book_A; // 0x4b8(0x08)
	struct UStaticMeshComponent* SM_HM_Neep_Pumpkin_B1; // 0x4c0(0x08)
	struct UStaticMeshComponent* SM_HW_HB_Couch_A_Bee1; // 0x4c8(0x08)
	struct UStaticMeshComponent* SM_HW_GenericTrunk_C_open1; // 0x4d0(0x08)
	struct UStaticMeshComponent* SM_HW_GenericTrunk_B1; // 0x4d8(0x08)
	struct UStaticMeshComponent* SM_HW_GenericTrunk_A1; // 0x4e0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HW_Food_Dishware_U1; // 0x4e8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_HW_Food_Dishware_D1; // 0x4f0(0x08)
	struct UStaticMeshComponent* SM_HW_Dishes_Pitcher1; // 0x4f8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_HW_Dishes_Goblet_A1; // 0x500(0x08)
	struct UStaticMeshComponent* SM_HW_Book1; // 0x508(0x08)
	struct UStaticMeshComponent* SM_HUFF_Desk1; // 0x510(0x08)
	struct UStaticMeshComponent* SM_HM_TeaShop_Curtains_A1; // 0x518(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_InkBottles_B1; // 0x520(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_HM_Quill_DisplayShelf_B1; // 0x528(0x08)
	struct UStaticMeshComponent* SM_HM_Quid_Snitch2; // 0x530(0x08)
	struct UStaticMeshComponent* SM_HM_Quidditch_TrophyLow_A1; // 0x538(0x08)
	struct UStaticMeshComponent* SM_HM_Quidditch_TrophyD1; // 0x540(0x08)
	struct UStaticMeshComponent* SM_HM_Quidditch_TrophyB1; // 0x548(0x08)
	struct UStaticMeshComponent* SM_HM_Quidditch_Shelves_C1; // 0x550(0x08)
	struct UStaticMeshComponent* SM_HM_Quidditch_Display_Case_A1; // 0x558(0x08)
	struct UStaticMeshComponent* SM_HM_Quidditch_Counter1; // 0x560(0x08)
	struct UStaticMeshComponent* SM_HM_Quid_BallBox_Open1; // 0x568(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_HangingProps_Bags_005_W1; // 0x570(0x08)
	struct UStaticMeshComponent* SM_HM_Ollivanders_WandBox_03B1; // 0x578(0x08)
	struct UStaticMeshComponent* SM_HM_Ollivanders_WandBox_02C1; // 0x580(0x08)
	struct UStaticMeshComponent* SM_HM_Neep_Pumpkin_E1; // 0x588(0x08)
	struct UStaticMeshComponent* SM_HM_Letter_A1; // 0x590(0x08)
	struct UStaticMeshComponent* SM_HM_Honeydukes_showcase_B1; // 0x598(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_HM_3Broom_Bottle_B1; // 0x5a0(0x08)
	struct UStaticMeshComponent* SM_HM_HogsHead_Big_Barrel1; // 0x5a8(0x08)
	struct UStaticMeshComponent* SM_HM_HangCloth_02; // 0x5b0(0x08)
	struct UStaticMeshComponent* SM_HM_Grandfather_Wall_Clock1; // 0x5b8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_HM_GEN_EndTable_B1; // 0x5c0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_Bed_E1; // 0x5c8(0x08)
	struct UStaticMeshComponent* SM_HM_Mattress_B; // 0x5d0(0x08)
	struct UStaticMeshComponent* SM_HW_QuidditchPitch_SmallFlags_AA1; // 0x5d8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_Curtain_small1; // 0x5e0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_Cloth_06; // 0x5e8(0x08)
	struct UStaticMeshComponent* SM_HM_Cloth_03; // 0x5f0(0x08)
	struct UStaticMeshComponent* SM_HM_Cauldron_FireStoker_B1; // 0x5f8(0x08)
	struct UStaticMeshComponent* SM_FlyingClassBroom_02; // 0x600(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_HM_3Broom_Chair_A1; // 0x608(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_Quid_BallBox_Quaffle_Bludger1; // 0x610(0x08)
	struct UStaticMeshComponent* SM_Hamlet_Cuttingboard_03; // 0x618(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CCL_Food_Bread_B1; // 0x620(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeStake_C1; // 0x628(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_Cavern_2m_PlankA_D1; // 0x630(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_HM_3Broom_Bottle_A; // 0x638(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_Int_BCProps_Spoon_003; // 0x640(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_BCProps_Eyelet_A1; // 0x648(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CCL_Food_Bread_A; // 0x650(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_HangingProps_Bags_004_W1; // 0x658(0x08)
	struct UStaticMeshComponent* SM_CampA_Int_Curtain_02B2; // 0x660(0x08)
	struct UStaticMeshComponent* SM_BCProps_Wood_Chopped_Small_003; // 0x668(0x08)
	struct UStaticMeshComponent* SM_BCProps_FoodBag_2bag_002; // 0x670(0x08)
	struct UStaticMeshComponent* SM_BCProps_FloorCloth_E1; // 0x678(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_35SM_BCProps_Apple_B1; // 0x680(0x08)
	struct UStaticMeshComponent* SM_HM_Dervish_Rag1; // 0x688(0x08)
	struct UStaticMeshComponent* SM_Dresser_HUF1; // 0x690(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_Potion_06; // 0x698(0x08)
	struct UStaticMeshComponent* SM_HM_MixingBowl1; // 0x6a0(0x08)
	struct UChildActorComponent* BP_Int_BCProps_Basket_Medium_001; // 0x6a8(0x08)
	struct UChildActorComponent* BP_HW_Trashcan_Simple; // 0x6b0(0x08)
	struct UChildActorComponent* BP_HW_L_New_Book_G; // 0x6b8(0x08)
	struct UChildActorComponent* BP_HW_L_New_Book_E; // 0x6c0(0x08)
	struct UChildActorComponent* BP_HM_Neep_Pumpkin_E; // 0x6c8(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x6d0(0x08)
};

