// BlueprintGeneratedClass BP_HW_PR_LensB.BP_HW_PR_LensB_C
// Size: 0x308 (Inherited: 0x248)
struct ABP_HW_PR_LensB_C : AActor {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x248(0x08)
	struct UStaticMeshComponent* GC_HW_PR_Lens_B_Piece_12; // 0x250(0x08)
	struct UStaticMeshComponent* GC_HW_PR_Lens_B_Piece_11; // 0x258(0x08)
	struct UStaticMeshComponent* GC_HW_PR_Lens_B_Piece_16; // 0x260(0x08)
	struct UStaticMeshComponent* GC_HW_PR_Lens_B_Piece_14; // 0x268(0x08)
	struct UStaticMeshComponent* GC_HW_PR_Lens_B_Piece_05; // 0x270(0x08)
	struct UStaticMeshComponent* GC_HW_PR_Lens_B_Piece_04; // 0x278(0x08)
	struct UStaticMeshComponent* GC_HW_PR_Lens_B_Piece_08; // 0x280(0x08)
	struct UStaticMeshComponent* GC_HW_PR_Lens_B_Piece_07; // 0x288(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse14; // 0x290(0x08)
	struct UStaticMeshComponent* GC_HW_PR_Lens_B_Piece_15; // 0x298(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse12; // 0x2a0(0x08)
	struct UStaticMeshComponent* GC_HW_PR_Lens_B_Piece_13; // 0x2a8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse9; // 0x2b0(0x08)
	struct UStaticMeshComponent* GC_HW_PR_Lens_B_Piece_09; // 0x2b8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse6; // 0x2c0(0x08)
	struct UStaticMeshComponent* GC_HW_PR_Lens_B_Piece_06; // 0x2c8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse3; // 0x2d0(0x08)
	struct UStaticMeshComponent* GC_HW_PR_Lens_B_Piece_03; // 0x2d8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse2; // 0x2e0(0x08)
	struct UStaticMeshComponent* GC_HW_PR_Lens_B_Piece_02; // 0x2e8(0x08)
	struct UStaticMeshComponent* GC_HW_PR_Lens_B_Piece_01; // 0x2f0(0x08)
	struct UPhysicalResponseComponent* Phys response main; // 0x2f8(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x300(0x08)

	void ObjectPhysicalResponseImpact(float ImpactIntensity, struct FName SpellName, struct FName ResponseConfigName, struct FVector& ImpactLocation); // Function BP_HW_PR_LensB.BP_HW_PR_LensB_C.ObjectPhysicalResponseImpact // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_BP_HW_PR_LensB(int32_t EntryPoint); // Function BP_HW_PR_LensB.BP_HW_PR_LensB_C.ExecuteUbergraph_BP_HW_PR_LensB // (Final|UbergraphFunction) // @ game+0x38a7480
};

