// BlueprintGeneratedClass BP_HM_PR_SpringDecor_Bells_C.BP_HM_PR_SpringDecor_Bells_C_C
// Size: 0x2e0 (Inherited: 0x248)
struct ABP_HM_PR_SpringDecor_Bells_C_C : AActor {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x248(0x08)
	struct UStaticMeshComponent* GC_HM_SpringDecor_Bells_A_PR_Piece_06; // 0x250(0x08)
	struct UStaticMeshComponent* GC_HM_SpringDecor_Bells_A_PR_COL; // 0x258(0x08)
	struct UObjectStateComponent* ObjectState; // 0x260(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse08; // 0x268(0x08)
	struct UStaticMeshComponent* GC_HM_SpringDecor_Bells_A_PR_Piece_08; // 0x270(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse07; // 0x278(0x08)
	struct UStaticMeshComponent* GC_HM_SpringDecor_Bells_A_PR_Piece_07; // 0x280(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse05; // 0x288(0x08)
	struct UStaticMeshComponent* GC_HM_SpringDecor_Bells_A_PR_Piece_05; // 0x290(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse04; // 0x298(0x08)
	struct UStaticMeshComponent* GC_HM_SpringDecor_Bells_A_PR_Piece_04; // 0x2a0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse03; // 0x2a8(0x08)
	struct UStaticMeshComponent* GC_HM_SpringDecor_Bells_A_PR_Piece_03; // 0x2b0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse02; // 0x2b8(0x08)
	struct UStaticMeshComponent* GC_HM_SpringDecor_Bells_A_PR_Piece_02; // 0x2c0(0x08)
	struct UStaticMeshComponent* GC_HM_SpringDecor_Bells_C_PR; // 0x2c8(0x08)
	struct UPhysicalResponseComponent* Phys response main; // 0x2d0(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x2d8(0x08)

	void ObjectPhysicalResponseImpact(float ImpactIntensity, struct FName SpellName, struct FName ResponseConfigName, struct FVector& ImpactLocation); // Function BP_HM_PR_SpringDecor_Bells_C.BP_HM_PR_SpringDecor_Bells_C_C.ObjectPhysicalResponseImpact // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_BP_HM_PR_SpringDecor_Bells_C(int32_t EntryPoint); // Function BP_HM_PR_SpringDecor_Bells_C.BP_HM_PR_SpringDecor_Bells_C_C.ExecuteUbergraph_BP_HM_PR_SpringDecor_Bells_C // (Final|UbergraphFunction) // @ game+0x38a7480
};

