// BlueprintGeneratedClass BP_HW_Garden_WallFountain_A.BP_HW_Garden_WallFountain_A_C
// Size: 0x290 (Inherited: 0x248)
struct ABP_HW_Garden_WallFountain_A_C : AActor {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x248(0x08)
	struct UAkComponent* Ak_BP_HW_Garden_WallFountain_A; // 0x250(0x08)
	struct UParticleSystemComponent* VFX_P_HW_BT_FountainStreamSplash; // 0x258(0x08)
	struct UParticleSystemComponent* VFX_P_HW_BT_FountainStream; // 0x260(0x08)
	struct UStaticMeshComponent* SM_HW_Garden_WallFountain_WaterPlane; // 0x268(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_WallFountain_C; // 0x270(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_WallFountain_Face_A; // 0x278(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_WallFountain_B; // 0x280(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x288(0x08)

	void ReceiveBeginPlay(); // Function BP_HW_Garden_WallFountain_A.BP_HW_Garden_WallFountain_A_C.ReceiveBeginPlay // (Event|Protected|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_BP_HW_Garden_WallFountain_A(int32_t EntryPoint); // Function BP_HW_Garden_WallFountain_A.BP_HW_Garden_WallFountain_A_C.ExecuteUbergraph_BP_HW_Garden_WallFountain_A // (Final|UbergraphFunction|HasDefaults) // @ game+0x38a7480
};

