// BlueprintGeneratedClass BP_HW_DisplayCase_R_Interact.BP_HW_DisplayCase_R_Interact_C
// Size: 0x380 (Inherited: 0x2f0)
struct ABP_HW_DisplayCase_R_Interact_C : ABP_HW_DisplayCase_Interact_C {
	struct UStaticMeshComponent* SM_HW_GST_HeadMaster_TowerSeal; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_HUM_M_Acc_DuelingMedalU; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_HW_TrophyPlaque_D; // 0x300(0x08)
	struct UStaticMeshComponent* SM_HUM_M_Acc_DuelingMedalU1; // 0x308(0x08)
	struct UStaticMeshComponent* W; // 0x310(0x08)
	struct UStaticMeshComponent* SM_CastleDun_FloorPlate_D; // 0x318(0x08)
	struct UStaticMeshComponent* SM_Gift_ScholarParchment; // 0x320(0x08)
	struct UStaticMeshComponent* SM_HW_TrophyPlaque_Rav_Sly; // 0x328(0x08)
	struct UStaticMeshComponent* SM_HW_TrophyPlaque_A1; // 0x330(0x08)
	struct UStaticMeshComponent* SM_HW_TrophyPlaque_A; // 0x338(0x08)
	struct UStaticMeshComponent* SM_HW_TriviaTrophy_B; // 0x340(0x08)
	struct UStaticMeshComponent* SM_HW_TriviaTrophy_C; // 0x348(0x08)
	struct UStaticMeshComponent* SM_HM_Quidditch_TrophyLow_C; // 0x350(0x08)
	struct UStaticMeshComponent* SM_Gift_Trophy; // 0x358(0x08)
	struct UStaticMeshComponent* SM_HM_Quidditch_TrophyD; // 0x360(0x08)
	struct USceneComponent* ForTag; // 0x368(0x08)
	struct UStaticMeshComponent* SM_HW_SideTable_G; // 0x370(0x08)
	struct UTextRenderComponent* Text Do Something; // 0x378(0x08)

	void GetTextDoSomething(struct UTextRenderComponent*& TextRenderComponent); // Function BP_HW_DisplayCase_R_Interact.BP_HW_DisplayCase_R_Interact_C.GetTextDoSomething // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void UserConstructionScript(); // Function BP_HW_DisplayCase_R_Interact.BP_HW_DisplayCase_R_Interact_C.UserConstructionScript // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
};

