// BlueprintGeneratedClass BP_Hamlet_Class_A_ShedA_Interior_A.BP_Hamlet_Class_A_ShedA_Interior_A_C
// Size: 0x320 (Inherited: 0x248)
struct ABP_Hamlet_Class_A_ShedA_Interior_A_C : AActor {
	struct UDecalComponent* MI_P_Decal_Puddle_2; // 0x248(0x08)
	struct UDecalComponent* MI_HW_WhiteLichen; // 0x250(0x08)
	struct UDecalComponent* MI_HW_Decal_Wood_WornStep01; // 0x258(0x08)
	struct UStaticMeshComponent* SM_HamletA_Shed_A2_Books_Merged; // 0x260(0x08)
	struct UStaticMeshComponent* SM_HamletA_Shed_A2_ScrollsPaperLetters_Merged; // 0x268(0x08)
	struct UStaticMeshComponent* SM_HamletA_Shed_PotionsIngredients_Merged; // 0x270(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CampB_5m_PostA; // 0x278(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Cairn_Bone_Skull_C; // 0x280(0x08)
	struct UStaticMeshComponent* SM_HM_Cauldron_Stand_F; // 0x288(0x08)
	struct UStaticMeshComponent* SM_HM_Cauldron_Stand_E; // 0x290(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_Stacking_Cauldron_A; // 0x298(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Bottle_D; // 0x2a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HW_DAO_CreepyFrame_A; // 0x2a8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_3Broom_Bottle_D_Empty; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_DB_GR_Desk; // 0x2b8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_3Broom_Bottle_B; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_HW_BS_Cage_B; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_HM_Pillow_A; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_BCProps_FloorCloth_E; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_CastleDun_Bookcase_A1; // 0x2e0(0x08)
	struct UChildActorComponent* Sconce; // 0x2e8(0x08)
	struct UChildActorComponent* BP_Candles4; // 0x2f0(0x08)
	struct UChildActorComponent* BP_Candles3; // 0x2f8(0x08)
	struct UChildActorComponent* BP_Cairn_SpineCandle_C; // 0x300(0x08)
	struct UChildActorComponent* BP_Cairn_SpineCandle_A; // 0x308(0x08)
	struct UChildActorComponent* BP_Candles; // 0x310(0x08)
	struct USceneComponent* SharedRoot; // 0x318(0x08)
};

