// BlueprintGeneratedClass BP_HW_WallPiece_L_Dwiz.BP_HW_WallPiece_L_Dwiz_C
// Size: 0x340 (Inherited: 0x2a8)
struct ABP_HW_WallPiece_L_Dwiz_C : ATransfigurationObjectBase {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2a8(0x08)
	struct UDeferredChildActorComponent* Deferred_Dressing02; // 0x2b0(0x08)
	struct UDeferredChildActorComponent* Deferred_Dressing01; // 0x2b8(0x08)
	struct UConjurationSurfaceShapeComponent* ConjurationSurfaceShape; // 0x2c0(0x08)
	struct UConjurationSnappingWallComponent* ConjurationSnappingWall; // 0x2c8(0x08)
	struct UOdcAuthoredObstacleSetupComponent* OdcAuthoredObstacleSetup; // 0x2d0(0x08)
	struct UAkComponent* AkComponent; // 0x2d8(0x08)
	struct UStaticMeshComponent* Cube; // 0x2e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent036; // 0x2e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent034; // 0x2f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent033; // 0x2f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent012; // 0x300(0x08)
	struct UStaticMeshComponent* StaticMeshComponent011; // 0x308(0x08)
	struct UStaticMeshComponent* StaticMeshComponent010; // 0x310(0x08)
	struct UStaticMeshComponent* StaticMeshComponent052; // 0x318(0x08)
	struct UStaticMeshComponent* StaticMeshComponent048; // 0x320(0x08)
	struct UStaticMeshComponent* StaticMeshComponent047; // 0x328(0x08)
	struct UPhysicalResponseComponent* PhysicalResponseMain; // 0x330(0x08)
	struct USceneComponent* SharedRoot; // 0x338(0x08)

	void ObjectPhysicalResponseImpact(float ImpactIntensity, struct FName SpellName, struct FName ResponseConfigName, struct FVector& ImpactLocation); // Function BP_HW_WallPiece_L_Dwiz.BP_HW_WallPiece_L_Dwiz_C.ObjectPhysicalResponseImpact // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_BP_HW_WallPiece_L_Dwiz(int32_t EntryPoint); // Function BP_HW_WallPiece_L_Dwiz.BP_HW_WallPiece_L_Dwiz_C.ExecuteUbergraph_BP_HW_WallPiece_L_Dwiz // (Final|UbergraphFunction|HasDefaults) // @ game+0x38a7480
};

