// BlueprintGeneratedClass BP_Hamlet_Class_A9_Interior_A.BP_Hamlet_Class_A9_Interior_A_C
// Size: 0x3c8 (Inherited: 0x248)
struct ABP_Hamlet_Class_A9_Interior_A_C : AActor {
	struct UParticleSystemComponent* P_fireflies; // 0x248(0x08)
	struct UChildActorComponent* BP_HW_Apple_Bowl_Yellow; // 0x250(0x08)
	struct UStaticMeshComponent* SM_HamletA_09_Interior_A_Cloth_Merged; // 0x258(0x08)
	struct UStaticMeshComponent* SM_HamletA_09_Interior_A_Pots_Merged; // 0x260(0x08)
	struct UStaticMeshComponent* SM_HamletA_09_Interior_A_FoodDishes_Merged; // 0x268(0x08)
	struct UStaticMeshComponent* SM_HamletA_09_Interior_A_NeepPlants_Merged; // 0x270(0x08)
	struct UStaticMeshComponent* SM_HamletA_09_Interior_A_Ivy_Merged; // 0x278(0x08)
	struct UStaticMeshComponent* SM_HamletA_09_Interior_A_DetailDressing_Merged; // 0x280(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_7SM_HS_Table_Short_001_D; // 0x288(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Rake_001_W; // 0x290(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_Cauldron_Cauldron_B; // 0x298(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_Int_BCProps_Bucket_Small_002_W; // 0x2a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CampB_2m_PlankA; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Jug_002_W; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Basket_Small_003_W; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Bucket_Small_001_W; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Hammer_001_W; // 0x2c8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_Jug_001_W; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Pitchfork_001_W; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_BCProps_Wood_Chopped_Small_002; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_CampA_NonClimbableWall_Wood_4m_F; // 0x2e8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_CastleDun_WoodenBeam_D; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Table_C_Chair_B; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Table_D_Chair_C; // 0x300(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_BLDG_TeaShop_Flowers_A; // 0x308(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_HM_BLDG_TeaShop_Flowers_D; // 0x310(0x08)
	struct UStaticMeshComponent* SM_HM_Honeydukes_Cellar_Shelf_A; // 0x318(0x08)
	struct UStaticMeshComponent* SM_HM_Potions_Brew_Station; // 0x320(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_Potions_HangingPot_B; // 0x328(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_Potions_HangingPot_C; // 0x330(0x08)
	struct UStaticMeshComponent* SM_HW_LetterCluster_C; // 0x338(0x08)
	struct UStaticMeshComponent* SM_HW_PC_PotionTable_Rack_A; // 0x340(0x08)
	struct UStaticMeshComponent* SM_HW_VE_DivRug; // 0x348(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_CloseCrate_Medium_001_W; // 0x350(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Medium_002_W; // 0x358(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Medium_B; // 0x360(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_HangingProps_Plants_002_W; // 0x368(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_HangingProps_Plants_003_W; // 0x370(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_Int_BCProps_HangingProps_Plants_004_W; // 0x378(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_Shovel_001_W; // 0x380(0x08)
	struct UStaticMeshComponent* SM_HM_Potions_HangingPot_A; // 0x388(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_CloseCrate_Small_002_W; // 0x390(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_11SM_Sanc_Paper_01; // 0x398(0x08)
	struct UStaticMeshComponent* SM_HM_Cauldron_Cauldron_A; // 0x3a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_Cauldron_Cauldron_D; // 0x3a8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_Cauldron_Cauldron_C; // 0x3b0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Sanc_HandTrowel; // 0x3b8(0x08)
	struct USceneComponent* SharedRoot; // 0x3c0(0x08)
};

