// BlueprintGeneratedClass BP_HS_AR_Keensbridge_bridge.BP_HS_AR_Keensbridge_bridge_C
// Size: 0x618 (Inherited: 0x248)
struct ABP_HS_AR_Keensbridge_bridge_C : AActor {
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleDun_JailHall_Stones_I; // 0x248(0x08)
	struct UDecalComponent* M_3Broom_Ground_Trans_Moss_Decal6; // 0x250(0x08)
	struct UDecalComponent* M_3Broom_Ground_Trans_Moss_Decal5; // 0x258(0x08)
	struct UDecalComponent* M_3Broom_Ground_Trans_Moss_Decal4; // 0x260(0x08)
	struct UDecalComponent* M_3Broom_Ground_Trans_Moss_Decal3; // 0x268(0x08)
	struct UDecalComponent* M_3Broom_Ground_Trans_Moss_Decal2; // 0x270(0x08)
	struct UDecalComponent* M_3Broom_Ground_Trans_Moss_Decal; // 0x278(0x08)
	struct UDecalComponent* MI_CairnDun_Decal_Grass_A2; // 0x280(0x08)
	struct UDecalComponent* MI_CairnDun_Decal_Grass_A; // 0x288(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Damage_A_7; // 0x290(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Damage_A_6; // 0x298(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Damage_A_5; // 0x2a0(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Damage_A_4; // 0x2a8(0x08)
	struct UDecalComponent* MI_Castle_Ruin1_Decal_RockDamage_3; // 0x2b0(0x08)
	struct UDecalComponent* MI_Castle_Ruin1_Decal_SootSmudge_11; // 0x2b8(0x08)
	struct UDecalComponent* MI_Castle_Ruin1_Decal_SootSmudge_10; // 0x2c0(0x08)
	struct UDecalComponent* MI_Castle_Ruin1_Decal_SootSmudge_9; // 0x2c8(0x08)
	struct UDecalComponent* MI_Castle_Ruin1_Decal_SootSmudge_8; // 0x2d0(0x08)
	struct UDecalComponent* MI_Cairn_Decal_Dirt_A17; // 0x2d8(0x08)
	struct UDecalComponent* MI_Cairn_Decal_Dirt_A16; // 0x2e0(0x08)
	struct UDecalComponent* MI_Cairn_Decal_Dirt_A15; // 0x2e8(0x08)
	struct UDecalComponent* MI_Cairn_Decal_Dirt_A14; // 0x2f0(0x08)
	struct UDecalComponent* MI_Cairn_Decal_Dirt_A13; // 0x2f8(0x08)
	struct UDecalComponent* MI_Cairn_Decal_Dirt_A12; // 0x300(0x08)
	struct UDecalComponent* MI_Cairn_Decal_Dirt_A11; // 0x308(0x08)
	struct UDecalComponent* MI_Cairn_Decal_Damage_A4; // 0x310(0x08)
	struct UDecalComponent* MI_Cairn_Decal_Dirt_A10; // 0x318(0x08)
	struct UDecalComponent* MI_P_Decal_Stain27; // 0x320(0x08)
	struct UDecalComponent* MI_Cairn_Decal_Dirt_A9; // 0x328(0x08)
	struct UDecalComponent* MI_Cairn_Decal_Dirt_A8; // 0x330(0x08)
	struct UDecalComponent* MI_Cairn_Decal_Dirt_A7; // 0x338(0x08)
	struct UDecalComponent* MI_Cairn_Decal_Damage_A3; // 0x340(0x08)
	struct UDecalComponent* MI_Cairn_Decal_Dirt_A6; // 0x348(0x08)
	struct UDecalComponent* MI_P_Decal_Stain26; // 0x350(0x08)
	struct UDecalComponent* MI_P_Decal_Stain25; // 0x358(0x08)
	struct UDecalComponent* MI_P_Decal_Stain24; // 0x360(0x08)
	struct UDecalComponent* MI_Castle_Ruin1_Decal_SootSmudge_7; // 0x368(0x08)
	struct UDecalComponent* MI_Cairn_Decal_Dirt_A5; // 0x370(0x08)
	struct UDecalComponent* MI_Cairn_Decal_Dirt_A4; // 0x378(0x08)
	struct UDecalComponent* MI_Cairn_Decal_Dirt_A3; // 0x380(0x08)
	struct UDecalComponent* MI_Cairn_Decal_Dirt_A2; // 0x388(0x08)
	struct UDecalComponent* MI_P_Decal_Stain23; // 0x390(0x08)
	struct UDecalComponent* MI_Castle_Ruin1_Decal_SootSmudge_6; // 0x398(0x08)
	struct UDecalComponent* MI_Cairn_Decal_Dirt_A; // 0x3a0(0x08)
	struct UDecalComponent* MI_Cairn_Decal_Damage_A2; // 0x3a8(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Damage_A_3; // 0x3b0(0x08)
	struct UDecalComponent* MI_Cairn_Decal_Damage_A; // 0x3b8(0x08)
	struct UStaticMeshComponent* SM_Iyv_English_Mesh_04_B; // 0x3c0(0x08)
	struct UStaticMeshComponent* SM_Ivy_English_Lg_D; // 0x3c8(0x08)
	struct UStaticMeshComponent* SM_HM_Bridge_Base_003; // 0x3d0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_OL2_StickPile_B; // 0x3d8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Iyv_English_Mesh_04; // 0x3e0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_OL2_StickPile_E; // 0x3e8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Ivy_English_Lg_C; // 0x3f0(0x08)
	struct UStaticMeshComponent* SM_CastleDun_Arch_Trim_D1; // 0x3f8(0x08)
	struct UStaticMeshComponent* SM_CastleDun_Jail_Block_H; // 0x400(0x08)
	struct UStaticMeshComponent* SM_CastleDun_Jail_Block_L; // 0x408(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_CastleDun_Debris_RubbleMound_A; // 0x410(0x08)
	struct UStaticMeshComponent* SM_OL2_StickPile_D; // 0x418(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_11SM_CastleDun_JailHall_Stones_C; // 0x420(0x08)
	struct UStaticMeshComponent* SM_HM_Bridge_Base_Trim_003; // 0x428(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleDun_WoodenBeamPeg_A; // 0x430(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_CastleRuins_1_Broken_F_a1; // 0x438(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_8SM_C_Dun_Blocks_x6_A; // 0x440(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_1_Broken_B_b1; // 0x448(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_C_b1; // 0x450(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_B; // 0x458(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_53SM_CastleRuins_1_Top_Trim_Cap_C; // 0x460(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_HW_LeafDebris_2_B; // 0x468(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_OL2_StickPile_F; // 0x470(0x08)
	struct UStaticMeshComponent* SM_OL2_StickPile_C; // 0x478(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_BCProps_Ivy_Wall_Single_D; // 0x480(0x08)
	struct UStaticMeshComponent* SM_CampB_2m_PlankD; // 0x488(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_CampB_5m_PostA; // 0x490(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleDun_Jail_Block_F1; // 0x498(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_CastleRuins_1_Broken_B_a2; // 0x4a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_Ivy_English_Lg_B; // 0x4a8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_14SM_OL2_StickPile_A; // 0x4b0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_Ivy_Floor_01; // 0x4b8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_8SM_Iyv_English_Mesh_03; // 0x4c0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_AshTree_ClusterD_Master; // 0x4c8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_BCProps_Ivy_Wall_Single_E; // 0x4d0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_9SM_CampB_2m_PlankA; // 0x4d8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CampB_5m_PlankA; // 0x4e0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_19SM_CastleDun_JailHall_Stones_E; // 0x4e8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_12SM_CastleRuins_1_Tower_ArchDome_Pillar_A1; // 0x4f0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_FenceB_Begin; // 0x4f8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Ivy_Branch_Bare_E; // 0x500(0x08)
	struct UStaticMeshComponent* SM_GrassMain_Dark; // 0x508(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_16SM_FenceB_Seperate_Post; // 0x510(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_BCProps_Ivy_Wall_Hanging_C; // 0x518(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_9SM_BCProps_Ivy_Wall_Small_A; // 0x520(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_15SM_CampB_2m_PlankC; // 0x528(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_24SM_CastleDun_DebrisMound_Jail_A; // 0x530(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_CastleRuins_1_Broken_End_cap_C; // 0x538(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_DeadLeafThick_02; // 0x540(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_FenceB_End; // 0x548(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_9SM_Ivy_Branch_Bare_G; // 0x550(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_21SM_GrassMain; // 0x558(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_36SM_BCProps_Ivy_Wall_Base_A; // 0x560(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_15SM_BogGrass_B; // 0x568(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_CastleDun_Jail_Block_A1; // 0x570(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_8SM_DiricawlNest_C; // 0x578(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_21SM_FenceB_Seperate_Beam; // 0x580(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_BCProps_Ivy_Wall_Hanging_A; // 0x588(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_CampB_2m_PostA; // 0x590(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_24SM_DeadLeafThick_01_Fall2; // 0x598(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_19SM_DeadLeafThin_01_Fall; // 0x5a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_28SM_Dun_PurpleMooreGrass_A_Master; // 0x5a8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_40SM_HW_LeafDebris_2_C; // 0x5b0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_BCProps_Ivy_Wall_Base_B; // 0x5b8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_CastleRuins_1_Tower_ArchDome_Pillar_A; // 0x5c0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_Ivy_Branch_Bare_D; // 0x5c8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_Iyv_English_Mesh_06_B; // 0x5d0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_Cap_A_a3; // 0x5d8(0x08)
	struct UStaticMeshComponent* SM_HM_Bridge_Base_005_pl_COL1; // 0x5e0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_7SM_TallGrass_03_Master; // 0x5e8(0x08)
	struct UStaticMeshComponent* SM_HM_Bridge_Base_Trim_006; // 0x5f0(0x08)
	struct UStaticMeshComponent* SM_HM_Bridge_Base_Trim_005; // 0x5f8(0x08)
	struct UStaticMeshComponent* SM_HM_Bridge_Base_Trim_004; // 0x600(0x08)
	struct UStaticMeshComponent* SM_HM_Bridge_Base_Trim_005_Collision; // 0x608(0x08)
	struct USceneComponent* SharedRoot; // 0x610(0x08)
};

