// BlueprintGeneratedClass BP_HW_Garden_Fountain_A.BP_HW_Garden_Fountain_A_C
// Size: 0x320 (Inherited: 0x248)
struct ABP_HW_Garden_Fountain_A_C : AActor {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x248(0x08)
	struct UAkComponent* Ak_BP_HW_Garden_Fountain_Bottom; // 0x250(0x08)
	struct UAkComponent* Ak_BP_HW_Garden_Fountain_Top; // 0x258(0x08)
	struct UParticleSystemComponent* TopSpout; // 0x260(0x08)
	struct UParticleSystemComponent* VFX_P_HW_CT_FountainDrops_TopLevel_Med; // 0x268(0x08)
	struct UParticleSystemComponent* WaterSplash3; // 0x270(0x08)
	struct UParticleSystemComponent* WaterSplash1; // 0x278(0x08)
	struct UParticleSystemComponent* WaterSplash8; // 0x280(0x08)
	struct UParticleSystemComponent* WaterSplash7; // 0x288(0x08)
	struct UParticleSystemComponent* WaterSplash6; // 0x290(0x08)
	struct UParticleSystemComponent* WaterSplash5; // 0x298(0x08)
	struct UParticleSystemComponent* WaterSplash4; // 0x2a0(0x08)
	struct UParticleSystemComponent* WaterSplash2; // 0x2a8(0x08)
	struct UParticleSystemComponent* Water8; // 0x2b0(0x08)
	struct UParticleSystemComponent* Water7; // 0x2b8(0x08)
	struct UParticleSystemComponent* Water6; // 0x2c0(0x08)
	struct UParticleSystemComponent* Water5; // 0x2c8(0x08)
	struct UParticleSystemComponent* Water4; // 0x2d0(0x08)
	struct UParticleSystemComponent* Water3; // 0x2d8(0x08)
	struct UParticleSystemComponent* Water2; // 0x2e0(0x08)
	struct UParticleSystemComponent* Water1; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_GardenFountain_WaterPlane2; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_GardenFountain_WaterPlane1; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_GardenFountain_WaterPlane; // 0x300(0x08)
	struct UStaticMeshComponent* SM_HW_Garden_Fountain_Top; // 0x308(0x08)
	struct UStaticMeshComponent* SM_HW_Garden_Fountain_Base; // 0x310(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x318(0x08)

	void ReceiveBeginPlay(); // Function BP_HW_Garden_Fountain_A.BP_HW_Garden_Fountain_A_C.ReceiveBeginPlay // (Event|Protected|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_BP_HW_Garden_Fountain_A(int32_t EntryPoint); // Function BP_HW_Garden_Fountain_A.BP_HW_Garden_Fountain_A_C.ExecuteUbergraph_BP_HW_Garden_Fountain_A // (Final|UbergraphFunction|HasDefaults) // @ game+0x38a7480
};

