// BlueprintGeneratedClass BP_HamletClassB_Interior_C3.BP_HamletClassB_Interior_C3_C
// Size: 0x688 (Inherited: 0x248)
struct ABP_HamletClassB_Interior_C3_C : AActor {
	struct UDecalComponent* M_HW_Decal_Grunge_4; // 0x248(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Color_A2; // 0x250(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Color_A; // 0x258(0x08)
	struct UDecalComponent* MI_CavernDun_Decal_Algae_B4; // 0x260(0x08)
	struct UDecalComponent* MI_HW_ArithmancyChalkDesign_F; // 0x268(0x08)
	struct UDecalComponent* MI_CavernDun_Decal_Algae_B3; // 0x270(0x08)
	struct UDecalComponent* MI_P_Decal_Stain16; // 0x278(0x08)
	struct UDecalComponent* MI_HW_Decal_Destruction_3; // 0x280(0x08)
	struct UDecalComponent* MI_HW_Decal_Destruction_2; // 0x288(0x08)
	struct UDecalComponent* MI_HW_Decal_Wood_WornStep3; // 0x290(0x08)
	struct UDecalComponent* MI_HW_Decal_Wood_WornStep2; // 0x298(0x08)
	struct UDecalComponent* MI_P_Decal_Stain15; // 0x2a0(0x08)
	struct UDecalComponent* MI_P_Decal_Stain14; // 0x2a8(0x08)
	struct UDecalComponent* MI_SanctumDun_Decal_Dirt_C4; // 0x2b0(0x08)
	struct UDecalComponent* M_P_Decal_Diffuse_Opacity; // 0x2b8(0x08)
	struct UDecalComponent* M_Cav_Decal_ChalkStain_6; // 0x2c0(0x08)
	struct UDecalComponent* M_HW_Decal_Grunge_3; // 0x2c8(0x08)
	struct UDecalComponent* M_Cav_Decal_ChalkStain_5; // 0x2d0(0x08)
	struct UDecalComponent* M_Cairn_Decal_grunge_G_Inst; // 0x2d8(0x08)
	struct UDecalComponent* MI_SanctumDun_Decal_Dirt_C3; // 0x2e0(0x08)
	struct UDecalComponent* MI_SanctumDun_Decal_Dirt_C2; // 0x2e8(0x08)
	struct UDecalComponent* MI_P_Decal_Puddle_3; // 0x2f0(0x08)
	struct UDecalComponent* MI_P_Decal_Puddle_2; // 0x2f8(0x08)
	struct UDecalComponent* MI_HW_Decal_Wood_WornStep01; // 0x300(0x08)
	struct UDecalComponent* MI_CavernDun_Decal_Algae_B2; // 0x308(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Soot_A; // 0x310(0x08)
	struct UDecalComponent* MI_SanctumDun_Decal_Dirt_C; // 0x318(0x08)
	struct UDecalComponent* M_Cav_Decal_Grunge_01; // 0x320(0x08)
	struct UDecalComponent* M_Cav_Decal_ChalkStain_03; // 0x328(0x08)
	struct UDecalComponent* MI_HW_ArithmancyChalkDesign_H; // 0x330(0x08)
	struct UDecalComponent* M_HW_Decal_Grunge_2; // 0x338(0x08)
	struct UStaticMeshComponent* SM_Star_Tapestry_04; // 0x340(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CampB_2m_PlankA; // 0x348(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_TallWeed_A; // 0x350(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HW_Vase_F; // 0x358(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_potions_cabinet_narrow; // 0x360(0x08)
	struct UStaticMeshComponent* SM_Star_Tapestry_03; // 0x368(0x08)
	struct UStaticMeshComponent* SM_HM_Picture_Frame_I_HORIZ1; // 0x370(0x08)
	struct UStaticMeshComponent* SM_HW_HourGlass_A; // 0x378(0x08)
	struct UStaticMeshComponent* SM_CampB_Tent_Rug_A2; // 0x380(0x08)
	struct UStaticMeshComponent* SM_CampB_Tent_Rug_A1; // 0x388(0x08)
	struct UStaticMeshComponent* SM_HM_Picture_Frame_G_HORIZ1; // 0x390(0x08)
	struct UStaticMeshComponent* GC_HW_L_BookStack_Large_A_piece_02; // 0x398(0x08)
	struct UStaticMeshComponent* SM_HM_HogsHead_Bottle_E; // 0x3a0(0x08)
	struct UStaticMeshComponent* SM_HM_TeaShop_TeaPot_B; // 0x3a8(0x08)
	struct UStaticMeshComponent* SM_HM_Tea_TeaTins_E; // 0x3b0(0x08)
	struct UStaticMeshComponent* SM_Astronomy_Chart_Quiver; // 0x3b8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Cairn_bag_01; // 0x3c0(0x08)
	struct UStaticMeshComponent* SM_Dresser_RAV; // 0x3c8(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_BroomstickRack_B; // 0x3d0(0x08)
	struct UStaticMeshComponent* SM_HM_Cauldron_FireStoker_B; // 0x3d8(0x08)
	struct UStaticMeshComponent* SM_HM_FullBed_Twin_A; // 0x3e0(0x08)
	struct UStaticMeshComponent* SM_HM_Honeydukes_broom; // 0x3e8(0x08)
	struct UStaticMeshComponent* SM_HM_InkBottleWithQuills_A; // 0x3f0(0x08)
	struct UStaticMeshComponent* SM_HM_OwlPost_Desk; // 0x3f8(0x08)
	struct UStaticMeshComponent* SM_HM_Quills_Bottle_A; // 0x400(0x08)
	struct UStaticMeshComponent* SM_HW_Dishes_ForkFood_Potato; // 0x408(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Dishes_AE; // 0x410(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Dishes_BA; // 0x418(0x08)
	struct UStaticMeshComponent* SM_HM_TeaShop_Stove; // 0x420(0x08)
	struct UStaticMeshComponent* SM_BCProps_FoodBag_2bag_001; // 0x428(0x08)
	struct UStaticMeshComponent* SM_HW_GenericTrunk_C; // 0x430(0x08)
	struct UStaticMeshComponent* SM_HW_Globe_B; // 0x438(0x08)
	struct UStaticMeshComponent* SM_HW_LetterCluster_F; // 0x440(0x08)
	struct UStaticMeshComponent* SM_HW_RugRoundB1; // 0x448(0x08)
	struct UStaticMeshComponent* SM_HW_Table_Round_A; // 0x450(0x08)
	struct UStaticMeshComponent* SM_HW_Telescope_C; // 0x458(0x08)
	struct UChildActorComponent* BP_HW_Dishes_Stack_MED_B_Gold; // 0x460(0x08)
	struct UStaticMeshComponent* SM_OVR_Kitchenware_item_F; // 0x468(0x08)
	struct UStaticMeshComponent* SM_OV_Trunk_GladstoneBag_Open2; // 0x470(0x08)
	struct UStaticMeshComponent* SM_OV_Trunk_Sml_GladstoneBag; // 0x478(0x08)
	struct UStaticMeshComponent* SM_Rav_LockedChest_L; // 0x480(0x08)
	struct UStaticMeshComponent* SM_OVR_Kitchenware_item_C; // 0x488(0x08)
	struct UStaticMeshComponent* SM_Muggle_Compass; // 0x490(0x08)
	struct UStaticMeshComponent* SM_BCProps_FoodBag_3bag_001; // 0x498(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Medium_A; // 0x4a0(0x08)
	struct UStaticMeshComponent* SM_HW_Pillow_B; // 0x4a8(0x08)
	struct UStaticMeshComponent* SM_HW_Laundry_Coatrack_A; // 0x4b0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_FoodBag_1bag_002_W; // 0x4b8(0x08)
	struct UStaticMeshComponent* SM_HM_Tea_TeaTins_F; // 0x4c0(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Dishware_N; // 0x4c8(0x08)
	struct UStaticMeshComponent* SM_HM_potions_cabinet_window; // 0x4d0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_HangingProps_Plants_004_W; // 0x4d8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_HangingProps_Plants_003_W; // 0x4e0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_HangingProps_Plants_001_W; // 0x4e8(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Main_EG; // 0x4f0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Medium_002_W; // 0x4f8(0x08)
	struct UStaticMeshComponent* SM_OVR_Kitchenware_item_A; // 0x500(0x08)
	struct UStaticMeshComponent* SM_OVR_Kitchenware_item_A_lid; // 0x508(0x08)
	struct UStaticMeshComponent* SM_OVR_Kitchenware_item_D; // 0x510(0x08)
	struct UStaticMeshComponent* SM_HM_HogsHead_Bottle_A; // 0x518(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Bottle_C; // 0x520(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_HangingProps_Bags_004_W; // 0x528(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Basket_Small_002_W; // 0x530(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Dishware_W; // 0x538(0x08)
	struct UStaticMeshComponent* SM_HW_Telescope_A; // 0x540(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Lantern_001; // 0x548(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CookingPot_001; // 0x550(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CookingPot_002; // 0x558(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Hammer_001_W; // 0x560(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Tongs_001; // 0x568(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Couch_A; // 0x570(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_HW_Food_Dishware_R; // 0x578(0x08)
	struct UStaticMeshComponent* SM_HM_Letter_A; // 0x580(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_BCProps_Eyelet_A; // 0x588(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeSpan_B; // 0x590(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_7GC_HW_PaperStack_Lg_C_Piece_27; // 0x598(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_25SM_BCProps_Apple_B; // 0x5a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_HM_3Broom_Bottle_B; // 0x5a8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_GEN_EndTable_E; // 0x5b0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_Tea_TeaTins_H; // 0x5b8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HW_Food_Dishware_A; // 0x5c0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HW_Food_Dishware_L; // 0x5c8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HW_Food_Dishware_P; // 0x5d0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_10SM_HW_Food_Dishware_R; // 0x5d8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HW_Food_Dishware_Q; // 0x5e0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HW_Food_Dishware_T; // 0x5e8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_HW_Food_Dishware_U; // 0x5f0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_HW_L_Chair_C; // 0x5f8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HW_LetterCluster_D; // 0x600(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_HW_LetterCluster_E; // 0x608(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HW_PC_HangingObjectsE; // 0x610(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_Int_BCProps_Spoon_003; // 0x618(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_CampB_WoodenPole; // 0x620(0x08)
	struct UChildActorComponent* BP_Int_BCProps_Basket_Small_001; // 0x628(0x08)
	struct UChildActorComponent* BP_HW_Trashcan_Simple; // 0x630(0x08)
	struct UChildActorComponent* BP_HW_L_BookStack_Small_D1; // 0x638(0x08)
	struct UChildActorComponent* BP_HW_L_BookStack_Small_B; // 0x640(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Stool_001_D; // 0x648(0x08)
	struct UChildActorComponent* BP_HW_L_BookStack_Medium_A; // 0x650(0x08)
	struct UChildActorComponent* BP_HW_L_BookStack_Large_A; // 0x658(0x08)
	struct UChildActorComponent* BP_HW_L_BookStack_Small_C; // 0x660(0x08)
	struct UChildActorComponent* BP_HW_L_BookStack_Small_D; // 0x668(0x08)
	struct UChildActorComponent* BP_HW_L_BookStack_Medium_B; // 0x670(0x08)
	struct UDecalComponent* M_HW_Decal_Grunge_5; // 0x678(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x680(0x08)
};

