// BlueprintGeneratedClass BP_Hamlet_Class_A_07.BP_Hamlet_Class_A_07_C
// Size: 0x371 (Inherited: 0x257)
struct ABP_Hamlet_Class_A_07_C : ABP_Hamlet_Base_C {
	char pad_257[0x1]; // 0x257(0x01)
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x258(0x08)
	struct UStaticMeshComponent* SM_HamletA_07_Windows_Glass_Int; // 0x260(0x08)
	struct UPointLightComponent* Window_Light3; // 0x268(0x08)
	struct UPointLightComponent* Window_Light2; // 0x270(0x08)
	struct UPointLightComponent* Window_Light1; // 0x278(0x08)
	struct UPointLightComponent* Window_Light; // 0x280(0x08)
	struct UChildActorComponent* BP_WalkSpeedVolume2; // 0x288(0x08)
	struct UChildActorComponent* BP_WalkSpeedVolume1; // 0x290(0x08)
	struct UChildActorComponent* BP_WalkSpeedVolume; // 0x298(0x08)
	struct UStaticMeshComponent* SM_COL_INT_PL; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_COL_INT_APL; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_COL_EXT_PL; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_COL_EXT_APL; // 0x2b8(0x08)
	struct USceneComponent* Collision; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_HamletA_07_Threshold; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_HamletA_07_Windows_Glass; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_HamletA_07_Windows; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_HamletA_07_Walls; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_HamletA_07_Trim; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_HamletA_07_Roof; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_HamletA_07_Rockedge; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_HamletA_07_Floors; // 0x300(0x08)
	struct UStaticMeshComponent* SM_HamletA_07_Fireplace; // 0x308(0x08)
	struct UStaticMeshComponent* StaticMeshComponent17; // 0x310(0x08)
	struct UStaticMeshComponent* StaticMeshComponent16; // 0x318(0x08)
	struct UCameraStackVolumeComponent* CameraStackVolume5; // 0x320(0x08)
	struct UBoxComponent* Box5; // 0x328(0x08)
	struct UCameraStackVolumeComponent* CameraStackVolume3; // 0x330(0x08)
	struct UBoxComponent* Box4; // 0x338(0x08)
	struct UCameraStackVolumeComponent* CameraStackVolume2; // 0x340(0x08)
	struct UBoxComponent* Box3; // 0x348(0x08)
	struct UCameraStackVolumeComponent* CameraStackVolume4; // 0x350(0x08)
	struct UCapsuleComponent* Capsule1; // 0x358(0x08)
	struct UChildActorComponent* BP_Door_Template; // 0x360(0x08)
	struct USceneComponent* SharedRoot; // 0x368(0x08)
	bool Remove Door; // 0x370(0x01)

	void UserConstructionScript(); // Function BP_Hamlet_Class_A_07.BP_Hamlet_Class_A_07_C.UserConstructionScript // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void ReceiveBeginPlay(); // Function BP_Hamlet_Class_A_07.BP_Hamlet_Class_A_07_C.ReceiveBeginPlay // (Event|Protected|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_BP_Hamlet_Class_A_07(int32_t EntryPoint); // Function BP_Hamlet_Class_A_07.BP_Hamlet_Class_A_07_C.ExecuteUbergraph_BP_Hamlet_Class_A_07 // (Final|UbergraphFunction) // @ game+0x38a7480
};

