// BlueprintGeneratedClass BP_HW_Phys_HangingCages_02.BP_HW_Phys_HangingCages_02_C
// Size: 0x358 (Inherited: 0x248)
struct ABP_HW_Phys_HangingCages_02_C : AActor {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x248(0x08)
	struct UObjectStateComponent* ObjectState; // 0x250(0x08)
	struct UAkComponent* AkComponent; // 0x258(0x08)
	struct UStaticMeshComponent* Cage_04_Rope_02; // 0x260(0x08)
	struct UStaticMeshComponent* Knot; // 0x268(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse_Cage_04_Rope; // 0x270(0x08)
	struct UStaticMeshComponent* Cage_04; // 0x278(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse_Cage_04; // 0x280(0x08)
	struct UStaticMeshComponent* Cage_03; // 0x288(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse_Cage_03; // 0x290(0x08)
	struct UStaticMeshComponent* cage_02; // 0x298(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse_Cage_02; // 0x2a0(0x08)
	struct UStaticMeshComponent* Crate_01_door; // 0x2a8(0x08)
	struct UStaticMeshComponent* Cage_04_Knot; // 0x2b0(0x08)
	struct UStaticMeshComponent* Crate_01; // 0x2b8(0x08)
	struct UStaticMeshComponent* Crate_01_Stick; // 0x2c0(0x08)
	struct UStaticMeshComponent* Cage_03_Rope; // 0x2c8(0x08)
	struct UStaticMeshComponent* Cage_03_Knot; // 0x2d0(0x08)
	struct UStaticMeshComponent* Cage_01_Top; // 0x2d8(0x08)
	struct UStaticMeshComponent* cage_01; // 0x2e0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse_Crate_01; // 0x2e8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse_Cage_03_Rope; // 0x2f0(0x08)
	struct UStaticMeshComponent* Cage_02_Rope; // 0x2f8(0x08)
	struct UStaticMeshComponent* Cage_02_Knot; // 0x300(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse_Cage_02_Rope; // 0x308(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse_Cage_01; // 0x310(0x08)
	struct UStaticMeshComponent* MainRope_Knot_01; // 0x318(0x08)
	struct UStaticMeshComponent* MainRope_02; // 0x320(0x08)
	struct UStaticMeshComponent* MainRope_Knot; // 0x328(0x08)
	struct UStaticMeshComponent* Crate_01_Rope; // 0x330(0x08)
	struct UStaticMeshComponent* MainRope_Knot_02; // 0x338(0x08)
	struct UStaticMeshComponent* MainRope; // 0x340(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse_Main; // 0x348(0x08)
	struct USceneComponent* SharedRoot; // 0x350(0x08)

	void ObjectPhysicalResponseImpact(float ImpactIntensity, struct FName SpellName, struct FName ResponseConfigName, struct FVector& ImpactLocation); // Function BP_HW_Phys_HangingCages_02.BP_HW_Phys_HangingCages_02_C.ObjectPhysicalResponseImpact // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_BP_HW_Phys_HangingCages_02(int32_t EntryPoint); // Function BP_HW_Phys_HangingCages_02.BP_HW_Phys_HangingCages_02_C.ExecuteUbergraph_BP_HW_Phys_HangingCages_02 // (Final|UbergraphFunction|HasDefaults) // @ game+0x38a7480
};

