// BlueprintGeneratedClass BP_HamletClassB_Interior_H2.BP_HamletClassB_Interior_H2_C
// Size: 0x3a8 (Inherited: 0x248)
struct ABP_HamletClassB_Interior_H2_C : AActor {
	struct UStaticMeshComponent* SM_HamletB_01_interior_H2_Pictureframes; // 0x248(0x08)
	struct UDecalComponent* MI_HW_Decal_Wood_WornStep2_37; // 0x250(0x08)
	struct UDecalComponent* MI_HW_Decal_Wood_WornStep01_35; // 0x258(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Soot_A_33; // 0x260(0x08)
	struct UStaticMeshComponent* SM_HamletB_01_interior_H2_Teashop; // 0x268(0x08)
	struct UStaticMeshComponent* SM_HamletB_01_interior_H2_Stampboxes; // 0x270(0x08)
	struct UStaticMeshComponent* SM_HamletB_01_interior_H2_Ropes; // 0x278(0x08)
	struct UStaticMeshComponent* SM_HamletB_01_interior_H2_Potions; // 0x280(0x08)
	struct UStaticMeshComponent* SM_HamletB_01_interior_H2_Plants; // 0x288(0x08)
	struct UStaticMeshComponent* SM_HamletB_01_interior_H2_HangingStuff; // 0x290(0x08)
	struct UStaticMeshComponent* SM_HamletB_01_interior_H2_Packages; // 0x298(0x08)
	struct UStaticMeshComponent* SM_HamletB_01_interior_H2_Letters; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_HamletB_01_interior_H2_Kitchenware; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_HamletB_01_interior_H2_Instruments; // 0x2b0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_HM_Quill_DisplayShelf_C; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_HamletB_01_interior_H2_Dishware; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_HamletB_01_interior_H2_Cloth; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_HamletB_01_interior_H2_Cauldrons; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_HamletB_01_interior_H2_Books; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_HamletB_01_interior_H2_Baskets; // 0x2e0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HW_GenericTrunk_C; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_Desk_RAV_01; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_HM_Gladrags_Corner_Dresser; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_HamletB_01_interior_H2_Veg; // 0x300(0x08)
	struct UStaticMeshComponent* SM_HW_Scale_A; // 0x308(0x08)
	struct UStaticMeshComponent* SM_HM_Potions_Table; // 0x310(0x08)
	struct UStaticMeshComponent* SM_Sanc_TableHorizontal_Hbgst; // 0x318(0x08)
	struct UStaticMeshComponent* SM_HW_L_BookShelfFurniture; // 0x320(0x08)
	struct UStaticMeshComponent* SM_HW_VE_DivRug; // 0x328(0x08)
	struct UStaticMeshComponent* SM_Bed_HM_Twin_A; // 0x330(0x08)
	struct UStaticMeshComponent* SM_Sanc_TableSquare_Small_Hbgst; // 0x338(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Sanc_Rug_Med_Hbgst; // 0x340(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Sanc_ArmChair_01_Hbgst; // 0x348(0x08)
	struct UStaticMeshComponent* SM_PotStack; // 0x350(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Broom_001_W; // 0x358(0x08)
	struct UStaticMeshComponent* SM_HW_Laundry_Coatrack_C; // 0x360(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_Neep_Pumpkin_B; // 0x368(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_BroomstickRack_B; // 0x370(0x08)
	struct UStaticMeshComponent* SM_HW_PC_Pipe_Elbow; // 0x378(0x08)
	struct UStaticMeshComponent* SM_HW_PC_PotionTable_Pipes_A; // 0x380(0x08)
	struct UStaticMeshComponent* SM_CampB_Int_Stove_01A; // 0x388(0x08)
	struct UStaticMeshComponent* SM_CampB_Int_Beam_01A; // 0x390(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HW_L_Chair_C; // 0x398(0x08)
	struct USceneComponent* Scene; // 0x3a0(0x08)
};

