// BlueprintGeneratedClass BP_HW_BellJars_Butterfly_A.BP_HW_BellJars_Butterfly_A_C
// Size: 0x288 (Inherited: 0x248)
struct ABP_HW_BellJars_Butterfly_A_C : AActor {
	struct UStaticMeshComponent* SM_Butterfly_06; // 0x248(0x08)
	struct UStaticMeshComponent* SM_Butterfly_01; // 0x250(0x08)
	struct UStaticMeshComponent* SM_Butterfly_02; // 0x258(0x08)
	struct UStaticMeshComponent* SM_Butterfly_03; // 0x260(0x08)
	struct UStaticMeshComponent* SM_Butterfly_04; // 0x268(0x08)
	struct UStaticMeshComponent* SM_Butterfly_05; // 0x270(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x278(0x08)
	struct USceneComponent* SharedRoot; // 0x280(0x08)
};

