// BlueprintGeneratedClass BP_Hamlet_Class_A2_Interior_A.BP_Hamlet_Class_A2_Interior_A_C
// Size: 0x468 (Inherited: 0x248)
struct ABP_Hamlet_Class_A2_Interior_A_C : AActor {
	struct UDecalComponent* MI_HW_Decal_PlasterWear_03; // 0x248(0x08)
	struct UDecalComponent* MI_HW_Decal_PlasterWear_02; // 0x250(0x08)
	struct UDecalComponent* M_HW_Decal_grunge3_Dark; // 0x258(0x08)
	struct UDecalComponent* MI_HW_Decal_SootSmudge_4; // 0x260(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_Int_BCProps_Bucket_Small_001_W; // 0x268(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_HM_Beast_Cage_B; // 0x270(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Pot_001_W; // 0x278(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_FirePlaceCrane_A; // 0x280(0x08)
	struct UStaticMeshComponent* SM_HM_TeaShop_Cake_C; // 0x288(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_10SM_BCProps_Eyelet_A; // 0x290(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CampB_5m_PostA; // 0x298(0x08)
	struct UStaticMeshComponent* SM_HM_Neep_Pumpkin_B; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_BroomStand_001_W; // 0x2a8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_Quill_DisplayShelf_C; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_HM_potions_cabinet_narrow; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_DisplayShelf_A; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_HM_Table_B; // 0x2c8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_3Broom_Curtains; // 0x2d0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_HM_Potions_HangingPot_Rope_B; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_HM_Animul_Fur; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_HangingProps_Bags_002_W; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_HW_RoomDivider_B; // 0x2f0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_BCProps_RopeSpan_K; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_OVR_KitchenHutch_01; // 0x300(0x08)
	struct UStaticMeshComponent* SM_HM_Honeydukes_Chair_A; // 0x308(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Rug_B; // 0x310(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_Stamp_B; // 0x318(0x08)
	struct UStaticMeshComponent* SM_HM_OwlPost_Desk; // 0x320(0x08)
	struct UStaticMeshComponent* SM_HM_GEN_Mirror_A; // 0x328(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Basket_Small_004_W; // 0x330(0x08)
	struct UStaticMeshComponent* SM_OVR_ChairWood_02; // 0x338(0x08)
	struct UStaticMeshComponent* SM_HM_Grandfather_Wall_Clock; // 0x340(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Basket_Small_003_W; // 0x348(0x08)
	struct UStaticMeshComponent* SM_HM_GEN_EndTable_B; // 0x350(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_Int_BCProps_FoodBag_1bag_001_W; // 0x358(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Bench_Medium_001_D; // 0x360(0x08)
	struct UStaticMeshComponent* SM_ArmChair_Leather_4s; // 0x368(0x08)
	struct UStaticMeshComponent* SM_Rug_Stag; // 0x370(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_WoodTub_Medium_001_W; // 0x378(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_OpenCrate_Medium_C; // 0x380(0x08)
	struct UStaticMeshComponent* SM_HM_Cauldron_FireStoker_B; // 0x388(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_FireWood_Stack_A; // 0x390(0x08)
	struct UStaticMeshComponent* SM_HW_BS_DiagramsAndOddities_F; // 0x398(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HW_L_New_Book_Small_A; // 0x3a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HW_L_New_Book_Medium_C; // 0x3a8(0x08)
	struct UStaticMeshComponent* SM_HW_L_New_Book_Small_C; // 0x3b0(0x08)
	struct UStaticMeshComponent* SM_HM_FeatherDuster; // 0x3b8(0x08)
	struct UStaticMeshComponent* SM_PortraitFrame_01; // 0x3c0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_HangingProps_Plants_001_W; // 0x3c8(0x08)
	struct UStaticMeshComponent* SM_HM_TeaShop_Curtains_A; // 0x3d0(0x08)
	struct UStaticMeshComponent* SM_HM_Cauldron_Cauldrons_N; // 0x3d8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Pot_002_W; // 0x3e0(0x08)
	struct UStaticMeshComponent* SM_HamletA_02_Merged_3BroomsJars; // 0x3e8(0x08)
	struct UStaticMeshComponent* SM_HamletA_02_Merged_Bottles; // 0x3f0(0x08)
	struct UStaticMeshComponent* SM_HamletA_02_Merged_HangingPot; // 0x3f8(0x08)
	struct UStaticMeshComponent* SM_HamletA_02_Merged_HangingProps_Plants; // 0x400(0x08)
	struct UStaticMeshComponent* SM_HamletA_02_Merged_Kitchenware; // 0x408(0x08)
	struct UStaticMeshComponent* SM_HamletA_02_Merged_Packages; // 0x410(0x08)
	struct UStaticMeshComponent* SM_HamletA_02_Merged_PotionBottles; // 0x418(0x08)
	struct UStaticMeshComponent* SM_HamletA_02_Merged_TeaShop_01; // 0x420(0x08)
	struct UStaticMeshComponent* SM_HamletA_02_Merged_ThreadSpools; // 0x428(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_StampBox_C; // 0x430(0x08)
	struct UStaticMeshComponent* SM_HM_Cauldron_Cauldron_C; // 0x438(0x08)
	struct UStaticMeshComponent* SM_HamletA_02_Merged_InkBottles; // 0x440(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_StampBox_B1; // 0x448(0x08)
	struct UChildActorComponent* BP_HW_Nuts_Bowl_C; // 0x450(0x08)
	struct USceneComponent* Scene; // 0x458(0x08)
	struct USceneComponent* SharedRoot; // 0x460(0x08)
};

