// BlueprintGeneratedClass BP_HamletClassB_Interior_D1.BP_HamletClassB_Interior_D1_C
// Size: 0x708 (Inherited: 0x248)
struct ABP_HamletClassB_Interior_D1_C : AActor {
	struct UDecalComponent* M_Cav_Decal_ChalkStain_16; // 0x248(0x08)
	struct UDecalComponent* M_Cav_Decal_ChalkStain_15; // 0x250(0x08)
	struct UDecalComponent* M_Cav_Decal_ChalkStain_14; // 0x258(0x08)
	struct UDecalComponent* M_Cav_Decal_ChalkStain_13; // 0x260(0x08)
	struct UDecalComponent* M_Cav_Decal_ChalkStain_12; // 0x268(0x08)
	struct UDecalComponent* M_Cav_Decal_ChalkStain_11; // 0x270(0x08)
	struct UDecalComponent* M_Cav_Decal_Wet_4; // 0x278(0x08)
	struct UDecalComponent* M_Cav_Decal_Wet_02; // 0x280(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_A1; // 0x288(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_B3; // 0x290(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_B1; // 0x298(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_C1; // 0x2a0(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_D1; // 0x2a8(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_AshCircle_A_4; // 0x2b0(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_AshCircle_B_4; // 0x2b8(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Dirt_A1; // 0x2c0(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Dirt_C1; // 0x2c8(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_B1; // 0x2d0(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Soot_A1; // 0x2d8(0x08)
	struct UDecalComponent* MI_HW_Decal_Brick_04; // 0x2e0(0x08)
	struct UDecalComponent* MI_HW_Decal_Brick_03; // 0x2e8(0x08)
	struct UDecalComponent* MI_HW_Decal_Wood_WornStep7; // 0x2f0(0x08)
	struct UDecalComponent* MI_HW_Decal_Wood_WornStep6; // 0x2f8(0x08)
	struct UDecalComponent* MI_HW_Decal_Wood_WornStep5; // 0x300(0x08)
	struct UDecalComponent* MI_HW_Decal_Wood_WornStep02; // 0x308(0x08)
	struct UDecalComponent* M_Cav_Decal_ChalkStain_04; // 0x310(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeSpan_K; // 0x318(0x08)
	struct UStaticMeshComponent* SM_BCProps_Wood_Chopped_Single_B; // 0x320(0x08)
	struct UStaticMeshComponent* SM_Amaryllis_Var8_Master; // 0x328(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_BCProps_Eyelet_A; // 0x330(0x08)
	struct UStaticMeshComponent* SM_HM_Cauldron_Cauldron_E; // 0x338(0x08)
	struct UStaticMeshComponent* SM_BCProps_FoodBag_2bag_001; // 0x340(0x08)
	struct UStaticMeshComponent* SM_BCProps_FoodBag_Top_001; // 0x348(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeSpan_D; // 0x350(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeStake_C; // 0x358(0x08)
	struct UStaticMeshComponent* SM_Book_03; // 0x360(0x08)
	struct UStaticMeshComponent* SM_HM_FeatherDuster_Small; // 0x368(0x08)
	struct UStaticMeshComponent* SM_OVR_Teapot_01; // 0x370(0x08)
	struct UStaticMeshComponent* SM_Folded_Cloth_05; // 0x378(0x08)
	struct UStaticMeshComponent* SM_Folded_Cloth_03; // 0x380(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_OV_Trunk_Sml_GladstoneBag; // 0x388(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_BroomstickRack_A; // 0x390(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Dishware_I; // 0x398(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_3Broom_Rug_B; // 0x3a0(0x08)
	struct UStaticMeshComponent* SM_HM_Cauldron_FireStoker_B; // 0x3a8(0x08)
	struct UStaticMeshComponent* SM_HM_Cauldron_Stand_B; // 0x3b0(0x08)
	struct UStaticMeshComponent* SM_HM_Cloth_03; // 0x3b8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_BCProps_Wood_Chopped_Small_002; // 0x3c0(0x08)
	struct UStaticMeshComponent* SM_HM_FullBed_Queen_C; // 0x3c8(0x08)
	struct UStaticMeshComponent* SM_HM_Gladrags_Corner_Dresser; // 0x3d0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_Gladrags_Hat_Box_B; // 0x3d8(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Desert_DC; // 0x3e0(0x08)
	struct UStaticMeshComponent* SM_HM_InkBottleWithQuills_B; // 0x3e8(0x08)
	struct UStaticMeshComponent* SM_HM_MixingBowl; // 0x3f0(0x08)
	struct UStaticMeshComponent* SM_HM_Gladrags_Hat_Box_A; // 0x3f8(0x08)
	struct UStaticMeshComponent* SM_HM_OwlPost_Package_B; // 0x400(0x08)
	struct UStaticMeshComponent* SM_HM_OwlPost_Package_G; // 0x408(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_OwlPost_Package_J; // 0x410(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_HM_OwlPost_Package_S; // 0x418(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_HM_PotionBottle5; // 0x420(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_HM_PotionBottle7; // 0x428(0x08)
	struct UStaticMeshComponent* SM_HM_TeaShop_Table_A; // 0x430(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_HM_PotionBottle6; // 0x438(0x08)
	struct UStaticMeshComponent* SM_HM_Potions_BookLectern; // 0x440(0x08)
	struct UStaticMeshComponent* SM_HM_Potions_Brew_Station; // 0x448(0x08)
	struct UStaticMeshComponent* SM_HM_Potions_built_in_cabinet_pieces_2; // 0x450(0x08)
	struct UStaticMeshComponent* SM_HM_potions_cabinet_main; // 0x458(0x08)
	struct UStaticMeshComponent* SM_HM_Potions_Cauldron_A_Med; // 0x460(0x08)
	struct UStaticMeshComponent* SM_HW_3Broom_Table_E; // 0x468(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_InkBottles_A; // 0x470(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_InkBottles_B; // 0x478(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_Quill_Rolled_Parchment_Pile_A; // 0x480(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_Shelf_A; // 0x488(0x08)
	struct UStaticMeshComponent* SM_HM_Stacking_Cauldron_F; // 0x490(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_HM_Stacking_Cauldron_A; // 0x498(0x08)
	struct UStaticMeshComponent* SM_HW_Laundry_Coatrack_B; // 0x4a0(0x08)
	struct UStaticMeshComponent* SM_HW_DAO_JewelryBox_A; // 0x4a8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_HW_Food_Dishware_R; // 0x4b0(0x08)
	struct UStaticMeshComponent* SM_HW_GenericTrunk_A; // 0x4b8(0x08)
	struct UStaticMeshComponent* SM_HW_HourGlass_A; // 0x4c0(0x08)
	struct UStaticMeshComponent* SM_HW_L_BookRow_Medium_A; // 0x4c8(0x08)
	struct UStaticMeshComponent* SM_HW_L_BookRow_Large_A; // 0x4d0(0x08)
	struct UStaticMeshComponent* SM_HW_LetterBundle_A; // 0x4d8(0x08)
	struct UStaticMeshComponent* SM_HW_LetterCluster_A; // 0x4e0(0x08)
	struct UStaticMeshComponent* SM_HW_LetterCluster_B; // 0x4e8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HW_LetterCluster_C; // 0x4f0(0x08)
	struct UStaticMeshComponent* SM_HW_LetterCluster_E; // 0x4f8(0x08)
	struct UStaticMeshComponent* SM_HW_LetterCluster_F; // 0x500(0x08)
	struct UStaticMeshComponent* SM_HW_L_BookRow_Half_B; // 0x508(0x08)
	struct UStaticMeshComponent* SM_HW_L_BookRow_Medium_B; // 0x510(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HW_L_Book_Medium_C; // 0x518(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HW_L_Book_Small_B; // 0x520(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HW_L_Book_Small_C; // 0x528(0x08)
	struct UStaticMeshComponent* SM_HW_L_Book_Large_A; // 0x530(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HW_OpenBook_B_Flat_CProp; // 0x538(0x08)
	struct UStaticMeshComponent* SM_HW_PC_PipeCap_Hamlet; // 0x540(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HW_PC_Pipe_Elbow_Hamlet; // 0x548(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HW_QuidditchPitch_SmallFlags_B; // 0x550(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_HM_Potions_Cauldron_A_Small; // 0x558(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_HW_SD_Armchair_A; // 0x560(0x08)
	struct UStaticMeshComponent* SM_HM_Potions_SmallTubesRack; // 0x568(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HW_Vase_F; // 0x570(0x08)
	struct UStaticMeshComponent* SM_HW_BlackBoard01; // 0x578(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Basket_Small_002_W; // 0x580(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Basket_Square_Small_002_W; // 0x588(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_Int_BCProps_Cauldron_001; // 0x590(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_Int_BCProps_CloseCrate_Medium_B; // 0x598(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_CookingPot_001; // 0x5a0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CookingPot_002; // 0x5a8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_HangingProps_Bags_005_W; // 0x5b0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_HangingProps_Plants_002_W; // 0x5b8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_HangingProps_Plants_003_W; // 0x5c0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_HangingProps_Plants_004_W; // 0x5c8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_HW_Food_Dishware_K; // 0x5d0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_Int_BCProps_Spoon_002; // 0x5d8(0x08)
	struct UStaticMeshComponent* SM_INT_HM_3Broom_Jars_A_3; // 0x5e0(0x08)
	struct UStaticMeshComponent* SM_Orchids_B; // 0x5e8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Foragable_Rue_B; // 0x5f0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_HW_L_BookStack_Small_D; // 0x5f8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_HM_PotionBottle14; // 0x600(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_PotionIngredients_BlindWormSting; // 0x608(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_3Broom_Jars_B; // 0x610(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_Potion_GingerRoot; // 0x618(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_3Broom_Jars_A; // 0x620(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_Potion_05; // 0x628(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_HM_PotionBottle8; // 0x630(0x08)
	struct UStaticMeshComponent* SM_Sanc_GlassDistilery_01A; // 0x638(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_9SM_HM_PotionBottle11; // 0x640(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_HW_L_BookRow_Half_A; // 0x648(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_HW_L_BookRow_Half_C; // 0x650(0x08)
	struct UStaticMeshComponent* SM_HW_L_BookRow_Half_D; // 0x658(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_Cavern_2m_PlankA_D; // 0x660(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_OpenCrate_Small_002_W; // 0x668(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_GEN_EndTable_B; // 0x670(0x08)
	struct UStaticMeshComponent* SM_HW_L_BookRow_Small_E; // 0x678(0x08)
	struct UStaticMeshComponent* SM_HW_3Broom_Table_E_3; // 0x680(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_3Broom_Rug_A; // 0x688(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_12SM_HW_WH_TransfigurationClass_Shelf_3m; // 0x690(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HS_3Broom_Chair_C; // 0x698(0x08)
	struct UStaticMeshComponent* SM_HW_L_Book_Large_C; // 0x6a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_BCProps_RopeSpan_J; // 0x6a8(0x08)
	struct UStaticMeshComponent* SM_Sanc_Desk_01_Mzoo; // 0x6b0(0x08)
	struct UChildActorComponent* BP_HW_L_BookStack_Medium_A1; // 0x6b8(0x08)
	struct UChildActorComponent* BP_HW_L_BookStack_Small_B; // 0x6c0(0x08)
	struct UChildActorComponent* BP_HW_L_BookStack_Medium_B; // 0x6c8(0x08)
	struct UChildActorComponent* BP_HW_Dishes_Stack_MED_A_Gold; // 0x6d0(0x08)
	struct UChildActorComponent* BP_HW_TallBookStack_B; // 0x6d8(0x08)
	struct UChildActorComponent* BP_HW_L_BookStack_Medium_A; // 0x6e0(0x08)
	struct UChildActorComponent* BP_HW_L_BookStack_Large_C; // 0x6e8(0x08)
	struct UChildActorComponent* BP_Int_BCProps_Basket_Medium_001; // 0x6f0(0x08)
	struct UWorldFXAudioComponent* WorldFXAudio-Amb_3D_Stove_Burning_Loop; // 0x6f8(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x700(0x08)
};

