// BlueprintGeneratedClass BP_Hamlet_Vendor_Plants_01.BP_Hamlet_Vendor_Plants_01_C
// Size: 0x400 (Inherited: 0x248)
struct ABP_Hamlet_Vendor_Plants_01_C : AActor {
	struct UStaticMeshComponent* SM_Hamlet_Vendor_Plants_Merged_02; // 0x248(0x08)
	struct UStaticMeshComponent* SM_Hamlet_Vendor_Plants_Merged_01; // 0x250(0x08)
	struct UChildActorComponent* BP_Flower_Clump_HISM; // 0x258(0x08)
	struct UStaticMeshComponent* SM_HM_Cauldron_Flowers_F; // 0x260(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeKnot_A; // 0x268(0x08)
	struct UStaticMeshComponent* SM_BCProps_Eyelet_A; // 0x270(0x08)
	struct UStaticMeshComponent* SM_OVR_Chandelier_01_Lantern2_StaticMeshComponent0; // 0x278(0x08)
	struct UPhysicalResponseComponent* PR_Chandelierlantern_01; // 0x280(0x08)
	struct UPhysicalResponseComponent* PR_Potion_10; // 0x288(0x08)
	struct UPhysicalResponseComponent* PR_Potion_6; // 0x290(0x08)
	struct UPhysicalResponseComponent* PR_Potion_15; // 0x298(0x08)
	struct UPhysicalResponseComponent* PR_Mallowsweetpot_01; // 0x2a0(0x08)
	struct UPhysicalResponseComponent* PR_Potstack_01; // 0x2a8(0x08)
	struct UPhysicalResponseComponent* PR_MixingBowl_01; // 0x2b0(0x08)
	struct UPhysicalResponseComponent* PR_Mininglamp_01; // 0x2b8(0x08)
	struct UPhysicalResponseComponent* PR_Bowl_A2; // 0x2c0(0x08)
	struct UPhysicalResponseComponent* PR_Bowl_F2; // 0x2c8(0x08)
	struct UPhysicalResponseComponent* PR_Ladysmantlepot_01; // 0x2d0(0x08)
	struct UPhysicalResponseComponent* PR_Mandrakepot_01; // 0x2d8(0x08)
	struct UStaticMeshComponent* Dirt3_StaticMeshComponent0; // 0x2e0(0x08)
	struct UPhysicalResponseComponent* PR_Dittanypot_02; // 0x2e8(0x08)
	struct UPhysicalResponseComponent* PR_Dittanypot_01; // 0x2f0(0x08)
	struct UStaticMeshComponent* Dirt8_StaticMeshComponent0; // 0x2f8(0x08)
	struct UPhysicalResponseComponent* PR_Helleborepot_02; // 0x300(0x08)
	struct UPhysicalResponseComponent* PR_Helleborepot_01; // 0x308(0x08)
	struct UPhysicalResponseComponent* PR_HangingHerbs_StringB; // 0x310(0x08)
	struct UStaticMeshComponent* Water2_StaticMeshComponent0; // 0x318(0x08)
	struct UPhysicalResponseComponent* PR_Bowl_A3; // 0x320(0x08)
	struct UPhysicalResponseComponent* PR_Potion_18; // 0x328(0x08)
	struct UPhysicalResponseComponent* PR_Potion_7; // 0x330(0x08)
	struct UPhysicalResponseComponent* PR_Potion_8; // 0x338(0x08)
	struct UStaticMeshComponent* Dirt2_StaticMeshComponent0; // 0x340(0x08)
	struct UStaticMeshComponent* Tarp_02_StaticMeshComponent0; // 0x348(0x08)
	struct UStaticMeshComponent* Water_StaticMeshComponent1; // 0x350(0x08)
	struct UStaticMeshComponent* Water_StaticMeshComponent0; // 0x358(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Bucket_Water_001_W2_StaticMeshComponent0; // 0x360(0x08)
	struct UStaticMeshComponent* SM_HW_3Broom_Table_E2_StaticMeshComponent0; // 0x368(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Table_Short_001_D3_StaticMeshComponent0; // 0x370(0x08)
	struct UStaticMeshComponent* Tarp_03_StaticMeshComponent0; // 0x378(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_OpenCrate_Small_001_W_StaticMeshComponent0; // 0x380(0x08)
	struct UStaticMeshComponent* SM_BCProps_FloorCloth_B_LOD_StaticMeshComponent0; // 0x388(0x08)
	struct UStaticMeshComponent* Tent_03_StaticMeshComponent0; // 0x390(0x08)
	struct UStaticMeshComponent* Tent_02_StaticMeshComponent0; // 0x398(0x08)
	struct UStaticMeshComponent* SM_HM_Cloth_04_CProp_StaticMeshComponent0; // 0x3a0(0x08)
	struct UStaticMeshComponent* SM_Sanc_HandShears_StaticMeshComponent0; // 0x3a8(0x08)
	struct UStaticMeshComponent* SM_BCProps_FloorCloth_A_StaticMeshComponent0; // 0x3b0(0x08)
	struct UStaticMeshComponent* SM_Sanc_HandTrowel_StaticMeshComponent0; // 0x3b8(0x08)
	struct UStaticMeshComponent* SM_HW_3Broom_Table_C3_StaticMeshComponent0; // 0x3c0(0x08)
	struct UStaticMeshComponent* ChalkBoard_StaticMeshComponent0; // 0x3c8(0x08)
	struct UStaticMeshComponent* SM_WE_Chalkboard_Herbology_Decal_03_StaticMeshComponent0; // 0x3d0(0x08)
	struct UStaticMeshComponent* SM_BroomRace_RopeFlags2_StaticMeshComponent0; // 0x3d8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Cart_001_Generic_D_StaticMeshComponent0; // 0x3e0(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_CartWheel_StaticMeshComponent0; // 0x3e8(0x08)
	struct USceneComponent* Scene; // 0x3f0(0x08)
	struct USceneComponent* SharedRoot; // 0x3f8(0x08)
};

