// BlueprintGeneratedClass BP_Hamlet_Class_A_08.BP_Hamlet_Class_A_08_C
// Size: 0x588 (Inherited: 0x257)
struct ABP_Hamlet_Class_A_08_C : ABP_Hamlet_Base_C {
	char pad_257[0x1]; // 0x257(0x01)
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x258(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Stone_Table_A_EXT1; // 0x260(0x08)
	struct UStaticMeshComponent* SM_MERGED_PostA2_EXT1; // 0x268(0x08)
	struct UPointLightComponent* Window_Light; // 0x270(0x08)
	struct UPointLightComponent* Window_Light4; // 0x278(0x08)
	struct UPointLightComponent* Window_Light3; // 0x280(0x08)
	struct UPointLightComponent* Window_Light2; // 0x288(0x08)
	struct UPointLightComponent* Window_Light1; // 0x290(0x08)
	struct UChildActorComponent* BP_WalkSpeedVolume; // 0x298(0x08)
	struct UChildActorComponent* BP_WalkSpeedVolume2; // 0x2a0(0x08)
	struct UChildActorComponent* BP_WalkSpeedVolume1; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_COL_INT_APL; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_COL_EXT_APL; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_COL_EXT_PL; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_COL_INT_PL; // 0x2c8(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Damage_A_5; // 0x2d0(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Damage_A_4; // 0x2d8(0x08)
	struct UDecalComponent* MI_Castle_Ruin1_Wetness_drips_5; // 0x2e0(0x08)
	struct UDecalComponent* MI_Castle_Ruin1_Wetness_drips_4; // 0x2e8(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Soot_A; // 0x2f0(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Damage_A_3; // 0x2f8(0x08)
	struct UDecalComponent* MI_Castle_Ruin1_Wetness_drips_3; // 0x300(0x08)
	struct UStaticMeshComponent* SM_HamletA_08_Walls_EXT; // 0x308(0x08)
	struct UStaticMeshComponent* SM_HamletA_08_Rockedge_EXT; // 0x310(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_3_RoofShingle_Small_A_EXT; // 0x318(0x08)
	struct UStaticMeshComponent* SM_Hamlet_Chimney_C_EXT; // 0x320(0x08)
	struct UStaticMeshComponent* SM_CampB_2m_PostA_INT_EXT; // 0x328(0x08)
	struct UStaticMeshComponent* SM_HamletA_08_Walls_INT; // 0x330(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_Cap_B4_EXT; // 0x338(0x08)
	struct UStaticMeshComponent* SM_HamletA_08_Fireplace_INT; // 0x340(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Arch_Doorway_INT; // 0x348(0x08)
	struct UStaticMeshComponent* SM_MERGED_PostA_INT_EXT; // 0x350(0x08)
	struct UStaticMeshComponent* SM_HamletA_08_Roof_INT; // 0x358(0x08)
	struct UStaticMeshComponent* SM_CampB_2m_Post_INT_EXT; // 0x360(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Arch_Pillar_A_INT; // 0x368(0x08)
	struct UStaticMeshComponent* SM_HamletA_08_Roof_EXT; // 0x370(0x08)
	struct UStaticMeshComponent* SM_HamletA_08_Threshold; // 0x378(0x08)
	struct UStaticMeshComponent* SM_HamletA_08_Windows_Frame_INT_EXT; // 0x380(0x08)
	struct UStaticMeshComponent* SM_HamletA_08_Windows_Glass_EXT; // 0x388(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_Cap_EXT; // 0x390(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_Cap_A_b6; // 0x398(0x08)
	struct UStaticMeshComponent* SM_HamletA_08_Tower_Int; // 0x3a0(0x08)
	struct UStaticMeshComponent* SM_HamletA_08_Trims_EXT; // 0x3a8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_Cap_A_b5_EXT; // 0x3b0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Arch_Pillar_B_INT; // 0x3b8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Arch_Pillar_EXT; // 0x3c0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Arch_Pillar_A3_INT; // 0x3c8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_C_INT; // 0x3d0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_Cap_A_b3_EXT; // 0x3d8(0x08)
	struct UStaticMeshComponent* SM_HamletA_08_Floor_INT; // 0x3e0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Arch_Pillar_A_EXT; // 0x3e8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_3_TheSteps_B2_INT; // 0x3f0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_3_TheSteps_B_EXT; // 0x3f8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_3_RoofShingle_A_EXT; // 0x400(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_C_INT_EXT; // 0x408(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_C2_EXT; // 0x410(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_C_EXT; // 0x418(0x08)
	struct UStaticMeshComponent* SM_HamletA_08_Windows_Glass_Int; // 0x420(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Arched_Window_A_INT_EXT; // 0x428(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_Cap__EXT; // 0x430(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Debris_C_EXT; // 0x438(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Debris_B2_INT; // 0x440(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_Cap_A_b_EXT; // 0x448(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_Cap_A_b_INT_EXT; // 0x450(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Wall_Damaged_INT; // 0x458(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_Cap_A_a3_INT; // 0x460(0x08)
	struct UStaticMeshComponent* SM_CastleDun_HayPile_D3_INT; // 0x468(0x08)
	struct UStaticMeshComponent* SM_CastleDun_HayPile_D2_EXT; // 0x470(0x08)
	struct UStaticMeshComponent* SM_MERGED_wall08_A_EXT; // 0x478(0x08)
	struct UStaticMeshComponent* SM_MERGED_PostA2_EXT; // 0x480(0x08)
	struct UStaticMeshComponent* SM_CastleDun_HayPile_A_EXT; // 0x488(0x08)
	struct UStaticMeshComponent* SM_CastleDun_HayFloor_A_INT; // 0x490(0x08)
	struct UStaticMeshComponent* SM_CastleDun_Floor_64_A_INT; // 0x498(0x08)
	struct UStaticMeshComponent* SM_CastleRuin1_DebrisMound_A_EXT; // 0x4a0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_Cap_B_EXT; // 0x4a8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Wall_Damaged_B_EXT; // 0x4b0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Arch_Doorway_A_INT_EXT; // 0x4b8(0x08)
	struct UStaticMeshComponent* SM_CastleDun_HayPile_D_INT; // 0x4c0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_Cap_A_EXT; // 0x4c8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_Cap_A_INT_EXT; // 0x4d0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Debris_B_EXT; // 0x4d8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Stone_Table_A_EXT; // 0x4e0(0x08)
	struct UStaticMeshComponent* SM_HamletA_08_Trims_INT; // 0x4e8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_Cap_A_INT; // 0x4f0(0x08)
	struct UStaticMeshComponent* SM_MERGED_wall08_int; // 0x4f8(0x08)
	struct UStaticMeshComponent* SM_HW_UH_WoodBrace_INT; // 0x500(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_INT; // 0x508(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_E_INT; // 0x510(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Arch_Pillar_A1_INT; // 0x518(0x08)
	struct UStaticMeshComponent* SM_MERGED_SM_MERGED_PostA5__EXT; // 0x520(0x08)
	struct UStaticMeshComponent* SM_MERGED_PostA; // 0x528(0x08)
	struct UChildActorComponent* BP_Door_Template2; // 0x530(0x08)
	struct UChildActorComponent* BP_Door_Template; // 0x538(0x08)
	struct UCapsuleComponent* Capsule1; // 0x540(0x08)
	struct UBoxComponent* Box5; // 0x548(0x08)
	struct UBoxComponent* Box4; // 0x550(0x08)
	struct UBoxComponent* Box3; // 0x558(0x08)
	struct USceneComponent* Scene_VOL_COL_DOOR_LIGHT; // 0x560(0x08)
	struct UCameraStackVolumeComponent* CameraStackVolume5; // 0x568(0x08)
	struct UCameraStackVolumeComponent* CameraStackVolume4; // 0x570(0x08)
	struct UCameraStackVolumeComponent* CameraStackVolume3; // 0x578(0x08)
	struct UCameraStackVolumeComponent* CameraStackVolume2; // 0x580(0x08)

	void UserConstructionScript(); // Function BP_Hamlet_Class_A_08.BP_Hamlet_Class_A_08_C.UserConstructionScript // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void ReceiveBeginPlay(); // Function BP_Hamlet_Class_A_08.BP_Hamlet_Class_A_08_C.ReceiveBeginPlay // (Event|Protected|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_BP_Hamlet_Class_A_08(int32_t EntryPoint); // Function BP_Hamlet_Class_A_08.BP_Hamlet_Class_A_08_C.ExecuteUbergraph_BP_Hamlet_Class_A_08 // (Final|UbergraphFunction) // @ game+0x38a7480
};

