// BlueprintGeneratedClass BP_HamletC_Gen_A.BP_HamletC_Gen_A_C
// Size: 0x478 (Inherited: 0x257)
struct ABP_HamletC_Gen_A_C : ANone {
	char pad_257[0x1]; // 0x257(0x01)
	struct UPointLightComponent* PointLight9; // 0x258(0x08)
	struct UPointLightComponent* PointLight8; // 0x260(0x08)
	struct UPointLightComponent* PointLight7; // 0x268(0x08)
	struct UPointLightComponent* PointLight6; // 0x270(0x08)
	struct UPointLightComponent* PointLight5; // 0x278(0x08)
	struct UPointLightComponent* PointLight4; // 0x280(0x08)
	struct UPointLightComponent* PointLight3; // 0x288(0x08)
	struct UPointLightComponent* PointLight2; // 0x290(0x08)
	struct UPointLightComponent* PointLight; // 0x298(0x08)
	struct UChildActorComponent* BP_WalkSpeedVolume; // 0x2a0(0x08)
	struct UChildActorComponent* BP_WalkSpeedVolume2; // 0x2a8(0x08)
	struct UChildActorComponent* BP_WalkSpeedVolume1; // 0x2b0(0x08)
	struct UChildActorComponent* BP_Door_Template; // 0x2b8(0x08)
	struct UChildActorComponent* ChildActor; // 0x2c0(0x08)
	struct UDecalComponent* MI_HM_Pippins_Decal_Algae_B9; // 0x2c8(0x08)
	struct UDecalComponent* MI_HM_Pippins_Decal_Algae_B8; // 0x2d0(0x08)
	struct UDecalComponent* MI_HM_Pippins_Decal_Algae_B7; // 0x2d8(0x08)
	struct UDecalComponent* MI_HM_Pippins_Decal_Algae_B6; // 0x2e0(0x08)
	struct UDecalComponent* MI_HM_Pippins_Decal_Algae_B5; // 0x2e8(0x08)
	struct UDecalComponent* MI_HM_Pippins_Decal_Algae_B4; // 0x2f0(0x08)
	struct UDecalComponent* MI_HM_Pippins_Decal_Algae_B3; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_HM_GEN_A_EXT_PL2_COL; // 0x300(0x08)
	struct UStaticMeshComponent* SM_HM_Porch_Steps_B; // 0x308(0x08)
	struct UStaticMeshComponent* SM_HM_Stone_Trim_Corner_1sided_G; // 0x310(0x08)
	struct UStaticMeshComponent* SM_HM_Stone_Trim_Flat_1sided_H; // 0x318(0x08)
	struct UStaticMeshComponent* SM_HM_Roof_Shingle_Pitch_E; // 0x320(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_HM_WindowsStyleC_L_Double_Single_A; // 0x328(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_HM_Stone_trim_corner_1sided_C; // 0x330(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_Stone_Trim_Flat_1sided_J; // 0x338(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_12SM_HM_WoodTrim_Cap_B; // 0x340(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_10SM_HM_WoodTrim_Cap_C; // 0x348(0x08)
	struct UStaticMeshComponent* SM_HM_GEN_A_ext_Roof; // 0x350(0x08)
	struct UStaticMeshComponent* SM_HM_Stone_Trim_Flat_1sided_E; // 0x358(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_HM_Stone_Trim_Corner_1sided_E; // 0x360(0x08)
	struct UStaticMeshComponent* SM_HM_GEN_A_ext_Window_Glass_A; // 0x368(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_9SM_HM_Roof_Shingle_Face_A; // 0x370(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_Stone_trim_flat_1sided_A; // 0x378(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_Stone_trim_door_arch_side_A; // 0x380(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_HM_Roof_Shingle_D; // 0x388(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_7SM_HM_Roof_Shingle_A; // 0x390(0x08)
	struct UStaticMeshComponent* SM_HM_Porch_Steps_A; // 0x398(0x08)
	struct UStaticMeshComponent* SM_HM_GEN_A_int_Trim; // 0x3a0(0x08)
	struct UStaticMeshComponent* SM_HM_GEN_A_ext_Trim; // 0x3a8(0x08)
	struct UStaticMeshComponent* SM_HM_GEN_A_EXT_APL2_COL; // 0x3b0(0x08)
	struct UStaticMeshComponent* SM_HM_GEN_A_EXT_APL_COL; // 0x3b8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_7SM_HM_Roof_Shingle_Face_G; // 0x3c0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_HM_WindowsStyleC_Square_Double_A; // 0x3c8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_7SM_HM_Roof_Shingle_Pitch_B; // 0x3d0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_HM_Roof_Shingle_Pitch_A; // 0x3d8(0x08)
	struct UStaticMeshComponent* SM_HM_GEN_A_ext_Walls; // 0x3e0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_Stone_trim_corner_1sided_A; // 0x3e8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_Stone_trim_corner_1sided_B; // 0x3f0(0x08)
	struct UStaticMeshComponent* SM_HM_GEN_A_ext_Decals; // 0x3f8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_HM_Roof_Shingle_Face_E; // 0x400(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_HM_WindowsStyleC_Retangle_Double_A; // 0x408(0x08)
	struct UStaticMeshComponent* SM_HM_GEN_A_ext_Chimney; // 0x410(0x08)
	struct UStaticMeshComponent* SM_HM_Stone_Trim_Corner_1sided_D; // 0x418(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_Stone_Trim_Corner_1sided_F; // 0x420(0x08)
	struct UStaticMeshComponent* SM_HM_GEN_A_int_Floor1; // 0x428(0x08)
	struct UStaticMeshComponent* SM_HM_GEN_A_int_Windows1; // 0x430(0x08)
	struct UStaticMeshComponent* SM_HM_GEN_A_int_Walls1; // 0x438(0x08)
	struct UStaticMeshComponent* SM_HM_GEN_A_INT_PL_COL1; // 0x440(0x08)
	struct UStaticMeshComponent* SM_HM_GEN_A_INT_APL2_COL1; // 0x448(0x08)
	struct UStaticMeshComponent* SM_HM_GEN_A_INT_APL_COL1; // 0x450(0x08)
	struct UStaticMeshComponent* SM_HM_GEN_A_INT_APLFLOOR_COL1; // 0x458(0x08)
	struct UStaticMeshComponent* SM_HM_GEN_A_INT_PL2_COL1; // 0x460(0x08)
	struct UStaticMeshComponent* SM_HM_GEN_A_INT_PLFLOOR_COL1; // 0x468(0x08)
	struct UStaticMeshComponent* SM_HM_GEN_A_EXT_PL_COL; // 0x470(0x08)
};

