// BlueprintGeneratedClass BP_Hamlet_Class_A7_Interior_A.BP_Hamlet_Class_A7_Interior_A_C
// Size: 0x3e8 (Inherited: 0x248)
struct ABP_Hamlet_Class_A7_Interior_A_C : AActor {
	struct UStaticMeshComponent* SM_HamletA_07_ScrollsPaperLetters_Merged; // 0x248(0x08)
	struct UStaticMeshComponent* SM_HamletA_07_OwlPost_Merged; // 0x250(0x08)
	struct UStaticMeshComponent* SM_HamletA_07_DittanyPlants_Merged; // 0x258(0x08)
	struct UStaticMeshComponent* SM_HamletA_07_3Broom_Jars_Merged; // 0x260(0x08)
	struct UStaticMeshComponent* SM_HamletA_07_PotionBottles_Merged; // 0x268(0x08)
	struct UStaticMeshComponent* SM_HamletA_07_NeepPlants_Merged; // 0x270(0x08)
	struct UStaticMeshComponent* SM_HamletA_07_HangingProps_Merged; // 0x278(0x08)
	struct UStaticMeshComponent* SM_HamletA_07_Books_Merged; // 0x280(0x08)
	struct UStaticMeshComponent* SM_BCProps_FoodBag_3bag_001; // 0x288(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_BCProps_RopeLashing_A; // 0x290(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_BCProps_RopeSpan_J; // 0x298(0x08)
	struct UStaticMeshComponent* SM_CashRegister_01; // 0x2a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_Counter_01; // 0x2a8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_9SM_Foragable_Sneezewort_B; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_Hamlet_Coat2; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_Hamlet_TableCloth_02; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_HM_2Hand_Cabinet; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_HM_2Hand_Standing_Mirror; // 0x2d0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_7SM_HM_BLDG_TeaShop_Flowers_D; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_HM_FullBed_Queen_B; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_HW_Laundry_Coatrack_C1; // 0x2e8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HW_Curtain_Sm_B; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_HW_Curtain_Sm_B; // 0x2f8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_7SM_HW_GenericTrunk_A; // 0x300(0x08)
	struct UStaticMeshComponent* SM_HW_HB_Couch_A; // 0x308(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HW_Shelf_2mWx4_5mT_B; // 0x310(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_10SM_Int_BCProps_Barrel_001_W1; // 0x318(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_FoodBag_1bag_003_W; // 0x320(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_12SM_Int_BCProps_FoodBag_1bag_001_W; // 0x328(0x08)
	struct UStaticMeshComponent* SM_Owl; // 0x330(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_8SM_Potion_CinnamonBark; // 0x338(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_8SM_Potion_GingerRoot; // 0x340(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_8SM_Potion_WormwoodTable; // 0x348(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_Sanc_Rug_Med_Hbgst; // 0x350(0x08)
	struct UStaticMeshComponent* SM_Sanc_Rug_Small_Dwiz; // 0x358(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Stall_001_D; // 0x360(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_11SM_HM_Quill_DisplayShelf_B; // 0x368(0x08)
	struct UStaticMeshComponent* SM_BCProps_Rope_001; // 0x370(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_PlantingPotMed_01; // 0x378(0x08)
	struct UStaticMeshComponent* SM_Mandrake_Stage5; // 0x380(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_10SM_PlantingPotSmall1; // 0x388(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HW_Shelf_2mWx2mT_B; // 0x390(0x08)
	struct UStaticMeshComponent* SM_HM_Quidditch_Display_Case_A; // 0x398(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_25SM_Int_BCProps_Basket_Square_Small_002_W; // 0x3a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_Sanc_HandShears; // 0x3a8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_StallRoof_001_D; // 0x3b0(0x08)
	struct UStaticMeshComponent* SM_Sanc_PotionStationHbgst_02; // 0x3b8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_Gladrags_Corner_Dresser; // 0x3c0(0x08)
	struct UWorldFXAudioComponent* WorldFXAudio - Amb_3D_Cauldron_Boiling_Loop; // 0x3c8(0x08)
	struct UParticleSystemComponent* ParticleSystemComponent0; // 0x3d0(0x08)
	struct USceneComponent* Scene; // 0x3d8(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x3e0(0x08)
};

