// BlueprintGeneratedClass BP_HW_QuidditchPitch_Tower_Gryffindor2.BP_HW_QuidditchPitch_Tower_Gryffindor2_C
// Size: 0x3d0 (Inherited: 0x248)
struct ABP_HW_QuidditchPitch_Tower_Gryffindor2_C : AActor {
	struct UStaticMeshComponent* SM_HW_GroundsQ_DefensiveTower_Corner_I27; // 0x248(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_DefensiveTower_Corner_I26; // 0x250(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_DefensiveTower_Corner_I25; // 0x258(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_DefensiveTower_Corner_I24; // 0x260(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_DefensiveTower_Corner_I23; // 0x268(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_DefensiveTower_Corner_I13; // 0x270(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_DefensiveTower_Corner_I12; // 0x278(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_DefensiveTower_Corner_I11; // 0x280(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_DefensiveTower_Corner_I10; // 0x288(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_DefensiveTower_Corner_I9; // 0x290(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_DefensiveTower_Corner_I8; // 0x298(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_DefensiveTower_Corner_I22; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_DefensiveTower_Corner_I21; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_DefensiveTower_Corner_I20; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_DefensiveTower_Corner_I19; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_DefensiveTower_Corner_I18; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_DefensiveTower_Corner_I17; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_DefensiveTower_Corner_I16; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_DefensiveTower_Corner_I15; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_DefensiveTower_Corner_I14; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_DefensiveTower_Corner_I7; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_DefensiveTower_Corner_I6; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_DefensiveTower_Corner_I5; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_DefensiveTower_Corner_I4; // 0x300(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_DefensiveTower_Corner_I3; // 0x308(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_DefensiveTower_Corner_I2; // 0x310(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_DefensiveTower_Corner_I1; // 0x318(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_DefensiveTower_Corner_I; // 0x320(0x08)
	struct UStaticMeshComponent* SM_HW_QuidditchPitch_Tower_Bleachers; // 0x328(0x08)
	struct UStaticMeshComponent* SM_HW_QuidditchPitch_Tower_WoodPaneling; // 0x330(0x08)
	struct UStaticMeshComponent* SM_HW_QuidditchPitch_Tower_WoodBeams; // 0x338(0x08)
	struct UStaticMeshComponent* SM_HW_QuidditchPitch_TrenchArch_A1; // 0x340(0x08)
	struct UStaticMeshComponent* SM_HW_QuidditchPitch_TrenchArch_A; // 0x348(0x08)
	struct UStaticMeshComponent* SM_HW_Owlery_ArchSupportHalfA6; // 0x350(0x08)
	struct UStaticMeshComponent* SM_HW_Owlery_ArchSupportHalfA5; // 0x358(0x08)
	struct UStaticMeshComponent* SM_HW_Owlery_ArchSupportHalfA4; // 0x360(0x08)
	struct UStaticMeshComponent* SM_HW_Owlery_ArchSupportHalfA2; // 0x368(0x08)
	struct UStaticMeshComponent* SM_HW_Owlery_ArchSupportHalfA1; // 0x370(0x08)
	struct UStaticMeshComponent* SM_HW_Owlery_ArchSupportHalfA; // 0x378(0x08)
	struct UStaticMeshComponent* SM_HW_QuidditchPitch_Tower1; // 0x380(0x08)
	struct UStaticMeshComponent* SM_HW_QuidditchPitch_Tower_BannerFlagEmblem_Ravenclaw; // 0x388(0x08)
	struct UStaticMeshComponent* SM_HW_QuidditchPitch_Tower_Roof_Ravenclaw; // 0x390(0x08)
	struct UStaticMeshComponent* SM_HW_QuidditchPitch_TowerTarp_D; // 0x398(0x08)
	struct UStaticMeshComponent* SM_CampB_2m_PlankC2; // 0x3a0(0x08)
	struct UStaticMeshComponent* SM_CampB_2m_PlankA; // 0x3a8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CampB_2m_PlankD; // 0x3b0(0x08)
	struct UStaticMeshComponent* SM_HW_RulesAndProclamations_Frame_A1; // 0x3b8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_HW_MC_Nail; // 0x3c0(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x3c8(0x08)
};

