// BlueprintGeneratedClass BP_Hamlet_Class_A8_Interior_A.BP_Hamlet_Class_A8_Interior_A_C
// Size: 0x370 (Inherited: 0x248)
struct ABP_Hamlet_Class_A8_Interior_A_C : AActor {
	struct UDecalComponent* MI_HW_Decal_Wood_WornStep3_71; // 0x248(0x08)
	struct UDecalComponent* MI_HW_Decal_Wood_WornStep2_69; // 0x250(0x08)
	struct UDecalComponent* MI_HW_Decal_Wood_WornStep01_67; // 0x258(0x08)
	struct UDecalComponent* MI_HW_Decal_WhiteDrip3_65; // 0x260(0x08)
	struct UDecalComponent* MI_HW_Decal_WhiteDrip2_63; // 0x268(0x08)
	struct UDecalComponent* MI_BCProps_Decal_Ash_A_61; // 0x270(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Soot_A_59; // 0x278(0x08)
	struct UDecalComponent* MI_HW_Decal_WhiteDrip_57; // 0x280(0x08)
	struct UStaticMeshComponent* SM_HamletA_08_QuillsandBooks_Merged; // 0x288(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_Int_BCProps_Barrel_Short_001_W; // 0x290(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_7SM_Int_BCProps_Barrel_001_W; // 0x298(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Sanc_Rug_Small_Mzoo1; // 0x2a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_Int_BCProps_CloseCrate_Large_002_W; // 0x2a8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_CloseCrate_Small_002_W; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_HW_Curtain_Lg_C1; // 0x2b8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_HM_Dogweed_HangingPots_A; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_HW_CoatRack_02; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_HM_FullBed_Queen_B1; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_HW_SideTable_C1; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_HM_FirePlaceSpit_A1; // 0x2e0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_Jug_001_W; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Pot_001_W1; // 0x2f0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_Int_BCProps_Barrel_Fat_001_W1; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_Shelf_A1; // 0x300(0x08)
	struct UStaticMeshComponent* SM_Owl1; // 0x308(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Table_A_4; // 0x310(0x08)
	struct UStaticMeshComponent* SM_HW_Chair_Footstool_C1; // 0x318(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HW_L_Chair_A1; // 0x320(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_HM_Music_Wall_Cabinet1; // 0x328(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_HW_Curtain_Lg_C1; // 0x330(0x08)
	struct UStaticMeshComponent* SM_HamletA_08_HM_PotionBottles_Merged1; // 0x338(0x08)
	struct UStaticMeshComponent* SM_HamletA_08_HM_3Broom_Bottles_Merged1; // 0x340(0x08)
	struct UStaticMeshComponent* SM_HamletA_08_HM_OwlPost_Packages_Merged1; // 0x348(0x08)
	struct UStaticMeshComponent* SM_HamletA_08_CampB_2m_PostA_Merged1; // 0x350(0x08)
	struct UChildActorComponent* BP_HW_Nuts_Bowl_B; // 0x358(0x08)
	struct USceneComponent* Scene; // 0x360(0x08)
	struct USceneComponent* SharedRoot; // 0x368(0x08)
};

