// BlueprintGeneratedClass BP_Hamlet_Vendor_Beast_02.BP_Hamlet_Vendor_Beast_02_C
// Size: 0x338 (Inherited: 0x248)
struct ABP_Hamlet_Vendor_Beast_02_C : AActor {
	struct UStaticMeshComponent* SM_Hamlet_Vendor_Beast_02_Merged_03; // 0x248(0x08)
	struct UStaticMeshComponent* SM_Hamlet_Vendor_Beast_02_Merged_02; // 0x250(0x08)
	struct UStaticMeshComponent* SM_Hamlet_Vendor_Beast_02_Merged_01; // 0x258(0x08)
	struct UBoxComponent* CollisionBox; // 0x260(0x08)
	struct UStaticMeshComponent* SM_Hamlet_Vendor_Tentprop_02; // 0x268(0x08)
	struct UStaticMeshComponent* SM_Hamlet_Vendor_Tentprop_01; // 0x270(0x08)
	struct UChildActorComponent* BP_HM_PropOwl; // 0x278(0x08)
	struct UStaticMeshComponent* SM_CampA_Int_BedRug_01B; // 0x280(0x08)
	struct UStaticMeshComponent* SM_CampA_HideTannerA; // 0x288(0x08)
	struct UStaticMeshComponent* SM_WE_Chalkboard_Transfiguration_Decal_02; // 0x290(0x08)
	struct UStaticMeshComponent* SM_Hamlet_Vendor_ChalkBoardSign; // 0x298(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeSpan7m_Flags_A2_StaticMeshComponent0; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeSpan7m_Flags_A_StaticMeshComponent0; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_4_wheel_Cart_Front_Steering_StaticMeshComponent0; // 0x2b0(0x08)
	struct UStaticMeshComponent* BP_4_Wheel_Cart_Body_5_SM_Sanc_MagicChestMedium_Hbgst_01A; // 0x2b8(0x08)
	struct UChildActorComponent* BP_4_Wheel_Cart_Body_5_Bag; // 0x2c0(0x08)
	struct UStaticMeshComponent* BP_4_Wheel_Cart_Body_5_SM_CastleDun_Bag_Closed_A; // 0x2c8(0x08)
	struct UStaticMeshComponent* BP_4_Wheel_Cart_Body_5_SM_4_wheel_Cart_Body_No_Sign; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_BCProps_FloorCloth_A2_StaticMeshComponent0; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_FoodBag_1bag_002_W3_StaticMeshComponent0; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_FoodBag_1bag_002_W2_StaticMeshComponent0; // 0x2e8(0x08)
	struct UStaticMeshComponent* Water3_StaticMeshComponent0; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_Hamlet_Vendor_Tarp_3_StaticMeshComponent0; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_Hamlet_Vendor_Frame_3_StaticMeshComponent0; // 0x300(0x08)
	struct UStaticMeshComponent* SM_Hamlet_Vendor_Tarp_02_StaticMeshComponent0; // 0x308(0x08)
	struct UStaticMeshComponent* SM_Hamlet_Vendor_Frame_02_StaticMeshComponent0; // 0x310(0x08)
	struct UStaticMeshComponent* SM_Int_CastleDun_TableLong2_StaticMeshComponent0; // 0x318(0x08)
	struct UStaticMeshComponent* SM_Int_CastleDun_Table2_StaticMeshComponent0; // 0x320(0x08)
	struct USceneComponent* Scene; // 0x328(0x08)
	struct USceneComponent* SharedRoot; // 0x330(0x08)
};

