// BlueprintGeneratedClass BP_Hamlet_Vendor_Clothing_02.BP_Hamlet_Vendor_Clothing_02_C
// Size: 0x300 (Inherited: 0x248)
struct ABP_Hamlet_Vendor_Clothing_02_C : AActor {
	struct UStaticMeshComponent* SM_Hamlet_Vendor_Clothing_02_Merged_02; // 0x248(0x08)
	struct UStaticMeshComponent* SM_Hamlet_Vendor_Clothing_02_Merged_01; // 0x250(0x08)
	struct UStaticMeshComponent* SM_HM_GEN_Mirror_D1; // 0x258(0x08)
	struct UStaticMeshComponent* SM_Mannequin_StandingA1; // 0x260(0x08)
	struct UStaticMeshComponent* SM_Hamlet_Vendor_Drapes_02; // 0x268(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_OVR_Table_01_Stool; // 0x270(0x08)
	struct UStaticMeshComponent* SM_Vendor_Clothing_Decal; // 0x278(0x08)
	struct UStaticMeshComponent* SM_Hamlet_Vendor_ChalkBoardSign; // 0x280(0x08)
	struct UStaticMeshComponent* SM_Cotton_Tufts_WithBasket; // 0x288(0x08)
	struct UStaticMeshComponent* SM_HW_Laundry_Coatrack_A; // 0x290(0x08)
	struct UStaticMeshComponent* SM_Hamlet_Vendor_Frame_01; // 0x298(0x08)
	struct UStaticMeshComponent* SM_Hamlet_TableCloth_02; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Table_Medium_001_D; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_BCProps_FloorCloth_D; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_HM_GEN_Chair_E; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_Hamlet_Vendor_Drapes_01; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_WE_CampFire_ClothLine_01; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeCloth_A; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_OVR_Table_01; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_HM_Gladrags_Hat_Box_E; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_BCProps_FloorCloth_A; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_HM_Honeydukes_cash_register; // 0x2f0(0x08)
	struct USceneComponent* SharedRoot; // 0x2f8(0x08)
};

