// BlueprintGeneratedClass BP_HW_VB_SconceColumnBase_A.BP_HW_VB_SconceColumnBase_A_C
// Size: 0x2d0 (Inherited: 0x248)
struct ABP_HW_VB_SconceColumnBase_A_C : AActor {
	struct UStaticMeshComponent* SM_HW_GroundsQ_Brick_G1; // 0x248(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_Brick_L3; // 0x250(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_Brick_G; // 0x258(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_Brick_I1; // 0x260(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_Brick_L2; // 0x268(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_Brick_P3; // 0x270(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_Brick_P2; // 0x278(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_Brick_L1; // 0x280(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_Brick_Q; // 0x288(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_Brick_P1; // 0x290(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_Brick_C1; // 0x298(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_Brick_L; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_Brick_C; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_Brick_I; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_Brick_P; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_HW_VB_SconceColumn_A; // 0x2c0(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x2c8(0x08)
};

