// BlueprintGeneratedClass BP_HamletC_Gen_A_Int.BP_HamletC_Gen_A_Int_C
// Size: 0x348 (Inherited: 0x248)
struct ABP_HamletC_Gen_A_Int_C : AActor {
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_ArmChair_Leather_4s; // 0x248(0x08)
	struct UStaticMeshComponent* SM_HW_HB_Plant_B_Sm; // 0x250(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_HW_LetterBundle_A; // 0x258(0x08)
	struct UStaticMeshComponent* SM_HW_LetterCluster_D; // 0x260(0x08)
	struct UStaticMeshComponent* SM_HW_Laundry_Coatrack_A; // 0x268(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_Dogweed_HangingPots_A; // 0x270(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_HM_Dogweed_HangingPot_B; // 0x278(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Basket_Small_004_W; // 0x280(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Basket_Small_001_W; // 0x288(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_HW_L_BookRow_Half_C; // 0x290(0x08)
	struct UStaticMeshComponent* SM_HW_K_HangingHerbs_B; // 0x298(0x08)
	struct UStaticMeshComponent* SM_HW_K_HangingHerbs_D; // 0x2a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HW_K_HangingHerbs_StringA; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_Desk; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_HM_Grandfather_Clock; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_HW_Bench_B1_2P; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_HW_Rectangular_Rug_01; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_HamletC_Gen_A_Interior_Dishware_Old_Merged; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_HW_L_BookStack_Large_A; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_HamletA_01_Fireplace; // 0x2e0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_Cauldron_Cauldron_C; // 0x2e8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_2Hand_Cabinet; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_HW_Circularr_Rug_01; // 0x2f8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_OVR_TableSmall_01; // 0x300(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_HM_3Broom_Chair_C; // 0x308(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_3Broom_Bottle_B; // 0x310(0x08)
	struct UStaticMeshComponent* SM_HM_HogsHead_Table; // 0x318(0x08)
	struct UStaticMeshComponent* SM_HM_Cauldron_FireStoker_B; // 0x320(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Jug_B; // 0x328(0x08)
	struct UStaticMeshComponent* SM_HM_Music_Phonograph1; // 0x330(0x08)
	struct UChildActorComponent* BP_HW_K_PR_Cauldron_4Pots; // 0x338(0x08)
	struct USceneComponent* SharedRoot; // 0x340(0x08)
};

