// BlueprintGeneratedClass BP_INT_CampShelf_A.BP_INT_CampShelf_A_C
// Size: 0x418 (Inherited: 0x248)
struct ABP_INT_CampShelf_A_C : AActor {
	struct UStaticMeshComponent* SM_BCProps_Apple_A101_StaticMeshComponent0; // 0x248(0x08)
	struct UStaticMeshComponent* SM_BCProps_Apple_A94_StaticMeshComponent0; // 0x250(0x08)
	struct UStaticMeshComponent* SM_BCProps_Apple_A93_StaticMeshComponent0; // 0x258(0x08)
	struct UStaticMeshComponent* SM_BCProps_Apple_A92_StaticMeshComponent0; // 0x260(0x08)
	struct UStaticMeshComponent* SM_BCProps_Apple_A96_StaticMeshComponent0; // 0x268(0x08)
	struct UStaticMeshComponent* SM_BCProps_Apple_A97_StaticMeshComponent0; // 0x270(0x08)
	struct UStaticMeshComponent* SM_BCProps_Apple_A89_StaticMeshComponent0; // 0x278(0x08)
	struct UStaticMeshComponent* SM_BCProps_Apple_A90_StaticMeshComponent0; // 0x280(0x08)
	struct UStaticMeshComponent* SM_BCProps_Apple_A88_StaticMeshComponent0; // 0x288(0x08)
	struct UStaticMeshComponent* SM_BCProps_Apple_A87_StaticMeshComponent0; // 0x290(0x08)
	struct UStaticMeshComponent* SM_BCProps_Apple_A86_StaticMeshComponent0; // 0x298(0x08)
	struct UStaticMeshComponent* SM_BCProps_Apple_A85_StaticMeshComponent0; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_BCProps_Apple_A84_StaticMeshComponent0; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_BCProps_Apple_A83_StaticMeshComponent0; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_BCProps_Apple_A78_StaticMeshComponent0; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_BCProps_Apple_A81_StaticMeshComponent0; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_BCProps_Apple_A82_StaticMeshComponent0; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_BCProps_Apple_A79_StaticMeshComponent0; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_HangingProps_Plants_001_W19_StaticMeshComponent0; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_HangingProps_Plants_004_W_StaticMeshComponent0; // 0x2e0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse2; // 0x2e8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse1; // 0x2f0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_CastleDun_GOB_Cup27_StaticMeshComponent0; // 0x300(0x08)
	struct UObjectStateComponent* ObjectState; // 0x308(0x08)
	struct UStaticMeshComponent* SM_CastleDun_GOB_Cup28_StaticMeshComponent0; // 0x310(0x08)
	struct UStaticMeshComponent* SM_CastleDun_GOB_Cup23_StaticMeshComponent0; // 0x318(0x08)
	struct UStaticMeshComponent* SM_CastleDun_GOB_Cup25_StaticMeshComponent0; // 0x320(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Jug_C14_StaticMeshComponent0; // 0x328(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Basket_Small_004_W5_StaticMeshComponent0; // 0x330(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Jug_001_W51_StaticMeshComponent0; // 0x338(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Jug_001_W50_StaticMeshComponent0; // 0x340(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Jug_001_W48_StaticMeshComponent0; // 0x348(0x08)
	struct UPhysicalResponseComponent* SmallProp8; // 0x350(0x08)
	struct UPhysicalResponseComponent* SmallProp7; // 0x358(0x08)
	struct UPhysicalResponseComponent* SmallProp6; // 0x360(0x08)
	struct UPhysicalResponseComponent* SmallProp5; // 0x368(0x08)
	struct UPhysicalResponseComponent* SmallProp4; // 0x370(0x08)
	struct UPhysicalResponseComponent* SmallProp3; // 0x378(0x08)
	struct UPhysicalResponseComponent* SmallProp2; // 0x380(0x08)
	struct UPhysicalResponseComponent* SmallProp1; // 0x388(0x08)
	struct UPhysicalResponseComponent* SmallProp; // 0x390(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_HangingProps_Plants_004_W3_StaticMeshComponent0; // 0x398(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_HangingProps_Plants_004_W4_StaticMeshComponent0; // 0x3a0(0x08)
	struct UPhysicalResponseComponent* Rope; // 0x3a8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse_Rope; // 0x3b0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Stall_001_D3_StaticMeshComponent0; // 0x3b8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_HangingProps_Plants_004_W2_StaticMeshComponent0; // 0x3c0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Basket_Square_Small_002_W6_StaticMeshComponent0; // 0x3c8(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Jug_C15_StaticMeshComponent0; // 0x3d0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Jug_001_W53_StaticMeshComponent0; // 0x3d8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Jug_001_W52_StaticMeshComponent0; // 0x3e0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Jug_001_W49_StaticMeshComponent0; // 0x3e8(0x08)
	struct UStaticMeshComponent* SM_CastleDun_GOB_Cup22_StaticMeshComponent0; // 0x3f0(0x08)
	struct UStaticMeshComponent* SM_CastleDun_GOB_Cup24_StaticMeshComponent0; // 0x3f8(0x08)
	struct UStaticMeshComponent* SM_CastleDun_GOB_Cup26_StaticMeshComponent0; // 0x400(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Stall_001_D2_StaticMeshComponent0; // 0x408(0x08)
	struct USceneComponent* SharedRoot; // 0x410(0x08)
};

