// BlueprintGeneratedClass BP_JobberKnollTreeDen_COASTAL.BP_JobberKnollTreeDen_COASTAL_C
// Size: 0x2e0 (Inherited: 0x248)
struct ABP_JobberKnollTreeDen_COASTAL_C : AActor {
	struct UCapsuleComponent* Capsule3; // 0x248(0x08)
	struct UCapsuleComponent* Capsule2; // 0x250(0x08)
	struct UCapsuleComponent* Capsule1; // 0x258(0x08)
	struct UCapsuleComponent* Capsule; // 0x260(0x08)
	struct UChildActorComponent* BP_BeastDen_Marker; // 0x268(0x08)
	struct UStaticMeshComponent* SM_OVL_BeastDen_JobberknollNest_C1; // 0x270(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse8; // 0x278(0x08)
	struct UStaticMeshComponent* SM_OVL_BeastDen_JobberknollNest_C; // 0x280(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse7; // 0x288(0x08)
	struct UStaticMeshComponent* SM_OVL_BeastDen_JobberknollNest_A_02; // 0x290(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse6; // 0x298(0x08)
	struct UStaticMeshComponent* Nest 01; // 0x2a0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse5; // 0x2a8(0x08)
	struct UStaticMeshComponent* Nest 02; // 0x2b0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse4; // 0x2b8(0x08)
	struct UStaticMeshComponent* Nest 03; // 0x2c0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse3; // 0x2c8(0x08)
	struct UChildActorComponent* BP_FF_HeroTree02_Blueprint; // 0x2d0(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x2d8(0x08)
};

