// BlueprintGeneratedClass BP_KeensBridge_Arch.BP_KeensBridge_Arch_C
// Size: 0x3b8 (Inherited: 0x248)
struct ABP_KeensBridge_Arch_C : AActor {
	struct UDecalComponent* MI_P_Decal_Stain23; // 0x248(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_C; // 0x250(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_E; // 0x258(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Damage_A_6; // 0x260(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_G2; // 0x268(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_F; // 0x270(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_G; // 0x278(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Damage_A_5; // 0x280(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Damage_A_4; // 0x288(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Damage_A_3; // 0x290(0x08)
	struct UStaticMeshComponent* SM_BCProps_Eyelet_B; // 0x298(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_BCProps_RopeLashing_C; // 0x2a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_CastleDun_WoodenBeamPeg_A; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_Hamlet_Keensbridge_Arch; // 0x2b0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_3Broom_RoofTile_C; // 0x2b8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_Formal_Stone_Wall_Pillar; // 0x2c0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_12SM_HM_Roof_Shingles_Set_A; // 0x2c8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_HM_Roof_Shingles_Set_B; // 0x2d0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_Roof_Shingles_Set_C; // 0x2d8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_Ivy_Branch_A; // 0x2e0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_18SM_Ivy_Branch_A; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_Ivy_Branch_B1; // 0x2f0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_13SM_Ivy_Branch_B; // 0x2f8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Ivy_Branch_Bare_C; // 0x300(0x08)
	struct UStaticMeshComponent* SM_Ivy_Branch_Bare_E; // 0x308(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_8SM_Ivy_Branch_Bare_F; // 0x310(0x08)
	struct UStaticMeshComponent* SM_Ivy_Branch_Bare_G; // 0x318(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_9SM_Ivy_Branch_Bare_B; // 0x320(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_Ivy_Branch_C; // 0x328(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Ivy_Branch_D; // 0x330(0x08)
	struct UStaticMeshComponent* SM_Ivy_Branch_B; // 0x338(0x08)
	struct UStaticMeshComponent* SM_Ivy_Branch_A; // 0x340(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Ivy_Branch_A; // 0x348(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_Ivy_Branch_B; // 0x350(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_20SM_Ivy_Branch_C; // 0x358(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_28SM_Ivy_Branch_C; // 0x360(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_13SM_Ivy_Branch_D; // 0x368(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_7SM_Ivy_Branch_E; // 0x370(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_Ivy_Branch_E; // 0x378(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_14SM_Ivy_Branch_F; // 0x380(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Ivy_Branch_F; // 0x388(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_Ivy_Branch_F; // 0x390(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_Ivy_MeshDecal_07; // 0x398(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_Ivy_MeshDecal_09; // 0x3a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_14SM_OL2_StickPile_F; // 0x3a8(0x08)
	struct USceneComponent* SharedRoot; // 0x3b0(0x08)
};

