// BlueprintGeneratedClass BP_Kitchen_Firepit_B.BP_Kitchen_Firepit_B_C
// Size: 0x290 (Inherited: 0x248)
struct ABP_Kitchen_Firepit_B_C : AActor {
	struct UStaticMeshComponent* SM_BCProps_Firepit_Rock_003_LOD; // 0x248(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Firepit_001; // 0x250(0x08)
	struct UStaticMeshComponent* StaticMeshComponent14; // 0x258(0x08)
	struct UStaticMeshComponent* StaticMeshComponent13; // 0x260(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse5; // 0x268(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse4; // 0x270(0x08)
	struct UStaticMeshComponent* StaticMeshComponent12; // 0x278(0x08)
	struct UDecalComponent* NewDecalComponent; // 0x280(0x08)
	struct USceneComponent* SharedRoot; // 0x288(0x08)
};

