// BlueprintGeneratedClass BP_Kitchen_Firepit_A.BP_Kitchen_Firepit_A_C
// Size: 0x2d0 (Inherited: 0x248)
struct ABP_Kitchen_Firepit_A_C : AActor {
	struct UStaticMeshComponent* SM_Int_CastleDun_Kitchen_Pot_C; // 0x248(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse5; // 0x250(0x08)
	struct UStaticMeshComponent* SM_Int_CastleDun_Kitchen_Pot_D; // 0x258(0x08)
	struct UStaticMeshComponent* StaticMeshComponent11; // 0x260(0x08)
	struct UStaticMeshComponent* StaticMeshComponent10; // 0x268(0x08)
	struct UStaticMeshComponent* StaticMeshComponent9; // 0x270(0x08)
	struct UStaticMeshComponent* StaticMeshComponent8; // 0x278(0x08)
	struct UStaticMeshComponent* StaticMeshComponent7; // 0x280(0x08)
	struct UStaticMeshComponent* StaticMeshComponent6; // 0x288(0x08)
	struct UStaticMeshComponent* StaticMeshComponent5; // 0x290(0x08)
	struct UStaticMeshComponent* StaticMeshComponent4; // 0x298(0x08)
	struct UStaticMeshComponent* StaticMeshComponent3; // 0x2a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent2; // 0x2a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent1; // 0x2b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0; // 0x2b8(0x08)
	struct UDecalComponent* NewDecalComponent; // 0x2c0(0x08)
	struct USceneComponent* SharedRoot; // 0x2c8(0x08)
};

