// BlueprintGeneratedClass BP_Magical_ImpCandy_Interact.BP_Magical_ImpCandy_Interact_C
// Size: 0x378 (Inherited: 0x324)
struct ABP_Magical_ImpCandy_Interact_C : ABP_Magical_Candy_Interact_Master_C {
	char pad_324[0x4]; // 0x324(0x04)
	struct UStaticMeshComponent* SM_Candy_Bowl_Glass_C; // 0x328(0x08)
	struct UStaticMeshComponent* SM_HM_HD_PepperImps_5; // 0x330(0x08)
	struct UStaticMeshComponent* SM_HM_HD_PepperImps_3; // 0x338(0x08)
	struct UStaticMeshComponent* SM_HM_HD_PepperImps_10; // 0x340(0x08)
	struct UStaticMeshComponent* SM_HM_HD_PepperImps_9; // 0x348(0x08)
	struct UStaticMeshComponent* SM_HM_HD_PepperImps_8; // 0x350(0x08)
	struct UStaticMeshComponent* SM_HM_HD_PepperImps_7; // 0x358(0x08)
	struct UStaticMeshComponent* SM_HM_HD_PepperImps_6; // 0x360(0x08)
	struct UStaticMeshComponent* SM_HM_HD_PepperImps_4; // 0x368(0x08)
	struct UStaticMeshComponent* SM_Candy_Bowl_Glass_Inside_A; // 0x370(0x08)
};

