// BlueprintGeneratedClass BP_MoonCalfDen_DarkForest.BP_MoonCalfDen_DarkForest_C
// Size: 0x320 (Inherited: 0x248)
struct ABP_MoonCalfDen_DarkForest_C : AActor {
	struct UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh19; // 0x248(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh18; // 0x250(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh17; // 0x258(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh16; // 0x260(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh12; // 0x268(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh11; // 0x270(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh10; // 0x278(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh9; // 0x280(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh8; // 0x288(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh7; // 0x290(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh6; // 0x298(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh1; // 0x2a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh4; // 0x2a8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh3; // 0x2b0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh2; // 0x2b8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh; // 0x2c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent7; // 0x2c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent6; // 0x2d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent5; // 0x2d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent4; // 0x2e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent3; // 0x2e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent2; // 0x2f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent1; // 0x2f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0; // 0x300(0x08)
	struct UStaticMeshComponent* StaticMeshComponent8; // 0x308(0x08)
	struct USceneComponent* SharedRoot; // 0x310(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x318(0x08)
};

