// BlueprintGeneratedClass BP_MoonCalfDen_Coast.BP_MoonCalfDen_Coast_C
// Size: 0x2d8 (Inherited: 0x248)
struct ABP_MoonCalfDen_Coast_C : AActor {
	struct UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh19; // 0x248(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh18; // 0x250(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh15; // 0x258(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh14; // 0x260(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh13; // 0x268(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh12; // 0x270(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh11; // 0x278(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh10; // 0x280(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh9; // 0x288(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh7; // 0x290(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh6; // 0x298(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh5; // 0x2a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh4; // 0x2a8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh3; // 0x2b0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh; // 0x2b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent8; // 0x2c0(0x08)
	struct USceneComponent* SharedRoot; // 0x2c8(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x2d0(0x08)
};

