// BlueprintGeneratedClass BP_master_tree_root_spline.BP_master_tree_root_spline_C
// Size: 0x328 (Inherited: 0x248)
struct ABP_master_tree_root_spline_C : AActor {
	struct USplineComponent* Spline1; // 0x248(0x08)
	struct USceneComponent* spline_mesh; // 0x250(0x08)
	struct UMeshComponent* MeshComponent; // 0x258(0x08)
	struct UMaterialInstanceDynamic* Dynamic Material; // 0x260(0x08)
	struct UMaterialInstanceDynamic* Dynamic Material1; // 0x268(0x08)
	struct UMaterialInstanceDynamic* Dynamic Material2; // 0x270(0x08)
	bool Draw Final (Disable for Preview - Better Performance); // 0x278(0x01)
	bool Draw Meshes (Disable for quicker spline creation); // 0x279(0x01)
	char pad_27A[0x2]; // 0x27a(0x02)
	float Start_Scale; // 0x27c(0x04)
	float End_Scale; // 0x280(0x04)
	struct FVector2D Lastscale Value; // 0x284(0x08)
	struct FVector2D Firstscale Value; // 0x28c(0x08)
	int32_t Index Number; // 0x294(0x04)
	struct USplineMeshComponent* SplineMesh1; // 0x298(0x08)
	struct UStaticMesh* SplineMesh; // 0x2a0(0x08)
	struct UStaticMesh* EndMesh; // 0x2a8(0x08)
	float Spline_Start; // 0x2b0(0x04)
	float SplineEnd; // 0x2b4(0x04)
	float SplineLength; // 0x2b8(0x04)
	char pad_2BC[0x4]; // 0x2bc(0x04)
	struct UMaterialInterface* Choose Material; // 0x2c0(0x08)
	struct UMaterialInterface* Choose Material_LOD2; // 0x2c8(0x08)
	float vertical_tiling_amount; // 0x2d0(0x04)
	float horizontal_tiling_amount; // 0x2d4(0x04)
	float Tesselation Scale; // 0x2d8(0x04)
	float Tesselation_Fade_Distance; // 0x2dc(0x04)
	int32_t GetNumSplinePoints; // 0x2e0(0x04)
	char pad_2E4[0x4]; // 0x2e4(0x04)
	struct TArray<struct FSTR_Tree_Twist_Data> Tree_Twist_Per_Spline_Point; // 0x2e8(0x10)
	struct USplineMeshComponent* SplineMesh2; // 0x2f8(0x08)
	float Spline Start2; // 0x300(0x04)
	float SplineEnd2; // 0x304(0x04)
	struct FVector2D Firstscale Value2; // 0x308(0x08)
	int32_t Last Index; // 0x310(0x04)
	char pad_314[0x4]; // 0x314(0x04)
	struct UPhysicsConstraintComponent* Physics_Constraint; // 0x318(0x08)
	struct UPhysicsConstraintComponent* NewVar0; // 0x320(0x08)

	void UserConstructionScript(); // Function BP_master_tree_root_spline.BP_master_tree_root_spline_C.UserConstructionScript // (Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
};

