// BlueprintGeneratedClass BP_OVL_Hut.BP_OVL_Hut_C
// Size: 0x658 (Inherited: 0x248)
struct ABP_OVL_Hut_C : AActor {
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D60_1444; // 0x248(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D59_1442; // 0x250(0x08)
	struct UStaticMeshComponent* SM_HM_Gatehouse_Stone_Cap_A19_1440; // 0x258(0x08)
	struct UStaticMeshComponent* SM_HM_Gatehouse_Stone_Cap_A18_1438; // 0x260(0x08)
	struct UStaticMeshComponent* SM_HM_Gatehouse_Stone_Cap_A17_1436; // 0x268(0x08)
	struct UStaticMeshComponent* SM_HM_Gatehouse_Stone_Cap_A16_1434; // 0x270(0x08)
	struct UStaticMeshComponent* SM_HM_Gatehouse_Stone_Cap_A15_1432; // 0x278(0x08)
	struct UStaticMeshComponent* SM_HM_Gatehouse_Stone_Cap_A14_1430; // 0x280(0x08)
	struct UStaticMeshComponent* SM_MC_Hut_Roof_1428; // 0x288(0x08)
	struct UStaticMeshComponent* SM_HM_Gatehouse_Stone_Cap_A13_1426; // 0x290(0x08)
	struct UStaticMeshComponent* SM_HM_Gatehouse_Stone_Cap_A12_1424; // 0x298(0x08)
	struct UStaticMeshComponent* SM_HM_Gatehouse_Stone_Cap_A11_1422; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_HM_Gatehouse_Stone_Cap_A10_1420; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_MC_Hut_Steps_1418; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D58_1416; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_HM_Gatehouse_Stone_Cap_A9_1414; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D57_1412; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_HM_Gatehouse_Stone_Cap_A8_1410; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_HM_Gatehouse_Stone_Cap_A7_1408; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_HM_Gatehouse_Stone_Cap_A6_1406; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_HM_Gatehouse_Stone_Cap_A5_1404; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_MC_Hut_Ext_WoodTrim_1402; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_HM_Gatehouse_Stone_Cap_A4_1400; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_HM_Gatehouse_Stone_Cap_B_1398; // 0x300(0x08)
	struct UStaticMeshComponent* SM_HW_MC_WoodPeg2_1396; // 0x308(0x08)
	struct UStaticMeshComponent* SM_HW_MC_WoodPeg_1394; // 0x310(0x08)
	struct UStaticMeshComponent* SM_MC_Hut_SideSteps_Small_1392; // 0x318(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D56_1390; // 0x320(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D55_1388; // 0x328(0x08)
	struct UStaticMeshComponent* SM_HM_Gatehouse_Stone_Cap_D_1386; // 0x330(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D54_1384; // 0x338(0x08)
	struct UStaticMeshComponent* SM_HM_Gatehouse_Stone_Cap_A3_1382; // 0x340(0x08)
	struct UStaticMeshComponent* SM_HW_MC_ExteriorCornerTreatment_B11_1380; // 0x348(0x08)
	struct UStaticMeshComponent* SM_HW_MC_WindowFrame_A_1378; // 0x350(0x08)
	struct UStaticMeshComponent* SM_HW_MC_Hut_Wall_Window_B_WindowPane_1376; // 0x358(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D53_1374; // 0x360(0x08)
	struct UStaticMeshComponent* SM_HW_MC_BathroomInterior_1372; // 0x368(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D52_1370; // 0x370(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D51_1368; // 0x378(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D50_1366; // 0x380(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D49_1364; // 0x388(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D48_1362; // 0x390(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D47_1360; // 0x398(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D46_1358; // 0x3a0(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D45_1356; // 0x3a8(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D44_1354; // 0x3b0(0x08)
	struct UStaticMeshComponent* SM_MC_Hut_Floor_1352; // 0x3b8(0x08)
	struct UStaticMeshComponent* SM_HW_MC_CeilingAndRafters_1350; // 0x3c0(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D43_1348; // 0x3c8(0x08)
	struct UStaticMeshComponent* SM_HW_MC_SideDoorEntrance_Small_Roof_02_1346; // 0x3d0(0x08)
	struct UStaticMeshComponent* SM_HM_Honeydukes_fireplace_1344; // 0x3d8(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D42_1342; // 0x3e0(0x08)
	struct UStaticMeshComponent* SM_HM_Gatehouse_Stone_Cap_A2_1340; // 0x3e8(0x08)
	struct UStaticMeshComponent* SM_HW_MC_Butress_B4_1338; // 0x3f0(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D41_1336; // 0x3f8(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D40_1334; // 0x400(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D39_1332; // 0x408(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D38_1330; // 0x410(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D37_1328; // 0x418(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D36_1326; // 0x420(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D35_1324; // 0x428(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D34_1322; // 0x430(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D33_1320; // 0x438(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D32_1318; // 0x440(0x08)
	struct UStaticMeshComponent* SM_HW_MC_ExteriorCornerTreatment_C6_1316; // 0x448(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D31_1314; // 0x450(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D30_1312; // 0x458(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D29_1310; // 0x460(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D28_1308; // 0x468(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D27_1306; // 0x470(0x08)
	struct UStaticMeshComponent* SM_HM_Gatehouse_Stone_Cap_A_1304; // 0x478(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D26_1302; // 0x480(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D25_1300; // 0x488(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D24_1298; // 0x490(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D23_1296; // 0x498(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D22_1294; // 0x4a0(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D21_1292; // 0x4a8(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D20_1290; // 0x4b0(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D19_1288; // 0x4b8(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D18_1286; // 0x4c0(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D17_1284; // 0x4c8(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D16_1282; // 0x4d0(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D15_1280; // 0x4d8(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D14_1278; // 0x4e0(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D13_1276; // 0x4e8(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D12_1274; // 0x4f0(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D11_1272; // 0x4f8(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D10_1270; // 0x500(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D9_1268; // 0x508(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D8_1266; // 0x510(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D7_1264; // 0x518(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D6_1262; // 0x520(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D5_1260; // 0x528(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D4_1258; // 0x530(0x08)
	struct UStaticMeshComponent* SM_HW_BS_WaterSpout_A_1256; // 0x538(0x08)
	struct UStaticMeshComponent* SM_HW_MC_OfficeINT_Walls_02_1254; // 0x540(0x08)
	struct UStaticMeshComponent* SM_MC_Hut_Ext_Shell_1252; // 0x548(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D3_1250; // 0x550(0x08)
	struct UStaticMeshComponent* SM_MC_Hut_Bathroom_Roof_1248; // 0x558(0x08)
	struct UStaticMeshComponent* SM_MC_Hut_Ext_Chimney_1246; // 0x560(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D2_1244; // 0x568(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WoodenBeam_D_1242; // 0x570(0x08)
	struct UStaticMeshComponent* SM_MC_Hut_Wall_Door_C_1240; // 0x578(0x08)
	struct UStaticMeshComponent* SM_MC_Hut_SideDoorEntrance_Small_02_1238; // 0x580(0x08)
	struct UStaticMeshComponent* SM_HW_MC_Butress_B3_1236; // 0x588(0x08)
	struct UStaticMeshComponent* SM_HW_MC_Butress_B2_1234; // 0x590(0x08)
	struct UStaticMeshComponent* SM_HW_MC_Butress_B_1232; // 0x598(0x08)
	struct UStaticMeshComponent* SM_HW_MC_ExteriorCornerTreatment_A6_1230; // 0x5a0(0x08)
	struct UStaticMeshComponent* SM_HW_MC_ExteriorCornerTreatment_B10_1228; // 0x5a8(0x08)
	struct UStaticMeshComponent* SM_HW_MC_ExteriorCornerTreatment_C5_1226; // 0x5b0(0x08)
	struct UStaticMeshComponent* SM_HW_MC_ExteriorCornerTreatment_C4_1224; // 0x5b8(0x08)
	struct UStaticMeshComponent* SM_HW_MC_ExteriorCornerTreatment_A5_1222; // 0x5c0(0x08)
	struct UStaticMeshComponent* SM_HW_MC_ExteriorCornerTreatment_A4_1220; // 0x5c8(0x08)
	struct UStaticMeshComponent* SM_MC_Hut_Window_B_1218; // 0x5d0(0x08)
	struct UStaticMeshComponent* SM_HW_MC_ExteriorCornerTreatment_B9_1216; // 0x5d8(0x08)
	struct UStaticMeshComponent* SM_HW_MC_ExteriorCornerTreatment_B8_1214; // 0x5e0(0x08)
	struct UStaticMeshComponent* SM_HW_MC_ExteriorCornerTreatment_C3_1212; // 0x5e8(0x08)
	struct UStaticMeshComponent* SM_HW_MC_ExteriorCornerTreatment_A3_1210; // 0x5f0(0x08)
	struct UStaticMeshComponent* SM_HW_MC_ExteriorCornerTreatment_B7_1208; // 0x5f8(0x08)
	struct UStaticMeshComponent* SM_HW_MC_ExteriorCornerTreatment_B6_1206; // 0x600(0x08)
	struct UStaticMeshComponent* SM_HW_MC_ExteriorCornerTreatment_C2_1204; // 0x608(0x08)
	struct UStaticMeshComponent* SM_HW_MC_ExteriorCornerTreatment_B5_1202; // 0x610(0x08)
	struct UStaticMeshComponent* SM_HW_MC_ExteriorCornerTreatment_B4_1200; // 0x618(0x08)
	struct UStaticMeshComponent* SM_HW_MC_ExteriorCornerTreatment_B3_1198; // 0x620(0x08)
	struct UStaticMeshComponent* SM_HW_MC_ExteriorCornerTreatment_C_1196; // 0x628(0x08)
	struct UStaticMeshComponent* SM_HW_MC_ExteriorCornerTreatment_A2_1194; // 0x630(0x08)
	struct UStaticMeshComponent* SM_HW_MC_ExteriorCornerTreatment_A_1192; // 0x638(0x08)
	struct UStaticMeshComponent* SM_HW_MC_ExteriorCornerTreatment_B2_1190; // 0x640(0x08)
	struct UStaticMeshComponent* SM_HW_MC_ExteriorCornerTreatment_B_1188; // 0x648(0x08)
	struct USceneComponent* SharedRoot; // 0x650(0x08)
};

