// BlueprintGeneratedClass BP_OverlandVars.BP_OverlandVars_C
// Size: 0x257 (Inherited: 0x248)
struct ABP_OverlandVars_C : AActor {
	struct USceneComponent* DefaultSceneRoot; // 0x248(0x08)
	bool All Additional Levels OFF; // 0x250(0x01)
	bool Hogwarts OFF; // 0x251(0x01)
	bool Hogsmeade OFF; // 0x252(0x01)
	bool Percival Tower OFF; // 0x253(0x01)
	bool All Large Bandit Camps OFF; // 0x254(0x01)
	bool All Interior Tents OFF; // 0x255(0x01)
	bool Quidditch Cine OFF; // 0x256(0x01)
};

