// BlueprintGeneratedClass BP_Ovl_BeastDen_GPurpleToad_Dressed_A.BP_Ovl_BeastDen_GPurpleToad_Dressed_A_C
// Size: 0x290 (Inherited: 0x248)
struct ABP_Ovl_BeastDen_GPurpleToad_Dressed_A_C : AActor {
	struct UStaticMeshComponent* SM_OL_BeastDen_PurpleToad; // 0x248(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_CaveRoots_Set1_F; // 0x250(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_11SM_DiricawlNest_C; // 0x258(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_BogGrass_A; // 0x260(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_9SM_BeardMoss_C; // 0x268(0x08)
	struct UStaticMeshComponent* SM_GPT_Pen_Nest_B; // 0x270(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_DiricawlNest_A; // 0x278(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_OL_BogIsland_A6; // 0x280(0x08)
	struct USceneComponent* SharedRoot; // 0x288(0x08)
};

