// BlueprintGeneratedClass BP_OVL_Hut_Interior_A.BP_OVL_Hut_Interior_A_C
// Size: 0x4d8 (Inherited: 0x248)
struct ABP_OVL_Hut_Interior_A_C : AActor {
	struct UStaticMeshComponent* SM_Int_BCProps_OpenCrate_Small_001_W; // 0x248(0x08)
	struct UDecalComponent* MI_CastleDun_BurntScatter_A; // 0x250(0x08)
	struct UStaticMeshComponent* SM_BCProps_Wood_Chopped_Small_002; // 0x258(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Table_Long_001_D_LOD; // 0x260(0x08)
	struct UStaticMeshComponent* SM_HW_Poster_A; // 0x268(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CampA_Cage_Rough_Small_A_Door; // 0x270(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_BroomstickRack_A; // 0x278(0x08)
	struct UStaticMeshComponent* SM_BCProps_FoodBag_Top_001; // 0x280(0x08)
	struct UStaticMeshComponent* SM_CastleDun_GOB_Cup; // 0x288(0x08)
	struct UStaticMeshComponent* SM_Int_CastleDun_Jail_HangingCageA; // 0x290(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeSpan_C; // 0x298(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeSpan_G; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_CastleDun_HayPile_A; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_HW_Birdcage_Round; // 0x2b0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HW_Birdcage_HangingDomed; // 0x2b8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_7SM_BCProps_RopeEnd_A; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_HW_Birdcage_Round_B; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Medium_002_W; // 0x2d0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_BCProps_RopeStake_C; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_CampA_Cage_Rough_Medium_A; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_CampA_Cage_Rough_Medium_A_Door; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeHanging_A; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Saw_Large_001; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Rake_001_W; // 0x300(0x08)
	struct UStaticMeshComponent* SM_CampB_2m_PlankD; // 0x308(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CampB_WoodenPole; // 0x310(0x08)
	struct UStaticMeshComponent* SM_HW_Trash_PaperScraps_A; // 0x318(0x08)
	struct UStaticMeshComponent* SM_HW_Birdcage_SmallOnion_B; // 0x320(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_Haystack_1Bale_001_W; // 0x328(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleDun_HayPile_E; // 0x330(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Medium_001_W; // 0x338(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_FoodBag_1bag_003_W; // 0x340(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_Saw_Medium_001; // 0x348(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_OpenCrate_Small_002_W; // 0x350(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Barrel_Fat_001_W; // 0x358(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Barrel_001_W; // 0x360(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Bucket_Small_002_W; // 0x368(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Bucket_Water_001_W; // 0x370(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_Cav_Dungeon_MiningLamp_Bracket_01; // 0x378(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_WoodPile_Large_001; // 0x380(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_WE_ScrunchedPaper; // 0x388(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_Cav_MiningLamp_01; // 0x390(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Haystack_3Bale_001_W; // 0x398(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleDun_HayPile_D; // 0x3a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleDun_HayFloor_A; // 0x3a8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_HangingProps_Bags_004_W; // 0x3b0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_BCProps_Rope_001; // 0x3b8(0x08)
	struct UStaticMeshComponent* SM_BCProps_FoodBag_Corner_001; // 0x3c0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_BCProps_RopeEnd_B; // 0x3c8(0x08)
	struct UStaticMeshComponent* SM_HW_Poster_B; // 0x3d0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Bonfire_001_Base; // 0x3d8(0x08)
	struct UStaticMeshComponent* SM_CampB_WallRopeAnchor_B; // 0x3e0(0x08)
	struct UStaticMeshComponent* SM_BCProps_Grinder_002; // 0x3e8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HW_Birdcage_SmallOnion; // 0x3f0(0x08)
	struct UStaticMeshComponent* SM_BCProps_Wood_Chopped_Medium_001; // 0x3f8(0x08)
	struct UStaticMeshComponent* SM_WE_Newspaper_02; // 0x400(0x08)
	struct UStaticMeshComponent* SM_BCProps_Rope_002; // 0x408(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_BCProps_Stool_001_D_BREAKABLE; // 0x410(0x08)
	struct UStaticMeshComponent* SM_CampB_2m_PostA; // 0x418(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CampA_Cage_Rough_Small_A; // 0x420(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_BCProps_RopeSpan_K; // 0x428(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_Int_BCProps_Tongs_002; // 0x430(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_Bucket_Small_001_W; // 0x438(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_Int_BCProps_Axe_001_W; // 0x440(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_Axe_002_W; // 0x448(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_8SM_Int_BCProps_Tongs_003; // 0x450(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_Int_BCProps_Hammer_001_W; // 0x458(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_Int_BCProps_Tongs_001; // 0x460(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Lantern_002; // 0x468(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_BCProps_Eyelet_A; // 0x470(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_16SM_BCProps_RopeKnot_A; // 0x478(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_CastleDun_Kitchen_cage; // 0x480(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_BCProps_RopeSpan_J; // 0x488(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_Pitchfork_001_W; // 0x490(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_Shovel_001_W; // 0x498(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleDun_MetalBand_A; // 0x4a0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_HangingProps_Bags_002_W; // 0x4a8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Rope_002_W; // 0x4b0(0x08)
	struct USceneComponent* Scene1; // 0x4b8(0x08)
	struct USceneComponent* BP_Poachers_HangingCages_C_SharedRoot; // 0x4c0(0x08)
	struct USceneComponent* Scene; // 0x4c8(0x08)
	struct USceneComponent* SharedRoot; // 0x4d0(0x08)
};

