// BlueprintGeneratedClass BP_Ovl_BeastDen_GPurpleToad_Dressed_B.BP_Ovl_BeastDen_GPurpleToad_Dressed_B_C
// Size: 0x298 (Inherited: 0x248)
struct ABP_Ovl_BeastDen_GPurpleToad_Dressed_B_C : AActor {
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_DiricawlNest_B1; // 0x248(0x08)
	struct UStaticMeshComponent* Sphere1; // 0x250(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_DiricawlNest_C1; // 0x258(0x08)
	struct UStaticMeshComponent* SM_BearBerry_A1; // 0x260(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_OL_BogIsland_A6; // 0x268(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_19SM_CaveRoots_Set1_B; // 0x270(0x08)
	struct UStaticMeshComponent* Cylinder1; // 0x278(0x08)
	struct UStaticMeshComponent* SM_GPT_Pen_Nest_B1; // 0x280(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_18SM_GrassMain; // 0x288(0x08)
	struct USceneComponent* SharedRoot; // 0x290(0x08)
};

