// BlueprintGeneratedClass BP_OL_VirtualTexturePaths_01.BP_OL_VirtualTexturePaths_01_C
// Size: 0x3d8 (Inherited: 0x248)
struct ABP_OL_VirtualTexturePaths_01_C : AActor {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x248(0x08)
	struct USplineComponent* Spline; // 0x250(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x258(0x08)
	float Mesh_Length; // 0x260(0x04)
	int32_t Mesh_Pieces; // 0x264(0x04)
	float Mesh_Length_3; // 0x268(0x04)
	float Mesh_Width; // 0x26c(0x04)
	struct UMaterialInterface* Path_Material; // 0x270(0x08)
	struct UStaticMesh* Path_Mesh; // 0x278(0x08)
	struct TArray<struct USplineMeshComponent*> Virtual_Textures; // 0x280(0x10)
	struct TArray<struct URuntimeVirtualTexture*> NewVar_1; // 0x290(0x10)
	struct TArray<struct URuntimeVirtualTexture*> VirtualTexture; // 0x2a0(0x10)
	bool Virtual_Texturing; // 0x2b0(0x01)
	char pad_2B1[0x3]; // 0x2b1(0x03)
	float Texture_Length; // 0x2b4(0x04)
	bool NewVar_2; // 0x2b8(0x01)
	char pad_2B9[0x7]; // 0x2b9(0x07)
	struct UTexture* Base_Colour; // 0x2c0(0x08)
	struct UTexture* HRO; // 0x2c8(0x08)
	struct UTexture* Normal; // 0x2d0(0x08)
	struct FLinearColor Tint; // 0x2d8(0x10)
	float UV_Scale_Near; // 0x2e8(0x04)
	float Path_Focus; // 0x2ec(0x04)
	float Blend_Contrast; // 0x2f0(0x04)
	struct FLinearColor Path_Tint_Middle; // 0x2f4(0x10)
	char pad_304[0x4]; // 0x304(0x04)
	struct UTexture* Path_Shape_Normal; // 0x308(0x08)
	struct UTexture* Base_Colour_3; // 0x310(0x08)
	struct UTexture* HRO_3; // 0x318(0x08)
	struct UTexture* Normal_3; // 0x320(0x08)
	float UV_Scale_Near2; // 0x328(0x04)
	struct FLinearColor Path_Tint_3; // 0x32c(0x10)
	float Tracks_Normal_Strength; // 0x33c(0x04)
	float Path_Normal_Edge_Strength; // 0x340(0x04)
	float Blend2_Offset; // 0x344(0x04)
	float Height2_Strength; // 0x348(0x04)
	float Blend2_Contrast; // 0x34c(0x04)
	float Normal2_Strength; // 0x350(0x04)
	float Normal1_Strength; // 0x354(0x04)
	float Normal_Edge_Start; // 0x358(0x04)
	float Normal_Edge_Contrast; // 0x35c(0x04)
	float Roughness1_Adjust; // 0x360(0x04)
	float Roughness2_Adjust; // 0x364(0x04)
	float Track_Depth_For_Puddles; // 0x368(0x04)
	char pad_36C[0x4]; // 0x36c(0x04)
	struct UTexture* Path_Shape_Mask; // 0x370(0x08)
	float Path_Offset_Middle; // 0x378(0x04)
	float Path_Sharpnes_Middle; // 0x37c(0x04)
	bool Create_Dynamic_Material; // 0x380(0x01)
	char pad_381[0x7]; // 0x381(0x07)
	struct TArray<enum class EObjectTypeQuery> Object Types; // 0x388(0x10)
	struct TArray<struct AActor*> Ignore; // 0x398(0x10)
	struct FVector Last_Block_Impact; // 0x3a8(0x0c)
	int32_t Snapping_Point Index; // 0x3b4(0x04)
	bool Landscape Hit; // 0x3b8(0x01)
	char pad_3B9[0x3]; // 0x3b9(0x03)
	int32_t Snapping_Test_Itteration; // 0x3bc(0x04)
	bool Continue_Snapping_Itteration_Loop; // 0x3c0(0x01)
	bool Spline_Or_Point; // 0x3c1(0x01)
	char pad_3C2[0x6]; // 0x3c2(0x06)
	struct TArray<struct ABP_OL_VirtualTexturePaths_01_C*> Level_Actors; // 0x3c8(0x10)

	void Clear_Array(); // Function BP_OL_VirtualTexturePaths_01.BP_OL_VirtualTexturePaths_01_C.Clear_Array // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void Snap_To_Landscape(); // Function BP_OL_VirtualTexturePaths_01.BP_OL_VirtualTexturePaths_01_C.Snap_To_Landscape // (Public|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x38a7480
	void Trace_To_Landscape(); // Function BP_OL_VirtualTexturePaths_01.BP_OL_VirtualTexturePaths_01_C.Trace_To_Landscape // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void UserConstructionScript(); // Function BP_OL_VirtualTexturePaths_01.BP_OL_VirtualTexturePaths_01_C.UserConstructionScript // (Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void ReceiveBeginPlay(); // Function BP_OL_VirtualTexturePaths_01.BP_OL_VirtualTexturePaths_01_C.ReceiveBeginPlay // (Event|Protected|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_BP_OL_VirtualTexturePaths_01(int32_t EntryPoint); // Function BP_OL_VirtualTexturePaths_01.BP_OL_VirtualTexturePaths_01_C.ExecuteUbergraph_BP_OL_VirtualTexturePaths_01 // (Final|UbergraphFunction) // @ game+0x38a7480
};

