// BlueprintGeneratedClass BP_Ovl_BeastDen_NifflerBush_Dressed.BP_Ovl_BeastDen_NifflerBush_Dressed_C
// Size: 0x308 (Inherited: 0x248)
struct ABP_Ovl_BeastDen_NifflerBush_Dressed_C : AActor {
	struct FNone* OdcNavMeshVolume; // 0x248(0x08)
	struct UPointLightComponent* PointLight1; // 0x250(0x08)
	struct UPointLightComponent* PointLight; // 0x258(0x08)
	struct UStaticMeshComponent* SM_Ovl_BeastDen_NifflerBush_Leaves; // 0x260(0x08)
	struct UDecalComponent* MI_Coin_decal_5; // 0x268(0x08)
	struct UDecalComponent* MI_Coin_decal_4; // 0x270(0x08)
	struct UDecalComponent* MI_Coin_decal_3; // 0x278(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HW_Banana; // 0x280(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HW_PC_HangingObjectsB; // 0x288(0x08)
	struct UStaticMeshComponent* SM_HM_HangCloth_01; // 0x290(0x08)
	struct UStaticMeshComponent* SM_HeroTreeBearBranch__S_Master; // 0x298(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_HW_Telescope_F_Barrel; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_Ovl_BeastDen_NifflerBush_p2; // 0x2a8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_BrackenFern_A_Fall; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_HW_Birdcage_HangingDomed; // 0x2b8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_Sphere_Complex; // 0x2c0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_HW_ArmilarySphere_D_MountB; // 0x2c8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_11SM_ScreePile_A; // 0x2d0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_15SM_HW_Dishes_Goblet_A; // 0x2d8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_7SM_HW_ArmilarySphere_D_Ball; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_Ovl_BeastDen_NifflerBush_p1; // 0x2e8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_12SM_HW_Dishes_Plate_Gold; // 0x2f0(0x08)
	struct USkeletalMeshComponent* WE_LooseSnitch_Idle_Comp_anm2_SkeletalMeshComponent0; // 0x2f8(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x300(0x08)
};

