// BlueprintGeneratedClass BP_PC_PotionBottles_SingleRow_B.BP_PC_PotionBottles_SingleRow_B_C
// Size: 0x2e8 (Inherited: 0x248)
struct ABP_PC_PotionBottles_SingleRow_B_C : AActor {
	struct UStaticMeshComponent* SM_HW_PC_PotionsIngredient_Batwings; // 0x248(0x08)
	struct UStaticMeshComponent* SM_HW_PC_PotionsIngredient_DriedHerbs3; // 0x250(0x08)
	struct UStaticMeshComponent* SM_HW_PC_PotionsIngredient_Plants1; // 0x258(0x08)
	struct UStaticMeshComponent* SM_HW_PC_PotionIngredient_AA2; // 0x260(0x08)
	struct UStaticMeshComponent* SM_HW_PC_PotionIngredient_AB4; // 0x268(0x08)
	struct UStaticMeshComponent* SM_HW_DAO_ShrunkenHeadB; // 0x270(0x08)
	struct UStaticMeshComponent* SM_HW_DAO_ShrunkenHeadA3; // 0x278(0x08)
	struct UStaticMeshComponent* SM_HW_DAO_ShrunkenHeadA2; // 0x280(0x08)
	struct UStaticMeshComponent* SM_HW_PC_PotionIngredient_AB3; // 0x288(0x08)
	struct UStaticMeshComponent* SM_HW_PC_PotionIngredient_AB2; // 0x290(0x08)
	struct UStaticMeshComponent* SM_HW_PC_PotionIngredient_A1; // 0x298(0x08)
	struct UStaticMeshComponent* SM_HW_DAO_ShrunkenHeadA; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_DryPlant_09_Master; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_HW_PC_PotionIngredient_AA1; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_HangingProps_Plants_001_W; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_HW_PC_PotionIngredient_AB1; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_HW_PC_PotionIngredient_AA; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_HW_PC_PotionIngredient_AB; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_HW_PC_PotionIngredient_A; // 0x2d8(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x2e0(0x08)
};

