// BlueprintGeneratedClass BP_Poacher_KitchenCentral_A.BP_Poacher_KitchenCentral_A_C
// Size: 0x388 (Inherited: 0x248)
struct ABP_Poacher_KitchenCentral_A_C : AActor {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x248(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Hay_A; // 0x250(0x08)
	struct UDecalComponent* MI_BCProps_Decal_Ash_A3; // 0x258(0x08)
	struct UDecalComponent* MI_BCProps_Decal_Ash_A2; // 0x260(0x08)
	struct UDecalComponent* MI_BCProps_Decal_Ash_A; // 0x268(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_Tongs_002; // 0x270(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_10SM_BCProps_Apple_A; // 0x278(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_BCProps_Wood_Chopped_Small_003; // 0x280(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_CastleDun_HayPile_A; // 0x288(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_Log_Stump_001_D; // 0x290(0x08)
	struct UStaticMeshComponent* SM_Poacher_KitchenCentralA_Merged_01; // 0x298(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_Int_BCProps_HangingProps_Plants_001_W; // 0x2a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_Int_BCProps_HangingProps_Plants_004_W; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeLashing_B; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeSpan_L; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_Poacher_KitchenCentralA_Merged_02; // 0x2c0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_BCProps_Wood_Chopped_Single_A; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Spoon_003; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Plate_002; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_Poacher_KitchenCentralA_Merged_03; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeHanging_A; // 0x2e8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_Int_BCProps_Spoon_002; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Basket_Small_004_W1; // 0x2f8(0x08)
	struct UAnimatedLightComponent* AnimatedLight; // 0x300(0x08)
	struct UPointLightComponent* PointLight; // 0x308(0x08)
	struct UNiagaraComponent* VFX_NS_FirePLace_Small; // 0x310(0x08)
	struct UChildActorComponent* BP_Cav_DestructibleJug_01; // 0x318(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse15; // 0x320(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse14; // 0x328(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse13; // 0x330(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse12; // 0x338(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse11; // 0x340(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse10; // 0x348(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse9; // 0x350(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse7; // 0x358(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse6; // 0x360(0x08)
	struct UAkComponent* Ak_BP_Poacher_Kitchen_Cauldron; // 0x368(0x08)
	struct UParticleSystemComponent* ParticleSystemComponent2; // 0x370(0x08)
	struct UParticleSystemComponent* ParticleSystemComponent1; // 0x378(0x08)
	struct USceneComponent* SharedRoot; // 0x380(0x08)

	void ReceiveBeginPlay(); // Function BP_Poacher_KitchenCentral_A.BP_Poacher_KitchenCentral_A_C.ReceiveBeginPlay // (Event|Protected|BlueprintEvent) // @ game+0x38a7480
	void ReceiveEndPlay(enum class EEndPlayReason EndPlayReason); // Function BP_Poacher_KitchenCentral_A.BP_Poacher_KitchenCentral_A_C.ReceiveEndPlay // (Event|Protected|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_BP_Poacher_KitchenCentral_A(int32_t EntryPoint); // Function BP_Poacher_KitchenCentral_A.BP_Poacher_KitchenCentral_A_C.ExecuteUbergraph_BP_Poacher_KitchenCentral_A // (Final|UbergraphFunction|HasDefaults) // @ game+0x38a7480
};

