// BlueprintGeneratedClass BP_PC_PotionBottles_SingleRow_D.BP_PC_PotionBottles_SingleRow_D_C
// Size: 0x2c0 (Inherited: 0x248)
struct ABP_PC_PotionBottles_SingleRow_D_C : AActor {
	struct UStaticMeshComponent* SM_PlantStage41; // 0x248(0x08)
	struct UStaticMeshComponent* SM_Asphodel_Stage3; // 0x250(0x08)
	struct UStaticMeshComponent* SM_ChompingCabbage_01; // 0x258(0x08)
	struct UStaticMeshComponent* SM_Belladonna_SM_Belladonna_Stage3; // 0x260(0x08)
	struct UStaticMeshComponent* Scull01; // 0x268(0x08)
	struct UStaticMeshComponent* SM_HW_PC_PotionIngredient_BA3; // 0x270(0x08)
	struct UStaticMeshComponent* SM_HW_PC_PotionIngredient_B1; // 0x278(0x08)
	struct UStaticMeshComponent* SM_HW_PC_PotionIngredient_BA2; // 0x280(0x08)
	struct UStaticMeshComponent* SM_HW_PC_PotionIngredient_BB1; // 0x288(0x08)
	struct UStaticMeshComponent* SM_HW_PC_PotionIngredient_BC1; // 0x290(0x08)
	struct UStaticMeshComponent* SM_PungousOnion_Stage5; // 0x298(0x08)
	struct UStaticMeshComponent* SM_PungousOnion_Stage4; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_HW_PC_PotionIngredient_BA; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_HW_PC_PotionIngredient_BB; // 0x2b0(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x2b8(0x08)
};

