// BlueprintGeneratedClass BP_PC_PotionBottles_SingleRow_E.BP_PC_PotionBottles_SingleRow_E_C
// Size: 0x2b8 (Inherited: 0x248)
struct ABP_PC_PotionBottles_SingleRow_E_C : AActor {
	struct UStaticMeshComponent* SM_HW_PC_PotionsIngredient_Liquid_Yellow18; // 0x248(0x08)
	struct UStaticMeshComponent* SM_HW_PC_PotionsIngredient_Plants3; // 0x250(0x08)
	struct UStaticMeshComponent* SM_HW_PC_PotionsIngredient_DriedHerbs31; // 0x258(0x08)
	struct UStaticMeshComponent* SM_HW_PC_PotionsIngredient_Leaves; // 0x260(0x08)
	struct UStaticMeshComponent* SM_HW_PC_PotionsIngredient_Liquid_Yellow17; // 0x268(0x08)
	struct UStaticMeshComponent* SM_HW_PC_PotionsIngredient_Liquid_Yellow16; // 0x270(0x08)
	struct UStaticMeshComponent* SM_HW_PC_PotionsIngredient_SnakeSkeletiao; // 0x278(0x08)
	struct UStaticMeshComponent* SM_HW_PC_PotionIngredient_BA6; // 0x280(0x08)
	struct UStaticMeshComponent* SM_HW_PC_PotionIngredient_B3; // 0x288(0x08)
	struct UStaticMeshComponent* SM_HW_PC_PotionIngredient_A3; // 0x290(0x08)
	struct UStaticMeshComponent* SM_HW_PC_PotionIngredient_BB2; // 0x298(0x08)
	struct UStaticMeshComponent* SM_HW_PC_PotionIngredient_BA5; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_HW_PC_PotionIngredient_B2; // 0x2a8(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x2b0(0x08)
};

