// BlueprintGeneratedClass BP_Poachers_ForgeCentral_A.BP_Poachers_ForgeCentral_A_C
// Size: 0x3b8 (Inherited: 0x248)
struct ABP_Poachers_ForgeCentral_A_C : AActor {
	struct UPointLightComponent* PointLight; // 0x248(0x08)
	struct UChildActorComponent* BP_Cav_DestructibleJug_01; // 0x250(0x08)
	struct UChildActorComponent* BP_Int_BCProps_WoodPile_Large_001; // 0x258(0x08)
	struct UDecalComponent* MI_BCProps_Decal_Ash_A2; // 0x260(0x08)
	struct UDecalComponent* MI_BCProps_Decal_Ash_A; // 0x268(0x08)
	struct UStaticMeshComponent* SM_CampA_Int_KitchenFirePit_01A; // 0x270(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Stand_2Leg_001_W; // 0x278(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Anvil_001_D; // 0x280(0x08)
	struct UStaticMeshComponent* SM_CastleDun_HayPile_C; // 0x288(0x08)
	struct UStaticMeshComponent* SM_BCProps_Firepit_Rock_003; // 0x290(0x08)
	struct UStaticMeshComponent* SM_Int_CastleDun_Kitchen_Pot_A; // 0x298(0x08)
	struct UStaticMeshComponent* SM_GobMine_CoalPile_A; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_BCProps_Wood_Chopped_Small_002; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_CastleDun_HayPile_A; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_HM_Cauldron_Cauldrons_O; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Shovel_001_W; // 0x2c0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleDun_Ember_B; // 0x2c8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_BCProps_Wood_Chopped_Single_A; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_DUN_Goblin_FirePit; // 0x2d8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_Firepit_001; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_HM_Cauldron_Stand_B; // 0x2e8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleDun_Kitchen_Pot_B; // 0x2f0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_Bucket_Water_001_W; // 0x2f8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_BCProps_Wood_Chopped_Small_001; // 0x300(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Anvil_002; // 0x308(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_Int_BCProps_Hammer_001_W; // 0x310(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleDun_TableShort; // 0x318(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_Int_BCProps_Log_Stump_002_D; // 0x320(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5VFX_SM_Coals_Heavy_01; // 0x328(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3VFX_SM_Coals_Light_01; // 0x330(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Tongs_002; // 0x338(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_Int_BCProps_Tongs_001; // 0x340(0x08)
	struct UStaticMeshComponent* SM_HM_Cauldron_Cauldrons_N; // 0x348(0x08)
	struct UStaticMeshComponent* SM_HM_Cauldron_Cauldron_L; // 0x350(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_Int_BCProps_Tongs_003; // 0x358(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse17; // 0x360(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse16; // 0x368(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse15; // 0x370(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse11; // 0x378(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse14; // 0x380(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse13; // 0x388(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse12; // 0x390(0x08)
	struct UParticleSystemComponent* ParticleSystemComponent2; // 0x398(0x08)
	struct UParticleSystemComponent* ParticleSystemComponent1; // 0x3a0(0x08)
	struct UParticleSystemComponent* ParticleSystemComponent0; // 0x3a8(0x08)
	struct USceneComponent* SharedRoot; // 0x3b0(0x08)
};

