// BlueprintGeneratedClass BP_Poacher_TableFood_A.BP_Poacher_TableFood_A_C
// Size: 0x3b8 (Inherited: 0x248)
struct ABP_Poacher_TableFood_A_C : AActor {
	struct UStaticMeshComponent* StaticMeshComponent24; // 0x248(0x08)
	struct UStaticMeshComponent* StaticMeshComponent43; // 0x250(0x08)
	struct UStaticMeshComponent* StaticMeshComponent46; // 0x258(0x08)
	struct UStaticMeshComponent* StaticMeshComponent44; // 0x260(0x08)
	struct UStaticMeshComponent* StaticMeshComponent20; // 0x268(0x08)
	struct UStaticMeshComponent* StaticMeshComponent11; // 0x270(0x08)
	struct UStaticMeshComponent* StaticMeshComponent34; // 0x278(0x08)
	struct UStaticMeshComponent* StaticMeshComponent27; // 0x280(0x08)
	struct UStaticMeshComponent* StaticMeshComponent9; // 0x288(0x08)
	struct UStaticMeshComponent* StaticMeshComponent36; // 0x290(0x08)
	struct UStaticMeshComponent* StaticMeshComponent37; // 0x298(0x08)
	struct UStaticMeshComponent* StaticMeshComponent13; // 0x2a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent4; // 0x2a8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse7; // 0x2b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent14; // 0x2b8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse6; // 0x2c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent12; // 0x2c8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse5; // 0x2d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent29; // 0x2d8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse4; // 0x2e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent15; // 0x2e8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse3; // 0x2f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent32; // 0x2f8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse2; // 0x300(0x08)
	struct UChildActorComponent* BP_HW_Cup_interact_Jug_C1; // 0x308(0x08)
	struct UChildActorComponent* BP_HW_Cup_interact_Jug_C; // 0x310(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Hay_A7_3; // 0x318(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Table_Long_001_D; // 0x320(0x08)
	struct UStaticMeshComponent* SM_CastleDun_TableLongTop_B; // 0x328(0x08)
	struct UStaticMeshComponent* SM_BCProps_FloorCloth_G; // 0x330(0x08)
	struct UStaticMeshComponent* SM_CastleDun_HayPile_A; // 0x338(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_BCProps_Apple_B; // 0x340(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_Int_BCProps_Plate_002; // 0x348(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_Int_BCProps_Plate_001; // 0x350(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_Int_BCProps_Fork_001; // 0x358(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Bucket_Water_001_W; // 0x360(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Log_Bench_001_D; // 0x368(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_Cairn_Bone_Femur_A; // 0x370(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_Int_BCProps_Spoon_001; // 0x378(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Log_Stump_001_D; // 0x380(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Rope_001_W; // 0x388(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_Int_BCProps_Log_Stump_002_D; // 0x390(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_BCProps_Apple_A; // 0x398(0x08)
	struct UStaticMeshComponent* SM_BCProps_Apple_C; // 0x3a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_BCProps_Plum_A; // 0x3a8(0x08)
	struct USceneComponent* SharedRoot; // 0x3b0(0x08)
};

