// BlueprintGeneratedClass BP_Poacher_StoragePile_Large_A.BP_Poacher_StoragePile_Large_A_C
// Size: 0x378 (Inherited: 0x248)
struct ABP_Poacher_StoragePile_Large_A_C : AActor {
	struct UStaticMeshComponent* SM_Int_BCProps_Rope_002_W; // 0x248(0x08)
	struct UStaticMeshComponent* SM_BCProps_FoodBag_Corner_001; // 0x250(0x08)
	struct UStaticMeshComponent* SM_BCProps_FoodBag_Top_001; // 0x258(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleDun_HayPile_A; // 0x260(0x08)
	struct UStaticMeshComponent* SM_CastleDun_HayPile_B; // 0x268(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_CastleDun_HayPile_C; // 0x270(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Large_001_W; // 0x278(0x08)
	struct UStaticMeshComponent* SM_CampA_Cage_Standard_Medium_A; // 0x280(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_CloseCrate_Medium_003_W; // 0x288(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CampA_Cage_Standard_Small_A; // 0x290(0x08)
	struct UStaticMeshComponent* SM_CampA_Cage_Standard_Medium_A_Door; // 0x298(0x08)
	struct UStaticMeshComponent* SM_CampA_Cage_Rough_Small_A; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Jug_001_W; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_HW_Birdcage_Round; // 0x2b0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_CampA_Cage_Standard_Small_A_Door; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_HW_BS_Trap_C; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_HW_Birdcage_HangingDomed; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Basket_Small_001_W; // 0x2d0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_BCProps_Apple_C; // 0x2d8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_BCProps_Apple_B; // 0x2e0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_7SM_Int_BCProps_FoodBag_1bag_001_W; // 0x2e8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_BCProps_Apple_A; // 0x2f0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_BCProps_Plum_A; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_Prop_Barrel_Unbreakable_A; // 0x300(0x08)
	struct UStaticMeshComponent* SM_CampA_Cage_Rough_Small_A_Door; // 0x308(0x08)
	struct UChildActorComponent* BP_Cav_DestructibleJug_03; // 0x310(0x08)
	struct UChildActorComponent* BP_Int_BCProps_WoodPile_Large_001; // 0x318(0x08)
	struct UChildActorComponent* BP_Int_BCProps_Basket_Medium_001; // 0x320(0x08)
	struct UChildActorComponent* BP_Int_BCProps_CloseCrate_Small_002; // 0x328(0x08)
	struct UChildActorComponent* BP_Cav_DestructibleJug_02; // 0x330(0x08)
	struct UChildActorComponent* BP_Cav_DestructibleJug_01; // 0x338(0x08)
	struct UStaticMeshComponent* StaticMeshComponent11; // 0x340(0x08)
	struct UStaticMeshComponent* StaticMeshComponent18; // 0x348(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse18; // 0x350(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse16; // 0x358(0x08)
	struct UDecalComponent* NewDecalComponent1; // 0x360(0x08)
	struct UDecalComponent* NewDecalComponent; // 0x368(0x08)
	struct USceneComponent* SharedRoot; // 0x370(0x08)
};

