// BlueprintGeneratedClass BP_Poachers_HangingCages_C.BP_Poachers_HangingCages_C_C
// Size: 0x298 (Inherited: 0x248)
struct ABP_Poachers_HangingCages_C_C : AActor {
	struct UStaticMeshComponent* SM_HW_Birdcage_HangingDomed; // 0x248(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CampA_Cage_Rough_Small_A; // 0x250(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CampA_Cage_Rough_Small_A_Door; // 0x258(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_BCProps_RopeEnd_B; // 0x260(0x08)
	struct UStaticMeshComponent* SM_HW_Birdcage_SmallOnion; // 0x268(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_BCProps_RopeKnot_A; // 0x270(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_BCProps_RopeEnd_A; // 0x278(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_BCProps_RopeStake_C; // 0x280(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse5; // 0x288(0x08)
	struct USceneComponent* SharedRoot; // 0x290(0x08)
};

