// BlueprintGeneratedClass BP_Poachers_HangingCages_B.BP_Poachers_HangingCages_B_C
// Size: 0x318 (Inherited: 0x248)
struct ABP_Poachers_HangingCages_B_C : AActor {
	struct UStaticMeshComponent* SM_BCProps_RopeEnd_B; // 0x248(0x08)
	struct UStaticMeshComponent* StaticMeshComponent20; // 0x250(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeLashing_B1; // 0x258(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeLashing_B; // 0x260(0x08)
	struct UStaticMeshComponent* StaticMeshComponent19; // 0x268(0x08)
	struct UStaticMeshComponent* StaticMeshComponent18; // 0x270(0x08)
	struct UStaticMeshComponent* StaticMeshComponent17; // 0x278(0x08)
	struct UStaticMeshComponent* StaticMeshComponent16; // 0x280(0x08)
	struct UStaticMeshComponent* StaticMeshComponent15; // 0x288(0x08)
	struct UStaticMeshComponent* StaticMeshComponent14; // 0x290(0x08)
	struct UStaticMeshComponent* StaticMeshComponent13; // 0x298(0x08)
	struct UStaticMeshComponent* StaticMeshComponent12; // 0x2a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent11; // 0x2a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent10; // 0x2b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0; // 0x2b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent8; // 0x2c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent7; // 0x2c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent6; // 0x2d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent5; // 0x2d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent4; // 0x2e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent3; // 0x2e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent2; // 0x2f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent1; // 0x2f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent9; // 0x300(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse5; // 0x308(0x08)
	struct USceneComponent* SharedRoot; // 0x310(0x08)
};

