// BlueprintGeneratedClass BP_Poacher_Bunkbeds_A.BP_Poacher_Bunkbeds_A_C
// Size: 0x350 (Inherited: 0x248)
struct ABP_Poacher_Bunkbeds_A_C : AActor {
	struct UChildActorComponent* BP_Int_BCProps_Bottle_003; // 0x248(0x08)
	struct UChildActorComponent* BP_Cav_DestructiblePot_01; // 0x250(0x08)
	struct UChildActorComponent* BP_Cav_DestructibleJug_02; // 0x258(0x08)
	struct UStaticMeshComponent* StaticMeshComponent31; // 0x260(0x08)
	struct UStaticMeshComponent* StaticMeshComponent30; // 0x268(0x08)
	struct UStaticMeshComponent* StaticMeshComponent29; // 0x270(0x08)
	struct UStaticMeshComponent* StaticMeshComponent28; // 0x278(0x08)
	struct UStaticMeshComponent* StaticMeshComponent25; // 0x280(0x08)
	struct UStaticMeshComponent* StaticMeshComponent24; // 0x288(0x08)
	struct UStaticMeshComponent* StaticMeshComponent23; // 0x290(0x08)
	struct UStaticMeshComponent* StaticMeshComponent22; // 0x298(0x08)
	struct UStaticMeshComponent* StaticMeshComponent21; // 0x2a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent20; // 0x2a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent19; // 0x2b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent18; // 0x2b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent17; // 0x2c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent16; // 0x2c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent15; // 0x2d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent14; // 0x2d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent13; // 0x2e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent12; // 0x2e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent11; // 0x2f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent10; // 0x2f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent9; // 0x300(0x08)
	struct UStaticMeshComponent* StaticMeshComponent8; // 0x308(0x08)
	struct UStaticMeshComponent* StaticMeshComponent7; // 0x310(0x08)
	struct UStaticMeshComponent* StaticMeshComponent4; // 0x318(0x08)
	struct UStaticMeshComponent* StaticMeshComponent3; // 0x320(0x08)
	struct UStaticMeshComponent* StaticMeshComponent2; // 0x328(0x08)
	struct UStaticMeshComponent* StaticMeshComponent1; // 0x330(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0; // 0x338(0x08)
	struct UStaticMeshComponent* StaticMeshComponent32; // 0x340(0x08)
	struct USceneComponent* SharedRoot; // 0x348(0x08)
};

