// BlueprintGeneratedClass BP_PuffskeinDen_03.BP_PuffskeinDen_03_C
// Size: 0x3e0 (Inherited: 0x248)
struct ABP_PuffskeinDen_03_C : AActor {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x248(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse28; // 0x250(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse30; // 0x258(0x08)
	struct UStaticMeshComponent* SM_OL_Rock_SM_Light_C3; // 0x260(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse29; // 0x268(0x08)
	struct UStaticMeshComponent* SM_OL_Rock_SM_Light_A4; // 0x270(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse27; // 0x278(0x08)
	struct UStaticMeshComponent* SM_OL_Rock_SM_Light_G; // 0x280(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse23; // 0x288(0x08)
	struct UStaticMeshComponent* SM_OL_Rock_SM_Light_J1; // 0x290(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse26; // 0x298(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse25; // 0x2a0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse24; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_OL_Rock_SM_Light_C4; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_OL_Rock_SM_Light_I2; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_OL_Rock_SM_Light_J3; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_OL_Rock_SM_Light_A6; // 0x2c8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse22; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_OL_Rock_SM_Light_A2; // 0x2d8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse21; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_OL_Rock_SM_Light_J2; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_OL_Rock_SM_Light_C; // 0x2f0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse20; // 0x2f8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse19; // 0x300(0x08)
	struct UStaticMeshComponent* SM_OL_Rock_SM_Light_G1; // 0x308(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse18; // 0x310(0x08)
	struct UStaticMeshComponent* SM_OL_Rock_SM_Light_C1; // 0x318(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse17; // 0x320(0x08)
	struct UStaticMeshComponent* SM_OL_Rock_SM_Light_A3; // 0x328(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse13; // 0x330(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse16; // 0x338(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse15; // 0x340(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse14; // 0x348(0x08)
	struct UStaticMeshComponent* SM_OL_Rock_SM_Light_I; // 0x350(0x08)
	struct UStaticMeshComponent* SM_OL_Rock_SM_Light_A5; // 0x358(0x08)
	struct UStaticMeshComponent* SM_OL_Rock_SM_Light_J; // 0x360(0x08)
	struct UStaticMeshComponent* SM_OL_Rock_SM_Light_A1; // 0x368(0x08)
	struct UStaticMeshComponent* SM_OL_Rock_SM_Light_A; // 0x370(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse12; // 0x378(0x08)
	struct UStaticMeshComponent* SM_OL_Rock_SM_Light_I1; // 0x380(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse11; // 0x388(0x08)
	struct UStaticMeshComponent* SM_OL_Rock_SM_Light_C2; // 0x390(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse10; // 0x398(0x08)
	struct UStaticMeshComponent* SM_OL_Rock_SM_Light_E; // 0x3a0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse9; // 0x3a8(0x08)
	struct UStaticMeshComponent* SM_OL_Rock_SM_Light_B; // 0x3b0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse8; // 0x3b8(0x08)
	struct USceneComponent* Scene; // 0x3c0(0x08)
	struct UChildActorComponent* Marker; // 0x3c8(0x08)
	bool Marker OFF; // 0x3d0(0x01)
	char pad_3D1[0x7]; // 0x3d1(0x07)
	struct UAkAudioEvent* AkEvent; // 0x3d8(0x08)

	void GetDenMarkerOFF(bool& Out); // Function BP_PuffskeinDen_03.BP_PuffskeinDen_03_C.GetDenMarkerOFF // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	struct TArray<struct FTransfigurationResource> GetAdditionalItemsReturned(); // Function BP_PuffskeinDen_03.BP_PuffskeinDen_03_C.GetAdditionalItemsReturned // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	bool IsObjectContextValidForTransformation(); // Function BP_PuffskeinDen_03.BP_PuffskeinDen_03_C.IsObjectContextValidForTransformation // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	bool IsObjectContextValidForVanishment(); // Function BP_PuffskeinDen_03.BP_PuffskeinDen_03_C.IsObjectContextValidForVanishment // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void UserConstructionScript(); // Function BP_PuffskeinDen_03.BP_PuffskeinDen_03_C.UserConstructionScript // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void DeactivateObject(); // Function BP_PuffskeinDen_03.BP_PuffskeinDen_03_C.DeactivateObject // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void FinalizeInitialAnimationState(); // Function BP_PuffskeinDen_03.BP_PuffskeinDen_03_C.FinalizeInitialAnimationState // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ObjectConjured(); // Function BP_PuffskeinDen_03.BP_PuffskeinDen_03_C.ObjectConjured // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ObjectStreamedSpawnInConfirmed(); // Function BP_PuffskeinDen_03.BP_PuffskeinDen_03_C.ObjectStreamedSpawnInConfirmed // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ObjectTransformationCancelled(); // Function BP_PuffskeinDen_03.BP_PuffskeinDen_03_C.ObjectTransformationCancelled // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ObjectTransformationConfirmed(); // Function BP_PuffskeinDen_03.BP_PuffskeinDen_03_C.ObjectTransformationConfirmed // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ObjectTransformationStarted(); // Function BP_PuffskeinDen_03.BP_PuffskeinDen_03_C.ObjectTransformationStarted // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ObjectVanished(); // Function BP_PuffskeinDen_03.BP_PuffskeinDen_03_C.ObjectVanished // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ReactivateObject(); // Function BP_PuffskeinDen_03.BP_PuffskeinDen_03_C.ReactivateObject // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void ObjectPhysicalResponseImpact(float ImpactIntensity, struct FName SpellName, struct FName ResponseConfigName, struct FVector& ImpactLocation); // Function BP_PuffskeinDen_03.BP_PuffskeinDen_03_C.ObjectPhysicalResponseImpact // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_BP_PuffskeinDen_03(int32_t EntryPoint); // Function BP_PuffskeinDen_03.BP_PuffskeinDen_03_C.ExecuteUbergraph_BP_PuffskeinDen_03 // (Final|UbergraphFunction|HasDefaults) // @ game+0x38a7480
};

