// BlueprintGeneratedClass BP_PC_PotionBottles_SingleRow_F.BP_PC_PotionBottles_SingleRow_F_C
// Size: 0x290 (Inherited: 0x248)
struct ABP_PC_PotionBottles_SingleRow_F_C : AActor {
	struct UStaticMeshComponent* SM_HW_PC_PotionsIngredient_Leaves1; // 0x248(0x08)
	struct UStaticMeshComponent* SM_HW_PC_PotionsIngredient_Liquid_Yellow19; // 0x250(0x08)
	struct UStaticMeshComponent* SM_HW_PC_PotionsIngredient_DriedHerbs21; // 0x258(0x08)
	struct UStaticMeshComponent* SM_HW_PC_PotionIngredient_AA3; // 0x260(0x08)
	struct UStaticMeshComponent* SM_HW_PC_PotionIngredient_BC3; // 0x268(0x08)
	struct UStaticMeshComponent* SM_HW_PC_PotionIngredient_AC; // 0x270(0x08)
	struct UStaticMeshComponent* SM_HW_PC_PotionIngredient_BC2; // 0x278(0x08)
	struct UStaticMeshComponent* SM_HW_PC_PotionIngredient_B2; // 0x280(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x288(0x08)
};

