// BlueprintGeneratedClass BP_Small_CastleRuins_1_E1.BP_Small_CastleRuins_1_E1_C
// Size: 0x360 (Inherited: 0x248)
struct ABP_Small_CastleRuins_1_E1_C : AActor {
	struct UStaticMeshComponent* SM_CastleRuins_1_Debris_C; // 0x248(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Debris_A; // 0x250(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_C2; // 0x258(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_F_b2; // 0x260(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_F_b1; // 0x268(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Wall_Corner_Decoration_A; // 0x270(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_C1; // 0x278(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_C; // 0x280(0x08)
	struct UStaticMeshComponent* StaticMeshComponent12; // 0x288(0x08)
	struct UStaticMeshComponent* StaticMeshComponent11; // 0x290(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Brick_A1; // 0x298(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Brick_A; // 0x2a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent10; // 0x2a8(0x08)
	struct UDecalComponent* Decal1; // 0x2b0(0x08)
	struct UDecalComponent* Decal; // 0x2b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0; // 0x2c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent1; // 0x2c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent2; // 0x2d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent3; // 0x2d8(0x08)
	struct UDecalComponent* NewDecalComponent; // 0x2e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent4; // 0x2e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent5; // 0x2f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent6; // 0x2f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent7; // 0x300(0x08)
	struct UDecalComponent* NewDecalComponent8; // 0x308(0x08)
	struct UDecalComponent* NewDecalComponent1; // 0x310(0x08)
	struct UDecalComponent* NewDecalComponent2; // 0x318(0x08)
	struct UStaticMeshComponent* StaticMeshComponent8; // 0x320(0x08)
	struct UStaticMeshComponent* StaticMeshComponent9; // 0x328(0x08)
	struct UDecalComponent* NewDecalComponent3; // 0x330(0x08)
	struct UDecalComponent* NewDecalComponent4; // 0x338(0x08)
	struct UDecalComponent* NewDecalComponent5; // 0x340(0x08)
	struct UDecalComponent* NewDecalComponent6; // 0x348(0x08)
	struct UDecalComponent* NewDecalComponent7; // 0x350(0x08)
	struct USceneComponent* SharedRoot; // 0x358(0x08)
};

