// BlueprintGeneratedClass BP_ST_GoblinCratesStack_A.BP_ST_GoblinCratesStack_A_C
// Size: 0x330 (Inherited: 0x2d0)
struct ABP_ST_GoblinCratesStack_A_C : ANone {
	struct UChildActorComponent* BP_Int_Goblin_Crates_Red_Medium_W; // 0x2d0(0x08)
	struct UChildActorComponent* BP_Int_GoblinCrates_Red_LG_W; // 0x2d8(0x08)
	struct UChildActorComponent* BP_Int_Goblin_Crates_Medium_W; // 0x2e0(0x08)
	struct UChildActorComponent* BP_Int_Goblin_Crates_Old_Medium_W; // 0x2e8(0x08)
	struct UChildActorComponent* BP_Int_GoblinCrates_Blue_Long_W; // 0x2f0(0x08)
	struct UChildActorComponent* BP_Int_Goblin_Crates_Blue_Medium_W1; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_GoblinCrates_Long_Blue_Metal; // 0x300(0x08)
	struct UStaticMeshComponent* SM_GoblinCrates_small_Red_Metal1; // 0x308(0x08)
	struct UStaticMeshComponent* SM_GoblinCrates_small_Red_Metal; // 0x310(0x08)
	struct UStaticMeshComponent* SM_GoblinCrates_small_Old_Metal; // 0x318(0x08)
	struct UStaticMeshComponent* W; // 0x320(0x08)
	struct UStaticMeshComponent* SM_GoblinCrates_Small_Blue_Metal; // 0x328(0x08)
};

