// BlueprintGeneratedClass BP_Sanc_TrashPileLarge_01B_Static.BP_Sanc_TrashPileLarge_01B_Static_C
// Size: 0x9b0 (Inherited: 0x248)
struct ABP_Sanc_TrashPileLarge_01B_Static_C : AActor {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x248(0x08)
	struct UStaticMeshComponent* StaticMeshComponent109; // 0x250(0x08)
	struct UStaticMeshComponent* StaticMeshComponent189; // 0x258(0x08)
	struct UStaticMeshComponent* StaticMeshComponent188; // 0x260(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse86; // 0x268(0x08)
	struct UPhysicalResponseComponent* MainPhysicalResponseBookCase3; // 0x270(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse1; // 0x278(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse60; // 0x280(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse67; // 0x288(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse87; // 0x290(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse66; // 0x298(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse68; // 0x2a0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse65; // 0x2a8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse64; // 0x2b0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse63; // 0x2b8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse78; // 0x2c0(0x08)
	struct UStaticMeshComponent* Cabinet1; // 0x2c8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse49; // 0x2d0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse26; // 0x2d8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse22; // 0x2e0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponsechairsStack17; // 0x2e8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponsechairsStack13; // 0x2f0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponsechairsStack10; // 0x2f8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponsechairsStack6; // 0x300(0x08)
	struct UPhysicalResponseComponent* PhysicalResponsechairsStack4; // 0x308(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse24; // 0x310(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse46; // 0x318(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse94; // 0x320(0x08)
	struct UPhysicalResponseComponent* PhysicalResponsechairsStack3; // 0x328(0x08)
	struct UPhysicalResponseComponent* PhysicalResponsechairsStack1; // 0x330(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse84; // 0x338(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse83; // 0x340(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse36; // 0x348(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse35; // 0x350(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse20; // 0x358(0x08)
	struct UPhysicalResponseComponent* MainPhysicalResponseBookCase1; // 0x360(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse19; // 0x368(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse33; // 0x370(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse32; // 0x378(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse16; // 0x380(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse56; // 0x388(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse57; // 0x390(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse30; // 0x398(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse54; // 0x3a0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse58; // 0x3a8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse29; // 0x3b0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse55; // 0x3b8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse88; // 0x3c0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse59; // 0x3c8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse31; // 0x3d0(0x08)
	struct UPhysicalResponseComponent* MainPhysicalResponseBookCase2; // 0x3d8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse2; // 0x3e0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse75; // 0x3e8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse76; // 0x3f0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse77; // 0x3f8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse85; // 0x400(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse82; // 0x408(0x08)
	struct UPhysicalResponseComponent* PhysicalResponsechairsStack2; // 0x410(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse114; // 0x418(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse37; // 0x420(0x08)
	struct UPhysicalResponseComponent* MainPhysicalResponse9; // 0x428(0x08)
	struct UPhysicalResponseComponent* MainPhysicalResponse8; // 0x430(0x08)
	struct UStaticMeshComponent* Chair24; // 0x438(0x08)
	struct UStaticMeshComponent* Chair23; // 0x440(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse93; // 0x448(0x08)
	struct UStaticMeshComponent* Chair22; // 0x450(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse91; // 0x458(0x08)
	struct UStaticMeshComponent* Chair21; // 0x460(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse89; // 0x468(0x08)
	struct UStaticMeshComponent* StaticMeshComponent56; // 0x470(0x08)
	struct UStaticMeshComponent* StaticMeshComponent77; // 0x478(0x08)
	struct UStaticMeshComponent* StaticMeshComponent120; // 0x480(0x08)
	struct UStaticMeshComponent* StaticMeshComponent108; // 0x488(0x08)
	struct UStaticMeshComponent* StaticMeshComponent103; // 0x490(0x08)
	struct UStaticMeshComponent* StaticMeshComponent121; // 0x498(0x08)
	struct UStaticMeshComponent* StaticMeshComponent124; // 0x4a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent102; // 0x4a8(0x08)
	struct UStaticMeshComponent* Crate1; // 0x4b0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse70; // 0x4b8(0x08)
	struct UStaticMeshComponent* Crate3; // 0x4c0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse69; // 0x4c8(0x08)
	struct UStaticMeshComponent* Crate5; // 0x4d0(0x08)
	struct UStaticMeshComponent* Crate8; // 0x4d8(0x08)
	struct UStaticMeshComponent* Chair17; // 0x4e0(0x08)
	struct UStaticMeshComponent* Chair20; // 0x4e8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse81; // 0x4f0(0x08)
	struct UStaticMeshComponent* Chair19; // 0x4f8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse80; // 0x500(0x08)
	struct UStaticMeshComponent* Chair18; // 0x508(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse79; // 0x510(0x08)
	struct UStaticMeshComponent* StaticMeshComponent193; // 0x518(0x08)
	struct UStaticMeshComponent* StaticMeshComponent35; // 0x520(0x08)
	struct UStaticMeshComponent* StaticMeshComponent36; // 0x528(0x08)
	struct UStaticMeshComponent* StaticMeshComponent84; // 0x530(0x08)
	struct UPhysicalResponseComponent* PhysicalResponsechairsStack20; // 0x538(0x08)
	struct UStaticMeshComponent* StaticMeshComponent83; // 0x540(0x08)
	struct UPhysicalResponseComponent* PhysicalResponsechairsStack19; // 0x548(0x08)
	struct UStaticMeshComponent* StaticMeshComponent82; // 0x550(0x08)
	struct UPhysicalResponseComponent* PhysicalResponsechairsStack18; // 0x558(0x08)
	struct UStaticMeshComponent* StaticMeshComponent81; // 0x560(0x08)
	struct UStaticMeshComponent* StaticMeshComponent15; // 0x568(0x08)
	struct UPhysicalResponseComponent* PhysicalResponsechairsStack16; // 0x570(0x08)
	struct UStaticMeshComponent* StaticMeshComponent13; // 0x578(0x08)
	struct UPhysicalResponseComponent* PhysicalResponsechairsStack15; // 0x580(0x08)
	struct UStaticMeshComponent* StaticMeshComponent32; // 0x588(0x08)
	struct UPhysicalResponseComponent* PhysicalResponsechairsStack14; // 0x590(0x08)
	struct UStaticMeshComponent* StaticMeshComponent17; // 0x598(0x08)
	struct UStaticMeshComponent* StaticMeshComponent16; // 0x5a0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponsechairsStack12; // 0x5a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent33; // 0x5b0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponsechairsStack11; // 0x5b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent18; // 0x5c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent7; // 0x5c8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponsechairsStack9; // 0x5d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent6; // 0x5d8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponsechairsStack8; // 0x5e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent5; // 0x5e8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponsechairsStack7; // 0x5f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent4; // 0x5f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent1; // 0x600(0x08)
	struct UPhysicalResponseComponent* PhysicalResponsechairsStack5; // 0x608(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0; // 0x610(0x08)
	struct UStaticMeshComponent* StaticMeshComponent8; // 0x618(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse25; // 0x620(0x08)
	struct UStaticMeshComponent* StaticMeshComponent9; // 0x628(0x08)
	struct UStaticMeshComponent* Chair28; // 0x630(0x08)
	struct UStaticMeshComponent* Chair27; // 0x638(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse97; // 0x640(0x08)
	struct UStaticMeshComponent* Chair26; // 0x648(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse96; // 0x650(0x08)
	struct UStaticMeshComponent* Chair25; // 0x658(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse95; // 0x660(0x08)
	struct UStaticMeshComponent* StaticMeshComponent257; // 0x668(0x08)
	struct UStaticMeshComponent* StaticMeshComponent192; // 0x670(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse45; // 0x678(0x08)
	struct UStaticMeshComponent* StaticMeshComponent310; // 0x680(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse44; // 0x688(0x08)
	struct UStaticMeshComponent* StaticMeshComponent309; // 0x690(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse43; // 0x698(0x08)
	struct UStaticMeshComponent* StaticMeshComponent256; // 0x6a0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse41; // 0x6a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent191; // 0x6b0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse38; // 0x6b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent306; // 0x6c0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse42; // 0x6c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent308; // 0x6d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent47; // 0x6d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent255; // 0x6e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent190; // 0x6e8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse28; // 0x6f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent305; // 0x6f8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse39; // 0x700(0x08)
	struct UStaticMeshComponent* StaticMeshComponent307; // 0x708(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse40; // 0x710(0x08)
	struct UStaticMeshComponent* StaticMeshComponent34; // 0x718(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse34; // 0x720(0x08)
	struct UStaticMeshComponent* StaticMeshComponent145; // 0x728(0x08)
	struct UStaticMeshComponent* StaticMeshComponent141; // 0x730(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse21; // 0x738(0x08)
	struct UStaticMeshComponent* StaticMeshComponent181; // 0x740(0x08)
	struct UStaticMeshComponent* StaticMeshComponent182; // 0x748(0x08)
	struct UStaticMeshComponent* StaticMeshComponent183; // 0x750(0x08)
	struct UStaticMeshComponent* StaticMeshComponent281; // 0x758(0x08)
	struct UPhysicalResponseComponent* MainPhysicalResponse5; // 0x760(0x08)
	struct UStaticMeshComponent* Crate6; // 0x768(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse23; // 0x770(0x08)
	struct UStaticMeshComponent* StaticMeshComponent282; // 0x778(0x08)
	struct UStaticMeshComponent* StaticMeshComponent284; // 0x780(0x08)
	struct UStaticMeshComponent* BookcaseSmall3; // 0x788(0x08)
	struct UStaticMeshComponent* StaticMeshComponent283; // 0x790(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse4; // 0x798(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse5; // 0x7a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent280; // 0x7a8(0x08)
	struct UPhysicalResponseComponent* MainPhysicalResponse6; // 0x7b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent142; // 0x7b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent144; // 0x7c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent146; // 0x7c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent155; // 0x7d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent137; // 0x7d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent138; // 0x7e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent156; // 0x7e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent157; // 0x7f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent140; // 0x7f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent154; // 0x800(0x08)
	struct UStaticMeshComponent* StaticMeshComponent42; // 0x808(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse90; // 0x810(0x08)
	struct UStaticMeshComponent* StaticMeshComponent49; // 0x818(0x08)
	struct UStaticMeshComponent* StaticMeshComponent158; // 0x820(0x08)
	struct UStaticMeshComponent* StaticMeshComponent135; // 0x828(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse92; // 0x830(0x08)
	struct UStaticMeshComponent* StaticMeshComponent136; // 0x838(0x08)
	struct UStaticMeshComponent* StaticMeshComponent263; // 0x840(0x08)
	struct UStaticMeshComponent* StaticMeshComponent227; // 0x848(0x08)
	struct UStaticMeshComponent* StaticMeshComponent245; // 0x850(0x08)
	struct UStaticMeshComponent* StaticMeshComponent244; // 0x858(0x08)
	struct UStaticMeshComponent* Owl; // 0x860(0x08)
	struct UStaticMeshComponent* StaticMeshComponent226; // 0x868(0x08)
	struct UStaticMeshComponent* StaticMeshComponent246; // 0x870(0x08)
	struct UStaticMeshComponent* StaticMeshComponent234; // 0x878(0x08)
	struct UStaticMeshComponent* StaticMeshComponent247; // 0x880(0x08)
	struct UStaticMeshComponent* StaticMeshComponent233; // 0x888(0x08)
	struct UStaticMeshComponent* SM_BCProps_FenceClothD_B; // 0x890(0x08)
	struct UStaticMeshComponent* SM_BCProps_FenceClothD_B_LOD; // 0x898(0x08)
	struct UStaticMeshComponent* StaticMeshComponent208; // 0x8a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent205; // 0x8a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent180; // 0x8b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent179; // 0x8b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent178; // 0x8c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent177; // 0x8c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent176; // 0x8d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent175; // 0x8d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent152; // 0x8e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent147; // 0x8e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent143; // 0x8f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent139; // 0x8f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent123; // 0x900(0x08)
	struct UStaticMeshComponent* StaticMeshComponent122; // 0x908(0x08)
	struct UStaticMeshComponent* StaticMeshComponent107; // 0x910(0x08)
	struct UStaticMeshComponent* StaticMeshComponent95; // 0x918(0x08)
	struct UStaticMeshComponent* StaticMeshComponent94; // 0x920(0x08)
	struct UStaticMeshComponent* StaticMeshComponent86; // 0x928(0x08)
	struct UStaticMeshComponent* StaticMeshComponent79; // 0x930(0x08)
	struct UStaticMeshComponent* StaticMeshComponent57; // 0x938(0x08)
	struct UStaticMeshComponent* StaticMeshComponent54; // 0x940(0x08)
	struct UStaticMeshComponent* StaticMeshComponent53; // 0x948(0x08)
	struct UStaticMeshComponent* StaticMeshComponent45; // 0x950(0x08)
	struct UStaticMeshComponent* StaticMeshComponent39; // 0x958(0x08)
	struct UStaticMeshComponent* StaticMeshComponent10; // 0x960(0x08)
	struct UStaticMeshComponent* StaticMeshComponent38; // 0x968(0x08)
	struct UStaticMeshComponent* StaticMeshComponent37; // 0x970(0x08)
	struct USceneComponent* Scene1; // 0x978(0x08)
	struct UStaticMeshComponent* SM_BCProps_FloorCloth_D_LOD; // 0x980(0x08)
	struct UStaticMeshComponent* SM_BCProps_FloorCloth_B_LOD; // 0x988(0x08)
	struct UStaticMeshComponent* SM_BCProps_FloorCloth_F; // 0x990(0x08)
	struct UStaticMeshComponent* Collision; // 0x998(0x08)
	struct USceneComponent* SharedRoot; // 0x9a0(0x08)
	struct UAkAudioEvent* AkEvent; // 0x9a8(0x08)

	struct TArray<struct FTransfigurationResource> GetAdditionalItemsReturned(); // Function BP_Sanc_TrashPileLarge_01B_Static.BP_Sanc_TrashPileLarge_01B_Static_C.GetAdditionalItemsReturned // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	bool IsObjectContextValidForTransformation(); // Function BP_Sanc_TrashPileLarge_01B_Static.BP_Sanc_TrashPileLarge_01B_Static_C.IsObjectContextValidForTransformation // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	bool IsObjectContextValidForVanishment(); // Function BP_Sanc_TrashPileLarge_01B_Static.BP_Sanc_TrashPileLarge_01B_Static_C.IsObjectContextValidForVanishment // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void DeactivateObject(); // Function BP_Sanc_TrashPileLarge_01B_Static.BP_Sanc_TrashPileLarge_01B_Static_C.DeactivateObject // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void FinalizeInitialAnimationState(); // Function BP_Sanc_TrashPileLarge_01B_Static.BP_Sanc_TrashPileLarge_01B_Static_C.FinalizeInitialAnimationState // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ObjectConjured(); // Function BP_Sanc_TrashPileLarge_01B_Static.BP_Sanc_TrashPileLarge_01B_Static_C.ObjectConjured // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ObjectStreamedSpawnInConfirmed(); // Function BP_Sanc_TrashPileLarge_01B_Static.BP_Sanc_TrashPileLarge_01B_Static_C.ObjectStreamedSpawnInConfirmed // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ObjectTransformationCancelled(); // Function BP_Sanc_TrashPileLarge_01B_Static.BP_Sanc_TrashPileLarge_01B_Static_C.ObjectTransformationCancelled // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ObjectTransformationConfirmed(); // Function BP_Sanc_TrashPileLarge_01B_Static.BP_Sanc_TrashPileLarge_01B_Static_C.ObjectTransformationConfirmed // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ObjectTransformationStarted(); // Function BP_Sanc_TrashPileLarge_01B_Static.BP_Sanc_TrashPileLarge_01B_Static_C.ObjectTransformationStarted // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ObjectVanished(); // Function BP_Sanc_TrashPileLarge_01B_Static.BP_Sanc_TrashPileLarge_01B_Static_C.ObjectVanished // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ReactivateObject(); // Function BP_Sanc_TrashPileLarge_01B_Static.BP_Sanc_TrashPileLarge_01B_Static_C.ReactivateObject // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void ObjectPhysicalResponseImpact(float ImpactIntensity, struct FName SpellName, struct FName ResponseConfigName, struct FVector& ImpactLocation); // Function BP_Sanc_TrashPileLarge_01B_Static.BP_Sanc_TrashPileLarge_01B_Static_C.ObjectPhysicalResponseImpact // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_BP_Sanc_TrashPileLarge_01B_Static(int32_t EntryPoint); // Function BP_Sanc_TrashPileLarge_01B_Static.BP_Sanc_TrashPileLarge_01B_Static_C.ExecuteUbergraph_BP_Sanc_TrashPileLarge_01B_Static // (Final|UbergraphFunction|HasDefaults) // @ game+0x38a7480
};

