// BlueprintGeneratedClass BP_Sanc_Desk_01_Potnr_Dressing01.BP_Sanc_Desk_01_Potnr_Dressing01_C
// Size: 0x420 (Inherited: 0x248)
struct ABP_Sanc_Desk_01_Potnr_Dressing01_C : AActor {
	struct UStaticMeshComponent* SM_HM_PotionBottle25; // 0x248(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle28; // 0x250(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse7; // 0x258(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse6; // 0x260(0x08)
	struct UStaticMeshComponent* SM_Book_04; // 0x268(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse5; // 0x270(0x08)
	struct UStaticMeshComponent* SM_Book_13; // 0x278(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse4; // 0x280(0x08)
	struct UStaticMeshComponent* SM_HW_Scrolls_B6; // 0x288(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse3; // 0x290(0x08)
	struct UStaticMeshComponent* SM_HW_Scrolls_C4; // 0x298(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse2; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_HW_Scrolls_B5; // 0x2a8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse1; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_HW_L_New_Book_A; // 0x2b8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_HW_Scrolls_C5; // 0x2c8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse57; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_Sanc_PestleMortar_01A; // 0x2d8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse56; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle1; // 0x2e8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse55; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle4; // 0x2f8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse54; // 0x300(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_Rolled_Parchment_G4; // 0x308(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_Rolled_Parchment_A5; // 0x310(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse73; // 0x318(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_Rolled_Parchment_A6; // 0x320(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse72; // 0x328(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_Rolled_Parchment_A4; // 0x330(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse71; // 0x338(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_Rolled_Parchment_A3; // 0x340(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse70; // 0x348(0x08)
	struct UStaticMeshComponent* SM_HW_Scrolls_B; // 0x350(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_Rolled_Parchment_G2; // 0x358(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse69; // 0x360(0x08)
	struct UStaticMeshComponent* SM_HW_LetterBundle_A6; // 0x368(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse68; // 0x370(0x08)
	struct UStaticMeshComponent* SM_HW_LetterBundle_A5; // 0x378(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse67; // 0x380(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_Rolled_Parchment_G3; // 0x388(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse66; // 0x390(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse65; // 0x398(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_Rolled_Parchment_A2; // 0x3a0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse64; // 0x3a8(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_Rolled_Parchment_G_245; // 0x3b0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse63; // 0x3b8(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_Rolled_Parchment_A_241; // 0x3c0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse62; // 0x3c8(0x08)
	struct UStaticMeshComponent* SM_Book_12; // 0x3d0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse61; // 0x3d8(0x08)
	struct UStaticMeshComponent* SM_Book_03; // 0x3e0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse59; // 0x3e8(0x08)
	struct UStaticMeshComponent* SM_HW_LetterBundle_A7; // 0x3f0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse19; // 0x3f8(0x08)
	struct UStaticMeshComponent* SM_HW_Scrolls_C; // 0x400(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse18; // 0x408(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse17; // 0x410(0x08)
	struct USceneComponent* SceneRoot; // 0x418(0x08)
};

