// BlueprintGeneratedClass BP_Stove_B2_Preset2.BP_Stove_B2_Preset2_C
// Size: 0x2e8 (Inherited: 0x288)
struct ABP_Stove_B2_Preset2_C : ABP_StirCrazy_Master_Preset_C {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x288(0x08)
	struct UStaticMeshComponent* SM_Stove_B2_Preset2_Potions; // 0x290(0x08)
	struct UStaticMeshComponent* SM_Stove_B2_Preset2_MetalUtilities; // 0x298(0x08)
	struct UStaticMeshComponent* SM_Stove_B2_Preset2_Food; // 0x2a0(0x08)
	struct UChildActorComponent* BP_HM_CandleHolder_A1; // 0x2a8(0x08)
	struct UChildActorComponent* BP_HM_CandleHolder_A; // 0x2b0(0x08)
	struct UDecalComponent* Decal2; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_HW_L_Book_Large_B; // 0x2c0(0x08)
	struct UDecalComponent* Decal1; // 0x2c8(0x08)
	struct UDecalComponent* Decal; // 0x2d0(0x08)
	struct UChildActorComponent* ChildActor3; // 0x2d8(0x08)
	struct UChildActorComponent* ChildActor1; // 0x2e0(0x08)

	void ReceiveBeginPlay(); // Function BP_Stove_B2_Preset2.BP_Stove_B2_Preset2_C.ReceiveBeginPlay // (Event|Protected|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_BP_Stove_B2_Preset2(int32_t EntryPoint); // Function BP_Stove_B2_Preset2.BP_Stove_B2_Preset2_C.ExecuteUbergraph_BP_Stove_B2_Preset2 // (Final|UbergraphFunction) // @ game+0x38a7480
};

