// BlueprintGeneratedClass BP_Sanc_TerrariumForestStart_Parent.BP_Sanc_TerrariumForestStart_Parent_C
// Size: 0x4f8 (Inherited: 0x2a8)
struct ABP_Sanc_TerrariumForestStart_Parent_C : ATransfigurationStructureBase {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2a8(0x08)
	struct UChildActorComponent* BP_Sanc_FreeStandingClock_Forest; // 0x2b0(0x08)
	struct UStaticMeshComponent* Collision2; // 0x2b8(0x08)
	struct USceneComponent* SK_Sanc_Forest_Wall:BanisterM3_L; // 0x2c0(0x08)
	struct USceneComponent* SK_Sanc_Forest_Wall:BanisterR3_L; // 0x2c8(0x08)
	struct USceneComponent* SK_Sanc_Forest_Wall:BanisterR2_L; // 0x2d0(0x08)
	struct USceneComponent* SK_Sanc_Forest_Wall:BanisterM2_L; // 0x2d8(0x08)
	struct USceneComponent* SK_Sanc_Forest_Wall:BanisterR1_L; // 0x2e0(0x08)
	struct USceneComponent* SK_Sanc_Forest_Wall:BanisterM1_L; // 0x2e8(0x08)
	struct USceneComponent* SK_Sanc_Forest_Wall:BanisterR3_R; // 0x2f0(0x08)
	struct USceneComponent* SK_Sanc_Forest_Wall:BanisterM3_R; // 0x2f8(0x08)
	struct USceneComponent* SK_Sanc_Forest_Wall:BanisterR2_R; // 0x300(0x08)
	struct USceneComponent* SK_Sanc_Forest_Wall:BanisterM2_R; // 0x308(0x08)
	struct USceneComponent* SK_Sanc_Forest_Wall:BanisterR1_R; // 0x310(0x08)
	struct USceneComponent* SK_Sanc_Forest_Wall:BanisterM1_R; // 0x318(0x08)
	struct UStaticMeshComponent* SM_Sanc_TerrariumForestBaseStart_Potnr; // 0x320(0x08)
	struct USceneComponent* Base; // 0x328(0x08)
	struct USceneComponent* SM_Sanc_Column_10_2; // 0x330(0x08)
	struct USceneComponent* SM_Sanc_Column_11; // 0x338(0x08)
	struct USceneComponent* SM_Sanc_Column_09_2; // 0x340(0x08)
	struct USceneComponent* SM_Sanc_Column_09; // 0x348(0x08)
	struct USceneComponent* SM_Sanc_TerrariumForestStart_06; // 0x350(0x08)
	struct USceneComponent* SM_Sanc_TerrariumForestStart_05; // 0x358(0x08)
	struct USceneComponent* SM_Sanc_TerrariumForestStart_04; // 0x360(0x08)
	struct USceneComponent* SM_Sanc_TerrariumForestStart_03; // 0x368(0x08)
	struct USceneComponent* SM_Sanc_TerrariumForestStart_02; // 0x370(0x08)
	struct USceneComponent* SM_Sanc_TerrariumForestStart_01; // 0x378(0x08)
	struct USceneComponent* SM_Sanc_TerrariumForestStart; // 0x380(0x08)
	struct USceneComponent* SM_Sanc_Wall_10x2_LF_02K; // 0x388(0x08)
	struct USceneComponent* SM_Sanc_Wall_10x2_LF_02J; // 0x390(0x08)
	struct USceneComponent* SM_Sanc_Wall_10x2_LF_02I; // 0x398(0x08)
	struct USceneComponent* SM_Sanc_Wall_10x2_LF_02H; // 0x3a0(0x08)
	struct USceneComponent* SM_Sanc_Wall_10x2_LF_02G; // 0x3a8(0x08)
	struct USceneComponent* SM_Sanc_Wall_10x2_LF_02F; // 0x3b0(0x08)
	struct USceneComponent* SM_Sanc_Wall_10x2_LF_02E; // 0x3b8(0x08)
	struct USceneComponent* SM_Sanc_Wall_10x2_LF_02D; // 0x3c0(0x08)
	struct USceneComponent* SM_Sanc_Wall_10x2_LF_02C; // 0x3c8(0x08)
	struct USceneComponent* SM_Sanc_Wall_10x2_LF_02B; // 0x3d0(0x08)
	struct USceneComponent* SM_Sanc_Wall_10x2_LF_02A; // 0x3d8(0x08)
	struct USceneComponent* SM_Sanc_Wall_10x2_LF_02; // 0x3e0(0x08)
	struct USceneComponent* SM_Sanc_Wall_10x2_RT_02K; // 0x3e8(0x08)
	struct USceneComponent* SM_Sanc_Wall_10x2_RT_02J; // 0x3f0(0x08)
	struct USceneComponent* SM_Sanc_Wall_10x2_RT_02I; // 0x3f8(0x08)
	struct USceneComponent* SM_Sanc_Wall_10x2_RT_02H; // 0x400(0x08)
	struct USceneComponent* SM_Sanc_Wall_10x2_RT_02G; // 0x408(0x08)
	struct USceneComponent* SM_Sanc_Wall_10x2_RT_02F; // 0x410(0x08)
	struct USceneComponent* SM_Sanc_Wall_10x2_RT_02E; // 0x418(0x08)
	struct USceneComponent* SM_Sanc_Wall_10x2_RT_02D; // 0x420(0x08)
	struct USceneComponent* SM_Sanc_Wall_10x2_RT_02C; // 0x428(0x08)
	struct USceneComponent* SM_Sanc_Wall_10x2_RT_02B; // 0x430(0x08)
	struct USceneComponent* SM_Sanc_Wall_10x2_RT_02A; // 0x438(0x08)
	struct USceneComponent* SM_Sanc_Wall_10x2_RT_02; // 0x440(0x08)
	struct USceneComponent* SM_Sanc_TerrariumForestClockHand_03; // 0x448(0x08)
	struct USceneComponent* SM_Sanc_TerrariumForestClockHand_02; // 0x450(0x08)
	struct USceneComponent* SM_Sanc_TerrariumForestClockHand_01; // 0x458(0x08)
	struct USceneComponent* SM_Sanc_TerrariumForestClockStart_02; // 0x460(0x08)
	struct USceneComponent* SM_Sanc_TerrariumForestClockStart_01; // 0x468(0x08)
	struct USceneComponent* SM_Sanc_TerrariumForestClockStart; // 0x470(0x08)
	struct USceneComponent* Clock; // 0x478(0x08)
	struct USceneComponent* RearWall_Right; // 0x480(0x08)
	struct USceneComponent* RearWall_Left; // 0x488(0x08)
	struct USceneComponent* RearWall_Centre; // 0x490(0x08)
	struct UStaticMeshComponent* SM_Sanc_Bio_DressingDecal_Medium_01A2; // 0x498(0x08)
	struct UStaticMeshComponent* SM_Sanc_Bio_DressingDecal_Medium_01A1; // 0x4a0(0x08)
	struct UStaticMeshComponent* SM_Sanc_Bio_DressingDecal_Medium_01A; // 0x4a8(0x08)
	struct UDecalComponent* Decal14; // 0x4b0(0x08)
	struct UDecalComponent* Decal11; // 0x4b8(0x08)
	struct UDecalComponent* Decal10; // 0x4c0(0x08)
	struct UDecalComponent* Decal9; // 0x4c8(0x08)
	struct UOdcObstacleComponent* OdcObstacle; // 0x4d0(0x08)
	struct UOdcAuthoredObstacleSetupComponent* OdcAuthoredObstacleSetup; // 0x4d8(0x08)
	struct UStaticMeshComponent* Collision1; // 0x4e0(0x08)
	struct UStaticMeshComponent* SM_Sanc_TerrariumForestStart_02A; // 0x4e8(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x4f0(0x08)

	void ReceiveBeginPlay(); // Function BP_Sanc_TerrariumForestStart_Parent.BP_Sanc_TerrariumForestStart_Parent_C.ReceiveBeginPlay // (Event|Protected|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_BP_Sanc_TerrariumForestStart_Parent(int32_t EntryPoint); // Function BP_Sanc_TerrariumForestStart_Parent.BP_Sanc_TerrariumForestStart_Parent_C.ExecuteUbergraph_BP_Sanc_TerrariumForestStart_Parent // (Final|UbergraphFunction|HasDefaults) // @ game+0x38a7480
};

