// BlueprintGeneratedClass BP_Sanc_HubCornerBookshelfs_03_Potnr_Dressing02.BP_Sanc_HubCornerBookshelfs_03_Potnr_Dressing02_C
// Size: 0x288 (Inherited: 0x248)
struct ABP_Sanc_HubCornerBookshelfs_03_Potnr_Dressing02_C : AActor {
	struct UStaticMeshComponent* StaticMesh11; // 0x248(0x08)
	struct UStaticMeshComponent* StaticMesh57; // 0x250(0x08)
	struct UStaticMeshComponent* StaticMesh18; // 0x258(0x08)
	struct UStaticMeshComponent* StaticMesh17; // 0x260(0x08)
	struct UStaticMeshComponent* StaticMesh16; // 0x268(0x08)
	struct UStaticMeshComponent* StaticMesh15; // 0x270(0x08)
	struct UStaticMeshComponent* StaticMesh13; // 0x278(0x08)
	struct USceneComponent* SceneRoot; // 0x280(0x08)
};

