// BlueprintGeneratedClass BP_Small_CastleRuins_1_B1.BP_Small_CastleRuins_1_B1_C
// Size: 0x2d0 (Inherited: 0x248)
struct ABP_Small_CastleRuins_1_B1_C : AActor {
	struct UDecalComponent* MI_Castle_Ruin1_WhiteLichen3; // 0x248(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_F5_109; // 0x250(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_F4_107; // 0x258(0x08)
	struct UDecalComponent* MI_P_Decal_Stain10_105; // 0x260(0x08)
	struct UDecalComponent* MI_Castle_Ruin1_WhiteLichen2_103; // 0x268(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_F3_101; // 0x270(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_F2_99; // 0x278(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_Bricks_A_e; // 0x280(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_C_a1; // 0x288(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_B_b1; // 0x290(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_1_Wall_Corner_Cap_A1_B; // 0x298(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_1_Broken_B_c1; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_F_a1; // 0x2a8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_CastleRuins_2_Bricks_A_f; // 0x2b0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuinsSmall_1_Wall_A_j1; // 0x2b8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuinsSmall_1_Wall_A_i1; // 0x2c0(0x08)
	struct USceneComponent* SharedRoot; // 0x2c8(0x08)
};

