// BlueprintGeneratedClass BP_Sanc_Bookcase_Dwiz.BP_Sanc_Bookcase_Dwiz_C
// Size: 0x358 (Inherited: 0x2b8)
struct ABP_Sanc_Bookcase_Dwiz_C : ABP_Sanc_Bookcase_Parent_C {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2b8(0x08)
	struct UDeferredChildActorComponent* Deferred_Dressing01; // 0x2c0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse26; // 0x2c8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse58; // 0x2d0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse39; // 0x2d8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse24; // 0x2e0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse8; // 0x2e8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse57; // 0x2f0(0x08)
	struct UOdcAuthoredObstacleSetupComponent* OdcAuthoredObstacleSetup; // 0x2f8(0x08)
	struct UConjurationSnappingFootprintComponent* ConjurationSnappingFootprint; // 0x300(0x08)
	struct UStaticMeshComponent* SM_Sanc_Bookcase_Dwiz; // 0x308(0x08)
	struct UStaticMeshComponent* SM_HW_L_New_Book_A; // 0x310(0x08)
	struct UStaticMeshComponent* SM_HW_DAO_Horn_A_40; // 0x318(0x08)
	struct UAkComponent* AkComponent; // 0x320(0x08)
	struct UStaticMeshComponent* SM_Cairn_Bone_Skull_E; // 0x328(0x08)
	struct UStaticMeshComponent* SM_HW_DAO_TribalMask_E; // 0x330(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse25; // 0x338(0x08)
	struct UStaticMeshComponent* SM_Sanc_Skull_Dwiz_01A; // 0x340(0x08)
	struct UStaticMeshComponent* SM_CandleGroup_Fat_A2; // 0x348(0x08)
	struct UStaticMeshComponent* SM_HW_DAO_DriedPixie_A; // 0x350(0x08)

	void ObjectPhysicalResponseImpact(float ImpactIntensity, struct FName SpellName, struct FName ResponseConfigName, struct FVector& ImpactLocation); // Function BP_Sanc_Bookcase_Dwiz.BP_Sanc_Bookcase_Dwiz_C.ObjectPhysicalResponseImpact // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_BP_Sanc_Bookcase_Dwiz(int32_t EntryPoint); // Function BP_Sanc_Bookcase_Dwiz.BP_Sanc_Bookcase_Dwiz_C.ExecuteUbergraph_BP_Sanc_Bookcase_Dwiz // (Final|UbergraphFunction|HasDefaults) // @ game+0x38a7480
};

