// BlueprintGeneratedClass BP_Sanc_Desk_01_Hbgst_Dressing01.BP_Sanc_Desk_01_Hbgst_Dressing01_C
// Size: 0x338 (Inherited: 0x248)
struct ABP_Sanc_Desk_01_Hbgst_Dressing01_C : AActor {
	struct UStaticMeshComponent* SM_SANC_PlantingPotSmall_Empty6_111; // 0x248(0x08)
	struct UStaticMeshComponent* SM_Mallowsweet_Stage7_134; // 0x250(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse32; // 0x258(0x08)
	struct UStaticMeshComponent* SM_SANC_PlantingPotSmall_Empty_97; // 0x260(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse50; // 0x268(0x08)
	struct UStaticMeshComponent* SM_SANC_PlantingPotSmall_Empty4_107; // 0x270(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse51; // 0x278(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse28; // 0x280(0x08)
	struct UStaticMeshComponent* SM_SANC_PlantingPotSmall_Empty3_103; // 0x288(0x08)
	struct UStaticMeshComponent* SM_Mallowsweet_Stage2_132; // 0x290(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse30; // 0x298(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse29; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_Sanc_HandFork5_91; // 0x2a8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse31; // 0x2b0(0x08)
	struct UAnimatedLightComponent* AnimatedLight1; // 0x2b8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse27; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_SANC_PlantingPotSmall_Empty7_113; // 0x2c8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse26; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_SANC_PlantingPotSmall_Empty5_109; // 0x2d8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse25; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_BCProps_Rope_126; // 0x2e8(0x08)
	struct UPointLightComponent* PointLight1; // 0x2f0(0x08)
	struct UNiagaraComponent* Niagara4; // 0x2f8(0x08)
	struct UNiagaraComponent* Niagara1; // 0x300(0x08)
	struct UStaticMeshComponent* SM_Candle_Fat_B; // 0x308(0x08)
	struct UNiagaraComponent* Niagara3; // 0x310(0x08)
	struct UStaticMeshComponent* SM_Candle_Skinny_B; // 0x318(0x08)
	struct UStaticMeshComponent* SM_Candle_Skinny_D; // 0x320(0x08)
	struct UStaticMeshComponent* SM_Sanc_LightFixtureTablelamp_01_Hbgst; // 0x328(0x08)
	struct USceneComponent* SceneRoot; // 0x330(0x08)
};

