// BlueprintGeneratedClass BP_Sanc_Bio_Glnd_CastleRuins_3_B.BP_Sanc_Bio_Glnd_CastleRuins_3_B_C
// Size: 0x3d0 (Inherited: 0x248)
struct ABP_Sanc_Bio_Glnd_CastleRuins_3_B_C : AActor {
	struct UDecalComponent* MM_P_Decal_Wetness_drips25; // 0x248(0x08)
	struct UDecalComponent* MM_P_Decal_Wetness_drips24; // 0x250(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_C6; // 0x258(0x08)
	struct UDecalComponent* MM_P_Decal_Wetness_drips23; // 0x260(0x08)
	struct UDecalComponent* MM_P_Decal_Wetness_drips22; // 0x268(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_B6; // 0x270(0x08)
	struct UDecalComponent* MM_P_Decal_Wetness_drips21; // 0x278(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_C4; // 0x280(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_C3; // 0x288(0x08)
	struct UDecalComponent* MM_P_Decal_Wetness_drips6; // 0x290(0x08)
	struct UDecalComponent* MM_P_Decal_Wetness_drips5; // 0x298(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_B; // 0x2a0(0x08)
	struct UDecalComponent* MM_P_Decal_Wetness_drips4; // 0x2a8(0x08)
	struct UDecalComponent* MM_P_Decal_Wetness_drips3; // 0x2b0(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_C; // 0x2b8(0x08)
	struct UDecalComponent* MM_P_Decal_Wetness_drips2; // 0x2c0(0x08)
	struct UDecalComponent* MM_P_Decal_Wetness_drips; // 0x2c8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_34SM_CastleRuins_2_Relief_A_e1; // 0x2d0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_2_Broken_C_b1; // 0x2d8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_2_Wall_L1; // 0x2e0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_2_Broken_C_a1; // 0x2e8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_16SM_CastleRuins_2_Relief_B_b1; // 0x2f0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_12SM_CastleRuins_2_Broken_F_a1; // 0x2f8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_7SM_CastleRuins_2_Broken_F_b1; // 0x300(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_8SM_CastleRuins_2_Broken_E1; // 0x308(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_CastleRuins_2_Wall_M1; // 0x310(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_20SM_CastleRuins_2_Relief_A_a1; // 0x318(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_CastleRuins_2_Broken_P_c1; // 0x320(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_17SM_CastleRuins_2_Relief_L_b1; // 0x328(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_CastleRuins_2_SquarePillars_A_a1; // 0x330(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_10SM_CastleRuins_2_Relief_C_d1; // 0x338(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_8SM_CastleRuins_2_Window_D_c1; // 0x340(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_2_Wall_O1; // 0x348(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_CastleRuins_2_Relief_A_b1; // 0x350(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_CastleRuins_2_Wall_A1; // 0x358(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_CastleRuins_2_Relief_A1_a1; // 0x360(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_8SM_CastleRuins_2_Relief_L_a1; // 0x368(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_2_Broken_B_b; // 0x370(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_CastleRuins_2_MainPillars_C_g; // 0x378(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_MainPillars_B_g; // 0x380(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_CastleRuins_2_MainPillars_C_f; // 0x388(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_MainPillars_E; // 0x390(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_Wall_T_a; // 0x398(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_Broken_M; // 0x3a0(0x08)
	struct UBoxComponent* Box2; // 0x3a8(0x08)
	struct UBoxComponent* W; // 0x3b0(0x08)
	struct UBoxComponent* Box1; // 0x3b8(0x08)
	struct UBoxComponent* Box; // 0x3c0(0x08)
	struct USceneComponent* SharedRoot; // 0x3c8(0x08)
};

