// BlueprintGeneratedClass BP_Stove_B2_Preset3.BP_Stove_B2_Preset3_C
// Size: 0x308 (Inherited: 0x288)
struct ABP_Stove_B2_Preset3_C : ABP_StirCrazy_Master_Preset_C {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x288(0x08)
	struct UStaticMeshComponent* SM_Stove_B2_Preset3_Food; // 0x290(0x08)
	struct UStaticMeshComponent* SM_Stove_B2_Preset3_Dishware; // 0x298(0x08)
	struct UStaticMeshComponent* SM_HM_Cauldron_Ladles_B; // 0x2a0(0x08)
	struct UPointLightComponent* PointLight; // 0x2a8(0x08)
	struct UParticleSystemComponent* P_Candleflame3; // 0x2b0(0x08)
	struct UParticleSystemComponent* P_Candleflame2; // 0x2b8(0x08)
	struct UParticleSystemComponent* P_Candleflame1; // 0x2c0(0x08)
	struct UParticleSystemComponent* P_Candleflame; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_Candle_Fat_B; // 0x2d0(0x08)
	struct UDecalComponent* Decal; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_FoodBag_1bag_003_W; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_FoodBag_1bag_002_W; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CookingPot_001; // 0x2f0(0x08)
	struct UChildActorComponent* ChildActor3; // 0x2f8(0x08)
	struct UChildActorComponent* ChildActor1; // 0x300(0x08)

	void ReceiveBeginPlay(); // Function BP_Stove_B2_Preset3.BP_Stove_B2_Preset3_C.ReceiveBeginPlay // (Event|Protected|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_BP_Stove_B2_Preset3(int32_t EntryPoint); // Function BP_Stove_B2_Preset3.BP_Stove_B2_Preset3_C.ExecuteUbergraph_BP_Stove_B2_Preset3 // (Final|UbergraphFunction) // @ game+0x38a7480
};

