// BlueprintGeneratedClass BP_StoragePile_Med_D.BP_StoragePile_Med_D_C
// Size: 0x2e8 (Inherited: 0x248)
struct ABP_StoragePile_Med_D_C : AActor {
	struct UChildActorComponent* BP_Int_BCProps_CloseCrate_Small_001; // 0x248(0x08)
	struct UChildActorComponent* BP_Int_BCProps_CloseCrate_Small_002; // 0x250(0x08)
	struct UDecalComponent* MI_CastleDun_BurntScatter_A2; // 0x258(0x08)
	struct UDecalComponent* MI_CastleDun_BurntScatter_A; // 0x260(0x08)
	struct UStaticMeshComponent* SM_BCProps_Bail_Large_001; // 0x268(0x08)
	struct UStaticMeshComponent* SM_BCProps_Bail_Medium_001; // 0x270(0x08)
	struct UStaticMeshComponent* SM_BCProps_Bail_Small_001; // 0x278(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Basket_Medium_001_W; // 0x280(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Medium_002_W; // 0x288(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Basket_Square_Small_002_W; // 0x290(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_Int_BCProps_Broom_001_W; // 0x298(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Bucket_Small_002_W; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Large_001_W; // 0x2a8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_FoodBag_1bag_001_W; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_FoodBag_1bag_002_W; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Jug_002_W; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Pot_002_W; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Lantern_002; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_WoodPile_Large_001; // 0x2d8(0x08)
	struct USceneComponent* SharedRoot; // 0x2e0(0x08)
};

