// BlueprintGeneratedClass BP_ST_ShelfCluster_A.BP_ST_ShelfCluster_A_C
// Size: 0x310 (Inherited: 0x2d0)
struct ABP_ST_ShelfCluster_A_C : ABP_SendTargetCluster_C {
	struct UChildActorComponent* BP_Int_Goblin_Crates_Red_Medium_W; // 0x2d0(0x08)
	struct UChildActorComponent* BP_WoodenShelfA1; // 0x2d8(0x08)
	struct UChildActorComponent* BP_Int_BCProps_Jug_001_W; // 0x2e0(0x08)
	struct UChildActorComponent* BP_Cav_DestructiblePot_01; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_Int_GoblinCrates_Small_Old_W; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_Int_GoblinCrates_Small_W; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_Prop_Barrel_Breakable_C; // 0x300(0x08)
	struct UChildActorComponent* BP_Prop_Barrel_Breakable_C; // 0x308(0x08)
};

