// BlueprintGeneratedClass BP_Sanc_Bio_Glnd_CastleRuins_2_WallEnd_A.BP_Sanc_Bio_Glnd_CastleRuins_2_WallEnd_A_C
// Size: 0x2d0 (Inherited: 0x248)
struct ABP_Sanc_Bio_Glnd_CastleRuins_2_WallEnd_A_C : AActor {
	struct UCapsuleComponent* Capsule2; // 0x248(0x08)
	struct UCapsuleComponent* Capsule1; // 0x250(0x08)
	struct UCapsuleComponent* Capsule; // 0x258(0x08)
	struct UBoxComponent* Box1; // 0x260(0x08)
	struct UBoxComponent* r1; // 0x268(0x08)
	struct UBoxComponent* R; // 0x270(0x08)
	struct UBoxComponent* Box; // 0x278(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0; // 0x280(0x08)
	struct UStaticMeshComponent* StaticMeshComponent08; // 0x288(0x08)
	struct UStaticMeshComponent* StaticMeshComponent07; // 0x290(0x08)
	struct UStaticMeshComponent* StaticMeshComponent06; // 0x298(0x08)
	struct UStaticMeshComponent* StaticMeshComponent05; // 0x2a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent04; // 0x2a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent03; // 0x2b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent02; // 0x2b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent01; // 0x2c0(0x08)
	struct USceneComponent* SharedRoot; // 0x2c8(0x08)
};

