// BlueprintGeneratedClass BP_Sanc_BooksPaperPopulation_01.BP_Sanc_BooksPaperPopulation_01_C
// Size: 0x298 (Inherited: 0x248)
struct ABP_Sanc_BooksPaperPopulation_01_C : AActor {
	struct UStaticMeshComponent* SM_HW_LetterCluster_B; // 0x248(0x08)
	struct UStaticMeshComponent* SM_HW_LetterCluster_E; // 0x250(0x08)
	struct UStaticMeshComponent* SM_HW_LetterCluster_D; // 0x258(0x08)
	struct UStaticMeshComponent* SM_HW_LetterCluster_F; // 0x260(0x08)
	struct UStaticMeshComponent* SM_HW_L_New_Book_Large_A; // 0x268(0x08)
	struct UStaticMeshComponent* SM_HW_L_New_Book_Medium_C; // 0x270(0x08)
	struct UStaticMeshComponent* SM_HW_L_New_Book_Medium_B; // 0x278(0x08)
	struct UStaticMeshComponent* SM_HW_L_New_Book_Medium_A; // 0x280(0x08)
	struct UStaticMeshComponent* SM_HW_L_New_Book_Large_C; // 0x288(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x290(0x08)
};

