// BlueprintGeneratedClass BP_Small_CastleRuins_1_A1.BP_Small_CastleRuins_1_A1_C
// Size: 0x2e8 (Inherited: 0x248)
struct ABP_Small_CastleRuins_1_A1_C : AActor {
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_F6; // 0x248(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_F5; // 0x250(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_F4_95; // 0x258(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_F3_93; // 0x260(0x08)
	struct UDecalComponent* MI_P_Decal_Stain10_91; // 0x268(0x08)
	struct UDecalComponent* MI_Castle_Ruin1_WhiteLichen2_89; // 0x270(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_F2_87; // 0x278(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_B; // 0x280(0x08)
	struct UStaticMeshComponent* SM_CastleRuinsSmall_1_Wall_A_g1; // 0x288(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_1_Broken_B_a1; // 0x290(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_1_Broken_C_b1; // 0x298(0x08)
	struct UStaticMeshComponent* SM_CastleRuinsSmall_1_Wall_A_h1; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Wall_Corner_Cap_A1_B; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_B_b1; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_F_a1; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_CastleRuinsSmall_1_Wall_A_g2; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_Relief_A_a; // 0x2c8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_CastleRuins_2_Relief_A_a; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_CastleRuinsSmall_1_Wall_A_h2; // 0x2d8(0x08)
	struct USceneComponent* SharedRoot; // 0x2e0(0x08)
};

