// BlueprintGeneratedClass BP_Sanc_HubCornerBookshelfs_03_Potnr_Dressing03.BP_Sanc_HubCornerBookshelfs_03_Potnr_Dressing03_C
// Size: 0x298 (Inherited: 0x248)
struct ABP_Sanc_HubCornerBookshelfs_03_Potnr_Dressing03_C : AActor {
	struct UStaticMeshComponent* SM_HM_Stacking_Cauldron_C3; // 0x248(0x08)
	struct UStaticMeshComponent* SM_Sanc_L_BookRow_Large_A1; // 0x250(0x08)
	struct UStaticMeshComponent* StaticMesh56; // 0x258(0x08)
	struct UStaticMeshComponent* StaticMesh34; // 0x260(0x08)
	struct UStaticMeshComponent* StaticMesh28; // 0x268(0x08)
	struct UStaticMeshComponent* SM_Sanc_L_BookRow_Large_A; // 0x270(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Jars_B1; // 0x278(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Jars_D; // 0x280(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Jars_C; // 0x288(0x08)
	struct USceneComponent* SceneRoot; // 0x290(0x08)
};

