// BlueprintGeneratedClass BP_StoragePile_Small_A_BreakablesRemoved.BP_StoragePile_Small_A_BreakablesRemoved_C
// Size: 0x2a0 (Inherited: 0x248)
struct ABP_StoragePile_Small_A_BreakablesRemoved_C : AActor {
	struct UStaticMeshComponent* StaticMeshComponent21; // 0x248(0x08)
	struct UStaticMeshComponent* StaticMeshComponent20; // 0x250(0x08)
	struct UStaticMeshComponent* StaticMeshComponent18; // 0x258(0x08)
	struct UStaticMeshComponent* StaticMeshComponent14; // 0x260(0x08)
	struct UStaticMeshComponent* StaticMeshComponent13; // 0x268(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0; // 0x270(0x08)
	struct UStaticMeshComponent* StaticMeshComponent10; // 0x278(0x08)
	struct UStaticMeshComponent* StaticMeshComponent8; // 0x280(0x08)
	struct UStaticMeshComponent* StaticMeshComponent3; // 0x288(0x08)
	struct UDecalComponent* NewDecalComponent; // 0x290(0x08)
	struct USceneComponent* SharedRoot; // 0x298(0x08)
};

