// BlueprintGeneratedClass BP_Sanc_Bio_Glnd_CastleRuins_2_D.BP_Sanc_Bio_Glnd_CastleRuins_2_D_C
// Size: 0x378 (Inherited: 0x248)
struct ABP_Sanc_Bio_Glnd_CastleRuins_2_D_C : AActor {
	struct UDecalComponent* MI_Castle_Ruin1_Decal_SootSmudge_11; // 0x248(0x08)
	struct UDecalComponent* MI_HW_Decal_SootSmudge_4; // 0x250(0x08)
	struct UDecalComponent* MI_Castle_Ruin1_Decal_SootSmudge_10; // 0x258(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_F6; // 0x260(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_F5; // 0x268(0x08)
	struct UDecalComponent* MI_Castle_Ruin1_Decal_SootSmudge_9; // 0x270(0x08)
	struct UDecalComponent* MI_CliffFaceIronDeposits_Decal; // 0x278(0x08)
	struct UDecalComponent* MI_Castle_Ruin1_Decal_SootSmudge_8; // 0x280(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_F4; // 0x288(0x08)
	struct UDecalComponent* MI_HW_Decal_SootSmudge_3; // 0x290(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_F3; // 0x298(0x08)
	struct UDecalComponent* MI_Castle_Ruin1_Decal_SootSmudge_7; // 0x2a0(0x08)
	struct UDecalComponent* MI_Castle_Ruin1_WhiteLichen1; // 0x2a8(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_F2; // 0x2b0(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_F; // 0x2b8(0x08)
	struct UDecalComponent* MI_Castle_Ruin1_Decal_SootSmudge_6; // 0x2c0(0x08)
	struct UDecalComponent* MI_P_Decal_Stain7; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_Broken_C_b; // 0x2d0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_2_Window_G; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_CastleRuinsSmall_2_Wall_A_b; // 0x2e0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_2_Broken_B_c; // 0x2e8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_2_Broken_F_b; // 0x2f0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_CastleRuins_2_Broken_B_b; // 0x2f8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_CastleRuins_2_Broken_B_a; // 0x300(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_CastleRuins_2_Wall_Corner_Cap_A; // 0x308(0x08)
	struct UStaticMeshComponent* SM_BIO_CastleRuinsSmall_Wall_B1; // 0x310(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_CastleRuins_2_Broken_G; // 0x318(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_CastleRuins_2_Broken_E; // 0x320(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_8SM_CastleRuins_2_Wall_A; // 0x328(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_8SM_CastleRuins_2_Wall_B; // 0x330(0x08)
	struct UBoxComponent* Box6; // 0x338(0x08)
	struct UBoxComponent* Box5; // 0x340(0x08)
	struct UBoxComponent* Box4; // 0x348(0x08)
	struct UBoxComponent* Box3; // 0x350(0x08)
	struct UBoxComponent* Box2; // 0x358(0x08)
	struct UBoxComponent* Box1; // 0x360(0x08)
	struct UBoxComponent* Box; // 0x368(0x08)
	struct USceneComponent* SharedRoot; // 0x370(0x08)
};

