// BlueprintGeneratedClass BP_Sanc_OutdoorsLantern.BP_Sanc_OutdoorsLantern_C
// Size: 0x290 (Inherited: 0x248)
struct ABP_Sanc_OutdoorsLantern_C : AActor {
	struct UMaterialBillboardComponent* MaterialBillboard; // 0x248(0x08)
	struct UAnimatedLightComponent* AnimatedLight; // 0x250(0x08)
	struct UPointLightComponent* PointLight; // 0x258(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Lantern_001; // 0x260(0x08)
	struct UNiagaraComponent* Niagara; // 0x268(0x08)
	struct UStaticMeshComponent* SM_BCProps_Eyelet_A; // 0x270(0x08)
	struct UStaticMeshComponent* SM_BCProps_Tentpole_A; // 0x278(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x280(0x08)
	struct ANone* LanternVar; // 0x288(0x08)
};

