// BlueprintGeneratedClass BP_Sanc_HubCornerBookshelfs_03_Potnr_Dressing04.BP_Sanc_HubCornerBookshelfs_03_Potnr_Dressing04_C
// Size: 0x2d8 (Inherited: 0x248)
struct ABP_Sanc_HubCornerBookshelfs_03_Potnr_Dressing04_C : AActor {
	struct UStaticMeshComponent* SM_HM_Stacking_Cauldron_C1; // 0x248(0x08)
	struct UStaticMeshComponent* SM_HM_Stacking_Cauldron_C2; // 0x250(0x08)
	struct UStaticMeshComponent* SM_HM_Stacking_Cauldron_C4; // 0x258(0x08)
	struct UStaticMeshComponent* SM_HM_Stacking_Cauldron_C; // 0x260(0x08)
	struct UStaticMeshComponent* StaticMesh58; // 0x268(0x08)
	struct UStaticMeshComponent* StaticMesh20; // 0x270(0x08)
	struct UStaticMeshComponent* StaticMesh31; // 0x278(0x08)
	struct UStaticMeshComponent* StaticMesh27; // 0x280(0x08)
	struct UStaticMeshComponent* SM_Bowl_01; // 0x288(0x08)
	struct UStaticMeshComponent* StaticMesh22; // 0x290(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Bottle_A1; // 0x298(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle1; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle12; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle15; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle7; // 0x2b8(0x08)
	struct UStaticMeshComponent* StaticMesh21; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle16; // 0x2c8(0x08)
	struct USceneComponent* SceneRoot; // 0x2d0(0x08)
};

