// BlueprintGeneratedClass BP_Sanc_QuidditchDiagrams_Dressing01.BP_Sanc_QuidditchDiagrams_Dressing01_C
// Size: 0x340 (Inherited: 0x248)
struct ABP_Sanc_QuidditchDiagrams_Dressing01_C : AActor {
	struct UStaticMeshComponent* SM_HW_QuidditchPitch_Emblems_C_197; // 0x248(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse14; // 0x250(0x08)
	struct UStaticMeshComponent* SM_HW_QuidditchPitch_SmallFlags_B3; // 0x258(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse13; // 0x260(0x08)
	struct UStaticMeshComponent* SM_HW_QuidditchPitch_SmallFlags_C4; // 0x268(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse12; // 0x270(0x08)
	struct UStaticMeshComponent* SM_HW_QuidditchPitch_SmallFlags_C3; // 0x278(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse11; // 0x280(0x08)
	struct UStaticMeshComponent* SM_HW_QuidditchPitch_Emblems_A_193; // 0x288(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse10; // 0x290(0x08)
	struct UStaticMeshComponent* SM_HW_QuidditchPitch_Emblems_B_195; // 0x298(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse9; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_HW_QuidditchPitch_Emblems_D_199; // 0x2a8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse8; // 0x2b0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse7; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_BulletinC_128; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_Rolled_Parchment_A_215; // 0x2c8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse6; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_Sanc_BeastBrush_01A3; // 0x2d8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse5; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_HM_Quidditch_TrophyLow_G10; // 0x2e8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse4; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_Sanc_GoldenSnitchOrnament_218; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_HM_FeatherDuster_212; // 0x300(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse; // 0x308(0x08)
	struct UStaticMeshComponent* SM_HM_Quidditch_TrophyLow_G9; // 0x310(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse2; // 0x318(0x08)
	struct UStaticMeshComponent* SM_HM_Quidditch_TrophyLow_G11; // 0x320(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse1; // 0x328(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse3; // 0x330(0x08)
	struct USceneComponent* SceneRoot; // 0x338(0x08)
};

