// BlueprintGeneratedClass BP_Sanc_Trash_3m_02A_Static.BP_Sanc_Trash_3m_02A_Static_C
// Size: 0x510 (Inherited: 0x248)
struct ABP_Sanc_Trash_3m_02A_Static_C : AActor {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x248(0x08)
	struct UStaticMeshComponent* LargeBookRow_2; // 0x250(0x08)
	struct UStaticMeshComponent* LargeBookRow_3; // 0x258(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse23; // 0x260(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse22; // 0x268(0x08)
	struct UStaticMeshComponent* Scrolls; // 0x270(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse21; // 0x278(0x08)
	struct UPhysicalResponseComponent* MainPhysicalResponse11; // 0x280(0x08)
	struct UPhysicalResponseComponent* MainPhysicalResponse10; // 0x288(0x08)
	struct UStaticMeshComponent* BigParcel_2; // 0x290(0x08)
	struct UStaticMeshComponent* BigParcel_3; // 0x298(0x08)
	struct UStaticMeshComponent* Cage_4; // 0x2a0(0x08)
	struct UStaticMeshComponent* Cage_5; // 0x2a8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse20; // 0x2b0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse19; // 0x2b8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse18; // 0x2c0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse17; // 0x2c8(0x08)
	struct UStaticMeshComponent* Scrolls1; // 0x2d0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse16; // 0x2d8(0x08)
	struct UStaticMeshComponent* LargeBookRow4; // 0x2e0(0x08)
	struct UPhysicalResponseComponent* MainPhysicalResponse9; // 0x2e8(0x08)
	struct UStaticMeshComponent* LargeBookRow_4; // 0x2f0(0x08)
	struct UPhysicalResponseComponent* MainPhysicalResponse8; // 0x2f8(0x08)
	struct UStaticMeshComponent* BigParcel_10; // 0x300(0x08)
	struct UStaticMeshComponent* LightParcel_11; // 0x308(0x08)
	struct UStaticMeshComponent* BigParcel_11; // 0x310(0x08)
	struct UStaticMeshComponent* LightParcel_10; // 0x318(0x08)
	struct UStaticMeshComponent* BigParcel_9; // 0x320(0x08)
	struct UStaticMeshComponent* BigParcel_8; // 0x328(0x08)
	struct UStaticMeshComponent* LightParcel_8; // 0x330(0x08)
	struct UStaticMeshComponent* LightParcel_6; // 0x338(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse6; // 0x340(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse7; // 0x348(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse8; // 0x350(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse9; // 0x358(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse15; // 0x360(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse11; // 0x368(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse12; // 0x370(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse13; // 0x378(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse14; // 0x380(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse10; // 0x388(0x08)
	struct UStaticMeshComponent* DarkParcel1; // 0x390(0x08)
	struct UStaticMeshComponent* DarkParcel2; // 0x398(0x08)
	struct UStaticMeshComponent* Book13; // 0x3a0(0x08)
	struct UStaticMeshComponent* Book14; // 0x3a8(0x08)
	struct UStaticMeshComponent* Book11; // 0x3b0(0x08)
	struct UStaticMeshComponent* Book10; // 0x3b8(0x08)
	struct UStaticMeshComponent* Book16; // 0x3c0(0x08)
	struct UStaticMeshComponent* Book15; // 0x3c8(0x08)
	struct UStaticMeshComponent* Book17; // 0x3d0(0x08)
	struct UStaticMeshComponent* Book9; // 0x3d8(0x08)
	struct UStaticMeshComponent* Book7; // 0x3e0(0x08)
	struct UStaticMeshComponent* Book6; // 0x3e8(0x08)
	struct UStaticMeshComponent* Book4; // 0x3f0(0x08)
	struct UStaticMeshComponent* Book5; // 0x3f8(0x08)
	struct UStaticMeshComponent* Book3; // 0x400(0x08)
	struct UStaticMeshComponent* Book2; // 0x408(0x08)
	struct UStaticMeshComponent* BigParcel_5; // 0x410(0x08)
	struct UStaticMeshComponent* BigParcel_4; // 0x418(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse5; // 0x420(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse4; // 0x428(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse1; // 0x430(0x08)
	struct UStaticMeshComponent* Cage_3; // 0x438(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse3; // 0x440(0x08)
	struct UStaticMeshComponent* Book1; // 0x448(0x08)
	struct UStaticMeshComponent* Book8; // 0x450(0x08)
	struct UStaticMeshComponent* SM_HW_BS_Cage_B; // 0x458(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse2; // 0x460(0x08)
	struct UStaticMeshComponent* Trunk1; // 0x468(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse; // 0x470(0x08)
	struct UBoxComponent* BoxCollision; // 0x478(0x08)
	struct UStaticMeshComponent* BrownCrateMed_7; // 0x480(0x08)
	struct UStaticMeshComponent* RedCrateMed_5; // 0x488(0x08)
	struct UStaticMeshComponent* BrownCrateMed_4; // 0x490(0x08)
	struct UStaticMeshComponent* RedCrateMed_2; // 0x498(0x08)
	struct UStaticMeshComponent* BrownCrateMed_5; // 0x4a0(0x08)
	struct UStaticMeshComponent* BrownCrateMed_6; // 0x4a8(0x08)
	struct UStaticMeshComponent* BrownCrateMed_3; // 0x4b0(0x08)
	struct UStaticMeshComponent* RedCrateMed_4; // 0x4b8(0x08)
	struct UStaticMeshComponent* BrownCrateMed_2; // 0x4c0(0x08)
	struct UStaticMeshComponent* BlueCrateMed_3; // 0x4c8(0x08)
	struct UStaticMeshComponent* BlueCrateMed_2; // 0x4d0(0x08)
	struct UStaticMeshComponent* RedCrateMed_3; // 0x4d8(0x08)
	struct UStaticMeshComponent* FloorCloth2; // 0x4e0(0x08)
	struct UStaticMeshComponent* FloorCloth1; // 0x4e8(0x08)
	struct UStaticMeshComponent* Cabinet_3; // 0x4f0(0x08)
	struct UStaticMeshComponent* Cabinet_2; // 0x4f8(0x08)
	struct USceneComponent* Scene; // 0x500(0x08)
	struct UAkAudioEvent* AkEvent; // 0x508(0x08)

	struct TArray<struct FTransfigurationResource> GetAdditionalItemsReturned(); // Function BP_Sanc_Trash_3m_02A_Static.BP_Sanc_Trash_3m_02A_Static_C.GetAdditionalItemsReturned // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	bool IsObjectContextValidForTransformation(); // Function BP_Sanc_Trash_3m_02A_Static.BP_Sanc_Trash_3m_02A_Static_C.IsObjectContextValidForTransformation // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	bool IsObjectContextValidForVanishment(); // Function BP_Sanc_Trash_3m_02A_Static.BP_Sanc_Trash_3m_02A_Static_C.IsObjectContextValidForVanishment // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void DeactivateObject(); // Function BP_Sanc_Trash_3m_02A_Static.BP_Sanc_Trash_3m_02A_Static_C.DeactivateObject // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void FinalizeInitialAnimationState(); // Function BP_Sanc_Trash_3m_02A_Static.BP_Sanc_Trash_3m_02A_Static_C.FinalizeInitialAnimationState // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ObjectConjured(); // Function BP_Sanc_Trash_3m_02A_Static.BP_Sanc_Trash_3m_02A_Static_C.ObjectConjured // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ObjectStreamedSpawnInConfirmed(); // Function BP_Sanc_Trash_3m_02A_Static.BP_Sanc_Trash_3m_02A_Static_C.ObjectStreamedSpawnInConfirmed // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ObjectTransformationCancelled(); // Function BP_Sanc_Trash_3m_02A_Static.BP_Sanc_Trash_3m_02A_Static_C.ObjectTransformationCancelled // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ObjectTransformationConfirmed(); // Function BP_Sanc_Trash_3m_02A_Static.BP_Sanc_Trash_3m_02A_Static_C.ObjectTransformationConfirmed // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ObjectTransformationStarted(); // Function BP_Sanc_Trash_3m_02A_Static.BP_Sanc_Trash_3m_02A_Static_C.ObjectTransformationStarted // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ObjectVanished(); // Function BP_Sanc_Trash_3m_02A_Static.BP_Sanc_Trash_3m_02A_Static_C.ObjectVanished // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ReactivateObject(); // Function BP_Sanc_Trash_3m_02A_Static.BP_Sanc_Trash_3m_02A_Static_C.ReactivateObject // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void ObjectPhysicalResponseImpact(float ImpactIntensity, struct FName SpellName, struct FName ResponseConfigName, struct FVector& ImpactLocation); // Function BP_Sanc_Trash_3m_02A_Static.BP_Sanc_Trash_3m_02A_Static_C.ObjectPhysicalResponseImpact // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_BP_Sanc_Trash_3m_02A_Static(int32_t EntryPoint); // Function BP_Sanc_Trash_3m_02A_Static.BP_Sanc_Trash_3m_02A_Static_C.ExecuteUbergraph_BP_Sanc_Trash_3m_02A_Static // (Final|UbergraphFunction|HasDefaults) // @ game+0x38a7480
};

