// BlueprintGeneratedClass BP_Sanc_TrashPileLarge_01C_Distance_Static.BP_Sanc_TrashPileLarge_01C_Distance_Static_C
// Size: 0x310 (Inherited: 0x248)
struct ABP_Sanc_TrashPileLarge_01C_Distance_Static_C : AActor {
	struct UStaticMeshComponent* StaticMeshComponent280; // 0x248(0x08)
	struct UStaticMeshComponent* StaticMeshComponent248; // 0x250(0x08)
	struct UStaticMeshComponent* StaticMeshComponent230; // 0x258(0x08)
	struct UStaticMeshComponent* StaticMeshComponent229; // 0x260(0x08)
	struct UStaticMeshComponent* StaticMeshComponent202; // 0x268(0x08)
	struct UStaticMeshComponent* StaticMeshComponent197; // 0x270(0x08)
	struct UStaticMeshComponent* StaticMeshComponent194; // 0x278(0x08)
	struct UStaticMeshComponent* Crate16; // 0x280(0x08)
	struct UStaticMeshComponent* Crate15; // 0x288(0x08)
	struct UStaticMeshComponent* Crate14; // 0x290(0x08)
	struct UStaticMeshComponent* Crate13; // 0x298(0x08)
	struct UStaticMeshComponent* Crate12; // 0x2a0(0x08)
	struct UStaticMeshComponent* Crate11; // 0x2a8(0x08)
	struct UStaticMeshComponent* Crate10; // 0x2b0(0x08)
	struct UStaticMeshComponent* Crate8; // 0x2b8(0x08)
	struct UStaticMeshComponent* Table2; // 0x2c0(0x08)
	struct UStaticMeshComponent* Crate5; // 0x2c8(0x08)
	struct UStaticMeshComponent* Crate3; // 0x2d0(0x08)
	struct UStaticMeshComponent* Crate1; // 0x2d8(0x08)
	struct UStaticMeshComponent* Cabinet1; // 0x2e0(0x08)
	struct UStaticMeshComponent* BookcaseLarge2; // 0x2e8(0x08)
	struct UStaticMeshComponent* BookcaseLarge1; // 0x2f0(0x08)
	struct UStaticMeshComponent* BookcaseSmall1; // 0x2f8(0x08)
	struct USceneComponent* Scene; // 0x300(0x08)
	struct USceneComponent* SharedRoot; // 0x308(0x08)
};

