// BlueprintGeneratedClass BP_Stove_Tea_Preset3.BP_Stove_Tea_Preset3_C
// Size: 0x2d0 (Inherited: 0x288)
struct ABP_Stove_Tea_Preset3_C : ABP_StirCrazy_Master_Preset_C {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x288(0x08)
	struct UStaticMeshComponent* SM_Stove_Tea_Preset3_Contents; // 0x290(0x08)
	struct UPointLightComponent* PointLight; // 0x298(0x08)
	struct UParticleSystemComponent* P_Candleflame; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_Light_Candle_4; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_HM_Candlestick_A; // 0x2b0(0x08)
	struct UDecalComponent* Decal1; // 0x2b8(0x08)
	struct UDecalComponent* Decal; // 0x2c0(0x08)
	struct UChildActorComponent* ChildActor3; // 0x2c8(0x08)

	void ReceiveBeginPlay(); // Function BP_Stove_Tea_Preset3.BP_Stove_Tea_Preset3_C.ReceiveBeginPlay // (Event|Protected|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_BP_Stove_Tea_Preset3(int32_t EntryPoint); // Function BP_Stove_Tea_Preset3.BP_Stove_Tea_Preset3_C.ExecuteUbergraph_BP_Stove_Tea_Preset3 // (Final|UbergraphFunction) // @ game+0x38a7480
};

