// BlueprintGeneratedClass BP_Sanc_HubCorner_03_Potnr.BP_Sanc_HubCorner_03_Potnr_C
// Size: 0x4d0 (Inherited: 0x330)
struct ABP_Sanc_HubCorner_03_Potnr_C : ABP_Sanc_HubCorner_03_C {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x330(0x08)
	struct UDeferredChildActorComponent* Deferred_Books01; // 0x338(0x08)
	struct UDeferredChildActorComponent* Deferred_Dressing01; // 0x340(0x08)
	struct UStaticMeshComponent* SM_Sanc_Detail_01_Potnr2; // 0x348(0x08)
	struct UStaticMeshComponent* SM_Sanc_Decal_03A_Potnr; // 0x350(0x08)
	struct UStaticMeshComponent* SM_Sanc_Decal_02A_Potnr; // 0x358(0x08)
	struct UStaticMeshComponent* SM_Sanc_Decal_01A_Potnr1; // 0x360(0x08)
	struct UStaticMeshComponent* SM_Sanc_Decal_01A_Potnr; // 0x368(0x08)
	struct UStaticMeshComponent* SM_Sanc_Vent_Potnr2; // 0x370(0x08)
	struct UStaticMeshComponent* SM_Sanc_Detail_01_Potnr1; // 0x378(0x08)
	struct UStaticMeshComponent* SM_Sanc_Detail_01_Potnr; // 0x380(0x08)
	struct UStaticMeshComponent* SM_Sanc_Vent_Potnr1; // 0x388(0x08)
	struct UStaticMeshComponent* SM_Sanc_WallFill_02_Dwiz3; // 0x390(0x08)
	struct UStaticMeshComponent* SM_Sanc_WallFill_02_Dwiz2; // 0x398(0x08)
	struct UStaticMeshComponent* SM_Sanc_WallFill_02_Dwiz1; // 0x3a0(0x08)
	struct UStaticMeshComponent* SM_Sanc_WallFill_02_Dwiz; // 0x3a8(0x08)
	struct UStaticMeshComponent* SM_Sanc_Wall_6x2_Potnr; // 0x3b0(0x08)
	struct UDecalComponent* Decal16; // 0x3b8(0x08)
	struct UDecalComponent* Decal18; // 0x3c0(0x08)
	struct UDecalComponent* Decal17; // 0x3c8(0x08)
	struct UDecalComponent* Decal15; // 0x3d0(0x08)
	struct UDecalComponent* E; // 0x3d8(0x08)
	struct UDecalComponent* Decal14; // 0x3e0(0x08)
	struct UDecalComponent* Decal13; // 0x3e8(0x08)
	struct UDecalComponent* Decal12; // 0x3f0(0x08)
	struct UDecalComponent* Decal11; // 0x3f8(0x08)
	struct UDecalComponent* Decal10; // 0x400(0x08)
	struct UDecalComponent* Decal9; // 0x408(0x08)
	struct UDecalComponent* Decal8; // 0x410(0x08)
	struct UDecalComponent* Decal7; // 0x418(0x08)
	struct UDecalComponent* Decal6; // 0x420(0x08)
	struct UDecalComponent* Decal5; // 0x428(0x08)
	struct UDecalComponent* W; // 0x430(0x08)
	struct UDecalComponent* Decal4; // 0x438(0x08)
	struct UDecalComponent* Decal3; // 0x440(0x08)
	struct UDecalComponent* Decal2; // 0x448(0x08)
	struct UDecalComponent* Decal1; // 0x450(0x08)
	struct UDecalComponent* Decal; // 0x458(0x08)
	struct UBoxComponent* Box1; // 0x460(0x08)
	struct UBoxComponent* Box; // 0x468(0x08)
	struct UConjurationWallAlignmentComponent* ConjurationWallAlignment1; // 0x470(0x08)
	struct UConjurationWallAlignmentComponent* ConjurationWallAlignment; // 0x478(0x08)
	struct UTransformationFxInfoComponent* TransformationFxInfo; // 0x480(0x08)
	struct UStaticMeshComponent* SM_Sanc_Alcove_01_Dwiz6; // 0x488(0x08)
	struct UStaticMeshComponent* SM_Sanc_Alcove_01_Dwiz7; // 0x490(0x08)
	struct UStaticMeshComponent* SM_Sanc_Alcove_01_Dwiz8; // 0x498(0x08)
	struct UStaticMeshComponent* SM_Sanc_Alcove_01_Dwiz5; // 0x4a0(0x08)
	struct UStaticMeshComponent* SM_Sanc_Alcove_01_Dwiz4; // 0x4a8(0x08)
	struct UStaticMeshComponent* SM_Sanc_Alcove_01_Dwiz3; // 0x4b0(0x08)
	struct UStaticMeshComponent* SM_Sanc_Alcove_01_Dwiz2; // 0x4b8(0x08)
	struct UStaticMeshComponent* SM_Sanc_Alcove_01_Dwiz1; // 0x4c0(0x08)
	struct UAkAudioEvent* AkEvent; // 0x4c8(0x08)

	void ObjectPhysicalResponseImpact(float ImpactIntensity, struct FName SpellName, struct FName ResponseConfigName, struct FVector& ImpactLocation); // Function BP_Sanc_HubCorner_03_Potnr.BP_Sanc_HubCorner_03_Potnr_C.ObjectPhysicalResponseImpact // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_BP_Sanc_HubCorner_03_Potnr(int32_t EntryPoint); // Function BP_Sanc_HubCorner_03_Potnr.BP_Sanc_HubCorner_03_Potnr_C.ExecuteUbergraph_BP_Sanc_HubCorner_03_Potnr // (Final|UbergraphFunction|HasDefaults) // @ game+0x38a7480
};

