// BlueprintGeneratedClass BP_Sanc_Bio_Glnd_CastleRuins_3_C.BP_Sanc_Bio_Glnd_CastleRuins_3_C_C
// Size: 0x2d0 (Inherited: 0x248)
struct ABP_Sanc_Bio_Glnd_CastleRuins_3_C_C : AActor {
	struct UStaticMeshComponent* SM_CastleRuins_2_MainPillars_E; // 0x248(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_Broken_P_c; // 0x250(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_Broken_M; // 0x258(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_Wall_T_a; // 0x260(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_CastleRuins_2_MainPillars_C_g; // 0x268(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_CastleRuins_2_MainPillars_C_f; // 0x270(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_MainPillars_B_g; // 0x278(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_2_Broken_B_b; // 0x280(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_CastleRuins_2_Relief_L_b; // 0x288(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_CastleRuins_2_Relief_L_a; // 0x290(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_CastleRuins_2_Broken_F_b; // 0x298(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_Broken_K_b; // 0x2a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_2_Broken_K_a; // 0x2a8(0x08)
	struct UBoxComponent* Box2; // 0x2b0(0x08)
	struct UBoxComponent* Box1; // 0x2b8(0x08)
	struct UBoxComponent* Box; // 0x2c0(0x08)
	struct USceneComponent* SharedRoot; // 0x2c8(0x08)
};

