// BlueprintGeneratedClass BP_Sanc_InsetSwamp_01A.BP_Sanc_InsetSwamp_01A_C
// Size: 0x4c0 (Inherited: 0x248)
struct ABP_Sanc_InsetSwamp_01A_C : AActor {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x248(0x08)
	struct UStaticMeshComponent* SM_CliffTop_B6; // 0x250(0x08)
	struct UStaticMeshComponent* SM_CliffTop_B5; // 0x258(0x08)
	struct UStaticMeshComponent* SM_CliffTop_B4; // 0x260(0x08)
	struct UStaticMeshComponent* SM_BogMyrtle_E4; // 0x268(0x08)
	struct UStaticMeshComponent* SM_BogMyrtle_E3; // 0x270(0x08)
	struct UStaticMeshComponent* SM_BogMyrtle_E2; // 0x278(0x08)
	struct UCapsuleComponent* Capsule1; // 0x280(0x08)
	struct UCapsuleComponent* Capsule; // 0x288(0x08)
	struct UStaticMeshComponent* SM_Sanc_Bio_DressingDecal_Large_01A; // 0x290(0x08)
	struct UStaticMeshComponent* SM_BogTree_BirchB1; // 0x298(0x08)
	struct UStaticMeshComponent* SM_BogTree_BirchB; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_Sanc_Bio_BogBank_A1; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_CliffTop_B3; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_Sanc_Bio_DressingDecal_Medium_01A8; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_CliffTop_B2; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_CliffTop_B1; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_CliffTop_B; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_RottedLog02_LOD0_Master; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_Sanc_Bio_DressingDecal_Medium_01A2; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_Sanc_Bio_DressingDecal_Medium_01A7; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_Sanc_Bio_DressingDecal_Medium_01A6; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_Sanc_Bio_DressingDecal_Medium_01A5; // 0x2f8(0x08)
	struct UParticleSystemComponent* P_Sanc_BOG_Terrarium_Portal_Particles; // 0x300(0x08)
	struct USceneComponent* VFX; // 0x308(0x08)
	struct UBP_SanctuaryPortal_MaterialComponent_StudyToBOG_Particles_C* BP_SanctuaryPortal_MaterialComponent_StudyToBOG_Particles1; // 0x310(0x08)
	struct UStaticMeshComponent* SM_BeardMoss_C11; // 0x318(0x08)
	struct UStaticMeshComponent* SM_BeardMoss_C10; // 0x320(0x08)
	struct UStaticMeshComponent* SM_BeardMoss_C9; // 0x328(0x08)
	struct UStaticMeshComponent* SM_BeardMoss_C8; // 0x330(0x08)
	struct UStaticMeshComponent* StaticMeshComponent219; // 0x338(0x08)
	struct UStaticMeshComponent* StaticMeshComponent218; // 0x340(0x08)
	struct UStaticMeshComponent* StaticMeshComponent217; // 0x348(0x08)
	struct UStaticMeshComponent* StaticMeshComponent216; // 0x350(0x08)
	struct UStaticMeshComponent* StaticMeshComponent215; // 0x358(0x08)
	struct UStaticMeshComponent* StaticMeshComponent214; // 0x360(0x08)
	struct UStaticMeshComponent* StaticMeshComponent213; // 0x368(0x08)
	struct USceneComponent* Scene2; // 0x370(0x08)
	struct UStaticMeshComponent* StaticMeshComponent212; // 0x378(0x08)
	struct UStaticMeshComponent* StaticMeshComponent211; // 0x380(0x08)
	struct UStaticMeshComponent* StaticMeshComponent209; // 0x388(0x08)
	struct UStaticMeshComponent* StaticMeshComponent208; // 0x390(0x08)
	struct UStaticMeshComponent* StaticMeshComponent205; // 0x398(0x08)
	struct UStaticMeshComponent* StaticMeshComponent201; // 0x3a0(0x08)
	struct USceneComponent* Scene1; // 0x3a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent206; // 0x3b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent204; // 0x3b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent202; // 0x3c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent207; // 0x3c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent203; // 0x3d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent199; // 0x3d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent200; // 0x3e0(0x08)
	struct USceneComponent* Scene; // 0x3e8(0x08)
	struct UStaticMeshComponent* SM_BeardMoss_C7; // 0x3f0(0x08)
	struct UStaticMeshComponent* SM_BeardMoss_A3; // 0x3f8(0x08)
	struct UStaticMeshComponent* SM_BeardMoss_A2; // 0x400(0x08)
	struct UStaticMeshComponent* SM_BeardMoss_A1; // 0x408(0x08)
	struct UStaticMeshComponent* SM_BeardMoss_A; // 0x410(0x08)
	struct UStaticMeshComponent* SM_BeardMoss_C6; // 0x418(0x08)
	struct UStaticMeshComponent* SM_BeardMoss_C5; // 0x420(0x08)
	struct UStaticMeshComponent* SM_BeardMoss_C4; // 0x428(0x08)
	struct UStaticMeshComponent* SM_BeardMoss_C3; // 0x430(0x08)
	struct UStaticMeshComponent* SM_BeardMoss_C2; // 0x438(0x08)
	struct UStaticMeshComponent* SM_BeardMoss_C1; // 0x440(0x08)
	struct UStaticMeshComponent* SM_BeardMoss_C; // 0x448(0x08)
	struct UStaticMeshComponent* SM_Heather_A6; // 0x450(0x08)
	struct UStaticMeshComponent* SM_Heather_A5; // 0x458(0x08)
	struct UStaticMeshComponent* SM_BogMyrtle_E1; // 0x460(0x08)
	struct UStaticMeshComponent* SM_Heather_A4; // 0x468(0x08)
	struct UStaticMeshComponent* SM_Heather_A3; // 0x470(0x08)
	struct UStaticMeshComponent* SM_Heather_A2; // 0x478(0x08)
	struct UStaticMeshComponent* SM_Heather_A1; // 0x480(0x08)
	struct UStaticMeshComponent* SM_Sanc_Bio_DressingDecal_Medium_01A3; // 0x488(0x08)
	struct UStaticMeshComponent* SM_Sanc_Bio_DressingDecal_Medium_01A1; // 0x490(0x08)
	struct UStaticMeshComponent* SM_Heather_A; // 0x498(0x08)
	struct UStaticMeshComponent* SM_BogMyrtle_E; // 0x4a0(0x08)
	struct UStaticMeshComponent* SM_Sanc_TerrariumSwampTrees_01A; // 0x4a8(0x08)
	struct USceneComponent* Dressing; // 0x4b0(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x4b8(0x08)

	void ReceiveBeginPlay(); // Function BP_Sanc_InsetSwamp_01A.BP_Sanc_InsetSwamp_01A_C.ReceiveBeginPlay // (Event|Protected|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_BP_Sanc_InsetSwamp_01A(int32_t EntryPoint); // Function BP_Sanc_InsetSwamp_01A.BP_Sanc_InsetSwamp_01A_C.ExecuteUbergraph_BP_Sanc_InsetSwamp_01A // (Final|UbergraphFunction) // @ game+0x38a7480
};

