// BlueprintGeneratedClass BP_Sanc_BiomeEntranceProps_01A.BP_Sanc_BiomeEntranceProps_01A_C
// Size: 0x2a8 (Inherited: 0x248)
struct ABP_Sanc_BiomeEntranceProps_01A_C : AActor {
	struct UStaticMeshComponent* SM_SANC_PlantingPotSmall2; // 0x248(0x08)
	struct UStaticMeshComponent* w2; // 0x250(0x08)
	struct UStaticMeshComponent* w1; // 0x258(0x08)
	struct UStaticMeshComponent* W; // 0x260(0x08)
	struct UStaticMeshComponent* SM_SANC_PlantingPotSmall1; // 0x268(0x08)
	struct UStaticMeshComponent* SM_SANC_PlantingPotSmall; // 0x270(0x08)
	struct UStaticMeshComponent* SM_Sanc_HandTrowel; // 0x278(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Shovel_001_W; // 0x280(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Pitchfork_001_W; // 0x288(0x08)
	struct UStaticMeshComponent* SM_CastleDun_HayPile_D; // 0x290(0x08)
	struct UStaticMeshComponent* SM_Sanc_WateringCan_01A; // 0x298(0x08)
	struct USceneComponent* SharedRoot; // 0x2a0(0x08)
};

