// BlueprintGeneratedClass BP_Shelf_Bottle_C.BP_Shelf_Bottle_C_C
// Size: 0x290 (Inherited: 0x248)
struct ABP_Shelf_Bottle_C_C : AActor {
	struct UStaticMeshComponent* SM_HM_Quill_DisplayShelf_A; // 0x248(0x08)
	struct UStaticMeshComponent* SM_CastleDun_GOB_Bottle_D; // 0x250(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleDun_GOB_Bottle_F; // 0x258(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_Bottle_002; // 0x260(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_Int_BCProps_Bottle_003; // 0x268(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_Int_BCProps_Bottle_001; // 0x270(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_OpenCrate_Medium_C; // 0x278(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_CastleDun_GOB_Bottle_B; // 0x280(0x08)
	struct USceneComponent* SharedRoot; // 0x288(0x08)
};

