// BlueprintGeneratedClass BP_Sanc_TerrariumForestStart_Potnr.BP_Sanc_TerrariumForestStart_Potnr_C
// Size: 0x710 (Inherited: 0x4f8)
struct ABP_Sanc_TerrariumForestStart_Potnr_C : ABP_Sanc_TerrariumForestStart_Parent_C {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x4f8(0x08)
	struct UDeferredChildActorComponent* Deferred_Dressing04; // 0x500(0x08)
	struct UDeferredChildActorComponent* Deferred_Dressing03; // 0x508(0x08)
	struct UDeferredChildActorComponent* Deferred_Dressing02; // 0x510(0x08)
	struct UDeferredChildActorComponent* Deferred_Dressing01; // 0x518(0x08)
	struct UDecalComponent* Decal12; // 0x520(0x08)
	struct UChildActorComponent* BP_Sanc_LightFixtureOmniDirectional_01_Potnr1; // 0x528(0x08)
	struct UChildActorComponent* BP_Sanc_LightFixtureOmniDirectional_01_Potnr; // 0x530(0x08)
	struct UStaticMeshComponent* SM_Sanc_Column; // 0x538(0x08)
	struct UStaticMeshComponent* SM_Sanc_Column1; // 0x540(0x08)
	struct UStaticMeshComponent* SM_Sanc_Wall_3x1; // 0x548(0x08)
	struct UStaticMeshComponent* SM_Sanc_Alcove_01_Dwiz9; // 0x550(0x08)
	struct UStaticMeshComponent* SM_Sanc_Wall_10x2_Potnr_02L1; // 0x558(0x08)
	struct UStaticMeshComponent* SM_Sanc_Wall_10x2_Potnr_02L; // 0x560(0x08)
	struct UStaticMeshComponent* SM_Sanc_TerrariumForestBanister_01_Dwiz2; // 0x568(0x08)
	struct UStaticMeshComponent* SM_Sanc_BanisterPost_01_Dwiz2; // 0x570(0x08)
	struct UStaticMeshComponent* SM_Sanc_BanisterPost_01_Dwiz1; // 0x578(0x08)
	struct UStaticMeshComponent* SM_Sanc_TerrariumForestBanister_01_Dwiz1; // 0x580(0x08)
	struct UStaticMeshComponent* SM_Sanc_TerrariumForestBanister_01_Dwiz3; // 0x588(0x08)
	struct UStaticMeshComponent* SM_Sanc_BanisterPost_01_Dwiz; // 0x590(0x08)
	struct UStaticMeshComponent* SM_Sanc_TerrariumForestBanister_01_Dwiz6; // 0x598(0x08)
	struct UStaticMeshComponent* SM_Sanc_BanisterPost_01_Dwiz5; // 0x5a0(0x08)
	struct UStaticMeshComponent* SM_Sanc_TerrariumForestBanister_01_Dwiz5; // 0x5a8(0x08)
	struct UStaticMeshComponent* SM_Sanc_BanisterPost_01_Dwiz4; // 0x5b0(0x08)
	struct UStaticMeshComponent* SM_Sanc_TerrariumForestBanister_01_Dwiz4; // 0x5b8(0x08)
	struct UStaticMeshComponent* SM_Sanc_BanisterPost_01_Dwiz3; // 0x5c0(0x08)
	struct UStaticMeshComponent* SM_Sanc_Wall_10x2_RT_02K_1; // 0x5c8(0x08)
	struct UStaticMeshComponent* SM_Sanc_Wall_10x2_RT_02J_1; // 0x5d0(0x08)
	struct UStaticMeshComponent* SM_Sanc_Wall_10x2_RT_02I_1; // 0x5d8(0x08)
	struct UStaticMeshComponent* SM_Sanc_Wall_10x2_RT_02H_1; // 0x5e0(0x08)
	struct UStaticMeshComponent* SM_Sanc_Wall_10x2_RT_02G_1; // 0x5e8(0x08)
	struct UStaticMeshComponent* SM_Sanc_Wall_10x2_RT_02F_1; // 0x5f0(0x08)
	struct UStaticMeshComponent* SM_Sanc_Wall_10x2_RT_02E_1; // 0x5f8(0x08)
	struct UStaticMeshComponent* SM_Sanc_Wall_10x2_RT_02D_1; // 0x600(0x08)
	struct UStaticMeshComponent* SM_Sanc_Wall_10x2_RT_02C_1; // 0x608(0x08)
	struct UStaticMeshComponent* SM_Sanc_Wall_10x2_RT_02B_1; // 0x610(0x08)
	struct UStaticMeshComponent* SM_Sanc_Wall_10x2_RT_02A_1; // 0x618(0x08)
	struct UStaticMeshComponent* SM_Sanc_Wall_10x2_RT_02_1; // 0x620(0x08)
	struct UStaticMeshComponent* SM_Sanc_Wall_10x2_LF_02K_1; // 0x628(0x08)
	struct UStaticMeshComponent* SM_Sanc_Wall_10x2_LF_02J_1; // 0x630(0x08)
	struct UStaticMeshComponent* SM_Sanc_Wall_10x2_LF_02I_1; // 0x638(0x08)
	struct UStaticMeshComponent* SM_Sanc_Wall_10x2_LF_02H_1; // 0x640(0x08)
	struct UStaticMeshComponent* SM_Sanc_Wall_10x2_LF_02G_1; // 0x648(0x08)
	struct UStaticMeshComponent* SM_Sanc_Wall_10x2_LF_02F_1; // 0x650(0x08)
	struct UStaticMeshComponent* SM_Sanc_Wall_10x2_LF_02E_1; // 0x658(0x08)
	struct UStaticMeshComponent* SM_Sanc_Wall_10x2_LF_02D_1; // 0x660(0x08)
	struct UStaticMeshComponent* SM_Sanc_Wall_10x2_LF_02C_1; // 0x668(0x08)
	struct UStaticMeshComponent* SM_Sanc_Wall_10x2_LF_02B_1; // 0x670(0x08)
	struct UStaticMeshComponent* SM_Sanc_Wall_10x2_LF_02A_1; // 0x678(0x08)
	struct UStaticMeshComponent* SM_Sanc_Wall_10x2_LF_02_1; // 0x680(0x08)
	struct UStaticMeshComponent* SM_Sanc_Column_10_1_1; // 0x688(0x08)
	struct UStaticMeshComponent* SM_Sanc_Column_10_1; // 0x690(0x08)
	struct UStaticMeshComponent* SM_Sanc_Column_09_1_1; // 0x698(0x08)
	struct UStaticMeshComponent* SM_Sanc_Column_09_1; // 0x6a0(0x08)
	struct UStaticMeshComponent* SM_Sanc_TerrariumForestStart_06_1; // 0x6a8(0x08)
	struct UStaticMeshComponent* SM_Sanc_TerrariumForestStart_05_1; // 0x6b0(0x08)
	struct UStaticMeshComponent* SM_Sanc_TerrariumForestStart_04_1; // 0x6b8(0x08)
	struct UStaticMeshComponent* SM_Sanc_TerrariumForestStart_03_1; // 0x6c0(0x08)
	struct UStaticMeshComponent* SM_Sanc_TerrariumForestStart_02_1; // 0x6c8(0x08)
	struct UStaticMeshComponent* SM_Sanc_TerrariumForestStart_01_1; // 0x6d0(0x08)
	struct UStaticMeshComponent* SM_Sanc_TerrariumForestStart_1; // 0x6d8(0x08)
	struct UStaticMeshComponent* SM_Sanc_TerrariumForestClockHand_02_1; // 0x6e0(0x08)
	struct UStaticMeshComponent* SM_Sanc_TerrariumForestClockHand_01_1; // 0x6e8(0x08)
	struct UStaticMeshComponent* SM_Sanc_TerrariumForestClockStart_02_1; // 0x6f0(0x08)
	struct UStaticMeshComponent* SM_Sanc_TerrariumForestClockStart_01_1; // 0x6f8(0x08)
	struct UStaticMeshComponent* SM_Sanc_TerrariumForestClockStart_1; // 0x700(0x08)
	struct UAkAudioEvent* AkEvent; // 0x708(0x08)

	void ObjectPhysicalResponseImpact(float ImpactIntensity, struct FName SpellName, struct FName ResponseConfigName, struct FVector& ImpactLocation); // Function BP_Sanc_TerrariumForestStart_Potnr.BP_Sanc_TerrariumForestStart_Potnr_C.ObjectPhysicalResponseImpact // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_BP_Sanc_TerrariumForestStart_Potnr(int32_t EntryPoint); // Function BP_Sanc_TerrariumForestStart_Potnr.BP_Sanc_TerrariumForestStart_Potnr_C.ExecuteUbergraph_BP_Sanc_TerrariumForestStart_Potnr // (Final|UbergraphFunction|HasDefaults) // @ game+0x38a7480
};

