// BlueprintGeneratedClass BP_Small_CastleRuins_2_E.BP_Small_CastleRuins_2_E_C
// Size: 0x2c0 (Inherited: 0x248)
struct ABP_Small_CastleRuins_2_E_C : AActor {
	struct UDecalComponent* MI_CliffFaceIronDeposits_Decal_209; // 0x248(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_F5_205; // 0x250(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_F4_203; // 0x258(0x08)
	struct UDecalComponent* MI_Castle_Ruin1_Decal_SootSmudge_201; // 0x260(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_F3_199; // 0x268(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_F2_197; // 0x270(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_F_195; // 0x278(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_2_Broken_F_b1; // 0x280(0x08)
	struct UStaticMeshComponent* SM_CastleRuinsSmall_2_Wall_A_c3; // 0x288(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_CastleRuins_2_Broken_B_b1; // 0x290(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_Broken_M1; // 0x298(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_MainPillars_A_c1; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_MainPillars_A_a1; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_CastleRuinsSmall_2_Wall_A_c2; // 0x2b0(0x08)
	struct USceneComponent* SharedRoot; // 0x2b8(0x08)
};

