// BlueprintGeneratedClass BP_Sanc_Bio_Bog_Central_Tree_01.BP_Sanc_Bio_Bog_Central_Tree_01_C
// Size: 0x2b0 (Inherited: 0x248)
struct ABP_Sanc_Bio_Bog_Central_Tree_01_C : AActor {
	struct UHierarchicalInstancedStaticMeshComponent* HISM_15SM_BrackinFern_C; // 0x248(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_22SM_BrackinFern_C_Fall; // 0x250(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_13SM_CaloceraFungus_01; // 0x258(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_11SM_CaloceraFungus_02; // 0x260(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_323SM_Moss_Lush_Master; // 0x268(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_13SM_Pleurocybella_01; // 0x270(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_Pleurocybella_03; // 0x278(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_22SM_Pleurocybella_05; // 0x280(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_28SM_XeromphalinaClump_04; // 0x288(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_66SM_XeromphalinaClump_06; // 0x290(0x08)
	struct UStaticMeshComponent* SM_BogTree_Oak_LargeC; // 0x298(0x08)
	struct USceneComponent* Scene; // 0x2a0(0x08)
	struct USceneComponent* SharedRoot; // 0x2a8(0x08)
};

