// BlueprintGeneratedClass BP_Stove_A_Preset1.BP_Stove_A_Preset1_C
// Size: 0x2e8 (Inherited: 0x288)
struct ABP_Stove_A_Preset1_C : ABP_StirCrazy_Master_Preset_C {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x288(0x08)
	struct UStaticMeshComponent* SM_Stove_A_Preset1_Contents; // 0x290(0x08)
	struct UStaticMeshComponent* SM_BCProps_Wood_Chopped_Small_001; // 0x298(0x08)
	struct UPointLightComponent* PointLight; // 0x2a0(0x08)
	struct UParticleSystemComponent* P_Candleflame; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_Candle_Skinny_B; // 0x2b0(0x08)
	struct UDecalComponent* Decal_Spillage_04; // 0x2b8(0x08)
	struct UDecalComponent* Decal_Spillage_01; // 0x2c0(0x08)
	struct UDecalComponent* Decal_Spillage_03; // 0x2c8(0x08)
	struct UDecalComponent* Decal_Spillage_02; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_HM_Cloth_04_CProp; // 0x2d8(0x08)
	struct UChildActorComponent* ChildActor; // 0x2e0(0x08)

	void ReceiveBeginPlay(); // Function BP_Stove_A_Preset1.BP_Stove_A_Preset1_C.ReceiveBeginPlay // (Event|Protected|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_BP_Stove_A_Preset1(int32_t EntryPoint); // Function BP_Stove_A_Preset1.BP_Stove_A_Preset1_C.ExecuteUbergraph_BP_Stove_A_Preset1 // (Final|UbergraphFunction) // @ game+0x38a7480
};

