// BlueprintGeneratedClass BP_Sanc_Trash_3m_03A_Static.BP_Sanc_Trash_3m_03A_Static_C
// Size: 0x2e0 (Inherited: 0x248)
struct ABP_Sanc_Trash_3m_03A_Static_C : AActor {
	struct UBoxComponent* BoxCollision; // 0x248(0x08)
	struct UStaticMeshComponent* SM_GoblinCrates_Small_Blue2; // 0x250(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Medium_003_W; // 0x258(0x08)
	struct UStaticMeshComponent* SM_Book_08; // 0x260(0x08)
	struct UStaticMeshComponent* SM_Book_07; // 0x268(0x08)
	struct UStaticMeshComponent* SM_Book_06; // 0x270(0x08)
	struct UStaticMeshComponent* SM_Book_05; // 0x278(0x08)
	struct UStaticMeshComponent* SM_Book_04; // 0x280(0x08)
	struct UStaticMeshComponent* SM_GoblinCrates_Small_Blue1; // 0x288(0x08)
	struct UStaticMeshComponent* SM_GoblinCrates_Small_Old1; // 0x290(0x08)
	struct UStaticMeshComponent* FloorCloth1; // 0x298(0x08)
	struct UStaticMeshComponent* SM_GoblinCrates_Small_Old; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_Goblin_Crates_Old_Medium; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_LoneTower_Ladder_02; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_Shelf_B1; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_Shelf_B; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_LoneTower_Ladder_01; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_GoblinCrates_Small_Blue; // 0x2d0(0x08)
	struct USceneComponent* Scene; // 0x2d8(0x08)
};

