// BlueprintGeneratedClass BP_Sanc_Bookcase_Dwiz_Dressing01.BP_Sanc_Bookcase_Dwiz_Dressing01_C
// Size: 0x3b0 (Inherited: 0x248)
struct ABP_Sanc_Bookcase_Dwiz_Dressing01_C : AActor {
	struct UPhysicalResponseComponent* PhysicalResponse27; // 0x248(0x08)
	struct UStaticMeshComponent* SM_Cairn_SpineCandle_C4_64; // 0x250(0x08)
	struct UStaticMeshComponent* SM_Cairn_SpineCandle_C_48; // 0x258(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse1; // 0x260(0x08)
	struct UStaticMeshComponent* SM_HW_DAO_ProstheticArm_A; // 0x268(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse; // 0x270(0x08)
	struct UStaticMeshComponent* SM_Cairn_SpineCandle_C2; // 0x278(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse31; // 0x280(0x08)
	struct UStaticMeshComponent* SM_HW_DAO_VoodooDoll_A_62; // 0x288(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse30; // 0x290(0x08)
	struct UStaticMeshComponent* SM_CandleGroup_Fat_A_59; // 0x298(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse28; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_HW_L_New_Book_Large_B_33; // 0x2a8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse29; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_HW_DAO_DriedMerman; // 0x2b8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse9; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_Cairn_SpineCandle_C3_55; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_HW_HourGlass_B_45; // 0x2d0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse56; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_Cairn_Bone_Skull_B; // 0x2e0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse22; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_Cairn_Bone_Skull_D_70; // 0x2f0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse20; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_HW_L_New_Book_F_28; // 0x300(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse21; // 0x308(0x08)
	struct UStaticMeshComponent* SM_HW_OpenBook_A_21; // 0x310(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse10; // 0x318(0x08)
	struct UStaticMeshComponent* SM_HW_L_BookStand_18; // 0x320(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse5; // 0x328(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse18; // 0x330(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse23; // 0x338(0x08)
	struct UStaticMeshComponent* SM_HW_DAO_ShrunkenHeadA; // 0x340(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse17; // 0x348(0x08)
	struct UStaticMeshComponent* SM_Sanc_Candle_Dwiz_01A; // 0x350(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse55; // 0x358(0x08)
	struct UStaticMeshComponent* SM_Sanc_Candle_Dwiz_01A2; // 0x360(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse54; // 0x368(0x08)
	struct UStaticMeshComponent* SM_HW_CrystalBall_Prof_67; // 0x370(0x08)
	struct UStaticMeshComponent* SM_Cairn_Bone_BeastSkull_A; // 0x378(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse53; // 0x380(0x08)
	struct UStaticMeshComponent* SM_HW_DAO_Bat; // 0x388(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse52; // 0x390(0x08)
	struct UStaticMeshComponent* SM_HW_DAO_SkullHorns05_25; // 0x398(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse19; // 0x3a0(0x08)
	struct USceneComponent* SceneRoot; // 0x3a8(0x08)
};

