// BlueprintGeneratedClass BP_Sanc_HubCornerBookshelfs_03.BP_Sanc_HubCornerBookshelfs_03_C
// Size: 0x2e8 (Inherited: 0x2a8)
struct ABP_Sanc_HubCornerBookshelfs_03_C : ATransfigurationStructureBase {
	struct UCameraStackFramingLocationComponent* CameraStackFramingLocation; // 0x2a8(0x08)
	struct USceneComponent* CornerShelves_Mzoo_BirdCage; // 0x2b0(0x08)
	struct USceneComponent* CornerShelves_ShelfPiece_04; // 0x2b8(0x08)
	struct USceneComponent* CornerShelves_ShelfPiece_03a; // 0x2c0(0x08)
	struct USceneComponent* CornerShelves_ShelfPiece_03; // 0x2c8(0x08)
	struct USceneComponent* CornerShelves_ShelfPiece_02; // 0x2d0(0x08)
	struct USceneComponent* CornerShelves_ShelfPiece_01; // 0x2d8(0x08)
	struct USceneComponent* Scene; // 0x2e0(0x08)

	void SetUpSplineEffects(struct UObject* ChildActor, struct TArray<struct USplineComponent*>& SplineArray); // Function BP_Sanc_HubCornerBookshelfs_03.BP_Sanc_HubCornerBookshelfs_03_C.SetUpSplineEffects // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void SetUpBookChildActor(struct UObject* ChildActor, struct TArray<struct USplineComponent*>& SplineArray); // Function BP_Sanc_HubCornerBookshelfs_03.BP_Sanc_HubCornerBookshelfs_03_C.SetUpBookChildActor // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
};

