// BlueprintGeneratedClass BP_Sanc_Trash_BoxPile_02A.BP_Sanc_Trash_BoxPile_02A_C
// Size: 0x450 (Inherited: 0x248)
struct ABP_Sanc_Trash_BoxPile_02A_C : AActor {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x248(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse1; // 0x250(0x08)
	struct UStaticMeshComponent* SM_GoblinCrates_LG_Old_Metal_250; // 0x258(0x08)
	struct UStaticMeshComponent* SM_HW_Scale_A2_224; // 0x260(0x08)
	struct UStaticMeshComponent* SM_HM_2Hand_Cabinet_178; // 0x268(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_Desk_228; // 0x270(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_BroomStand_001_W2; // 0x278(0x08)
	struct UStaticMeshComponent* SM_GoblinCrates_LG_264; // 0x280(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_Shelf_B_238; // 0x288(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse2; // 0x290(0x08)
	struct UStaticMeshComponent* SM_GoblinCrates_LG_Red_Metal_176; // 0x298(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Large_001_W4_272; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_GoblinCrates_Blue_LG_240; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Medium_003_W_LOD2_222; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Medium_001_W_144; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_GoblinCrates_small_metal_105; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_GoblinCrates_Red_Long_182; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_Goblin_Crates_Medium3_148; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_HM_GEN_Wardrobe_B_242; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Large_001_W2_142; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Chair_C29; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_GoblinCrates_Long_Old_Metal_262; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_HM_Bench_A_170; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_Goblin_Crates_Medium_Red_Metal_186; // 0x300(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Bench_Long_001_D_164; // 0x308(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Chair_C4_156; // 0x310(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Chair_C9_168; // 0x318(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Chair_C3_154; // 0x320(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Medium_B_134; // 0x328(0x08)
	struct UStaticMeshComponent* SM_Goblin_Crates_Medium_Old_Metal2_132; // 0x330(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse; // 0x338(0x08)
	struct UStaticMeshComponent* Collision; // 0x340(0x08)
	struct UStaticMeshComponent* SM_OVR_ChairWood_02_230; // 0x348(0x08)
	struct UStaticMeshComponent* SM_HW_L_BookStack_Medium_B_93; // 0x350(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_Desk2_236; // 0x358(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Chair_C16_212; // 0x360(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Chair_C17_214; // 0x368(0x08)
	struct UStaticMeshComponent* SM_Scales_226; // 0x370(0x08)
	struct UStaticMeshComponent* SM_GoblinCrates_Old_Long_111; // 0x378(0x08)
	struct UStaticMeshComponent* SM_HW_Frame_Diagram_A2; // 0x380(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Large_001_W3_252; // 0x388(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Large_002_W_246; // 0x390(0x08)
	struct UStaticMeshComponent* SM_GoblinCrates_Red_Long2_254; // 0x398(0x08)
	struct UStaticMeshComponent* SM_HM_Wardrobes_D_140; // 0x3a0(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Chair_C6_160; // 0x3a8(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Chair_C7_162; // 0x3b0(0x08)
	struct UStaticMeshComponent* SM_GoblinCrates_Blue_Long2_109; // 0x3b8(0x08)
	struct UStaticMeshComponent* SM_GoblinCrates_Blue_LG2_260; // 0x3c0(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Chair_C12_204; // 0x3c8(0x08)
	struct UStaticMeshComponent* SM_HW_Frame_Diagram_A1_298; // 0x3d0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Medium_003_W_LOD3_256; // 0x3d8(0x08)
	struct UStaticMeshComponent* SM_HM_Gladrags_Corner_Dresser2_232; // 0x3e0(0x08)
	struct UStaticMeshComponent* SM_GoblinCrates_Red_Long3_268; // 0x3e8(0x08)
	struct UStaticMeshComponent* SM_HW_L_BookStack_Medium_A5_196; // 0x3f0(0x08)
	struct UStaticMeshComponent* SM_HW_Toilet_293; // 0x3f8(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Chair_C11_202; // 0x400(0x08)
	struct UStaticMeshComponent* SM_Cairn_Vessel_E2_216; // 0x408(0x08)
	struct UStaticMeshComponent* SM_Goblin_Crates_Medium_Metal2_266; // 0x410(0x08)
	struct UStaticMeshComponent* SM_HW_HourGlass_D2_248; // 0x418(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Chair_C10_200; // 0x420(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Chair_C2_136; // 0x428(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Chair_C14_208; // 0x430(0x08)
	struct UStaticMeshComponent* SM_HW_L_BookStack_Medium_A4_194; // 0x438(0x08)
	struct USceneComponent* Scene; // 0x440(0x08)
	struct UAkAudioEvent* AkEvent; // 0x448(0x08)

	struct TArray<struct FTransfigurationResource> GetAdditionalItemsReturned(); // Function BP_Sanc_Trash_BoxPile_02A.BP_Sanc_Trash_BoxPile_02A_C.GetAdditionalItemsReturned // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	bool IsObjectContextValidForTransformation(); // Function BP_Sanc_Trash_BoxPile_02A.BP_Sanc_Trash_BoxPile_02A_C.IsObjectContextValidForTransformation // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	bool IsObjectContextValidForVanishment(); // Function BP_Sanc_Trash_BoxPile_02A.BP_Sanc_Trash_BoxPile_02A_C.IsObjectContextValidForVanishment // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void DeactivateObject(); // Function BP_Sanc_Trash_BoxPile_02A.BP_Sanc_Trash_BoxPile_02A_C.DeactivateObject // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void FinalizeInitialAnimationState(); // Function BP_Sanc_Trash_BoxPile_02A.BP_Sanc_Trash_BoxPile_02A_C.FinalizeInitialAnimationState // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ObjectConjured(); // Function BP_Sanc_Trash_BoxPile_02A.BP_Sanc_Trash_BoxPile_02A_C.ObjectConjured // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ObjectStreamedSpawnInConfirmed(); // Function BP_Sanc_Trash_BoxPile_02A.BP_Sanc_Trash_BoxPile_02A_C.ObjectStreamedSpawnInConfirmed // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ObjectTransformationCancelled(); // Function BP_Sanc_Trash_BoxPile_02A.BP_Sanc_Trash_BoxPile_02A_C.ObjectTransformationCancelled // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ObjectTransformationConfirmed(); // Function BP_Sanc_Trash_BoxPile_02A.BP_Sanc_Trash_BoxPile_02A_C.ObjectTransformationConfirmed // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ObjectTransformationStarted(); // Function BP_Sanc_Trash_BoxPile_02A.BP_Sanc_Trash_BoxPile_02A_C.ObjectTransformationStarted // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ObjectVanished(); // Function BP_Sanc_Trash_BoxPile_02A.BP_Sanc_Trash_BoxPile_02A_C.ObjectVanished // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ReactivateObject(); // Function BP_Sanc_Trash_BoxPile_02A.BP_Sanc_Trash_BoxPile_02A_C.ReactivateObject // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void ObjectPhysicalResponseImpact(float ImpactIntensity, struct FName SpellName, struct FName ResponseConfigName, struct FVector& ImpactLocation); // Function BP_Sanc_Trash_BoxPile_02A.BP_Sanc_Trash_BoxPile_02A_C.ObjectPhysicalResponseImpact // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_BP_Sanc_Trash_BoxPile_02A(int32_t EntryPoint); // Function BP_Sanc_Trash_BoxPile_02A.BP_Sanc_Trash_BoxPile_02A_C.ExecuteUbergraph_BP_Sanc_Trash_BoxPile_02A // (Final|UbergraphFunction|HasDefaults) // @ game+0x38a7480
};

