// BlueprintGeneratedClass BP_Sanc_HubArchway_01_Potnr.BP_Sanc_HubArchway_01_Potnr_C
// Size: 0x390 (Inherited: 0x2b8)
struct ABP_Sanc_HubArchway_01_Potnr_C : ABP_Sanc_HubArchway_01_Parent_C {
	struct UStaticMeshComponent* SM_Sanc_Alcove_01_Dwiz; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_Sanc_Alcove_01_Dwiz6; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_Sanc_Alcove_01_Dwiz5; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_Sanc_Alcove_01_Dwiz4; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_Sanc_Alcove_01_Dwiz2; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_Sanc_Alcove_01_Dwiz1; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_Sanc_StairsBase_01A_Potnr; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_Sanc_StairsBase_01B_Potnr; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_Sanc_Alcove_01_Dwiz7; // 0x2f8(0x08)
	struct USceneComponent* DefaultSceneRoot12; // 0x300(0x08)
	struct UDecalComponent* Decal1; // 0x308(0x08)
	struct UDecalComponent* Decal; // 0x310(0x08)
	struct UStaticMeshComponent* SM_Sanc_Column_02_Potnr; // 0x318(0x08)
	struct UStaticMeshComponent* SM_Sanc_Alcove_01_Dwiz3; // 0x320(0x08)
	struct UChildActorComponent* BP_Sanc_LightFixtureDownwardsDirectional_01_Potnr; // 0x328(0x08)
	struct UStaticMeshComponent* SM_Sanc_Alcove_01_Dwiz8; // 0x330(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x338(0x08)
	struct UStaticMeshComponent* SM_Sanc_Column_02_Potnr1; // 0x340(0x08)
	struct UChildActorComponent* BP_Sanc_LightFixtureOmniDirectional_01_Potnr1; // 0x348(0x08)
	struct UChildActorComponent* BP_Sanc_LightFixtureOmniDirectional_01_Potnr; // 0x350(0x08)
	struct UTransformationFxInfoComponent* TransformationFxInfo1; // 0x358(0x08)
	struct USceneComponent* DefaultSceneRoot7; // 0x360(0x08)
	struct USceneComponent* DefaultSceneRoot4; // 0x368(0x08)
	struct USceneComponent* Scene; // 0x370(0x08)
	struct USceneComponent* Scene1; // 0x378(0x08)
	struct USceneComponent* DefaultSceneRoot2; // 0x380(0x08)
	struct USceneComponent* DefaultSceneRoot1; // 0x388(0x08)
};

