// BlueprintGeneratedClass BP_StoragePile_Large_C.BP_StoragePile_Large_C_C
// Size: 0x310 (Inherited: 0x248)
struct ABP_StoragePile_Large_C_C : AActor {
	struct UChildActorComponent* BP_Int_BCProps_WoodPile_Large_001; // 0x248(0x08)
	struct UChildActorComponent* BP_Cav_DestructiblePot_01; // 0x250(0x08)
	struct UChildActorComponent* BP_Cav_DestructiblePot_02; // 0x258(0x08)
	struct UChildActorComponent* BP_Cav_DestructibleJug_02; // 0x260(0x08)
	struct UChildActorComponent* BP_Cav_DestructibleJug_01; // 0x268(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Hay_A3; // 0x270(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Hay_A2; // 0x278(0x08)
	struct UStaticMeshComponent* SM_BCProps_FoodBag_3bag_001; // 0x280(0x08)
	struct UStaticMeshComponent* SM_CastleDun_HayPile_A; // 0x288(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_CastleDun_HayPile_C; // 0x290(0x08)
	struct UStaticMeshComponent* SM_CastleDun_Kitchen_cage; // 0x298(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Medium_B; // 0x2a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_Barrel_001_W; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Barrel_Short_001_W; // 0x2b0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_Int_BCProps_Broom_001_W; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Large_001_W; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Medium_003_W; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Medium_A; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Medium_C; // 0x2d8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_Int_BCProps_FoodBag_1bag_001_W; // 0x2e0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_FoodBag_1bag_002_W; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Lantern_002; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_OpenCrate_Medium_001_W; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Large_002_W; // 0x300(0x08)
	struct USceneComponent* SharedRoot; // 0x308(0x08)
};

