// BlueprintGeneratedClass BP_Sanc_WallDecorationQuidditch_Dressing01.BP_Sanc_WallDecorationQuidditch_Dressing01_C
// Size: 0x378 (Inherited: 0x248)
struct ABP_Sanc_WallDecorationQuidditch_Dressing01_C : AActor {
	struct UStaticMeshComponent* SM_Sanc_WallPieceShelves_4; // 0x248(0x08)
	struct UStaticMeshComponent* SM_HM_Quidditch_TrophyLow_G8; // 0x250(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse13; // 0x258(0x08)
	struct UStaticMeshComponent* SM_HM_Quidditch_TrophyLow_G7; // 0x260(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse12; // 0x268(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse11; // 0x270(0x08)
	struct UStaticMeshComponent* SM_HM_Quidditch_TrophyLow_G5; // 0x278(0x08)
	struct UStaticMeshComponent* SM_HW_QuidditchPitch_SmallFlags_B2; // 0x280(0x08)
	struct UStaticMeshComponent* SM_HW_QuidditchPitch_SmallFlags_C2; // 0x288(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse20; // 0x290(0x08)
	struct UStaticMeshComponent* SM_HW_QuidditchPitch_SmallFlags_D2; // 0x298(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse18; // 0x2a0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse16; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_Sanc_WallPieceShelves_120; // 0x2b0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse17; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_Sanc_BeastBrush_01A2; // 0x2c0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse15; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_HM_Quidditch_TrophyLow_G3; // 0x2d0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse19; // 0x2d8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse14; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_BulletinA_111; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_BulletinA3; // 0x2f0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse9; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_BulletinA2; // 0x300(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse8; // 0x308(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse7; // 0x310(0x08)
	struct UStaticMeshComponent* SM_BulletinA5; // 0x318(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse4; // 0x320(0x08)
	struct UStaticMeshComponent* SM_BulletinA6; // 0x328(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse6; // 0x330(0x08)
	struct UStaticMeshComponent* SM_BulletinA4; // 0x338(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse5; // 0x340(0x08)
	struct UStaticMeshComponent* SM_BCProps_Eyelet_A4; // 0x348(0x08)
	struct UStaticMeshComponent* SM_HW_QuidditchPitch_SmallFlags_Stripe5; // 0x350(0x08)
	struct UStaticMeshComponent* SM_HW_QuidditchPitch_SmallFlags_Stripe6_135; // 0x358(0x08)
	struct UStaticMeshComponent* SM_BCProps_Eyelet_A2; // 0x360(0x08)
	struct UStaticMeshComponent* SM_BCProps_Eyelet_A3; // 0x368(0x08)
	struct USceneComponent* SceneRoot; // 0x370(0x08)
};

