// BlueprintGeneratedClass BP_Sanc_Bio_Bog_bogTree_Oak_LargeB_planted.BP_Sanc_Bio_Bog_bogTree_Oak_LargeB_planted_C
// Size: 0x2b8 (Inherited: 0x248)
struct ABP_Sanc_Bio_Bog_bogTree_Oak_LargeB_planted_C : AActor {
	struct UStaticMeshComponent* SM_BogTree_Oak_LargeB; // 0x248(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_41SM_BrackinFern_C; // 0x250(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_CaloceraFungus_01; // 0x258(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_155SM_Moss_Lush_Master; // 0x260(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_Pleurocybella_05; // 0x268(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_22SM_Pleurocybella_01; // 0x270(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_9SM_Pleurocybella_03; // 0x278(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_XeromphalinaClump_04; // 0x280(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_7SM_XeromphalinaClump_06; // 0x288(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_9SM_BeardMoss_C; // 0x290(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_BeardMoss_A; // 0x298(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_BeardMoss_B; // 0x2a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_14SM_BeardMoss_D; // 0x2a8(0x08)
	struct USceneComponent* SharedRoot; // 0x2b0(0x08)
};

