// BlueprintGeneratedClass BP_Sanc_Desk_01_Potnr_Dressing02.BP_Sanc_Desk_01_Potnr_Dressing02_C
// Size: 0x450 (Inherited: 0x248)
struct ABP_Sanc_Desk_01_Potnr_Dressing02_C : AActor {
	struct UStaticMeshComponent* SM_HM_PotionBottle8; // 0x248(0x08)
	struct UStaticMeshComponent* SM_Book_15; // 0x250(0x08)
	struct UStaticMeshComponent* SM_Book_14; // 0x258(0x08)
	struct UStaticMeshComponent* SM_Book_05; // 0x260(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_Rolled_Parchment_G5; // 0x268(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse52; // 0x270(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle27; // 0x278(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse58; // 0x280(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle2; // 0x288(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse47; // 0x290(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle11; // 0x298(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse50; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle7; // 0x2a8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse49; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle12; // 0x2b8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse48; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_HW_L_BookStack_Small_D; // 0x2c8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse46; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_HM_Paper_E; // 0x2d8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse45; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_HM_Paper_F; // 0x2e8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse44; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle9; // 0x2f8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse43; // 0x300(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_InkBottles_F; // 0x308(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse42; // 0x310(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_InkBottles_E; // 0x318(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse41; // 0x320(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_InkBottles_D; // 0x328(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse40; // 0x330(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_InkBottles_A; // 0x338(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse39; // 0x340(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_InkBottles_B; // 0x348(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse38; // 0x350(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse60; // 0x358(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse37; // 0x360(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle26; // 0x368(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse25; // 0x370(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle5; // 0x378(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse24; // 0x380(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle13; // 0x388(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse23; // 0x390(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle22; // 0x398(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse22; // 0x3a0(0x08)
	struct UStaticMeshComponent* SM_HW_OpenBook_A; // 0x3a8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse53; // 0x3b0(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle23; // 0x3b8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse21; // 0x3c0(0x08)
	struct UStaticMeshComponent* SM_HW_LetterBundle_A; // 0x3c8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse16; // 0x3d0(0x08)
	struct UStaticMeshComponent* SM_Book_11; // 0x3d8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse15; // 0x3e0(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle24; // 0x3e8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse20; // 0x3f0(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle6; // 0x3f8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse11; // 0x400(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle14; // 0x408(0x08)
	struct UStaticMeshComponent* SM_CastleDun_GOB_Scales_C; // 0x410(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse12; // 0x418(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle3; // 0x420(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse9; // 0x428(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle10; // 0x430(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse8; // 0x438(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse10; // 0x440(0x08)
	struct USceneComponent* SceneRoot; // 0x448(0x08)
};

