// BlueprintGeneratedClass BP_Sanc_InsetTundra_01A.BP_Sanc_InsetTundra_01A_C
// Size: 0x2f8 (Inherited: 0x248)
struct ABP_Sanc_InsetTundra_01A_C : AActor {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x248(0x08)
	struct UStaticMeshComponent* SM_Sanc_TerrariumGrasslandInset_01A; // 0x250(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Cairn_StoneStand; // 0x258(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_TundraScrubWillow_A; // 0x260(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_Lavender_B; // 0x268(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_NoddingViolet_A; // 0x270(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_Sanc_Bio_Glnd_Heather_01_A; // 0x278(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_Gorse_Master_C_Fall; // 0x280(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_7SM_Sanc_Bio_DressingDecal_Medium_01A; // 0x288(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_OL_Rock_Md_Light_A; // 0x290(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_8SM_CliffTop_Med_D; // 0x298(0x08)
	struct UStaticMeshComponent* SM_BP_Sanc_InsetTundra_01A_Grass_Merged_01; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_BP_Sanc_InsetTundra_01A_Pebbles_Merged_01; // 0x2a8(0x08)
	struct UParticleSystemComponent* P_Bees; // 0x2b0(0x08)
	struct UParticleSystemComponent* P_AMB_Butterflies_Red_Groups; // 0x2b8(0x08)
	struct UParticleSystemComponent* Pollen; // 0x2c0(0x08)
	struct UParticleSystemComponent* ParticleSystem1; // 0x2c8(0x08)
	struct UParticleSystemComponent* P_Flies_White1; // 0x2d0(0x08)
	struct UParticleSystemComponent* P_Flies_White; // 0x2d8(0x08)
	struct UOdcAuthoredObstacleSetupComponent* OdcAuthoredObstacleSetup; // 0x2e0(0x08)
	struct UOdcObstacleComponent* OdcObstacle; // 0x2e8(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x2f0(0x08)

	void ReceiveBeginPlay(); // Function BP_Sanc_InsetTundra_01A.BP_Sanc_InsetTundra_01A_C.ReceiveBeginPlay // (Event|Protected|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_BP_Sanc_InsetTundra_01A(int32_t EntryPoint); // Function BP_Sanc_InsetTundra_01A.BP_Sanc_InsetTundra_01A_C.ExecuteUbergraph_BP_Sanc_InsetTundra_01A // (Final|UbergraphFunction|HasDefaults) // @ game+0x38a7480
};

