// BlueprintGeneratedClass BP_Stove_B2_Preset1.BP_Stove_B2_Preset1_C
// Size: 0x318 (Inherited: 0x288)
struct ABP_Stove_B2_Preset1_C : ABP_StirCrazy_Master_Preset_C {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x288(0x08)
	struct UDecalComponent* Decal; // 0x290(0x08)
	struct UDecalComponent* Decal1; // 0x298(0x08)
	struct UStaticMeshComponent* SM_Stove_B2_Preset1_TeaPotsAndBooks; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_Stove_B2_Preset1_Food; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_Stove_B2_Preset1_PotsAndBottles; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_BCProps_Wood_Chopped_Single_T1; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_BCProps_Wood_Chopped_Single_U; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_BCProps_Wood_Chopped_Single_T; // 0x2c8(0x08)
	struct UPointLightComponent* PointLight; // 0x2d0(0x08)
	struct UParticleSystemComponent* P_Candleflame1; // 0x2d8(0x08)
	struct UParticleSystemComponent* P_Candleflame; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_CandleGroup_Fat_F; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_HM_Cauldron_Ladles_B; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_Int_CastleDun_Kitchen_Ladle_B; // 0x2f8(0x08)
	struct USkeletalMeshComponent* SK_WE_StirCrazy_potD; // 0x300(0x08)
	struct UChildActorComponent* ChildActor3; // 0x308(0x08)
	struct UChildActorComponent* ChildActor1; // 0x310(0x08)

	void ReceiveBeginPlay(); // Function BP_Stove_B2_Preset1.BP_Stove_B2_Preset1_C.ReceiveBeginPlay // (Event|Protected|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_BP_Stove_B2_Preset1(int32_t EntryPoint); // Function BP_Stove_B2_Preset1.BP_Stove_B2_Preset1_C.ExecuteUbergraph_BP_Stove_B2_Preset1 // (Final|UbergraphFunction) // @ game+0x38a7480
};

