// BlueprintGeneratedClass BP_Sanc_Trash_3m_04A_Static.BP_Sanc_Trash_3m_04A_Static_C
// Size: 0x468 (Inherited: 0x248)
struct ABP_Sanc_Trash_3m_04A_Static_C : AActor {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x248(0x08)
	struct UStaticMeshComponent* SM_HM_OwlPost_Package_S4; // 0x250(0x08)
	struct UStaticMeshComponent* SM_HW_L_Book_Medium_C4; // 0x258(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse5; // 0x260(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse4; // 0x268(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_Rolled_Parchment_Pile_A; // 0x270(0x08)
	struct UStaticMeshComponent* SM_HW_L_Book_Medium_A1; // 0x278(0x08)
	struct UStaticMeshComponent* SM_HW_L_Book_Medium_C1; // 0x280(0x08)
	struct UStaticMeshComponent* SM_HW_L_Book_Medium_C2; // 0x288(0x08)
	struct UStaticMeshComponent* SM_HW_L_Book_Medium_C3; // 0x290(0x08)
	struct UStaticMeshComponent* Parchment1; // 0x298(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse3; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_Rolled_Parchment_Pile_A1; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_HW_L_Book_Medium_C6; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_HW_L_Book_Medium_C5; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_HM_OwlPost_Package_S; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_HM_OwlPost_Package_C2; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_HM_OwlPost_Package_S2; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_HM_OwlPost_Package_C; // 0x2d8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse2; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_HM_OwlPost_Package_S3; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_HM_OwlPost_Package_C1; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_HM_OwlPost_Package_S1; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_HM_OwlPost_Package_C3; // 0x300(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse1; // 0x308(0x08)
	struct UStaticMeshComponent* Blackboard; // 0x310(0x08)
	struct UStaticMeshComponent* HangingCloth; // 0x318(0x08)
	struct UPhysicalResponseComponent* MainPhysicalResponse8; // 0x320(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse27; // 0x328(0x08)
	struct UStaticMeshComponent* LongDrawer4; // 0x330(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse29; // 0x338(0x08)
	struct UStaticMeshComponent* ShortDrawer3; // 0x340(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse28; // 0x348(0x08)
	struct UStaticMeshComponent* SM_HW_L_Book_Small_A; // 0x350(0x08)
	struct UStaticMeshComponent* SM_HW_L_BookRow_Half_C; // 0x358(0x08)
	struct UStaticMeshComponent* ShortDrawer4; // 0x360(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse26; // 0x368(0x08)
	struct UStaticMeshComponent* LongDrawer2; // 0x370(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse25; // 0x378(0x08)
	struct UStaticMeshComponent* LongDrawer1; // 0x380(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse24; // 0x388(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse23; // 0x390(0x08)
	struct UStaticMeshComponent* SM_HW_L_BookRow_Half_D; // 0x398(0x08)
	struct UStaticMeshComponent* SM_HW_L_Book_Medium_A; // 0x3a0(0x08)
	struct UStaticMeshComponent* ShortDrawer2; // 0x3a8(0x08)
	struct UStaticMeshComponent* ShortDrawer5; // 0x3b0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse22; // 0x3b8(0x08)
	struct UStaticMeshComponent* LongDrawer3; // 0x3c0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse21; // 0x3c8(0x08)
	struct UStaticMeshComponent* ShortDrawer1; // 0x3d0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse20; // 0x3d8(0x08)
	struct UStaticMeshComponent* ShortDrawer; // 0x3e0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse19; // 0x3e8(0x08)
	struct UStaticMeshComponent* LongDrawer; // 0x3f0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse18; // 0x3f8(0x08)
	struct UStaticMeshComponent* HourGlass; // 0x400(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse; // 0x408(0x08)
	struct UBoxComponent* BoxCollision; // 0x410(0x08)
	struct UStaticMeshComponent* SM_HW_L_BookRow_Half_D1; // 0x418(0x08)
	struct UStaticMeshComponent* SM_HW_L_BookRow_Small_E; // 0x420(0x08)
	struct UStaticMeshComponent* SM_GoblinCrates_Small_Metal1; // 0x428(0x08)
	struct UStaticMeshComponent* SM_GoblinCrates_small_metal; // 0x430(0x08)
	struct UStaticMeshComponent* SM_HW_L_Book_Medium_C; // 0x438(0x08)
	struct UStaticMeshComponent* SideTable; // 0x440(0x08)
	struct UStaticMeshComponent* FloorCloth; // 0x448(0x08)
	struct UStaticMeshComponent* Dresser; // 0x450(0x08)
	struct USceneComponent* Scene; // 0x458(0x08)
	struct UAkAudioEvent* AkEvent; // 0x460(0x08)

	struct TArray<struct FTransfigurationResource> GetAdditionalItemsReturned(); // Function BP_Sanc_Trash_3m_04A_Static.BP_Sanc_Trash_3m_04A_Static_C.GetAdditionalItemsReturned // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	bool IsObjectContextValidForTransformation(); // Function BP_Sanc_Trash_3m_04A_Static.BP_Sanc_Trash_3m_04A_Static_C.IsObjectContextValidForTransformation // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	bool IsObjectContextValidForVanishment(); // Function BP_Sanc_Trash_3m_04A_Static.BP_Sanc_Trash_3m_04A_Static_C.IsObjectContextValidForVanishment // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void DeactivateObject(); // Function BP_Sanc_Trash_3m_04A_Static.BP_Sanc_Trash_3m_04A_Static_C.DeactivateObject // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void FinalizeInitialAnimationState(); // Function BP_Sanc_Trash_3m_04A_Static.BP_Sanc_Trash_3m_04A_Static_C.FinalizeInitialAnimationState // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ObjectConjured(); // Function BP_Sanc_Trash_3m_04A_Static.BP_Sanc_Trash_3m_04A_Static_C.ObjectConjured // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ObjectStreamedSpawnInConfirmed(); // Function BP_Sanc_Trash_3m_04A_Static.BP_Sanc_Trash_3m_04A_Static_C.ObjectStreamedSpawnInConfirmed // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ObjectTransformationCancelled(); // Function BP_Sanc_Trash_3m_04A_Static.BP_Sanc_Trash_3m_04A_Static_C.ObjectTransformationCancelled // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ObjectTransformationConfirmed(); // Function BP_Sanc_Trash_3m_04A_Static.BP_Sanc_Trash_3m_04A_Static_C.ObjectTransformationConfirmed // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ObjectTransformationStarted(); // Function BP_Sanc_Trash_3m_04A_Static.BP_Sanc_Trash_3m_04A_Static_C.ObjectTransformationStarted // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ObjectVanished(); // Function BP_Sanc_Trash_3m_04A_Static.BP_Sanc_Trash_3m_04A_Static_C.ObjectVanished // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ReactivateObject(); // Function BP_Sanc_Trash_3m_04A_Static.BP_Sanc_Trash_3m_04A_Static_C.ReactivateObject // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void ObjectPhysicalResponseImpact(float ImpactIntensity, struct FName SpellName, struct FName ResponseConfigName, struct FVector& ImpactLocation); // Function BP_Sanc_Trash_3m_04A_Static.BP_Sanc_Trash_3m_04A_Static_C.ObjectPhysicalResponseImpact // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_BP_Sanc_Trash_3m_04A_Static(int32_t EntryPoint); // Function BP_Sanc_Trash_3m_04A_Static.BP_Sanc_Trash_3m_04A_Static_C.ExecuteUbergraph_BP_Sanc_Trash_3m_04A_Static // (Final|UbergraphFunction|HasDefaults) // @ game+0x38a7480
};

