// BlueprintGeneratedClass BP_Sanc_Trash_BoxPile_03A.BP_Sanc_Trash_BoxPile_03A_C
// Size: 0x540 (Inherited: 0x248)
struct ABP_Sanc_Trash_BoxPile_03A_C : AActor {
	struct UStaticMeshComponent* Collision; // 0x248(0x08)
	struct UStaticMeshComponent* SM_GoblinCrates_Red_Long5; // 0x250(0x08)
	struct UStaticMeshComponent* SM_GoblinCrates_Red_Long4; // 0x258(0x08)
	struct UStaticMeshComponent* SM_Goblin_Crates_Old_Medium_135; // 0x260(0x08)
	struct UStaticMeshComponent* SM_HW_Birdcage_Round2_33; // 0x268(0x08)
	struct UStaticMeshComponent* SM_Goblin_Crates_Medium_Metal3; // 0x270(0x08)
	struct UStaticMeshComponent* SM_HM_GEN_Chair_E1; // 0x278(0x08)
	struct UStaticMeshComponent* SM_HW_L_BookStack_Medium_A5_2; // 0x280(0x08)
	struct UStaticMeshComponent* SM_HW_GenericTrunk_C_49; // 0x288(0x08)
	struct UStaticMeshComponent* SM_Goblin_Crates_Medium_Old_Metal1; // 0x290(0x08)
	struct UStaticMeshComponent* SM_HW_GenericTrunk_B_63; // 0x298(0x08)
	struct UStaticMeshComponent* SM_GoblinCrates_Blue_Long3; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Medium_B1; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Medium_C; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_GoblinCrates_Blue_Long7; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_Goblin_Crates_Medium_Old_Metal3; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_GoblinCrates_Small_Metal1; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Medium_C2; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_HW_Telescope_C; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Chair_C4; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_HW_L_BookStack_Medium_B1; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Bellows_002_W3; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_Goblin_Crates_Medium4; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Large_001_W_122; // 0x300(0x08)
	struct UStaticMeshComponent* SM_GoblinCrates_LG_metal1; // 0x308(0x08)
	struct UStaticMeshComponent* SM_HM_Gladrags_Corner_Dresser1; // 0x310(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Chair_C9; // 0x318(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Chair_C8; // 0x320(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Chair_C7; // 0x328(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Chair_C6; // 0x330(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Chair_C5; // 0x338(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Bench_Long_001_D1; // 0x340(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Chair_C3; // 0x348(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Chair_C2; // 0x350(0x08)
	struct UStaticMeshComponent* SM_HM_Bench_A1; // 0x358(0x08)
	struct UStaticMeshComponent* SM_GoblinCrates_Blue_Long1; // 0x360(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Medium_002_W2; // 0x368(0x08)
	struct UStaticMeshComponent* SM_GoblinCrates_LG_Red_Metal1; // 0x370(0x08)
	struct UStaticMeshComponent* SM_HM_2Hand_Cabinet1; // 0x378(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Large_001_W4; // 0x380(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Large_001_W3; // 0x388(0x08)
	struct UStaticMeshComponent* SM_Goblin_Crates_Medium_Blue_Metal1; // 0x390(0x08)
	struct UStaticMeshComponent* SM_GoblinCrates_LG_Red_Metal2; // 0x398(0x08)
	struct UStaticMeshComponent* SM_Goblin_Crates_Medium_Red_Metal1; // 0x3a0(0x08)
	struct UStaticMeshComponent* SM_GoblinCrates_Small_Blue_Metal1; // 0x3a8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Medium_002_W; // 0x3b0(0x08)
	struct UStaticMeshComponent* SM_HM_Wardrobes_D1; // 0x3b8(0x08)
	struct UStaticMeshComponent* SM_HW_L_BookStack_Medium_A8; // 0x3c0(0x08)
	struct UStaticMeshComponent* SM_HW_L_BookStack_Medium_A3; // 0x3c8(0x08)
	struct UStaticMeshComponent* SM_BCProps_CloseCrate_Medium_D1; // 0x3d0(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Chair_C31; // 0x3d8(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Chair_C30; // 0x3e0(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Chair_C11; // 0x3e8(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Chair_C10; // 0x3f0(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Chair_C29; // 0x3f8(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Chair_C12; // 0x400(0x08)
	struct UStaticMeshComponent* SM_Cairn_Vessel_E3; // 0x408(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Large_001_W2; // 0x410(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Medium_A; // 0x418(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Medium_003_W_LOD5; // 0x420(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Medium_003_W_LOD3; // 0x428(0x08)
	struct UStaticMeshComponent* SM_HW_Scrolls_C_18; // 0x430(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Medium_001_W_107; // 0x438(0x08)
	struct UStaticMeshComponent* SM_HW_Scale_A3; // 0x440(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Medium_001_W_103; // 0x448(0x08)
	struct UStaticMeshComponent* SM_Scales_4; // 0x450(0x08)
	struct UStaticMeshComponent* SM_HM_Quidditch_Shelves_F_130; // 0x458(0x08)
	struct UStaticMeshComponent* SM_OVR_ChairWood_03; // 0x460(0x08)
	struct UStaticMeshComponent* SM_GoblinCrates_Old_Long3; // 0x468(0x08)
	struct UStaticMeshComponent* SM_HW_Globe_A_52; // 0x470(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_Desk2; // 0x478(0x08)
	struct UStaticMeshComponent* SM_HW_Scrolls_B_15; // 0x480(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_Shelf_B1; // 0x488(0x08)
	struct UStaticMeshComponent* SM_GoblinCrates_Blue_LG1; // 0x490(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Medium_C_127; // 0x498(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Medium_C_125; // 0x4a0(0x08)
	struct UStaticMeshComponent* SM_HM_GEN_Wardrobe_B1; // 0x4a8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_OpenCrate_Small_002_W_LOD_148; // 0x4b0(0x08)
	struct UStaticMeshComponent* SM_HW_HourGlass_D3; // 0x4b8(0x08)
	struct UStaticMeshComponent* SM_GoblinCrates_LG_Old_Metal1; // 0x4c0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Large_001_W1; // 0x4c8(0x08)
	struct UStaticMeshComponent* SM_GoblinCrates_Red_Long1; // 0x4d0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_BroomStand_001_W2; // 0x4d8(0x08)
	struct UStaticMeshComponent* SM_HW_L_Book_Small_A_5; // 0x4e0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Medium_003_W_LOD1; // 0x4e8(0x08)
	struct UStaticMeshComponent* SM_HW_L_BookStack_Small_D1; // 0x4f0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Large_002_W_120; // 0x4f8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Medium_C_111; // 0x500(0x08)
	struct UStaticMeshComponent* SM_HW_L_BookStack_Small_D2_8; // 0x508(0x08)
	struct UStaticMeshComponent* SM_GoblinCrates_Blue_LG3; // 0x510(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Large_001_W_114; // 0x518(0x08)
	struct UStaticMeshComponent* SM_GoblinCrates_Long_Old_Metal1; // 0x520(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Large_001_W_116; // 0x528(0x08)
	struct UStaticMeshComponent* SM_GoblinCrates_LG1; // 0x530(0x08)
	struct USceneComponent* Scene; // 0x538(0x08)
};

