// BlueprintGeneratedClass BP_Sanc_ScrollsPaperPopulation_03.BP_Sanc_ScrollsPaperPopulation_03_C
// Size: 0x2a0 (Inherited: 0x248)
struct ABP_Sanc_ScrollsPaperPopulation_03_C : AActor {
	struct UStaticMeshComponent* SM_HW_LetterCluster_F1; // 0x248(0x08)
	struct UStaticMeshComponent* SM_HW_LetterCluster_D1; // 0x250(0x08)
	struct UStaticMeshComponent* SM_HW_LetterCluster_B1; // 0x258(0x08)
	struct UStaticMeshComponent* SM_HW_LetterCluster_C; // 0x260(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_Rolled_Parchment_B1; // 0x268(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_Rolled_Parchment_Pile_A1; // 0x270(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_Rolled_Parchment_Pile_B1; // 0x278(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_Rolled_Parchment_Pile_C1; // 0x280(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_Rolled_Parchment_Pile_D1; // 0x288(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_Rolled_Parchment_Pile_E1; // 0x290(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x298(0x08)
};

