// BlueprintGeneratedClass BP_Stove_A_Preset3.BP_Stove_A_Preset3_C
// Size: 0x318 (Inherited: 0x288)
struct ABP_Stove_A_Preset3_C : ABP_StirCrazy_Master_Preset_C {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x288(0x08)
	struct UStaticMeshComponent* SM_Stove_A_Preset3_Food; // 0x290(0x08)
	struct UStaticMeshComponent* SM_BCProps_Wood_Chopped_Small_001; // 0x298(0x08)
	struct UPointLightComponent* PointLight; // 0x2a0(0x08)
	struct UParticleSystemComponent* P_Candleflame; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_Candle_Skinny_E; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_HM_Candlestick_A; // 0x2b8(0x08)
	struct UDecalComponent* Decal3; // 0x2c0(0x08)
	struct UDecalComponent* Decal1; // 0x2c8(0x08)
	struct UDecalComponent* Decal; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_HangingProps_Plants_004_W; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Fork_001; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_PotionSpoon; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CookingPot_001; // 0x2f0(0x08)
	struct USkeletalMeshComponent* SK_Herb_Basket; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_HangingProps_Plants_002_W; // 0x300(0x08)
	struct UChildActorComponent* ChildActor2; // 0x308(0x08)
	struct UChildActorComponent* ChildActor; // 0x310(0x08)

	void ReceiveBeginPlay(); // Function BP_Stove_A_Preset3.BP_Stove_A_Preset3_C.ReceiveBeginPlay // (Event|Protected|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_BP_Stove_A_Preset3(int32_t EntryPoint); // Function BP_Stove_A_Preset3.BP_Stove_A_Preset3_C.ExecuteUbergraph_BP_Stove_A_Preset3 // (Final|UbergraphFunction) // @ game+0x38a7480
};

