// BlueprintGeneratedClass BP_Sanc_ScrollsPaperPopulation_01.BP_Sanc_ScrollsPaperPopulation_01_C
// Size: 0x2a8 (Inherited: 0x248)
struct ABP_Sanc_ScrollsPaperPopulation_01_C : AActor {
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_Quill_Rolled_Parchment_Pile_E1; // 0x248(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_Quill_Rolled_Parchment_G1; // 0x250(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_Rolled_Parchment_Pile_D; // 0x258(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_Rolled_Parchment_Pile_C; // 0x260(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_Rolled_Parchment_Pile_B; // 0x268(0x08)
	struct UStaticMeshComponent* SM_HW_LetterCluster_F; // 0x270(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_Rolled_Parchment_Pile_A; // 0x278(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HW_LetterCluster_E1; // 0x280(0x08)
	struct UStaticMeshComponent* SM_HW_LetterCluster_C1; // 0x288(0x08)
	struct UStaticMeshComponent* SM_HW_LetterCluster_B; // 0x290(0x08)
	struct UStaticMeshComponent* SM_HW_LetterCluster_D; // 0x298(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x2a0(0x08)
};

