// BlueprintGeneratedClass BP_Sanc_Cabinet_Potnr_Dressing01.BP_Sanc_Cabinet_Potnr_Dressing01_C
// Size: 0x3c0 (Inherited: 0x248)
struct ABP_Sanc_Cabinet_Potnr_Dressing01_C : AActor {
	struct UPhysicalResponseComponent* PhysicalResponse43; // 0x248(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse15; // 0x250(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse21; // 0x258(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse27; // 0x260(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse28; // 0x268(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse29; // 0x270(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse30; // 0x278(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse31; // 0x280(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse14; // 0x288(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse46; // 0x290(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse33; // 0x298(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse34; // 0x2a0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse35; // 0x2a8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse36; // 0x2b0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse37; // 0x2b8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse38; // 0x2c0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse39; // 0x2c8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse32; // 0x2d0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse40; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle18; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle12_31; // 0x2e8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse62; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle7; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle11_28; // 0x300(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse48; // 0x308(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle15_38; // 0x310(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse49; // 0x318(0x08)
	struct UStaticMeshComponent* SM_HW_LetterBundle_A4_25; // 0x320(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_Rolled_Parchment_Pile_B_90; // 0x328(0x08)
	struct UStaticMeshComponent* SM_CastleDun_GOB_MagnifyingDevice_C2_108; // 0x330(0x08)
	struct UStaticMeshComponent* SM_Sanc_PestleMortar_01A_78; // 0x338(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Jars_A; // 0x340(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Jars_D; // 0x348(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle17; // 0x350(0x08)
	struct UStaticMeshComponent* SM_Potion_55; // 0x358(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Jars_C; // 0x360(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Jars_E2; // 0x368(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle16; // 0x370(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle19; // 0x378(0x08)
	struct UStaticMeshComponent* SM_Potion_58; // 0x380(0x08)
	struct UStaticMeshComponent* SM_Potion_01_98; // 0x388(0x08)
	struct UStaticMeshComponent* SM_Potion_05_101; // 0x390(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle6; // 0x398(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_Rolled_Parchment_Pile_D_46; // 0x3a0(0x08)
	struct UStaticMeshComponent* SM_HM_Paper_E2; // 0x3a8(0x08)
	struct UStaticMeshComponent* SM_HM_Paper_E_75; // 0x3b0(0x08)
	struct USceneComponent* SceneRoot; // 0x3b8(0x08)
};

