// BlueprintGeneratedClass BP_Sanc_TerrariumForestStart_Potnr_Dressing04.BP_Sanc_TerrariumForestStart_Potnr_Dressing04_C
// Size: 0x2e0 (Inherited: 0x248)
struct ABP_Sanc_TerrariumForestStart_Potnr_Dressing04_C : AActor {
	struct UPhysicalResponseComponent* PhysicalResponse93; // 0x248(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse101; // 0x250(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse99; // 0x258(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse98; // 0x260(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse97; // 0x268(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse96; // 0x270(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse94; // 0x278(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse91; // 0x280(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse86; // 0x288(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Bottle_D5; // 0x290(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle22; // 0x298(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Jars_B4; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Bottle_D4; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle52; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle21; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Jars_D1; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_Rolled_Parchment_Pile_E2; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle18; // 0x2d0(0x08)
	struct USceneComponent* SceneRoot; // 0x2d8(0x08)
};

