// BlueprintGeneratedClass BP_ST_GenericCrateStack_A.BP_ST_GenericCrateStack_A_C
// Size: 0x368 (Inherited: 0x2d0)
struct ABP_ST_GenericCrateStack_A_C : ABP_SendTargetCluster_C {
	struct UObjectStateComponent* ObjectState; // 0x2d0(0x08)
	struct UChildActorComponent* BP_Int_BCProps_OpenCrate_Small_001; // 0x2d8(0x08)
	struct UChildActorComponent* BP_Int_BCProps_CloseCrate_Medium_002; // 0x2e0(0x08)
	struct UChildActorComponent* BP_Int_BCProps_CloseCrate_Large_001_W; // 0x2e8(0x08)
	struct UChildActorComponent* BP_Int_BCProps_CloseCrate_Medium_001; // 0x2f0(0x08)
	struct UChildActorComponent* BP_Int_BCProps_CloseCrate_Large_002; // 0x2f8(0x08)
	struct UChildActorComponent* BP_Prop_Barrel_Breakable_C; // 0x300(0x08)
	struct UOdcAuthoredObstacleSetupComponent* OdcAuthoredObstacleSetup1; // 0x308(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Medium_B1; // 0x310(0x08)
	struct UStaticMeshComponent* SM_CampB_2m_PlankC2; // 0x318(0x08)
	struct UStaticMeshComponent* SM_CampB_2m_PlankC1; // 0x320(0x08)
	struct UStaticMeshComponent* SM_CampB_2m_PlankD; // 0x328(0x08)
	struct UStaticMeshComponent* SM_CampB_2m_PlankC; // 0x330(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Bottle_003; // 0x338(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_HangingProps_Bags_006_F; // 0x340(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Broom_001_W; // 0x348(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Medium_B; // 0x350(0x08)
	struct UStaticMeshComponent* SM_GoblinCrates_Small_Blue_Metal; // 0x358(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Cauldron_001; // 0x360(0x08)
};

