// BlueprintGeneratedClass BP_Stove_Tea_Preset2.BP_Stove_Tea_Preset2_C
// Size: 0x2c8 (Inherited: 0x288)
struct ABP_Stove_Tea_Preset2_C : ABP_StirCrazy_Master_Preset_C {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x288(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Knife_001; // 0x290(0x08)
	struct UStaticMeshComponent* SM_HM_Neep_PlantF_Pea_Bunch; // 0x298(0x08)
	struct UStaticMeshComponent* SM_OVR_Kitchenware_item_E2; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_OVR_Kitchenware_item_E1; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_OVR_Kitchenware_item_E; // 0x2b0(0x08)
	struct UDecalComponent* Decal; // 0x2b8(0x08)
	struct UChildActorComponent* ChildActor3; // 0x2c0(0x08)

	void ReceiveBeginPlay(); // Function BP_Stove_Tea_Preset2.BP_Stove_Tea_Preset2_C.ReceiveBeginPlay // (Event|Protected|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_BP_Stove_Tea_Preset2(int32_t EntryPoint); // Function BP_Stove_Tea_Preset2.BP_Stove_Tea_Preset2_C.ExecuteUbergraph_BP_Stove_Tea_Preset2 // (Final|UbergraphFunction) // @ game+0x38a7480
};

