// BlueprintGeneratedClass BP_Sanc_Alcove_02_Parent.BP_Sanc_Alcove_02_Parent_C
// Size: 0x308 (Inherited: 0x2a8)
struct ABP_Sanc_Alcove_02_Parent_C : ATransfigurationStructureBase {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2a8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse; // 0x2b0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse1; // 0x2b8(0x08)
	struct USceneComponent* Alcove_Plinth; // 0x2c0(0x08)
	struct USceneComponent* Alcove_Statue; // 0x2c8(0x08)
	struct USceneComponent* Alcove_Base_R; // 0x2d0(0x08)
	struct USceneComponent* Alcove_Base_L; // 0x2d8(0x08)
	struct USceneComponent* Alcove_Arch_R; // 0x2e0(0x08)
	struct USceneComponent* Alcove_Arch_L; // 0x2e8(0x08)
	struct UOdcAuthoredObstacleSetupComponent* OdcAuthoredObstacleSetup; // 0x2f0(0x08)
	struct UOdcObstacleComponent* OdcObstacle; // 0x2f8(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x300(0x08)

	void ReceiveBeginPlay(); // Function BP_Sanc_Alcove_02_Parent.BP_Sanc_Alcove_02_Parent_C.ReceiveBeginPlay // (Event|Protected|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_BP_Sanc_Alcove_02_Parent(int32_t EntryPoint); // Function BP_Sanc_Alcove_02_Parent.BP_Sanc_Alcove_02_Parent_C.ExecuteUbergraph_BP_Sanc_Alcove_02_Parent // (Final|UbergraphFunction|HasDefaults) // @ game+0x38a7480
};

