// BlueprintGeneratedClass BP_Sanc_TerrariumForestStart_Potnr_Dressing01.BP_Sanc_TerrariumForestStart_Potnr_Dressing01_C
// Size: 0x2f0 (Inherited: 0x248)
struct ABP_Sanc_TerrariumForestStart_Potnr_Dressing01_C : AActor {
	struct UPhysicalResponseComponent* PhysicalResponse211; // 0x248(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse23; // 0x250(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse60; // 0x258(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse55; // 0x260(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse56; // 0x268(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse39; // 0x270(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse22; // 0x278(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse57; // 0x280(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse7; // 0x288(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse59; // 0x290(0x08)
	struct UStaticMeshComponent* SM_HW_L_New_Book_Large_C; // 0x298(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Jars_D; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle51; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle4; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_Sanc_L_BookRow_Half_A; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_Sanc_L_BookRow_Half_D2; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_HW_L_New_Book_A; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_HW_L_New_Book_Large_B; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle10; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Bottle_C1; // 0x2e0(0x08)
	struct USceneComponent* SceneRoot; // 0x2e8(0x08)
};

