// BlueprintGeneratedClass BP_Sanc_GlndStreamingTunnelStairs_01.BP_Sanc_GlndStreamingTunnelStairs_01_C
// Size: 0x2e0 (Inherited: 0x248)
struct ABP_Sanc_GlndStreamingTunnelStairs_01_C : AActor {
	struct UStaticMeshComponent* Cube; // 0x248(0x08)
	struct UStaticMeshComponent* SM_Cairn_MainHall_RoofTrim_A_2; // 0x250(0x08)
	struct UStaticMeshComponent* SM_Cairn_RockDebris01; // 0x258(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Cairn_SideHall_Roof_A_2; // 0x260(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Cairn_StoneDebris10; // 0x268(0x08)
	struct UStaticMeshComponent* SM_Cairn_StoneDebris05; // 0x270(0x08)
	struct UStaticMeshComponent* SM_Cairn_StoneDebris08; // 0x278(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_Cairn_SideHall_Roof_B_2; // 0x280(0x08)
	struct UStaticMeshComponent* SM_Cairn_SideHall_Roof_C_2; // 0x288(0x08)
	struct UStaticMeshComponent* SM_Cairn_Column_SideHall_C; // 0x290(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Cairn_Wall_SideHall_B; // 0x298(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Cairn_smallPuzzleStone_B_2; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_Cairn_StoneDebris09; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_Cairn_Column_SideHall_A; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_Cairn_StoneDebris12; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_Cairn_StoneDebris03; // 0x2c0(0x08)
	struct USceneComponent* Scene; // 0x2c8(0x08)
	struct USceneComponent* DefaultSceneRoot1; // 0x2d0(0x08)
	struct USceneComponent* SharedRoot; // 0x2d8(0x08)
};

