// BlueprintGeneratedClass BP_StoragePile_Large_E.BP_StoragePile_Large_E_C
// Size: 0x390 (Inherited: 0x248)
struct ABP_StoragePile_Large_E_C : AActor {
	struct UChildActorComponent* BP_Prop_Barrel_Breakable_B1; // 0x248(0x08)
	struct UChildActorComponent* BP_Prop_Barrel_Breakable_B; // 0x250(0x08)
	struct UChildActorComponent* BP_Int_BCProps_CloseCrate_Small_002; // 0x258(0x08)
	struct UChildActorComponent* BP_Int_BCProps_Bucket_Small_002; // 0x260(0x08)
	struct UChildActorComponent* BP_Cav_DestructiblePot_02; // 0x268(0x08)
	struct UChildActorComponent* BP_Cav_DestructibleJug_02; // 0x270(0x08)
	struct UChildActorComponent* BP_Cav_DestructiblePot_01; // 0x278(0x08)
	struct UChildActorComponent* BP_Cav_DestructibleJug_01; // 0x280(0x08)
	struct UStaticMeshComponent* StaticMeshComponent36; // 0x288(0x08)
	struct UStaticMeshComponent* StaticMeshComponent39; // 0x290(0x08)
	struct UStaticMeshComponent* StaticMeshComponent38; // 0x298(0x08)
	struct UStaticMeshComponent* StaticMeshComponent33; // 0x2a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent32; // 0x2a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent31; // 0x2b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent30; // 0x2b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent29; // 0x2c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent28; // 0x2c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent27; // 0x2d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent26; // 0x2d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent24; // 0x2e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent23; // 0x2e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent22; // 0x2f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent21; // 0x2f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent20; // 0x300(0x08)
	struct UStaticMeshComponent* StaticMeshComponent18; // 0x308(0x08)
	struct UStaticMeshComponent* StaticMeshComponent34; // 0x310(0x08)
	struct UStaticMeshComponent* StaticMeshComponent15; // 0x318(0x08)
	struct UStaticMeshComponent* StaticMeshComponent14; // 0x320(0x08)
	struct UStaticMeshComponent* StaticMeshComponent13; // 0x328(0x08)
	struct UStaticMeshComponent* StaticMeshComponent12; // 0x330(0x08)
	struct UStaticMeshComponent* StaticMeshComponent10; // 0x338(0x08)
	struct UStaticMeshComponent* StaticMeshComponent7; // 0x340(0x08)
	struct UStaticMeshComponent* StaticMeshComponent6; // 0x348(0x08)
	struct UStaticMeshComponent* StaticMeshComponent5; // 0x350(0x08)
	struct UStaticMeshComponent* StaticMeshComponent4; // 0x358(0x08)
	struct UStaticMeshComponent* StaticMeshComponent3; // 0x360(0x08)
	struct UStaticMeshComponent* StaticMeshComponent2; // 0x368(0x08)
	struct UStaticMeshComponent* StaticMeshComponent1; // 0x370(0x08)
	struct UStaticMeshComponent* StaticMeshComponent16; // 0x378(0x08)
	struct UStaticMeshComponent* StaticMeshComponent35; // 0x380(0x08)
	struct USceneComponent* SharedRoot; // 0x388(0x08)
};

