// BlueprintGeneratedClass BP_ST_GenericCrateStack_B.BP_ST_GenericCrateStack_B_C
// Size: 0x350 (Inherited: 0x2d0)
struct ABP_ST_GenericCrateStack_B_C : ABP_SendTargetCluster_C {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2d0(0x08)
	struct UObjectStateComponent* ObjectState; // 0x2d8(0x08)
	struct UChildActorComponent* BP_Int_BCProps_OpenCrate_Small_002; // 0x2e0(0x08)
	struct UChildActorComponent* BP_Int_BCProps_Basket_Square_Small_002; // 0x2e8(0x08)
	struct UChildActorComponent* BP_Int_BCProps_CloseCrate_Large_001_W1; // 0x2f0(0x08)
	struct UChildActorComponent* BP_Int_BCProps_CloseCrate_Large_001_W; // 0x2f8(0x08)
	struct UChildActorComponent* BP_Int_BCProps_CloseCrate_Medium_001; // 0x300(0x08)
	struct UOdcAuthoredObstacleSetupComponent* OdcAuthoredObstacleSetup; // 0x308(0x08)
	struct UStaticMeshComponent* SM_CampB_2m_PlankC2; // 0x310(0x08)
	struct UStaticMeshComponent* SM_CampB_2m_PlankC1; // 0x318(0x08)
	struct UStaticMeshComponent* SM_CampB_2m_PlankC; // 0x320(0x08)
	struct UStaticMeshComponent* SM_CampB_2m_PostA7; // 0x328(0x08)
	struct UStaticMeshComponent* SM_CampB_2m_PostA6; // 0x330(0x08)
	struct UStaticMeshComponent* SM_CampB_2m_PostA3; // 0x338(0x08)
	struct UStaticMeshComponent* SM_CampB_2m_PostA1; // 0x340(0x08)
	struct UStaticMeshComponent* SM_CampB_2m_PostA; // 0x348(0x08)

	void ReceiveBeginPlay(); // Function BP_ST_GenericCrateStack_B.BP_ST_GenericCrateStack_B_C.ReceiveBeginPlay // (Event|Protected|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_BP_ST_GenericCrateStack_B(int32_t EntryPoint); // Function BP_ST_GenericCrateStack_B.BP_ST_GenericCrateStack_B_C.ExecuteUbergraph_BP_ST_GenericCrateStack_B // (Final|UbergraphFunction) // @ game+0x38a7480
};

