// BlueprintGeneratedClass BP_Sanc_LightFixtureDownwardsDirectional_01_Potnr.BP_Sanc_LightFixtureDownwardsDirectional_01_Potnr_C
// Size: 0x289 (Inherited: 0x248)
struct ABP_Sanc_LightFixtureDownwardsDirectional_01_Potnr_C : AActor {
	struct UAnimatedLightComponent* AnimatedLight1; // 0x248(0x08)
	struct UAnimatedLightComponent* AnimatedLight; // 0x250(0x08)
	struct UBP_ID_DownwardsDirectional_Master1_C* BP_ID_DownwardsDirectional_Master3; // 0x258(0x08)
	struct UPointLightComponent* PointLight1; // 0x260(0x08)
	struct UBP_ID_DownwardsDirectional_Master1_C* BP_ID_DownwardsDirectional_Master2; // 0x268(0x08)
	struct USpotLightComponent* SpotLight; // 0x270(0x08)
	struct UStaticMeshComponent* Base; // 0x278(0x08)
	struct USceneComponent* Scene; // 0x280(0x08)
	bool Cast Spotlight shadows; // 0x288(0x01)
};

