// BlueprintGeneratedClass BP_Stall_Small_A.BP_Stall_Small_A_C
// Size: 0x468 (Inherited: 0x248)
struct ABP_Stall_Small_A_C : AActor {
	struct UChildActorComponent* Candle; // 0x248(0x08)
	struct UStaticMeshComponent* StaticMeshComponent64; // 0x250(0x08)
	struct UStaticMeshComponent* StaticMeshComponent63; // 0x258(0x08)
	struct UStaticMeshComponent* StaticMeshComponent62; // 0x260(0x08)
	struct UStaticMeshComponent* StaticMeshComponent61; // 0x268(0x08)
	struct UStaticMeshComponent* StaticMeshComponent60; // 0x270(0x08)
	struct UStaticMeshComponent* StaticMeshComponent59; // 0x278(0x08)
	struct UStaticMeshComponent* StaticMeshComponent58; // 0x280(0x08)
	struct UStaticMeshComponent* StaticMeshComponent57; // 0x288(0x08)
	struct UStaticMeshComponent* StaticMeshComponent56; // 0x290(0x08)
	struct UStaticMeshComponent* StaticMeshComponent55; // 0x298(0x08)
	struct UStaticMeshComponent* StaticMeshComponent54; // 0x2a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent53; // 0x2a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent52; // 0x2b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent51; // 0x2b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent50; // 0x2c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent49; // 0x2c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent48; // 0x2d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent47; // 0x2d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent46; // 0x2e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent45; // 0x2e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent44; // 0x2f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent43; // 0x2f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent42; // 0x300(0x08)
	struct UStaticMeshComponent* StaticMeshComponent41; // 0x308(0x08)
	struct UStaticMeshComponent* StaticMeshComponent40; // 0x310(0x08)
	struct UStaticMeshComponent* StaticMeshComponent39; // 0x318(0x08)
	struct UStaticMeshComponent* StaticMeshComponent38; // 0x320(0x08)
	struct UStaticMeshComponent* StaticMeshComponent37; // 0x328(0x08)
	struct UStaticMeshComponent* StaticMeshComponent36; // 0x330(0x08)
	struct UStaticMeshComponent* StaticMeshComponent35; // 0x338(0x08)
	struct UStaticMeshComponent* StaticMeshComponent34; // 0x340(0x08)
	struct UStaticMeshComponent* StaticMeshComponent33; // 0x348(0x08)
	struct UStaticMeshComponent* StaticMeshComponent32; // 0x350(0x08)
	struct UStaticMeshComponent* StaticMeshComponent31; // 0x358(0x08)
	struct UStaticMeshComponent* StaticMeshComponent30; // 0x360(0x08)
	struct UStaticMeshComponent* StaticMeshComponent29; // 0x368(0x08)
	struct UStaticMeshComponent* StaticMeshComponent28; // 0x370(0x08)
	struct UStaticMeshComponent* StaticMeshComponent27; // 0x378(0x08)
	struct UStaticMeshComponent* StaticMeshComponent26; // 0x380(0x08)
	struct UStaticMeshComponent* StaticMeshComponent25; // 0x388(0x08)
	struct UStaticMeshComponent* StaticMeshComponent24; // 0x390(0x08)
	struct UStaticMeshComponent* StaticMeshComponent23; // 0x398(0x08)
	struct UStaticMeshComponent* StaticMeshComponent22; // 0x3a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent21; // 0x3a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent20; // 0x3b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent19; // 0x3b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent18; // 0x3c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent17; // 0x3c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent16; // 0x3d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent15; // 0x3d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent14; // 0x3e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent13; // 0x3e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent12; // 0x3f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent11; // 0x3f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent10; // 0x400(0x08)
	struct UStaticMeshComponent* StaticMeshComponent9; // 0x408(0x08)
	struct UStaticMeshComponent* StaticMeshComponent7; // 0x410(0x08)
	struct UStaticMeshComponent* StaticMeshComponent6; // 0x418(0x08)
	struct UStaticMeshComponent* StaticMeshComponent5; // 0x420(0x08)
	struct UStaticMeshComponent* StaticMeshComponent4; // 0x428(0x08)
	struct UStaticMeshComponent* StaticMeshComponent3; // 0x430(0x08)
	struct UStaticMeshComponent* StaticMeshComponent2; // 0x438(0x08)
	struct UStaticMeshComponent* StaticMeshComponent1; // 0x440(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0; // 0x448(0x08)
	struct UStaticMeshComponent* StaticMeshComponent65; // 0x450(0x08)
	struct UStaticMeshComponent* StaticMeshComponent66; // 0x458(0x08)
	struct USceneComponent* SharedRoot; // 0x460(0x08)
};

