// BlueprintGeneratedClass BP_Sanc_WallPiece_L_Dwiz_Dressing01.BP_Sanc_WallPiece_L_Dwiz_Dressing01_C
// Size: 0x2d8 (Inherited: 0x248)
struct ABP_Sanc_WallPiece_L_Dwiz_Dressing01_C : AActor {
	struct UStaticMeshComponent* StaticMeshComponent07; // 0x248(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse14; // 0x250(0x08)
	struct UStaticMeshComponent* StaticMeshComponent043; // 0x258(0x08)
	struct UStaticMeshComponent* StaticMeshComponent040; // 0x260(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse15; // 0x268(0x08)
	struct UStaticMeshComponent* StaticMeshComponent038; // 0x270(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse13; // 0x278(0x08)
	struct UStaticMeshComponent* StaticMeshComponent019; // 0x280(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse12; // 0x288(0x08)
	struct UStaticMeshComponent* StaticMeshComponent028; // 0x290(0x08)
	struct UStaticMeshComponent* StaticMeshComponent024; // 0x298(0x08)
	struct UStaticMeshComponent* StaticMeshComponent022; // 0x2a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent025; // 0x2a8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse11; // 0x2b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent018; // 0x2b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent020; // 0x2c0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse10; // 0x2c8(0x08)
	struct USceneComponent* SceneRoot; // 0x2d0(0x08)
};

