// BlueprintGeneratedClass BP_Sanc_TrashPileLarge_01C_Static.BP_Sanc_TrashPileLarge_01C_Static_C
// Size: 0xb50 (Inherited: 0x248)
struct ABP_Sanc_TrashPileLarge_01C_Static_C : AActor {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x248(0x08)
	struct UCapsuleComponent* Capsule6; // 0x250(0x08)
	struct UCapsuleComponent* Capsule5; // 0x258(0x08)
	struct UCapsuleComponent* Capsule4; // 0x260(0x08)
	struct UCapsuleComponent* Capsule3; // 0x268(0x08)
	struct UCapsuleComponent* Capsule2; // 0x270(0x08)
	struct UCapsuleComponent* Capsule1; // 0x278(0x08)
	struct UCapsuleComponent* Capsule; // 0x280(0x08)
	struct UStaticMeshComponent* W; // 0x288(0x08)
	struct UStaticMeshComponent* SM_Cairn_Vessel_D; // 0x290(0x08)
	struct UStaticMeshComponent* SM_GoblinCrates_LG_Red_Metal; // 0x298(0x08)
	struct UStaticMeshComponent* SM_HW_L_BookShelfLargeD; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_Goblin_Crates_Blue_Medium; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_BCProps_FloorCloth_C; // 0x2b0(0x08)
	struct UStaticMeshComponent* Cabinet1; // 0x2b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent227; // 0x2c0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse2; // 0x2c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent245; // 0x2d0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse75; // 0x2d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent244; // 0x2e0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse76; // 0x2e8(0x08)
	struct UStaticMeshComponent* Owl; // 0x2f0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse77; // 0x2f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent226; // 0x300(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse85; // 0x308(0x08)
	struct UStaticMeshComponent* StaticMeshComponent246; // 0x310(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse82; // 0x318(0x08)
	struct UStaticMeshComponent* StaticMeshComponent234; // 0x320(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse83; // 0x328(0x08)
	struct UStaticMeshComponent* StaticMeshComponent247; // 0x330(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse84; // 0x338(0x08)
	struct UStaticMeshComponent* StaticMeshComponent233; // 0x340(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse114; // 0x348(0x08)
	struct UStaticMeshComponent* Chair40; // 0x350(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse113; // 0x358(0x08)
	struct UStaticMeshComponent* Chair39; // 0x360(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse112; // 0x368(0x08)
	struct UStaticMeshComponent* Chair38; // 0x370(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse111; // 0x378(0x08)
	struct UStaticMeshComponent* Chair37; // 0x380(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse110; // 0x388(0x08)
	struct UStaticMeshComponent* Chair36; // 0x390(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse109; // 0x398(0x08)
	struct UStaticMeshComponent* Chair32; // 0x3a0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse105; // 0x3a8(0x08)
	struct UStaticMeshComponent* Chair31; // 0x3b0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse104; // 0x3b8(0x08)
	struct UStaticMeshComponent* Chair30; // 0x3c0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse103; // 0x3c8(0x08)
	struct UStaticMeshComponent* Chair29; // 0x3d0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse102; // 0x3d8(0x08)
	struct UStaticMeshComponent* Chair35; // 0x3e0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse108; // 0x3e8(0x08)
	struct UStaticMeshComponent* Chair34; // 0x3f0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse107; // 0x3f8(0x08)
	struct UStaticMeshComponent* Chair33; // 0x400(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse106; // 0x408(0x08)
	struct UStaticMeshComponent* Chair28; // 0x410(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse101; // 0x418(0x08)
	struct UStaticMeshComponent* Chair27; // 0x420(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse100; // 0x428(0x08)
	struct UStaticMeshComponent* Chair26; // 0x430(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse99; // 0x438(0x08)
	struct UStaticMeshComponent* Chair25; // 0x440(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse98; // 0x448(0x08)
	struct UStaticMeshComponent* Chair24; // 0x450(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse97; // 0x458(0x08)
	struct UStaticMeshComponent* Chair23; // 0x460(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse96; // 0x468(0x08)
	struct UStaticMeshComponent* Chair22; // 0x470(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse95; // 0x478(0x08)
	struct UStaticMeshComponent* Chair21; // 0x480(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse94; // 0x488(0x08)
	struct UStaticMeshComponent* StaticMeshComponent242; // 0x490(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse93; // 0x498(0x08)
	struct UStaticMeshComponent* StaticMeshComponent228; // 0x4a0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse92; // 0x4a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent232; // 0x4b0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse86; // 0x4b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent235; // 0x4c0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse91; // 0x4c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent307; // 0x4d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent241; // 0x4d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent231; // 0x4e0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse90; // 0x4e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent230; // 0x4f0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse88; // 0x4f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent243; // 0x500(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse87; // 0x508(0x08)
	struct UStaticMeshComponent* Chair20; // 0x510(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse81; // 0x518(0x08)
	struct UStaticMeshComponent* Chair19; // 0x520(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse80; // 0x528(0x08)
	struct UStaticMeshComponent* Chair18; // 0x530(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse79; // 0x538(0x08)
	struct UStaticMeshComponent* Chair17; // 0x540(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse78; // 0x548(0x08)
	struct UStaticMeshComponent* Chair14; // 0x550(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse72; // 0x558(0x08)
	struct UStaticMeshComponent* Chair15; // 0x560(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse73; // 0x568(0x08)
	struct UStaticMeshComponent* Chair16; // 0x570(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse74; // 0x578(0x08)
	struct UStaticMeshComponent* Chair13; // 0x580(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse71; // 0x588(0x08)
	struct UStaticMeshComponent* Scales1; // 0x590(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse68; // 0x598(0x08)
	struct UStaticMeshComponent* Books7; // 0x5a0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse67; // 0x5a8(0x08)
	struct UStaticMeshComponent* Books6; // 0x5b0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse66; // 0x5b8(0x08)
	struct UStaticMeshComponent* books3; // 0x5c0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse65; // 0x5c8(0x08)
	struct UStaticMeshComponent* Crate1; // 0x5d0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse70; // 0x5d8(0x08)
	struct UStaticMeshComponent* Crate3; // 0x5e0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse69; // 0x5e8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse89; // 0x5f0(0x08)
	struct UStaticMeshComponent* Crate5; // 0x5f8(0x08)
	struct UStaticMeshComponent* Crate8; // 0x600(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse63; // 0x608(0x08)
	struct UStaticMeshComponent* StaticMeshComponent117; // 0x610(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse1; // 0x618(0x08)
	struct UStaticMeshComponent* StaticMeshComponent309; // 0x620(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse62; // 0x628(0x08)
	struct UStaticMeshComponent* StaticMeshComponent310; // 0x630(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse61; // 0x638(0x08)
	struct UStaticMeshComponent* StaticMeshComponent249; // 0x640(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse53; // 0x648(0x08)
	struct UStaticMeshComponent* StaticMeshComponent250; // 0x650(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse52; // 0x658(0x08)
	struct UStaticMeshComponent* StaticMeshComponent288; // 0x660(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse54; // 0x668(0x08)
	struct UStaticMeshComponent* Chair4; // 0x670(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse47; // 0x678(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse64; // 0x680(0x08)
	struct UStaticMeshComponent* Chair3; // 0x688(0x08)
	struct UStaticMeshComponent* Crate15; // 0x690(0x08)
	struct UStaticMeshComponent* Chair2; // 0x698(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse45; // 0x6a0(0x08)
	struct UStaticMeshComponent* Chair1; // 0x6a8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse44; // 0x6b0(0x08)
	struct UStaticMeshComponent* Crate14; // 0x6b8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse42; // 0x6c0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse46; // 0x6c8(0x08)
	struct UStaticMeshComponent* Crate16; // 0x6d0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse41; // 0x6d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent189; // 0x6e0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse28; // 0x6e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent305; // 0x6f0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse39; // 0x6f8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse43; // 0x700(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse40; // 0x708(0x08)
	struct UStaticMeshComponent* StaticMeshComponent255; // 0x710(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse27; // 0x718(0x08)
	struct UStaticMeshComponent* StaticMeshComponent256; // 0x720(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse; // 0x728(0x08)
	struct UStaticMeshComponent* StaticMeshComponent263; // 0x730(0x08)
	struct UPhysicalResponseComponent* MainPhysicalResponseBookCase2; // 0x738(0x08)
	struct UStaticMeshComponent* StaticMeshComponent287; // 0x740(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse38; // 0x748(0x08)
	struct UStaticMeshComponent* StaticMeshComponent261; // 0x750(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse37; // 0x758(0x08)
	struct UStaticMeshComponent* StaticMeshComponent260; // 0x760(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse36; // 0x768(0x08)
	struct UStaticMeshComponent* StaticMeshComponent259; // 0x770(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse35; // 0x778(0x08)
	struct UStaticMeshComponent* Brooms1; // 0x780(0x08)
	struct UPhysicalResponseComponent* MainPhysicalResponseBookCase1; // 0x788(0x08)
	struct UStaticMeshComponent* Crate10; // 0x790(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse26; // 0x798(0x08)
	struct UStaticMeshComponent* Crate11; // 0x7a0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse25; // 0x7a8(0x08)
	struct UStaticMeshComponent* Crate12; // 0x7b0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse23; // 0x7b8(0x08)
	struct UStaticMeshComponent* Crate13; // 0x7c0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse24; // 0x7c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent281; // 0x7d0(0x08)
	struct UPhysicalResponseComponent* MainPhysicalResponse5; // 0x7d8(0x08)
	struct UStaticMeshComponent* Crate6; // 0x7e0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse22; // 0x7e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent282; // 0x7f0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse5; // 0x7f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent283; // 0x800(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse4; // 0x808(0x08)
	struct UStaticMeshComponent* StaticMeshComponent284; // 0x810(0x08)
	struct UPhysicalResponseComponent* MainPhysicalResponse6; // 0x818(0x08)
	struct UStaticMeshComponent* StaticMeshComponent279; // 0x820(0x08)
	struct UStaticMeshComponent* BookcaseSmall2; // 0x828(0x08)
	struct UPhysicalResponseComponent* MainPhysicalResponseBookCase; // 0x830(0x08)
	struct UStaticMeshComponent* StaticMeshComponent168; // 0x838(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse34; // 0x840(0x08)
	struct UStaticMeshComponent* StaticMeshComponent194; // 0x848(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse21; // 0x850(0x08)
	struct UStaticMeshComponent* StaticMeshComponent197; // 0x858(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse20; // 0x860(0x08)
	struct UStaticMeshComponent* Birdcage1; // 0x868(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse19; // 0x870(0x08)
	struct UStaticMeshComponent* StaticMeshComponent286; // 0x878(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse18; // 0x880(0x08)
	struct UStaticMeshComponent* StaticMeshComponent285; // 0x888(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse17; // 0x890(0x08)
	struct UStaticMeshComponent* Crate4; // 0x898(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse16; // 0x8a0(0x08)
	struct UStaticMeshComponent* Bellows1; // 0x8a8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse33; // 0x8b0(0x08)
	struct UStaticMeshComponent* HourGlass; // 0x8b8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse32; // 0x8c0(0x08)
	struct UStaticMeshComponent* Scales; // 0x8c8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse60; // 0x8d0(0x08)
	struct UStaticMeshComponent* Crate2; // 0x8d8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse15; // 0x8e0(0x08)
	struct UStaticMeshComponent* Vase2; // 0x8e8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse59; // 0x8f0(0x08)
	struct UStaticMeshComponent* Wolfbaby; // 0x8f8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse58; // 0x900(0x08)
	struct UStaticMeshComponent* Scales2; // 0x908(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse57; // 0x910(0x08)
	struct UStaticMeshComponent* Books1; // 0x918(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse31; // 0x920(0x08)
	struct UStaticMeshComponent* Books4; // 0x928(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse30; // 0x930(0x08)
	struct UStaticMeshComponent* Books2; // 0x938(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse29; // 0x940(0x08)
	struct UStaticMeshComponent* Vase4; // 0x948(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse55; // 0x950(0x08)
	struct UStaticMeshComponent* StaticMeshComponent254; // 0x958(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse51; // 0x960(0x08)
	struct UStaticMeshComponent* StaticMeshComponent253; // 0x968(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse50; // 0x970(0x08)
	struct UStaticMeshComponent* StaticMeshComponent252; // 0x978(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse49; // 0x980(0x08)
	struct UStaticMeshComponent* StaticMeshComponent251; // 0x988(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse48; // 0x990(0x08)
	struct UStaticMeshComponent* SM_BCProps_FenceClothC_A_LOD1; // 0x998(0x08)
	struct UStaticMeshComponent* SM_BCProps_FenceClothC_A_LOD; // 0x9a0(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeCloth_B; // 0x9a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent311; // 0x9b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent308; // 0x9b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent306; // 0x9c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent280; // 0x9c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent268; // 0x9d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent262; // 0x9d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent258; // 0x9e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent257; // 0x9e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent248; // 0x9f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent229; // 0x9f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent225; // 0xa00(0x08)
	struct UStaticMeshComponent* StaticMeshComponent213; // 0xa08(0x08)
	struct UStaticMeshComponent* StaticMeshComponent202; // 0xa10(0x08)
	struct UStaticMeshComponent* StaticMeshComponent196; // 0xa18(0x08)
	struct UStaticMeshComponent* StaticMeshComponent195; // 0xa20(0x08)
	struct UStaticMeshComponent* StaticMeshComponent312; // 0xa28(0x08)
	struct UStaticMeshComponent* Crate9; // 0xa30(0x08)
	struct UStaticMeshComponent* Books5; // 0xa38(0x08)
	struct UStaticMeshComponent* Table3; // 0xa40(0x08)
	struct UStaticMeshComponent* Chair12; // 0xa48(0x08)
	struct UStaticMeshComponent* Chair11; // 0xa50(0x08)
	struct UStaticMeshComponent* Chair10; // 0xa58(0x08)
	struct UStaticMeshComponent* Chair9; // 0xa60(0x08)
	struct UStaticMeshComponent* Table2; // 0xa68(0x08)
	struct UStaticMeshComponent* Crate7; // 0xa70(0x08)
	struct UStaticMeshComponent* Frame3; // 0xa78(0x08)
	struct UStaticMeshComponent* BookRow20; // 0xa80(0x08)
	struct UStaticMeshComponent* Table1; // 0xa88(0x08)
	struct UStaticMeshComponent* BookRow19; // 0xa90(0x08)
	struct UStaticMeshComponent* BookRow18; // 0xa98(0x08)
	struct UStaticMeshComponent* BookRow17; // 0xaa0(0x08)
	struct UStaticMeshComponent* BookRow16; // 0xaa8(0x08)
	struct UStaticMeshComponent* BookRow15; // 0xab0(0x08)
	struct UStaticMeshComponent* BookRow14; // 0xab8(0x08)
	struct UStaticMeshComponent* BookRow13; // 0xac0(0x08)
	struct UStaticMeshComponent* BookRow12; // 0xac8(0x08)
	struct UStaticMeshComponent* BookRow11; // 0xad0(0x08)
	struct UStaticMeshComponent* BookRow10; // 0xad8(0x08)
	struct UStaticMeshComponent* BookRow9; // 0xae0(0x08)
	struct UStaticMeshComponent* BookRow8; // 0xae8(0x08)
	struct UStaticMeshComponent* BookcaseLarge2; // 0xaf0(0x08)
	struct UStaticMeshComponent* BookRow7; // 0xaf8(0x08)
	struct UStaticMeshComponent* BookRow6; // 0xb00(0x08)
	struct UStaticMeshComponent* BookcaseSmall1; // 0xb08(0x08)
	struct UStaticMeshComponent* BookRow5; // 0xb10(0x08)
	struct UStaticMeshComponent* BookRow4; // 0xb18(0x08)
	struct UStaticMeshComponent* BookRow3; // 0xb20(0x08)
	struct UStaticMeshComponent* BookRow2; // 0xb28(0x08)
	struct USceneComponent* Scene; // 0xb30(0x08)
	struct UStaticMeshComponent* Collision; // 0xb38(0x08)
	struct USceneComponent* SharedRoot; // 0xb40(0x08)
	struct UAkAudioEvent* AkEvent; // 0xb48(0x08)

	struct TArray<struct FTransfigurationResource> GetAdditionalItemsReturned(); // Function BP_Sanc_TrashPileLarge_01C_Static.BP_Sanc_TrashPileLarge_01C_Static_C.GetAdditionalItemsReturned // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	bool IsObjectContextValidForTransformation(); // Function BP_Sanc_TrashPileLarge_01C_Static.BP_Sanc_TrashPileLarge_01C_Static_C.IsObjectContextValidForTransformation // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	bool IsObjectContextValidForVanishment(); // Function BP_Sanc_TrashPileLarge_01C_Static.BP_Sanc_TrashPileLarge_01C_Static_C.IsObjectContextValidForVanishment // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void DeactivateObject(); // Function BP_Sanc_TrashPileLarge_01C_Static.BP_Sanc_TrashPileLarge_01C_Static_C.DeactivateObject // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void FinalizeInitialAnimationState(); // Function BP_Sanc_TrashPileLarge_01C_Static.BP_Sanc_TrashPileLarge_01C_Static_C.FinalizeInitialAnimationState // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ObjectConjured(); // Function BP_Sanc_TrashPileLarge_01C_Static.BP_Sanc_TrashPileLarge_01C_Static_C.ObjectConjured // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ObjectStreamedSpawnInConfirmed(); // Function BP_Sanc_TrashPileLarge_01C_Static.BP_Sanc_TrashPileLarge_01C_Static_C.ObjectStreamedSpawnInConfirmed // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ObjectTransformationCancelled(); // Function BP_Sanc_TrashPileLarge_01C_Static.BP_Sanc_TrashPileLarge_01C_Static_C.ObjectTransformationCancelled // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ObjectTransformationConfirmed(); // Function BP_Sanc_TrashPileLarge_01C_Static.BP_Sanc_TrashPileLarge_01C_Static_C.ObjectTransformationConfirmed // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ObjectTransformationStarted(); // Function BP_Sanc_TrashPileLarge_01C_Static.BP_Sanc_TrashPileLarge_01C_Static_C.ObjectTransformationStarted // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ObjectVanished(); // Function BP_Sanc_TrashPileLarge_01C_Static.BP_Sanc_TrashPileLarge_01C_Static_C.ObjectVanished // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ReactivateObject(); // Function BP_Sanc_TrashPileLarge_01C_Static.BP_Sanc_TrashPileLarge_01C_Static_C.ReactivateObject // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void ObjectPhysicalResponseImpact(float ImpactIntensity, struct FName SpellName, struct FName ResponseConfigName, struct FVector& ImpactLocation); // Function BP_Sanc_TrashPileLarge_01C_Static.BP_Sanc_TrashPileLarge_01C_Static_C.ObjectPhysicalResponseImpact // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_BP_Sanc_TrashPileLarge_01C_Static(int32_t EntryPoint); // Function BP_Sanc_TrashPileLarge_01C_Static.BP_Sanc_TrashPileLarge_01C_Static_C.ExecuteUbergraph_BP_Sanc_TrashPileLarge_01C_Static // (Final|UbergraphFunction|HasDefaults) // @ game+0x38a7480
};

