// BlueprintGeneratedClass BP_Sanc_Trash_2m_01A_Static.BP_Sanc_Trash_2m_01A_Static_C
// Size: 0x320 (Inherited: 0x248)
struct ABP_Sanc_Trash_2m_01A_Static_C : AActor {
	struct UBoxComponent* BoxCollision; // 0x248(0x08)
	struct UStaticMeshComponent* SM_MediumPallet1; // 0x250(0x08)
	struct UStaticMeshComponent* SM_MediumPallet; // 0x258(0x08)
	struct UStaticMeshComponent* SM_HW_L_BookStack_Small_D6; // 0x260(0x08)
	struct UStaticMeshComponent* SM_HW_L_BookRow_Half_C; // 0x268(0x08)
	struct UStaticMeshComponent* StaticMeshComponent77; // 0x270(0x08)
	struct UStaticMeshComponent* StaticMeshComponent76; // 0x278(0x08)
	struct UStaticMeshComponent* StaticMeshComponent75; // 0x280(0x08)
	struct UStaticMeshComponent* StaticMeshComponent153; // 0x288(0x08)
	struct UStaticMeshComponent* Parchment9; // 0x290(0x08)
	struct UStaticMeshComponent* Parchment8; // 0x298(0x08)
	struct UStaticMeshComponent* vase3; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_BCProps_FloorCloth_F; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_HW_L_Book_Small_C4; // 0x2b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent185; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_HW_L_BookRow_Small_E1; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_HW_L_BookStack_Small_D2; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_HW_L_Book_Small_C1; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_HW_L_Book_Small_C; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_HW_L_BookRow_Small_E; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_HM_OwlPost_Package_F; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_HM_OwlPost_Package_A; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_HM_BeaterStands_A; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_HW_Shelf_2mWx2mT_B1; // 0x300(0x08)
	struct UStaticMeshComponent* SM_HW_Shelf_2mWx2mT_B; // 0x308(0x08)
	struct UStaticMeshComponent* SM_HW_L_Book_Small_C2; // 0x310(0x08)
	struct USceneComponent* Scene; // 0x318(0x08)
};

