// BlueprintGeneratedClass BP_Sanc_HubCorner_03_Potnr_Dressing01.BP_Sanc_HubCorner_03_Potnr_Dressing01_C
// Size: 0x348 (Inherited: 0x248)
struct ABP_Sanc_HubCorner_03_Potnr_Dressing01_C : AActor {
	struct UStaticMeshComponent* SM_HM_PotionBottle42; // 0x248(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle32; // 0x250(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse40; // 0x258(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle33; // 0x260(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse41; // 0x268(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle43; // 0x270(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse2; // 0x278(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle37; // 0x280(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle44; // 0x288(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse4; // 0x290(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle41; // 0x298(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse1; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle39; // 0x2a8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse8; // 0x2b0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse3; // 0x2b8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse39; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_HW_L_New_Book_Small_B; // 0x2c8(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x2d0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse12; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Bottle_E; // 0x2e0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse13; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Bottle_C1; // 0x2f0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse14; // 0x2f8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse15; // 0x300(0x08)
	struct UDecalComponent* e1; // 0x308(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_Rolled_Parchment_A1; // 0x310(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse17; // 0x318(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_Rolled_Parchment_Pile_E1; // 0x320(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse16; // 0x328(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle45; // 0x330(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse18; // 0x338(0x08)
	struct USceneComponent* SceneRoot; // 0x340(0x08)
};

