// BlueprintGeneratedClass BP_Sanc_TerrariumForestStart_Potnr_Dressing03.BP_Sanc_TerrariumForestStart_Potnr_Dressing03_C
// Size: 0x2e0 (Inherited: 0x248)
struct ABP_Sanc_TerrariumForestStart_Potnr_Dressing03_C : AActor {
	struct UPhysicalResponseComponent* PhysicalResponse70; // 0x248(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse24; // 0x250(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse102; // 0x258(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse212; // 0x260(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse44; // 0x268(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse90; // 0x270(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse87; // 0x278(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse30; // 0x280(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse31; // 0x288(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle20; // 0x290(0x08)
	struct UStaticMeshComponent* SM_HW_L_New_Book_Medium_C3; // 0x298(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle23; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_Sanc_L_BookRow_Half_D3; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_HW_L_New_Book_Large_C1; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle5; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_HW_L_New_Book_Large_B1; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Bottle_C2; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_Sanc_L_BookRow_Half_A1; // 0x2d0(0x08)
	struct USceneComponent* SceneRoot; // 0x2d8(0x08)
};

