// BlueprintGeneratedClass BP_Sanc_Desk_01_Hbgst_Dressing02.BP_Sanc_Desk_01_Hbgst_Dressing02_C
// Size: 0x360 (Inherited: 0x248)
struct ABP_Sanc_Desk_01_Hbgst_Dressing02_C : AActor {
	struct UDecalComponent* Decal; // 0x248(0x08)
	struct UDecalComponent* Decal1; // 0x250(0x08)
	struct UStaticMeshComponent* SM_HM_Candy_B_130; // 0x258(0x08)
	struct UStaticMeshComponent* SM_Sanc_Secateurs_89; // 0x260(0x08)
	struct UStaticMeshComponent* SM_Sanc_HandShears4_101; // 0x268(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse48; // 0x270(0x08)
	struct UStaticMeshComponent* SM_Sanc_HandTrowel4_115; // 0x278(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse47; // 0x280(0x08)
	struct UStaticMeshComponent* SM_HM_Hard_Candy_A_93; // 0x288(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse46; // 0x290(0x08)
	struct UStaticMeshComponent* SM_HM_Hard_Candy_A3_105; // 0x298(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse45; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_HM_Hard_Candy_B2_136; // 0x2a8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse44; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_HM_Hard_Candy_B_117; // 0x2b8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse43; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_HM_Hard_Candy_A2_95; // 0x2c8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse42; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_Sanc_WateringCan_01A2_120; // 0x2d8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse41; // 0x2e0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse40; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_HM_Candy_E_128; // 0x2f0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse49; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_SANC_PlantingPotSmall_Empty2_99; // 0x300(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse33; // 0x308(0x08)
	struct UStaticMeshComponent* SM_HW_L_BookStack_Large_B_85; // 0x310(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse38; // 0x318(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_InkBottles_E_122; // 0x320(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse37; // 0x328(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse36; // 0x330(0x08)
	struct UStaticMeshComponent* SM_Book_04_87; // 0x338(0x08)
	struct UStaticMeshComponent* SM_HM_Neep_Pumpkin_D_124; // 0x340(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse34; // 0x348(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse39; // 0x350(0x08)
	struct USceneComponent* SceneRoot; // 0x358(0x08)
};

