// BlueprintGeneratedClass BP_Sanc_BottlesPopulation_02.BP_Sanc_BottlesPopulation_02_C
// Size: 0x2b8 (Inherited: 0x248)
struct ABP_Sanc_BottlesPopulation_02_C : AActor {
	struct UStaticMeshComponent* SM_HM_PotionBottle12; // 0x248(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle4; // 0x250(0x08)
	struct UStaticMeshComponent* SM_HM_HogsHead_Bottle_D1; // 0x258(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle11; // 0x260(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle9; // 0x268(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_PotionBottle7; // 0x270(0x08)
	struct UStaticMeshComponent* SM_HM_HogsHead_Bottle_E1; // 0x278(0x08)
	struct UStaticMeshComponent* SM_HM_HogsHead_Bottle_C1; // 0x280(0x08)
	struct UStaticMeshComponent* SM_HM_HogsHead_Bottle_B1; // 0x288(0x08)
	struct UStaticMeshComponent* SM_HM_HogsHead_Bottle_A1; // 0x290(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Bottle_C1; // 0x298(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Bottle_D1; // 0x2a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_PotionBottle3; // 0x2a8(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x2b0(0x08)
};

