// BlueprintGeneratedClass BP_Sanc_Bio_Glnd_CastleRuins_3_A.BP_Sanc_Bio_Glnd_CastleRuins_3_A_C
// Size: 0x4b0 (Inherited: 0x248)
struct ABP_Sanc_Bio_Glnd_CastleRuins_3_A_C : AActor {
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_B13; // 0x248(0x08)
	struct UDecalComponent* MM_P_Decal_Wetness_drips20; // 0x250(0x08)
	struct UDecalComponent* MM_P_Decal_Wetness_drips19; // 0x258(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_C11; // 0x260(0x08)
	struct UDecalComponent* MM_P_Decal_Wetness_drips18; // 0x268(0x08)
	struct UDecalComponent* MM_P_Decal_Wetness_drips17; // 0x270(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_B12; // 0x278(0x08)
	struct UDecalComponent* MM_P_Decal_Wetness_drips16; // 0x280(0x08)
	struct UDecalComponent* MM_P_Decal_Wetness_drips15; // 0x288(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_C10; // 0x290(0x08)
	struct UDecalComponent* MM_P_Decal_Wetness_drips14; // 0x298(0x08)
	struct UDecalComponent* MM_P_Decal_Wetness_drips13; // 0x2a0(0x08)
	struct UDecalComponent* MM_P_Decal_Wetness_drips12; // 0x2a8(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_B11; // 0x2b0(0x08)
	struct UDecalComponent* MM_P_Decal_Wetness_drips11; // 0x2b8(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_C9; // 0x2c0(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_E2; // 0x2c8(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_B10; // 0x2d0(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_C8; // 0x2d8(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_E; // 0x2e0(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_G11; // 0x2e8(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_G6; // 0x2f0(0x08)
	struct UDecalComponent* MM_P_Decal_Wetness_drips10; // 0x2f8(0x08)
	struct UDecalComponent* MM_P_Decal_Wetness_drips9; // 0x300(0x08)
	struct UDecalComponent* MM_P_Decal_Wetness_drips8; // 0x308(0x08)
	struct UDecalComponent* MM_P_Decal_Wetness_drips7; // 0x310(0x08)
	struct UDecalComponent* MM_P_Decal_Wetness_drips6; // 0x318(0x08)
	struct UDecalComponent* MM_P_Decal_Wetness_drips5; // 0x320(0x08)
	struct UDecalComponent* MM_P_Decal_Wetness_drips4; // 0x328(0x08)
	struct UDecalComponent* MM_P_Decal_Wetness_drips3; // 0x330(0x08)
	struct UDecalComponent* MM_P_Decal_Wetness_drips2; // 0x338(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_B9; // 0x340(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_B8; // 0x348(0x08)
	struct UDecalComponent* M_HW_Decal_grunge3_Dark3; // 0x350(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_C3; // 0x358(0x08)
	struct UDecalComponent* MM_P_Decal_Wetness_drips; // 0x360(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_B4; // 0x368(0x08)
	struct UDecalComponent* M_HW_Decal_grunge3_Dark2; // 0x370(0x08)
	struct UDecalComponent* M_HW_Decal_grunge3_Dark; // 0x378(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_A7; // 0x380(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_Relief_A1_c; // 0x388(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_2_Broken_P_c; // 0x390(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_2_Wall_M; // 0x398(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_Broken_C_b; // 0x3a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_2_SquarePillars_A_a; // 0x3a8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_CastleRuins_2_Relief_C_d; // 0x3b0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_Wall_O; // 0x3b8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_10SM_CastleRuins_2_Relief_A_a; // 0x3c0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_CastleRuins_2_Window_D_c; // 0x3c8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_CastleRuins_2_Broken_F_a; // 0x3d0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_Wall_K; // 0x3d8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_CastleRuins_2_Broken_B_b; // 0x3e0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_CastleRuins_2_Broken_C_a; // 0x3e8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_Broken_D; // 0x3f0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_Wall_L; // 0x3f8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_2_Door_B; // 0x400(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_Window_G; // 0x408(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_Window_M; // 0x410(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_Wall_J; // 0x418(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_CastleRuins_2_Broken_E; // 0x420(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_CastleRuins_2_Relief_B_c; // 0x428(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_CastleRuins_2_Relief_L_a; // 0x430(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_10SM_CastleRuins_2_Broken_F_b; // 0x438(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_Broken_B_a; // 0x440(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_CastleRuins_2_Wall_A; // 0x448(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_Relief_B1_c; // 0x450(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_CastleRuins_2_Relief_A1_a; // 0x458(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_Relief_B1_b; // 0x460(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_18SM_CastleRuins_2_Relief_A_e; // 0x468(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_Relief_A1_b; // 0x470(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_7SM_CastleRuins_2_Relief_L_b; // 0x478(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_CastleRuins_2_Relief_A_b; // 0x480(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_13SM_CastleRuins_2_Relief_B_b; // 0x488(0x08)
	struct UBoxComponent* r1; // 0x490(0x08)
	struct UBoxComponent* R; // 0x498(0x08)
	struct USceneComponent* Scene; // 0x4a0(0x08)
	struct USceneComponent* SharedRoot; // 0x4a8(0x08)
};

