// BlueprintGeneratedClass BP_Sanc_WallPiece_L_Dwiz_Dressing02.BP_Sanc_WallPiece_L_Dwiz_Dressing02_C
// Size: 0x4a8 (Inherited: 0x248)
struct ABP_Sanc_WallPiece_L_Dwiz_Dressing02_C : AActor {
	struct UPhysicalResponseComponent* PhysicalResponseChain1; // 0x248(0x08)
	struct UPhysicalResponseComponent* PhysicalResponseTopShelf; // 0x250(0x08)
	struct UPhysicalResponseComponent* PhysicalResponseBottomShelf; // 0x258(0x08)
	struct UPhysicalResponseComponent* PhysicalResponseChain3; // 0x260(0x08)
	struct UPhysicalResponseComponent* PhysicalResponseMidShelf; // 0x268(0x08)
	struct UPhysicalResponseComponent* PhysicalResponseChain2; // 0x270(0x08)
	struct UAnimatedLightComponent* AnimatedLight2; // 0x278(0x08)
	struct UPointLightComponent* PointLight2; // 0x280(0x08)
	struct UAnimatedLightComponent* AnimatedLight; // 0x288(0x08)
	struct UPointLightComponent* PointLight1; // 0x290(0x08)
	struct UStaticMeshComponent* StaticMeshComponent02; // 0x298(0x08)
	struct UStaticMeshComponent* StaticMeshComponent017; // 0x2a0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse37; // 0x2a8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse16; // 0x2b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent08; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_CandleGroup_Fat_E; // 0x2c0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse36; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_Sanc_Candle_Dwiz_01A; // 0x2d0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse35; // 0x2d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent09; // 0x2e0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse34; // 0x2e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent06; // 0x2f0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse33; // 0x2f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent051; // 0x300(0x08)
	struct UStaticMeshComponent* StaticMeshComponent031; // 0x308(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse31; // 0x310(0x08)
	struct UStaticMeshComponent* StaticMeshComponent021; // 0x318(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse32; // 0x320(0x08)
	struct UStaticMeshComponent* StaticMeshComponent042; // 0x328(0x08)
	struct UStaticMeshComponent* StaticMeshComponent053; // 0x330(0x08)
	struct UStaticMeshComponent* StaticMeshComponent044; // 0x338(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse22; // 0x340(0x08)
	struct UStaticMeshComponent* StaticMeshComponent049; // 0x348(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse17; // 0x350(0x08)
	struct UStaticMeshComponent* StaticMeshComponent045; // 0x358(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse21; // 0x360(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse20; // 0x368(0x08)
	struct UStaticMeshComponent* StaticMeshComponent046; // 0x370(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse19; // 0x378(0x08)
	struct UStaticMeshComponent* StaticMeshComponent050; // 0x380(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse18; // 0x388(0x08)
	struct UStaticMeshComponent* StaticMeshComponent029; // 0x390(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse30; // 0x398(0x08)
	struct UStaticMeshComponent* StaticMeshComponent035; // 0x3a0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse29; // 0x3a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent030; // 0x3b0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse28; // 0x3b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0; // 0x3c0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse27; // 0x3c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent023; // 0x3d0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse26; // 0x3d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent032; // 0x3e0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse25; // 0x3e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent027; // 0x3f0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse24; // 0x3f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent026; // 0x400(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse23; // 0x408(0x08)
	struct UStaticMeshComponent* StaticMeshComponent037; // 0x410(0x08)
	struct UStaticMeshComponent* StaticMeshComponent059; // 0x418(0x08)
	struct UPhysicalResponseComponent* PhysicalResponseMain8; // 0x420(0x08)
	struct UStaticMeshComponent* StaticMeshComponent057; // 0x428(0x08)
	struct UPhysicalResponseComponent* PhysicalResponseMain7; // 0x430(0x08)
	struct UStaticMeshComponent* StaticMeshComponent055; // 0x438(0x08)
	struct UStaticMeshComponent* StaticMeshComponent061; // 0x440(0x08)
	struct UPhysicalResponseComponent* PhysicalResponseMain5; // 0x448(0x08)
	struct UStaticMeshComponent* StaticMeshComponent060; // 0x450(0x08)
	struct UPhysicalResponseComponent* PhysicalResponseMain4; // 0x458(0x08)
	struct UStaticMeshComponent* StaticMeshComponent058; // 0x460(0x08)
	struct UStaticMeshComponent* StaticMeshComponent054; // 0x468(0x08)
	struct UPhysicalResponseComponent* PhysicalResponseMain3; // 0x470(0x08)
	struct UStaticMeshComponent* StaticMeshComponent056; // 0x478(0x08)
	struct UPhysicalResponseComponent* PhysicalResponseMain2; // 0x480(0x08)
	struct UStaticMeshComponent* StaticMeshComponent039; // 0x488(0x08)
	struct UStaticMeshComponent* StaticMeshComponent041; // 0x490(0x08)
	struct UPhysicalResponseComponent* PhysicalResponseMain10; // 0x498(0x08)
	struct USceneComponent* SceneRoot; // 0x4a0(0x08)
};

