// BlueprintGeneratedClass BP_Small_CastleRuins_1_F1.BP_Small_CastleRuins_1_F1_C
// Size: 0x2a0 (Inherited: 0x248)
struct ABP_Small_CastleRuins_1_F1_C : AActor {
	struct UStaticMeshComponent* StaticMeshComponent8; // 0x248(0x08)
	struct UStaticMeshComponent* StaticMeshComponent14; // 0x250(0x08)
	struct UStaticMeshComponent* StaticMeshComponent13; // 0x258(0x08)
	struct UStaticMeshComponent* StaticMeshComponent7; // 0x260(0x08)
	struct UStaticMeshComponent* StaticMeshComponent6; // 0x268(0x08)
	struct UStaticMeshComponent* StaticMeshComponent5; // 0x270(0x08)
	struct UStaticMeshComponent* StaticMeshComponent4; // 0x278(0x08)
	struct UStaticMeshComponent* StaticMeshComponent3; // 0x280(0x08)
	struct UStaticMeshComponent* StaticMeshComponent1; // 0x288(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0; // 0x290(0x08)
	struct USceneComponent* SharedRoot; // 0x298(0x08)
};

