// BlueprintGeneratedClass BP_Sanc_Trash_2m_02A_Static.BP_Sanc_Trash_2m_02A_Static_C
// Size: 0x2e8 (Inherited: 0x248)
struct ABP_Sanc_Trash_2m_02A_Static_C : AActor {
	struct UBoxComponent* BoxCollision2; // 0x248(0x08)
	struct UBoxComponent* BoxCollision1; // 0x250(0x08)
	struct UBoxComponent* BoxCollision; // 0x258(0x08)
	struct UStaticMeshComponent* SM_HW_GenericTrunk_A4; // 0x260(0x08)
	struct UStaticMeshComponent* Shield1; // 0x268(0x08)
	struct UStaticMeshComponent* SM_BCProps_FloorCloth_F1; // 0x270(0x08)
	struct UStaticMeshComponent* SM_BCProps_FloorCloth_F; // 0x278(0x08)
	struct UStaticMeshComponent* SM_HW_GenericTrunk_A3; // 0x280(0x08)
	struct UStaticMeshComponent* SM_HW_GenericTrunk_A2; // 0x288(0x08)
	struct UStaticMeshComponent* SM_HW_L_BookStack_Large_A2; // 0x290(0x08)
	struct UStaticMeshComponent* SM_HW_L_BookStack_Large_A1; // 0x298(0x08)
	struct UStaticMeshComponent* SM_HW_L_BookStack_Large_A; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_HW_Shelf_2mWx2mT_B; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_HW_L_BookRow_Small_D1; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_HW_L_BookRow_Small_D; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_HW_GenericTrunk_A; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_HW_GenericTrunk_A1; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_HW_GenericTrunk_C; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_HW_L_BookRow_Small_A; // 0x2d8(0x08)
	struct USceneComponent* Scene; // 0x2e0(0x08)
};

