// BlueprintGeneratedClass BP_Sanc_HubBookshelfRightUnit_01_Potnr.BP_Sanc_HubBookshelfRightUnit_01_Potnr_C
// Size: 0x330 (Inherited: 0x2b0)
struct ABP_Sanc_HubBookshelfRightUnit_01_Potnr_C : ABP_SelfArrangingBookshelf_Parent_C {
	struct UTransformationFxInfoComponent* TransformationFxInfo_0_1; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_BP_Sanc_HubBookshelfRightUnit_01_Potnr_Bottles_Merged_04; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_Sanc_FloatingBookshelf_02_Potnr; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_Sanc_FloatingBookshelf_02_Potnr4; // 0x2c8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_HM_Quill_Rolled_Parchment_A1; // 0x2d0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_HM_3Broom_Jars_B1; // 0x2d8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Sanc_FloatingBookshelf_10_Potnr1; // 0x2e0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Sanc_HouseBannerGen_02; // 0x2e8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_Quill_Rolled_Parchment_Pile_A1; // 0x2f0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Sanc_FloatingBookshelf_06_Potnr1; // 0x2f8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_HM_3Broom_Jars_A1; // 0x300(0x08)
	struct UStaticMeshComponent* SM_BP_Sanc_HubBookshelfRightUnit_01_Potnr_Bottles_Merged_03; // 0x308(0x08)
	struct USplineComponent* Spline1; // 0x310(0x08)
	struct UChildActorComponent* ChildActor1; // 0x318(0x08)
	struct USceneComponent* SelfArrangingBooks; // 0x320(0x08)
	struct USceneComponent* Scene; // 0x328(0x08)

	void UserConstructionScript(); // Function BP_Sanc_HubBookshelfRightUnit_01_Potnr.BP_Sanc_HubBookshelfRightUnit_01_Potnr_C.UserConstructionScript // (Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
};

