// BlueprintGeneratedClass BP_StoragePile_Med_C.BP_StoragePile_Med_C_C
// Size: 0x2d0 (Inherited: 0x248)
struct ABP_StoragePile_Med_C_C : AActor {
	struct UChildActorComponent* BP_Cav_DestructibleJug_02; // 0x248(0x08)
	struct UChildActorComponent* BP_Cav_DestructiblePot_02; // 0x250(0x08)
	struct UDecalComponent* MI_CastleDun_SoilBones_A; // 0x258(0x08)
	struct UDecalComponent* MI_CastleDun_BurntScatter_A; // 0x260(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Wetness_drips_B; // 0x268(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Medium_003_W; // 0x270(0x08)
	struct UStaticMeshComponent* SM_CastleDun_Kitchen_cage; // 0x278(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Large_001_W; // 0x280(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Barrel_Fat_001_W; // 0x288(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_Int_BCProps_FoodBag_1bag_001_W; // 0x290(0x08)
	struct UStaticMeshComponent* SM_BCProps_FoodBag_Corner_001; // 0x298(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Cauldron_001; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_CloseCrate_Medium_A; // 0x2a8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_Int_BCProps_FoodBag_1bag_002_W; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Lantern_001; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Rope_002_W; // 0x2c0(0x08)
	struct USceneComponent* SharedRoot; // 0x2c8(0x08)
};

