// BlueprintGeneratedClass BP_Sanc_InsetCoastal_01A.BP_Sanc_InsetCoastal_01A_C
// Size: 0x310 (Inherited: 0x248)
struct ABP_Sanc_InsetCoastal_01A_C : AActor {
	struct UStaticMeshComponent* SM_BP_Sanc_InsetCoastal_01A_Seaweed_Merged_01; // 0x248(0x08)
	struct UStaticMeshComponent* SM_BP_Sanc_InsetCoastal_01A_Water_Sheet_Merged_01; // 0x250(0x08)
	struct UStaticMeshComponent* SM_BP_Sanc_InsetCoastal_01A_Decals_Merged_01; // 0x258(0x08)
	struct UParticleSystemComponent* WaterDrops3; // 0x260(0x08)
	struct UParticleSystemComponent* WaterDrops2; // 0x268(0x08)
	struct UParticleSystemComponent* Splash7; // 0x270(0x08)
	struct UParticleSystemComponent* Splash6; // 0x278(0x08)
	struct UParticleSystemComponent* Splash5; // 0x280(0x08)
	struct UParticleSystemComponent* Splash4; // 0x288(0x08)
	struct USceneComponent* VFX1; // 0x290(0x08)
	struct UChildActorComponent* BP_Cav_Dungeon_Waterplane1; // 0x298(0x08)
	struct USceneComponent* Water1; // 0x2a0(0x08)
	struct UDecalComponent* VFX_MI_Decal_WaterSurface_CoastalTerr5; // 0x2a8(0x08)
	struct UDecalComponent* VFX_MI_Decal_WaterSurface_CoastalTerr4; // 0x2b0(0x08)
	struct UDecalComponent* VFX_MI_Decal_WaterSurface_CoastalTerr3; // 0x2b8(0x08)
	struct UDecalComponent* VFX_MI_Decal_WaterSurface_CoastalTerr2; // 0x2c0(0x08)
	struct UDecalComponent* VFX_MI_Decal_WaterSurface_CoastalTerr; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_Sanc_TerrariumCoastalRocks_01A1; // 0x2d0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_11SM_CavernDun_Rock_Hex_Q; // 0x2d8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_8SM_CavernDun_Rock_Hex_B; // 0x2e0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_13SM_CavernDun_Rock_Hex_E; // 0x2e8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_9SM_CavernDun_Rock_Hex_T; // 0x2f0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_8SM_CavernDun_Rock_Hex_I; // 0x2f8(0x08)
	struct UDecalComponent* VFX_MI_Decal_WaterSurface_CoastalTerr6; // 0x300(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x308(0x08)
};

