// BlueprintGeneratedClass BP_Sanc_Cabinet_Potnr_Dressing02.BP_Sanc_Cabinet_Potnr_Dressing02_C
// Size: 0x3c8 (Inherited: 0x248)
struct ABP_Sanc_Cabinet_Potnr_Dressing02_C : AActor {
	struct UPhysicalResponseComponent* PhysicalResponse22; // 0x248(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse16; // 0x250(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse56; // 0x258(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse60; // 0x260(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse59; // 0x268(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse58; // 0x270(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse57; // 0x278(0x08)
	struct UStaticMeshComponent* SM_Potion_04_105; // 0x280(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse55; // 0x288(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse26; // 0x290(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse25; // 0x298(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse41; // 0x2a0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse51; // 0x2a8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse54; // 0x2b0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse53; // 0x2b8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse52; // 0x2c0(0x08)
	struct UPointLightComponent* PointLight; // 0x2c8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse; // 0x2d0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse4; // 0x2d8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse50; // 0x2e0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse47; // 0x2e8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse42; // 0x2f0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse24; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_HW_L_New_Book_Large_C; // 0x300(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_Rolled_Parchment_H_49; // 0x308(0x08)
	struct UStaticMeshComponent* SM_HW_L_New_Book_C_72; // 0x310(0x08)
	struct UStaticMeshComponent* SM_CastleDun_GOB_PotionContainer_A2_129; // 0x318(0x08)
	struct UStaticMeshComponent* SM_HW_Cauldron_A; // 0x320(0x08)
	struct UStaticMeshComponent* SM_HM_MixingBowl; // 0x328(0x08)
	struct UStaticMeshComponent* SM_HW_Cauldron_A2; // 0x330(0x08)
	struct UStaticMeshComponent* SM_HW_L_New_Book_Medium_A; // 0x338(0x08)
	struct UStaticMeshComponent* SM_HW_L_Book_Large_A2; // 0x340(0x08)
	struct UStaticMeshComponent* SM_HW_L_New_Book_Medium_C; // 0x348(0x08)
	struct UStaticMeshComponent* SM_HW_L_Book_Small_C2; // 0x350(0x08)
	struct UStaticMeshComponent* SM_CastleDun_GOB_MortarPestle_C_a_123; // 0x358(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle13_18; // 0x360(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle3_12; // 0x368(0x08)
	struct UStaticMeshComponent* SM_Book_03_86; // 0x370(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle14_15; // 0x378(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle10_21; // 0x380(0x08)
	struct UBP_ID_OmniLight_Master_C* BP_ID_OmniLight_Master; // 0x388(0x08)
	struct UStaticMeshComponent* SM_Candle_Fat_B_65; // 0x390(0x08)
	struct UStaticMeshComponent* SM_HM_Candlestick_A_52; // 0x398(0x08)
	struct UStaticMeshComponent* SM_CastleDun_GOB_MagnifyingDevice_D3_120; // 0x3a0(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Jug_D2_62; // 0x3a8(0x08)
	struct UStaticMeshComponent* SM_HW_L_New_Book_H; // 0x3b0(0x08)
	struct UStaticMeshComponent* SM_CastleDun_GOB_Scales_B_42; // 0x3b8(0x08)
	struct USceneComponent* SceneRoot; // 0x3c0(0x08)
};

