// BlueprintGeneratedClass BP_Sanc_Bio_Glnd_CastleRuins_2_Door_F1.BP_Sanc_Bio_Glnd_CastleRuins_2_Door_F1_C
// Size: 0x330 (Inherited: 0x248)
struct ABP_Sanc_Bio_Glnd_CastleRuins_2_Door_F1_C : AActor {
	struct UStaticMeshComponent* Collision2; // 0x248(0x08)
	struct UStaticMeshComponent* Collision1; // 0x250(0x08)
	struct UStaticMeshComponent* Collision; // 0x258(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_B3; // 0x260(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_C; // 0x268(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_B2; // 0x270(0x08)
	struct UDecalComponent* MM_P_Decal_Wetness_drips5; // 0x278(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_G3; // 0x280(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_G2; // 0x288(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_G; // 0x290(0x08)
	struct UDecalComponent* MM_P_Decal_Wetness_drips4; // 0x298(0x08)
	struct UDecalComponent* MM_P_Decal_Wetness_drips3; // 0x2a0(0x08)
	struct UDecalComponent* MM_P_Decal_Wetness_drips2; // 0x2a8(0x08)
	struct UDecalComponent* MM_P_Decal_Wetness_drips; // 0x2b0(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_B; // 0x2b8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_2_Broken_A_a; // 0x2c0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_CastleRuins_2_Broken_A_b; // 0x2c8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_2_Broken_B_b; // 0x2d0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_CastleRuins_2_Broken_F_b; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_Door_D; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_Relief_H_a; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_Relief_H_b; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_Wall_D_a; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_Wall_D_b; // 0x300(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_2_Wall_G_a; // 0x308(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_Window_J; // 0x310(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_Broken_E; // 0x318(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_2_Broken_C_b; // 0x320(0x08)
	struct USceneComponent* SharedRoot; // 0x328(0x08)
};

