// BlueprintGeneratedClass BP_Sanc_Trash_1m_02A_Static.BP_Sanc_Trash_1m_02A_Static_C
// Size: 0x3e0 (Inherited: 0x248)
struct ABP_Sanc_Trash_1m_02A_Static_C : AActor {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x248(0x08)
	struct UStaticMeshComponent* Stack3Book8; // 0x250(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle13; // 0x258(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse33; // 0x260(0x08)
	struct UStaticMeshComponent* Stack3Book9; // 0x268(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse32; // 0x270(0x08)
	struct UStaticMeshComponent* Stack3Book5; // 0x278(0x08)
	struct UStaticMeshComponent* Stack3Book7; // 0x280(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse30; // 0x288(0x08)
	struct UStaticMeshComponent* Stack3Book6; // 0x290(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse29; // 0x298(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse31; // 0x2a0(0x08)
	struct UStaticMeshComponent* Stack3Book4; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_HW_L_BookRow_Half_C; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_HW_L_BookRow_Half_D; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_HW_L_CatalogShelfA_Shelf_C; // 0x2c0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse28; // 0x2c8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse27; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_HW_L_CatalogShelfA_Shelf_A; // 0x2d8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse1; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_HW_L_CatalogShelfA_Shelf_A1; // 0x2e8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse2; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_Goblin_Crates_Blue_Medium; // 0x2f8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse77; // 0x300(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse26; // 0x308(0x08)
	struct UStaticMeshComponent* Stack3Book3; // 0x310(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse25; // 0x318(0x08)
	struct UStaticMeshComponent* Stack3Book2; // 0x320(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse22; // 0x328(0x08)
	struct UStaticMeshComponent* Stack3Book1; // 0x330(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse21; // 0x338(0x08)
	struct UStaticMeshComponent* SM_HW_L_New_Book_D; // 0x340(0x08)
	struct UStaticMeshComponent* SM_HW_L_BookStack_Small_B1; // 0x348(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse24; // 0x350(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse23; // 0x358(0x08)
	struct UStaticMeshComponent* SM_HW_L_Book_Small_A2; // 0x360(0x08)
	struct UStaticMeshComponent* SM_HW_L_Book_Small_A3; // 0x368(0x08)
	struct UStaticMeshComponent* SM_HW_L_Book_Small_A1; // 0x370(0x08)
	struct UStaticMeshComponent* SM_HW_L_CatalogShelfA_Shelf_C1; // 0x378(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse; // 0x380(0x08)
	struct UStaticMeshComponent* SM_HW_L_BookStack_Small_B; // 0x388(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse20; // 0x390(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse19; // 0x398(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Chair_B; // 0x3a0(0x08)
	struct UStaticMeshComponent* SM_HW_L_Book_Small_A; // 0x3a8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse18; // 0x3b0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse76; // 0x3b8(0x08)
	struct USceneComponent* Scene; // 0x3c0(0x08)
	struct UBoxComponent* BoxCollision; // 0x3c8(0x08)
	struct USceneComponent* Root; // 0x3d0(0x08)
	struct UAkAudioEvent* AkEvent; // 0x3d8(0x08)

	struct TArray<struct FTransfigurationResource> GetAdditionalItemsReturned(); // Function BP_Sanc_Trash_1m_02A_Static.BP_Sanc_Trash_1m_02A_Static_C.GetAdditionalItemsReturned // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	bool IsObjectContextValidForTransformation(); // Function BP_Sanc_Trash_1m_02A_Static.BP_Sanc_Trash_1m_02A_Static_C.IsObjectContextValidForTransformation // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	bool IsObjectContextValidForVanishment(); // Function BP_Sanc_Trash_1m_02A_Static.BP_Sanc_Trash_1m_02A_Static_C.IsObjectContextValidForVanishment // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void DeactivateObject(); // Function BP_Sanc_Trash_1m_02A_Static.BP_Sanc_Trash_1m_02A_Static_C.DeactivateObject // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void FinalizeInitialAnimationState(); // Function BP_Sanc_Trash_1m_02A_Static.BP_Sanc_Trash_1m_02A_Static_C.FinalizeInitialAnimationState // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ObjectConjured(); // Function BP_Sanc_Trash_1m_02A_Static.BP_Sanc_Trash_1m_02A_Static_C.ObjectConjured // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ObjectStreamedSpawnInConfirmed(); // Function BP_Sanc_Trash_1m_02A_Static.BP_Sanc_Trash_1m_02A_Static_C.ObjectStreamedSpawnInConfirmed // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ObjectTransformationCancelled(); // Function BP_Sanc_Trash_1m_02A_Static.BP_Sanc_Trash_1m_02A_Static_C.ObjectTransformationCancelled // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ObjectTransformationConfirmed(); // Function BP_Sanc_Trash_1m_02A_Static.BP_Sanc_Trash_1m_02A_Static_C.ObjectTransformationConfirmed // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ObjectTransformationStarted(); // Function BP_Sanc_Trash_1m_02A_Static.BP_Sanc_Trash_1m_02A_Static_C.ObjectTransformationStarted // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ObjectVanished(); // Function BP_Sanc_Trash_1m_02A_Static.BP_Sanc_Trash_1m_02A_Static_C.ObjectVanished // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ReactivateObject(); // Function BP_Sanc_Trash_1m_02A_Static.BP_Sanc_Trash_1m_02A_Static_C.ReactivateObject // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void ObjectPhysicalResponseImpact(float ImpactIntensity, struct FName SpellName, struct FName ResponseConfigName, struct FVector& ImpactLocation); // Function BP_Sanc_Trash_1m_02A_Static.BP_Sanc_Trash_1m_02A_Static_C.ObjectPhysicalResponseImpact // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_BP_Sanc_Trash_1m_02A_Static(int32_t EntryPoint); // Function BP_Sanc_Trash_1m_02A_Static.BP_Sanc_Trash_1m_02A_Static_C.ExecuteUbergraph_BP_Sanc_Trash_1m_02A_Static // (Final|UbergraphFunction|HasDefaults) // @ game+0x38a7480
};

