// BlueprintGeneratedClass BP_Sanc_HubCornerBookshelfs_03_Potnr.BP_Sanc_HubCornerBookshelfs_03_Potnr_C
// Size: 0x340 (Inherited: 0x2e8)
struct ABP_Sanc_HubCornerBookshelfs_03_Potnr_C : ABP_Sanc_HubCornerBookshelfs_03_C {
	struct UDeferredChildActorComponent* Deferred_Dressing05; // 0x2e8(0x08)
	struct UDeferredChildActorComponent* Deferred_Dressing04; // 0x2f0(0x08)
	struct UDeferredChildActorComponent* Deferred_Dressing03; // 0x2f8(0x08)
	struct UDeferredChildActorComponent* Deferred_Dressing02; // 0x300(0x08)
	struct UDeferredChildActorComponent* Deferred_Dressing01; // 0x308(0x08)
	struct UStaticMeshComponent* SM_Sanc_Alcove_01_Dwiz2; // 0x310(0x08)
	struct UStaticMeshComponent* SM_Sanc_FloatingBookshelf_04_Potnr2; // 0x318(0x08)
	struct UTransformationFxInfoComponent* TransformationFxInfo; // 0x320(0x08)
	struct UStaticMeshComponent* SM_Sanc_Alcove_01_Dwiz3; // 0x328(0x08)
	struct UStaticMeshComponent* SM_Sanc_Alcove_01_Dwiz1; // 0x330(0x08)
	struct UStaticMeshComponent* SM_Sanc_Alcove_01_Dwiz; // 0x338(0x08)
};

