// BlueprintGeneratedClass BP_Sanc_Bio_Glnd_Castle_Ruins_01.BP_Sanc_Bio_Glnd_Castle_Ruins_01_C
// Size: 0x2b8 (Inherited: 0x248)
struct ABP_Sanc_Bio_Glnd_Castle_Ruins_01_C : AActor {
	struct UDecalComponent* MI_HW_Decal_SootSmudge_7; // 0x248(0x08)
	struct UDecalComponent* MI_HW_Decal_SootSmudge_6; // 0x250(0x08)
	struct UDecalComponent* MI_HW_Decal_SootSmudge_5; // 0x258(0x08)
	struct UDecalComponent* MI_HW_Decal_SootSmudge_4; // 0x260(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_3_Broken_D_C; // 0x268(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_3_Broken_B_a; // 0x270(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_CastleRuins_3_Broken_C; // 0x278(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_3_Broken_E; // 0x280(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_3_Broken_K; // 0x288(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_3_Broken_M_b; // 0x290(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_3_Broken_M_c; // 0x298(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_9SM_CastleRuins_3_TheSteps_B; // 0x2a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_3_Wall_M_a; // 0x2a8(0x08)
	struct USceneComponent* SharedRoot; // 0x2b0(0x08)
};

