// BlueprintGeneratedClass BP_Sanc_Bio_Bog_bogTree_Oak_LargeC_planted.BP_Sanc_Bio_Bog_bogTree_Oak_LargeC_planted_C
// Size: 0x2c0 (Inherited: 0x248)
struct ABP_Sanc_Bio_Bog_bogTree_Oak_LargeC_planted_C : AActor {
	struct UHierarchicalInstancedStaticMeshComponent* HISM_102SM_Moss_Lush_Master1; // 0x248(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_16SM_BeardMoss_D1; // 0x250(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_25SM_BeardMoss_C1; // 0x258(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_7SM_BeardMoss_A1; // 0x260(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_30SM_XeromphalinaClump_05; // 0x268(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_8SM_XeromphalinaClump_07; // 0x270(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_17SM_Pleurocybella_06; // 0x278(0x08)
	struct UStaticMeshComponent* SM_BogTree_Oak_LargeC1; // 0x280(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_12SM_Pleurocybella_02; // 0x288(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_12SM_Pleurocybella_04; // 0x290(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_30SM_BrackinFern_C_Fall1; // 0x298(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_CaloceraFungus_03; // 0x2a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_CaloceraFungus_02; // 0x2a8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_14SM_BrackinFern_C1; // 0x2b0(0x08)
	struct USceneComponent* SharedRoot; // 0x2b8(0x08)
};

