// BlueprintGeneratedClass BP_Sanc_TrashPileSmall_02A_Static.BP_Sanc_TrashPileSmall_02A_Static_C
// Size: 0x588 (Inherited: 0x248)
struct ABP_Sanc_TrashPileSmall_02A_Static_C : AActor {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x248(0x08)
	struct UCapsuleComponent* Capsule5; // 0x250(0x08)
	struct UPhysicalResponseComponent* MainPhysicalResponse5; // 0x258(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse4; // 0x260(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse5; // 0x268(0x08)
	struct UPhysicalResponseComponent* MainPhysicalResponse10; // 0x270(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse21; // 0x278(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse18; // 0x280(0x08)
	struct UStaticMeshComponent* BookcaseSmall; // 0x288(0x08)
	struct UStaticMeshComponent* Books5; // 0x290(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse61; // 0x298(0x08)
	struct UStaticMeshComponent* Scales2; // 0x2a0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse57; // 0x2a8(0x08)
	struct UStaticMeshComponent* Scales1; // 0x2b0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse58; // 0x2b8(0x08)
	struct UStaticMeshComponent* Vase2; // 0x2c0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse56; // 0x2c8(0x08)
	struct UStaticMeshComponent* Jug1; // 0x2d0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse55; // 0x2d8(0x08)
	struct UStaticMeshComponent* vase1; // 0x2e0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse54; // 0x2e8(0x08)
	struct UStaticMeshComponent* Books4; // 0x2f0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse53; // 0x2f8(0x08)
	struct UStaticMeshComponent* Chair18; // 0x300(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse3; // 0x308(0x08)
	struct UStaticMeshComponent* Chair21; // 0x310(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse2; // 0x318(0x08)
	struct UStaticMeshComponent* Chair20; // 0x320(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse1; // 0x328(0x08)
	struct UStaticMeshComponent* Chair19; // 0x330(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse; // 0x338(0x08)
	struct UStaticMeshComponent* Chair17; // 0x340(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse28; // 0x348(0x08)
	struct UStaticMeshComponent* Books11; // 0x350(0x08)
	struct UStaticMeshComponent* Chair16; // 0x358(0x08)
	struct UStaticMeshComponent* Chair13; // 0x360(0x08)
	struct UStaticMeshComponent* Chair15; // 0x368(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse26; // 0x370(0x08)
	struct UStaticMeshComponent* Chair14; // 0x378(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse25; // 0x380(0x08)
	struct UStaticMeshComponent* Brooms2; // 0x388(0x08)
	struct UStaticMeshComponent* BooksRow1; // 0x390(0x08)
	struct UPhysicalResponseComponent* MainPhysicalResponse8; // 0x398(0x08)
	struct UStaticMeshComponent* BooksRow2; // 0x3a0(0x08)
	struct UPhysicalResponseComponent* MainPhysicalResponse9; // 0x3a8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse24; // 0x3b0(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse27; // 0x3b8(0x08)
	struct UStaticMeshComponent* BookcaseLarge; // 0x3c0(0x08)
	struct UPhysicalResponseComponent* MainPhysicalResponse7; // 0x3c8(0x08)
	struct UStaticMeshComponent* Parchment3; // 0x3d0(0x08)
	struct UStaticMeshComponent* Parchment2; // 0x3d8(0x08)
	struct UPhysicalResponseComponent* MainPhysicalResponse6; // 0x3e0(0x08)
	struct UStaticMeshComponent* BookRow4; // 0x3e8(0x08)
	struct UStaticMeshComponent* BookRow3; // 0x3f0(0x08)
	struct UStaticMeshComponent* Books7; // 0x3f8(0x08)
	struct UStaticMeshComponent* Books10; // 0x400(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse20; // 0x408(0x08)
	struct UStaticMeshComponent* Books9; // 0x410(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse19; // 0x418(0x08)
	struct UStaticMeshComponent* Chair11; // 0x420(0x08)
	struct UStaticMeshComponent* Chair12; // 0x428(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse11; // 0x430(0x08)
	struct UStaticMeshComponent* Chest1; // 0x438(0x08)
	struct UStaticMeshComponent* Chair10; // 0x440(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse10; // 0x448(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse9; // 0x450(0x08)
	struct UStaticMeshComponent* Chair9; // 0x458(0x08)
	struct UStaticMeshComponent* Chair8; // 0x460(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse8; // 0x468(0x08)
	struct UStaticMeshComponent* Chair7; // 0x470(0x08)
	struct UStaticMeshComponent* Chair6; // 0x478(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse7; // 0x480(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse6; // 0x488(0x08)
	struct UStaticMeshComponent* books3; // 0x490(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse60; // 0x498(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse12; // 0x4a0(0x08)
	struct UStaticMeshComponent* Chest2; // 0x4a8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse13; // 0x4b0(0x08)
	struct UStaticMeshComponent* Books8; // 0x4b8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse59; // 0x4c0(0x08)
	struct UStaticMeshComponent* Chest5; // 0x4c8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse14; // 0x4d0(0x08)
	struct UStaticMeshComponent* Books1; // 0x4d8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse51; // 0x4e0(0x08)
	struct UStaticMeshComponent* Chest4; // 0x4e8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse15; // 0x4f0(0x08)
	struct UStaticMeshComponent* Chair4; // 0x4f8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse23; // 0x500(0x08)
	struct UStaticMeshComponent* Chair3; // 0x508(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse22; // 0x510(0x08)
	struct UStaticMeshComponent* Chair2; // 0x518(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse17; // 0x520(0x08)
	struct UStaticMeshComponent* Chair1; // 0x528(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse16; // 0x530(0x08)
	struct UStaticMeshComponent* Books2; // 0x538(0x08)
	struct UStaticMeshComponent* SM_BCProps_FloorCloth_E1; // 0x540(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse52; // 0x548(0x08)
	struct UStaticMeshComponent* Chest3; // 0x550(0x08)
	struct UStaticMeshComponent* SM_BCProps_FloorCloth_E; // 0x558(0x08)
	struct UStaticMeshComponent* Table1; // 0x560(0x08)
	struct USceneComponent* Scene; // 0x568(0x08)
	struct UStaticMeshComponent* Collision; // 0x570(0x08)
	struct USceneComponent* SharedRoot; // 0x578(0x08)
	struct UAkAudioEvent* AkEvent; // 0x580(0x08)

	struct TArray<struct FTransfigurationResource> GetAdditionalItemsReturned(); // Function BP_Sanc_TrashPileSmall_02A_Static.BP_Sanc_TrashPileSmall_02A_Static_C.GetAdditionalItemsReturned // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	bool IsObjectContextValidForTransformation(); // Function BP_Sanc_TrashPileSmall_02A_Static.BP_Sanc_TrashPileSmall_02A_Static_C.IsObjectContextValidForTransformation // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	bool IsObjectContextValidForVanishment(); // Function BP_Sanc_TrashPileSmall_02A_Static.BP_Sanc_TrashPileSmall_02A_Static_C.IsObjectContextValidForVanishment // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void DeactivateObject(); // Function BP_Sanc_TrashPileSmall_02A_Static.BP_Sanc_TrashPileSmall_02A_Static_C.DeactivateObject // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void FinalizeInitialAnimationState(); // Function BP_Sanc_TrashPileSmall_02A_Static.BP_Sanc_TrashPileSmall_02A_Static_C.FinalizeInitialAnimationState // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ObjectConjured(); // Function BP_Sanc_TrashPileSmall_02A_Static.BP_Sanc_TrashPileSmall_02A_Static_C.ObjectConjured // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ObjectStreamedSpawnInConfirmed(); // Function BP_Sanc_TrashPileSmall_02A_Static.BP_Sanc_TrashPileSmall_02A_Static_C.ObjectStreamedSpawnInConfirmed // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ObjectTransformationCancelled(); // Function BP_Sanc_TrashPileSmall_02A_Static.BP_Sanc_TrashPileSmall_02A_Static_C.ObjectTransformationCancelled // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ObjectTransformationConfirmed(); // Function BP_Sanc_TrashPileSmall_02A_Static.BP_Sanc_TrashPileSmall_02A_Static_C.ObjectTransformationConfirmed // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ObjectTransformationStarted(); // Function BP_Sanc_TrashPileSmall_02A_Static.BP_Sanc_TrashPileSmall_02A_Static_C.ObjectTransformationStarted // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ObjectVanished(); // Function BP_Sanc_TrashPileSmall_02A_Static.BP_Sanc_TrashPileSmall_02A_Static_C.ObjectVanished // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ReactivateObject(); // Function BP_Sanc_TrashPileSmall_02A_Static.BP_Sanc_TrashPileSmall_02A_Static_C.ReactivateObject // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void ObjectPhysicalResponseImpact(float ImpactIntensity, struct FName SpellName, struct FName ResponseConfigName, struct FVector& ImpactLocation); // Function BP_Sanc_TrashPileSmall_02A_Static.BP_Sanc_TrashPileSmall_02A_Static_C.ObjectPhysicalResponseImpact // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_BP_Sanc_TrashPileSmall_02A_Static(int32_t EntryPoint); // Function BP_Sanc_TrashPileSmall_02A_Static.BP_Sanc_TrashPileSmall_02A_Static_C.ExecuteUbergraph_BP_Sanc_TrashPileSmall_02A_Static // (Final|UbergraphFunction|HasDefaults) // @ game+0x38a7480
};

