// BlueprintGeneratedClass BP_ST_BarrelStack_Large_B.BP_ST_BarrelStack_Large_B_C
// Size: 0x358 (Inherited: 0x2d0)
struct ABP_ST_BarrelStack_Large_B_C : ABP_SendTargetCluster_C {
	struct UStaticMeshComponent* SM_BarrelRack_B; // 0x2d0(0x08)
	struct UChildActorComponent* BP_Prop_Barrel_Breakable_C1; // 0x2d8(0x08)
	struct UChildActorComponent* BP_Prop_Barrel_Breakable_A1; // 0x2e0(0x08)
	struct UChildActorComponent* BP_Prop_Barrel_Breakable_B2; // 0x2e8(0x08)
	struct UChildActorComponent* BP_Prop_Barrel_Breakable_B3; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_BCProps_Lantern_001; // 0x2f8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse1; // 0x300(0x08)
	struct UStaticMeshComponent* SM_CampB_2m_PostA; // 0x308(0x08)
	struct UStaticMeshComponent* SM_CampB_2m_PlankA2; // 0x310(0x08)
	struct UStaticMeshComponent* SM_CampB_2m_PlankA1; // 0x318(0x08)
	struct UStaticMeshComponent* SM_CampB_2m_PlankA; // 0x320(0x08)
	struct UStaticMeshComponent* SM_Prop_Barrel_Unbreakable_A2; // 0x328(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse4; // 0x330(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse3; // 0x338(0x08)
	struct UStaticMeshComponent* SM_Prop_Barrel_Unbreakable_A1; // 0x340(0x08)
	struct UStaticMeshComponent* SM_Prop_Barrel_Unbreakable_A; // 0x348(0x08)
	struct USceneComponent* SharedRoot; // 0x350(0x08)
};

