// BlueprintGeneratedClass BP_Sanc_QuidditchDiagrams.BP_Sanc_QuidditchDiagrams_C
// Size: 0x368 (Inherited: 0x2a8)
struct ABP_Sanc_QuidditchDiagrams_C : ATransfigurationObjectBase {
	struct UDeferredChildActorComponent* Deferred_Dressing01; // 0x2a8(0x08)
	struct UConjurationSurfaceShapeComponent* ConjurationSurfaceShape; // 0x2b0(0x08)
	struct UBoxComponent* BoxCollision; // 0x2b8(0x08)
	struct UConjurationSnappingWallComponent* ConjurationSnappingWall; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_BulletinE3; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_BulletinE2; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_BulletinA9; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_BulletinA8; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_Chalk2; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_Chalk3; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_HW_QuidditchPitch_SmallFlags_Stripe7_153; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_BCProps_Eyelet_A4_154; // 0x300(0x08)
	struct UStaticMeshComponent* SM_BulletinE4; // 0x308(0x08)
	struct UStaticMeshComponent* SM_BulletinA7; // 0x310(0x08)
	struct UStaticMeshComponent* SM_Sanc_QuidditchDiagrams; // 0x318(0x08)
	struct UStaticMeshComponent* SM_BCProps_Eyelet_A5_155; // 0x320(0x08)
	struct UStaticMeshComponent* SM_BulletinE_131; // 0x328(0x08)
	struct UStaticMeshComponent* SM_BCProps_Eyelet_A6_160; // 0x330(0x08)
	struct UStaticMeshComponent* SM_Chalk_172; // 0x338(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_Rolled_Parchment_A2; // 0x340(0x08)
	struct UStaticMeshComponent* SM_HW_QuidditchPitch_SmallFlags_D3; // 0x348(0x08)
	struct UStaticMeshComponent* SM_BCProps_Eyelet_A7_161; // 0x350(0x08)
	struct UStaticMeshComponent* SM_HW_QuidditchPitch_SmallFlags_Stripe8_159; // 0x358(0x08)
	struct USceneComponent* Scene; // 0x360(0x08)
};

