// BlueprintGeneratedClass BP_Sanc_Bio_Glnd_CastleRuins_2_C.BP_Sanc_Bio_Glnd_CastleRuins_2_C_C
// Size: 0x2f8 (Inherited: 0x248)
struct ABP_Sanc_Bio_Glnd_CastleRuins_2_C_C : AActor {
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_F6; // 0x248(0x08)
	struct UDecalComponent* MI_Castle_Ruin1_WhiteLichen4; // 0x250(0x08)
	struct UDecalComponent* MI_Castle_Ruin1_Decal_SootSmudge_8; // 0x258(0x08)
	struct UDecalComponent* MI_HW_Decal_SootSmudge_7; // 0x260(0x08)
	struct UDecalComponent* MI_HW_Decal_SootSmudge_4; // 0x268(0x08)
	struct UDecalComponent* MI_HW_Decal_SootSmudge_3; // 0x270(0x08)
	struct UDecalComponent* MI_Castle_Ruin1_WhiteLichen1; // 0x278(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_Broken_B_c; // 0x280(0x08)
	struct UStaticMeshComponent* SM_BIO_CastleRuinsSmall_Wall_A_a1; // 0x288(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_2_Window_G; // 0x290(0x08)
	struct UStaticMeshComponent* SM_CastleRuinsSmall_2_Wall_A_a; // 0x298(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_2_Broken_B_a; // 0x2a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_CastleRuins_2_Broken_E; // 0x2a8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_CastleRuins_2_Broken_G; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_CastleRuinsSmall_2_Archway_A; // 0x2b8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_2_Broken_P_c; // 0x2c0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_18SM_CastleRuins_2_Broken_B_b; // 0x2c8(0x08)
	struct UBoxComponent* w2; // 0x2d0(0x08)
	struct UBoxComponent* w1; // 0x2d8(0x08)
	struct UBoxComponent* W; // 0x2e0(0x08)
	struct UBoxComponent* Box; // 0x2e8(0x08)
	struct USceneComponent* SharedRoot; // 0x2f0(0x08)
};

