// BlueprintGeneratedClass BP_Sanc_HubCornerBookshelfs_03_Potnr_Dressing01.BP_Sanc_HubCornerBookshelfs_03_Potnr_Dressing01_C
// Size: 0x2a8 (Inherited: 0x248)
struct ABP_Sanc_HubCornerBookshelfs_03_Potnr_Dressing01_C : AActor {
	struct UStaticMeshComponent* StaticMesh8; // 0x248(0x08)
	struct UStaticMeshComponent* StaticMesh7; // 0x250(0x08)
	struct UStaticMeshComponent* StaticMesh5; // 0x258(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle91; // 0x260(0x08)
	struct UStaticMeshComponent* StaticMesh2; // 0x268(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle8; // 0x270(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle14; // 0x278(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle112; // 0x280(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle13; // 0x288(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle9; // 0x290(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle11; // 0x298(0x08)
	struct USceneComponent* SceneRoot; // 0x2a0(0x08)
};

