// BlueprintGeneratedClass BP_ToolShelf_C.BP_ToolShelf_C_C
// Size: 0x2b0 (Inherited: 0x248)
struct ABP_ToolShelf_C_C : AActor {
	struct UStaticMeshComponent* SM_CampB_2m_PostA; // 0x248(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Hammer_001_W; // 0x250(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Jug_001_W; // 0x258(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Jug_002_W; // 0x260(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Lantern_002; // 0x268(0x08)
	struct UStaticMeshComponent* SM_CampB_WoodenPole; // 0x270(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Axe_002_W; // 0x278(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_BCProps_Eyelet_A; // 0x280(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeHanging_A; // 0x288(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeKnot_A; // 0x290(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeSpan_L; // 0x298(0x08)
	struct UStaticMeshComponent* SM_CampB_2m_PlankA; // 0x2a0(0x08)
	struct USceneComponent* SharedRoot; // 0x2a8(0x08)
};

