// BlueprintGeneratedClass BP_Thief_TableFood_A.BP_Thief_TableFood_A_C
// Size: 0x3da (Inherited: 0x248)
struct ABP_Thief_TableFood_A_C : AActor {
	struct UStaticMeshComponent* SM_Int_BCProps_Table_Long_001_D; // 0x248(0x08)
	struct UStaticMeshComponent* SM_CastleDun_HayPile_D; // 0x250(0x08)
	struct UStaticMeshComponent* SM_CastleDun_HayPile_A1; // 0x258(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_Int_BCProps_Spoon_001; // 0x260(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_Int_BCProps_Plate_002; // 0x268(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_Int_BCProps_Fork_001; // 0x270(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_Int_BCProps_Plate_001; // 0x278(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Rope_002_W1; // 0x280(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Singles_Rib2; // 0x288(0x08)
	struct UStaticMeshComponent* StaticMeshComponent43; // 0x290(0x08)
	struct UStaticMeshComponent* StaticMeshComponent41; // 0x298(0x08)
	struct UStaticMeshComponent* StaticMeshComponent17; // 0x2a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent37; // 0x2a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent33; // 0x2b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent31; // 0x2b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent30; // 0x2c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent23; // 0x2c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent22; // 0x2d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent16; // 0x2d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent21; // 0x2e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent19; // 0x2e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent18; // 0x2f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent38; // 0x2f8(0x08)
	struct UChildActorComponent* BP_Int_BCProps_Bucket_Small_001; // 0x300(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Pot_002_W; // 0x308(0x08)
	struct UChildActorComponent* BP_HW_Cup_interact_Jug_B; // 0x310(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Singles_Rib1; // 0x318(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Singles_BreadLoaf1; // 0x320(0x08)
	struct UStaticMeshComponent* StaticMeshComponent34; // 0x328(0x08)
	struct UStaticMeshComponent* StaticMeshComponent24; // 0x330(0x08)
	struct UStaticMeshComponent* StaticMeshComponent27; // 0x338(0x08)
	struct UStaticMeshComponent* StaticMeshComponent20; // 0x340(0x08)
	struct UStaticMeshComponent* StaticMeshComponent36; // 0x348(0x08)
	struct UStaticMeshComponent* StaticMeshComponent45; // 0x350(0x08)
	struct UStaticMeshComponent* StaticMeshComponent46; // 0x358(0x08)
	struct UStaticMeshComponent* StaticMeshComponent26; // 0x360(0x08)
	struct UStaticMeshComponent* StaticMeshComponent12; // 0x368(0x08)
	struct UStaticMeshComponent* StaticMeshComponent35; // 0x370(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_WoodTub_Medium_001_W; // 0x378(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse5; // 0x380(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse4; // 0x388(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse3; // 0x390(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse2; // 0x398(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse1; // 0x3a0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Lantern_001; // 0x3a8(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse; // 0x3b0(0x08)
	struct UChildActorComponent* BP_Destructible_BenchLong_01_2; // 0x3b8(0x08)
	struct UChildActorComponent* BP_Destructible_BenchLong_01; // 0x3c0(0x08)
	struct UDecalComponent* NewDecalComponent; // 0x3c8(0x08)
	struct USceneComponent* SharedRoot; // 0x3d0(0x08)
	bool Food Off; // 0x3d8(0x01)
	bool Extra Stuff Off; // 0x3d9(0x01)

	void UserConstructionScript(); // Function BP_Thief_TableFood_A.BP_Thief_TableFood_A_C.UserConstructionScript // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
};

