// BlueprintGeneratedClass BP_TableFood_Cutting_A.BP_TableFood_Cutting_A_C
// Size: 0x2e1 (Inherited: 0x248)
struct ABP_TableFood_Cutting_A_C : AActor {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x248(0x08)
	struct UStaticMeshComponent* SM_Meat_Flesh; // 0x250(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse3; // 0x258(0x08)
	struct UStaticMeshComponent* SM_Meat_Carcass; // 0x260(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse2; // 0x268(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Basket_Small_004_W; // 0x270(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse1; // 0x278(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Cauldron_001; // 0x280(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse; // 0x288(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Singles_Rib; // 0x290(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Singles_Rib1; // 0x298(0x08)
	struct UStaticMeshComponent* SM_BCProps_Apple_E1; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_BCProps_Apple_E; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_BCProps_Apple_D; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_CastleDun_HayPile_D; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Axe_002_W; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_HangingProps_Bags_007_F; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Table_Medium_001_D; // 0x2d0(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x2d8(0x08)
	bool Food Off; // 0x2e0(0x01)

	void UserConstructionScript(); // Function BP_TableFood_Cutting_A.BP_TableFood_Cutting_A_C.UserConstructionScript // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void ReceiveBeginPlay(); // Function BP_TableFood_Cutting_A.BP_TableFood_Cutting_A_C.ReceiveBeginPlay // (Event|Protected|BlueprintEvent) // @ game+0x38a7480
	void Food Off in Editor(); // Function BP_TableFood_Cutting_A.BP_TableFood_Cutting_A_C.Food Off in Editor // (BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_BP_TableFood_Cutting_A(int32_t EntryPoint); // Function BP_TableFood_Cutting_A.BP_TableFood_Cutting_A_C.ExecuteUbergraph_BP_TableFood_Cutting_A // (Final|UbergraphFunction) // @ game+0x38a7480
};

