// BlueprintGeneratedClass BP_ToolShelf_D.BP_ToolShelf_D_C
// Size: 0x2d8 (Inherited: 0x248)
struct ABP_ToolShelf_D_C : AActor {
	struct UStaticMeshComponent* SM_CampB_5m_PostA; // 0x248(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_15SM_BCProps_Eyelet_A; // 0x250(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Tongs_003; // 0x258(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleDun_MetalBand_A; // 0x260(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleDun_MetalBand_B; // 0x268(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Basket_Small_003_W; // 0x270(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Bucket_Small_001_W; // 0x278(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Hammer_001_W; // 0x280(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Axe_002_W; // 0x288(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Axe_001_W; // 0x290(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Jug_001_W; // 0x298(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Lantern_002; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Pitchfork_001_W; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Saw_Medium_001; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Saw_Large_001; // 0x2b8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Int_BCProps_Tongs_001; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Tongs_002; // 0x2c8(0x08)
	struct USceneComponent* SharedRoot; // 0x2d0(0x08)
};

