// BlueprintGeneratedClass BP_Troll_Camp_Teepee.BP_Troll_Camp_Teepee_C
// Size: 0x298 (Inherited: 0x248)
struct ABP_Troll_Camp_Teepee_C : AActor {
	struct UStaticMeshComponent* SM_MERGED_SM_TrollTeepee_Logs; // 0x248(0x08)
	struct UStaticMeshComponent* SM_MERGED_SM_TrollTeepee_Pelts; // 0x250(0x08)
	struct UStaticMeshComponent* SM_MERGED_SM_TrollTeepee_Rope; // 0x258(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_CaveRoots_Set1_G; // 0x260(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_AshTree_SmallD; // 0x268(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HeroTreeBearBranch__S_Master; // 0x270(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CaveRoots_Set1_D; // 0x278(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_HeroTreeBranch_Master; // 0x280(0x08)
	struct USceneComponent* Collision; // 0x288(0x08)
	struct USceneComponent* SharedRoot; // 0x290(0x08)
};

