// BlueprintGeneratedClass BP_Troll_Lean-to.BP_Troll_Lean-to_C
// Size: 0x298 (Inherited: 0x248)
struct ABP_Troll_Lean-to_C : AActor {
	struct UStaticMeshComponent* SM_TrollLean_COL_01; // 0x248(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_OL_Rock_SM_Light_D1; // 0x250(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_11SM_OL_Rock_Md_A1; // 0x258(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_FallenTree_Log_B1; // 0x260(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_10SM_FallenTree_Log_C1; // 0x268(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CaveRoots_Set1_F1; // 0x270(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_9SM_HeroTreeBranch_45_Master1; // 0x278(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Rope3; // 0x280(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_7SM_TrollTree_03; // 0x288(0x08)
	struct USceneComponent* SharedRoot; // 0x290(0x08)
};

