// BlueprintGeneratedClass BP_TrollHut.BP_TrollHut_C
// Size: 0x2c8 (Inherited: 0x248)
struct ABP_TrollHut_C : AActor {
	struct FNone* OdcNavMeshVolume; // 0x248(0x08)
	struct UStaticMeshComponent* SM_MERGED_SM_TrollDen_Textiles; // 0x250(0x08)
	struct UDecalComponent* MI_Cairn_Decal_MossPatch_B3; // 0x258(0x08)
	struct UDecalComponent* MI_Cairn_Decal_MossPatch_C2; // 0x260(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Damage_A_3; // 0x268(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Color_B2; // 0x270(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Color_B; // 0x278(0x08)
	struct UDecalComponent* MI_Cairn_Decal_MossPatch_C; // 0x280(0x08)
	struct UDecalComponent* MI_Cairn_Decal_MossPatch_B2; // 0x288(0x08)
	struct UDecalComponent* MI_Cairn_Decal_MossPatch_B; // 0x290(0x08)
	struct UStaticMeshComponent* SM_MERGED_SM_OL_Rock_Md_A_D; // 0x298(0x08)
	struct UStaticMeshComponent* SM_MERGED_SM_TrollTree_Logs; // 0x2a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_CaveRoots_Set1_E; // 0x2a8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_HeroTreeBranch_01_Master; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_MERGED_SM_Cairn_Bones; // 0x2b8(0x08)
	struct USceneComponent* SharedRoot; // 0x2c0(0x08)
};

