// BlueprintGeneratedClass BP_Vault_CrawlDoor_02.BP_Vault_CrawlDoor_02_C
// Size: 0x338 (Inherited: 0x248)
struct ABP_Vault_CrawlDoor_02_C : AActor {
	struct UStaticMeshComponent* SM_BeardMoss_C2; // 0x248(0x08)
	struct UStaticMeshComponent* SM_BeardMoss_A1; // 0x250(0x08)
	struct UStaticMeshComponent* SM_BeardMoss_C1; // 0x258(0x08)
	struct UStaticMeshComponent* SM_BeardMoss_A; // 0x260(0x08)
	struct UStaticMeshComponent* SM_BeardMoss_C; // 0x268(0x08)
	struct UStaticMeshComponent* StaticMesh63; // 0x270(0x08)
	struct UStaticMeshComponent* adad; // 0x278(0x08)
	struct UStaticMeshComponent* SM_Cairn_RockPile_B_001; // 0x280(0x08)
	struct UStaticMeshComponent* SM_Cairn_RockPile_E_001; // 0x288(0x08)
	struct UStaticMeshComponent* StaticMesh62; // 0x290(0x08)
	struct UStaticMeshComponent* StaticMesh26; // 0x298(0x08)
	struct UStaticMeshComponent* SM_Cairn_StoneDebris07; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_Cairn_StoneDebris06; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_Cairn_Wall_SideHall2_Cutout_C; // 0x2b0(0x08)
	struct UStaticMeshComponent* StaticMesh58; // 0x2b8(0x08)
	struct UStaticMeshComponent* StaticMesh35; // 0x2c0(0x08)
	struct UStaticMeshComponent* StaticMesh29; // 0x2c8(0x08)
	struct UStaticMeshComponent* StaticMesh25; // 0x2d0(0x08)
	struct UStaticMeshComponent* StaticMesh13; // 0x2d8(0x08)
	struct UStaticMeshComponent* StaticMesh24; // 0x2e0(0x08)
	struct UStaticMeshComponent* StaticMesh61; // 0x2e8(0x08)
	struct UStaticMeshComponent* StaticMesh60; // 0x2f0(0x08)
	struct UStaticMeshComponent* StaticMesh59; // 0x2f8(0x08)
	struct UStaticMeshComponent* StaticMesh57; // 0x300(0x08)
	struct UStaticMeshComponent* StaticMesh56; // 0x308(0x08)
	struct UStaticMeshComponent* MinimumSpaceCube; // 0x310(0x08)
	struct UStaticMeshComponent* SM_Door_Crawl_01; // 0x318(0x08)
	struct UStaticMeshComponent* Door_Crawl_01; // 0x320(0x08)
	struct UChildActorComponent* BP_NavCrawl; // 0x328(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x330(0x08)
};

