// BlueprintGeneratedClass BP_Vault_Castle_A_EntranceArch.BP_Vault_Castle_A_EntranceArch_C
// Size: 0x489 (Inherited: 0x248)
struct ABP_Vault_Castle_A_EntranceArch_C : AActor {
	struct UCameraStackVolumeComponent* CameraStackVolume2; // 0x248(0x08)
	struct UBoxComponent* Box3; // 0x250(0x08)
	struct UCameraStackVolumeComponent* CameraStackVolume3; // 0x258(0x08)
	struct UBoxComponent* Box4; // 0x260(0x08)
	struct UStaticMeshComponent* SM_C_Dun_Wall_4_7; // 0x268(0x08)
	struct UStaticMeshComponent* StaticMesh23; // 0x270(0x08)
	struct UStaticMeshComponent* SM_C_Dun_Wall_5; // 0x278(0x08)
	struct UStaticMeshComponent* StaticMesh22; // 0x280(0x08)
	struct UStaticMeshComponent* StaticMesh21; // 0x288(0x08)
	struct UStaticMeshComponent* StaticMesh20; // 0x290(0x08)
	struct UStaticMeshComponent* StaticMesh19; // 0x298(0x08)
	struct UStaticMeshComponent* StaticMesh18; // 0x2a0(0x08)
	struct UStaticMeshComponent* StaticMesh17; // 0x2a8(0x08)
	struct UStaticMeshComponent* StaticMesh16; // 0x2b0(0x08)
	struct UStaticMeshComponent* StaticMesh15; // 0x2b8(0x08)
	struct UStaticMeshComponent* StaticMesh14; // 0x2c0(0x08)
	struct UStaticMeshComponent* StaticMesh13; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_CastleDungeon_CurbStyle_2_A6; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_C_Dun_Wall_4_5; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_CastleDungeon_CurbStyle_2_A5; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_CastleDungeon_CurbStyle_2_A2; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_CastleDungeon_CurbStyle_2_A; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_CastleDungeon_CurbStyle_2_A3; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_CastleDungeon_CurbStyle_2_A4; // 0x300(0x08)
	struct UStaticMeshComponent* StaticMesh12; // 0x308(0x08)
	struct UStaticMeshComponent* StaticMesh11; // 0x310(0x08)
	struct UStaticMeshComponent* StaticMesh10; // 0x318(0x08)
	struct UStaticMeshComponent* StaticMesh9; // 0x320(0x08)
	struct UStaticMeshComponent* StaticMesh8; // 0x328(0x08)
	struct UStaticMeshComponent* StaticMesh7; // 0x330(0x08)
	struct UStaticMeshComponent* StaticMesh6; // 0x338(0x08)
	struct UStaticMeshComponent* StaticMesh5; // 0x340(0x08)
	struct UStaticMeshComponent* SM_CastleDun_3dDecal_Small_E; // 0x348(0x08)
	struct UStaticMeshComponent* StaticMesh4; // 0x350(0x08)
	struct UStaticMeshComponent* StaticMesh3; // 0x358(0x08)
	struct UStaticMeshComponent* StaticMesh2; // 0x360(0x08)
	struct UStaticMeshComponent* StaticMesh1; // 0x368(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x370(0x08)
	struct UStaticMeshComponent* SM_VaultFloor_CastleDoorway; // 0x378(0x08)
	struct UStaticMeshComponent* SM_C_Dun_Wall_4_6; // 0x380(0x08)
	struct UStaticMeshComponent* SM_C_Dun_Wall_4_4; // 0x388(0x08)
	struct UStaticMeshComponent* SM_C_Dun_Wall_4_3; // 0x390(0x08)
	struct UStaticMeshComponent* SM_CastleDun_Wall_HalfWidth8; // 0x398(0x08)
	struct UStaticMeshComponent* SM_CastleDun_Wall_HalfWidth7; // 0x3a0(0x08)
	struct UStaticMeshComponent* SM_CastleDun_Wall_HalfWidth6; // 0x3a8(0x08)
	struct UStaticMeshComponent* SM_CastleDun_Wall_HalfWidth5; // 0x3b0(0x08)
	struct UStaticMeshComponent* SM_CastleDun_Wall_HalfWidth4; // 0x3b8(0x08)
	struct UStaticMeshComponent* SM_CastleDun_Wall_HalfWidth3; // 0x3c0(0x08)
	struct UStaticMeshComponent* SM_CastleDun_Wall_HalfWidth2; // 0x3c8(0x08)
	struct UStaticMeshComponent* SM_CastleDun_Wall_HalfWidth; // 0x3d0(0x08)
	struct UStaticMeshComponent* SM_CastleDun_Roof_G4; // 0x3d8(0x08)
	struct UStaticMeshComponent* SM_CastleDun_Roof_G3; // 0x3e0(0x08)
	struct UStaticMeshComponent* SM_CastleDun_Roof_G2; // 0x3e8(0x08)
	struct UStaticMeshComponent* SM_CastleDun_Roof_G; // 0x3f0(0x08)
	struct UStaticMeshComponent* SM_CastleDun_LowerRail_B5; // 0x3f8(0x08)
	struct UStaticMeshComponent* SM_CastleDun_LowerRail_B4; // 0x400(0x08)
	struct UStaticMeshComponent* SM_CastleDun_LowerRail_B3; // 0x408(0x08)
	struct UStaticMeshComponent* SM_CastleDun_LowerRail_B2; // 0x410(0x08)
	struct UStaticMeshComponent* SM_CastleDun_LowerRail_B; // 0x418(0x08)
	struct UStaticMeshComponent* SM_CastleDun_FloorBroken_A2; // 0x420(0x08)
	struct UStaticMeshComponent* SM_CastleDun_FloorBroken_A; // 0x428(0x08)
	struct UStaticMeshComponent* SM_CastleDun_Column_A_5Meter4; // 0x430(0x08)
	struct UStaticMeshComponent* SM_CastleDun_Column_A_5Meter3; // 0x438(0x08)
	struct UStaticMeshComponent* SM_CastleDun_Column_A_5Meter2; // 0x440(0x08)
	struct UStaticMeshComponent* SM_CastleDun_Column_A_5Meter; // 0x448(0x08)
	struct UStaticMeshComponent* SM_CastleDun_5m_StoneStep_D; // 0x450(0x08)
	struct UStaticMeshComponent* SM_CastleDun_5m_StoneStep_C; // 0x458(0x08)
	struct UStaticMeshComponent* SM_CastleDun_5m_StoneStep_B2; // 0x460(0x08)
	struct UStaticMeshComponent* SM_CastleDun_5m_StoneStep_B; // 0x468(0x08)
	struct UStaticMeshComponent* SM_CastleDun_5m_StoneStep_A2; // 0x470(0x08)
	struct UStaticMeshComponent* SM_CastleDun_5m_StoneStep_A; // 0x478(0x08)
	struct USceneComponent* SharedRoot; // 0x480(0x08)
	bool Blocker Toggle; // 0x488(0x01)
};

