// BlueprintGeneratedClass BP_Vault_Goblin_HallwayRight_01.BP_Vault_Goblin_HallwayRight_01_C
// Size: 0x468 (Inherited: 0x248)
struct ABP_Vault_Goblin_HallwayRight_01_C : AActor {
	struct UChildActorComponent* BP_Int_BCProps_OpenCrate_Small_002; // 0x248(0x08)
	struct UChildActorComponent* BP_Int_BCProps_OpenCrate_Small_001; // 0x250(0x08)
	struct UDecalComponent* VFX_MI_Decal_WaterSurface_DungeonsLight4_NewDecalComponent; // 0x258(0x08)
	struct UDecalComponent* VFX_MI_Decal_WaterSurface_DungeonsLight3_NewDecalComponent; // 0x260(0x08)
	struct UDecalComponent* VFX_MI_Decal_WaterSurface_DungeonsLight_NewDecalComponent; // 0x268(0x08)
	struct UStaticMeshComponent* SM_Vault_Goblin_HallwayWalls_A_StaticMeshComponent0; // 0x270(0x08)
	struct UInstancedStaticMeshComponent* SM_Vault_Cave_RockPile_01_InstancedStaticMesh; // 0x278(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* SM_ScreePile_B_HierarchicalInstancedStaticMesh; // 0x280(0x08)
	struct UStaticMeshComponent* SM_ScreePile_A3_StaticMeshComponent0; // 0x288(0x08)
	struct UInstancedStaticMeshComponent* SM_ScreePile_A_InstancedStaticMesh; // 0x290(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* SM_OL_CliffRock_B2_1 (HISMA)_HierarchicalInstancedStaticMesh; // 0x298(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* SM_OL_CliffRock_B2_1_HierarchicalInstancedStaticMesh; // 0x2a0(0x08)
	struct UInstancedStaticMeshComponent* SM_OL2_RockAssembly_D_InstancedStaticMesh; // 0x2a8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* SM_OL2_RockAssembly_B_HierarchicalInstancedStaticMesh; // 0x2b0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* SM_GobMine_Tunnel_Trim_C (HISMA)_HierarchicalInstancedStaticMesh; // 0x2b8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* SM_GobMine_TrimWall_Column_D (HISMA)_HierarchicalInstancedStaticMesh; // 0x2c0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* SM_GobMine_OL_Camp_Wall_A (HISMA)_HierarchicalInstancedStaticMesh; // 0x2c8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* SM_GobMine_MetalFloorGrid_150cmx150cm_A (HISMA)_HierarchicalInstancedStaticMesh; // 0x2d0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* SM_GobMine_Manhole_Base_A (HISMA)_HierarchicalInstancedStaticMesh; // 0x2d8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* SM_GobMine_Chariot_A (HISMA)_HierarchicalInstancedStaticMesh; // 0x2e0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* SM_GobMine_BrickWall_TRIM01_D (HISMA)_HierarchicalInstancedStaticMesh; // 0x2e8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* SM_GobMine_BrickWall_500Hx750W_BOT_A (HISMA)_HierarchicalInstancedStaticMesh; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_GobMine_BrickWall_500Hx500W_MID_B_StaticMeshComponent0; // 0x2f8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* SM_GobMine_Beam_400Hx125W_A_Rust (HISMA)_HierarchicalInstancedStaticMesh; // 0x300(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* SM_CastleDun_Arch_Trim_C (HISMA)_HierarchicalInstancedStaticMesh; // 0x308(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* SM_BeardMoss_C (HISMA)_HierarchicalInstancedStaticMesh; // 0x310(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* SM_BeardMoss_A (HISMA)_HierarchicalInstancedStaticMesh; // 0x318(0x08)
	struct UParticleSystemComponent* P_WaterDrips2_ParticleSystemComponent0; // 0x320(0x08)
	struct UParticleSystemComponent* P_WaterDrips_ParticleSystemComponent0; // 0x328(0x08)
	struct UDecalComponent* M_P_Decal_Stain4_NewDecalComponent; // 0x330(0x08)
	struct UDecalComponent* M_P_Decal_Stain3_NewDecalComponent; // 0x338(0x08)
	struct UDecalComponent* M_P_Decal_Stain2_NewDecalComponent; // 0x340(0x08)
	struct UDecalComponent* M_P_Decal_Stain_NewDecalComponent; // 0x348(0x08)
	struct UDecalComponent* MI_Sanc_BIO_COAST_Decal_WetSand_02_NewDecalComponent; // 0x350(0x08)
	struct UDecalComponent* MI_P_Decal_Stain6_NewDecalComponent; // 0x358(0x08)
	struct UDecalComponent* MI_OL_WetStreaks_8_NewDecalComponent; // 0x360(0x08)
	struct UDecalComponent* MI_OL_WetStreaks_7_NewDecalComponent; // 0x368(0x08)
	struct UDecalComponent* MI_OL_WetStreaks_6_NewDecalComponent; // 0x370(0x08)
	struct UDecalComponent* MI_OL_WetStreaks_5_NewDecalComponent; // 0x378(0x08)
	struct UDecalComponent* MI_OL_WetStreaks_4_NewDecalComponent; // 0x380(0x08)
	struct UDecalComponent* MI_OL_WetStreaks_3_NewDecalComponent; // 0x388(0x08)
	struct UDecalComponent* MI_OL_WetStreaks_2_NewDecalComponent; // 0x390(0x08)
	struct UDecalComponent* MI_OL_WetStreaks_01_NewDecalComponent; // 0x398(0x08)
	struct UDecalComponent* MI_CliffFaceIronDeposits_Decal2_NewDecalComponent; // 0x3a0(0x08)
	struct UDecalComponent* MI_CliffFaceIronDeposits_Decal_NewDecalComponent; // 0x3a8(0x08)
	struct UDecalComponent* MI_Cav_Decal_Rock_Lime26_NewDecalComponent; // 0x3b0(0x08)
	struct UDecalComponent* MI_Cav_Decal_Rock_Lime23_NewDecalComponent; // 0x3b8(0x08)
	struct UDecalComponent* MI_Cav_Decal_Rock_Lime18_NewDecalComponent; // 0x3c0(0x08)
	struct UDecalComponent* MI_Cav_Decal_Rock_Lime16_NewDecalComponent; // 0x3c8(0x08)
	struct UDecalComponent* MI_Cav_Decal_Rock_Lime14_NewDecalComponent; // 0x3d0(0x08)
	struct UDecalComponent* MI_Cav_Decal_Rock_Lime13_NewDecalComponent; // 0x3d8(0x08)
	struct UDecalComponent* MI_Cav_Decal_Rock_Lime11_NewDecalComponent; // 0x3e0(0x08)
	struct UDecalComponent* MI_Cav_Decal_Rock_Lime9_NewDecalComponent; // 0x3e8(0x08)
	struct UDecalComponent* MI_Cav_Decal_Rock_Lime8_NewDecalComponent; // 0x3f0(0x08)
	struct UDecalComponent* MI_Cav_Decal_Rock_Lime2_NewDecalComponent; // 0x3f8(0x08)
	struct UDecalComponent* MI_Cav_Decal_Rock_Lime_NewDecalComponent; // 0x400(0x08)
	struct UDecalComponent* MI_Cairn_Decal_MossPatch_B7_NewDecalComponent; // 0x408(0x08)
	struct UDecalComponent* MI_Cairn_Decal_MossPatch_B6_NewDecalComponent; // 0x410(0x08)
	struct UDecalComponent* MI_Cairn_Decal_MossPatch_B5_NewDecalComponent; // 0x418(0x08)
	struct UDecalComponent* MI_Cairn_Decal_MossPatch_B4_NewDecalComponent; // 0x420(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_B3_NewDecalComponent; // 0x428(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_B2_NewDecalComponent; // 0x430(0x08)
	struct UDecalComponent* MI_Cairn_Decal_DamageSmall_B_NewDecalComponent; // 0x438(0x08)
	struct UStaticMeshComponent* BP_Int_BCProps_CloseCrate_Small_3_StaticMeshComponent0; // 0x440(0x08)
	struct UStaticMeshComponent* BP_Int_BCProps_CloseCrate_Medium_3_StaticMeshComponent0; // 0x448(0x08)
	struct UStaticMeshComponent* BP_Int_BCProps_CloseCrate_Medium_2_StaticMeshComponent0; // 0x450(0x08)
	struct UStaticMeshComponent* BP_Int_BCProps_CloseCrate_Medium_001_StaticMeshComponent0; // 0x458(0x08)
	struct USceneComponent* SharedRoot; // 0x460(0x08)
};

