// BlueprintGeneratedClass BP_Vault_Castle_Stairs_01.BP_Vault_Castle_Stairs_01_C
// Size: 0x6c0 (Inherited: 0x248)
struct ABP_Vault_Castle_Stairs_01_C : AActor {
	struct UDecalComponent* MI_CliffFaceIronDeposits_Decal5_141; // 0x248(0x08)
	struct UDecalComponent* MI_CavernDun_Decal_Algae_B4_139; // 0x250(0x08)
	struct UDecalComponent* MI_CavernDun_Decal_Algae_B3_137; // 0x258(0x08)
	struct UDecalComponent* MI_CliffFaceIronDeposits_Decal4_135; // 0x260(0x08)
	struct UDecalComponent* MI_CliffFaceIronDeposits_Decal3_133; // 0x268(0x08)
	struct UDecalComponent* MI_CliffFaceIronDeposits_Decal2_131; // 0x270(0x08)
	struct UDecalComponent* MI_OL_WetStreaks_129; // 0x278(0x08)
	struct UDecalComponent* MI_CliffFaceIronDeposits_Decal_127; // 0x280(0x08)
	struct UDecalComponent* MI_OL_WetStreaks_01_125; // 0x288(0x08)
	struct UDecalComponent* MI_CavernDun_Decal_Algae_B2_123; // 0x290(0x08)
	struct UDecalComponent* MI_Cairn_Decal_Damage_A6_121; // 0x298(0x08)
	struct UDecalComponent* MI_Cairn_Decal_Damage_A5_119; // 0x2a0(0x08)
	struct UDecalComponent* MI_Cairn_Decal_Damage_A4_117; // 0x2a8(0x08)
	struct UDecalComponent* MI_Cairn_Decal_Damage_A3_115; // 0x2b0(0x08)
	struct UDecalComponent* MI_Cairn_Decal_Damage_A2_113; // 0x2b8(0x08)
	struct UDecalComponent* MI_Cairn_Decal_Damage_A_111; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_Castle_Vault_DebrisMound_CHISMA_20; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_Castle_Vault_DebrisMound_CHISMA_19; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_Castle_Vault_DebrisMound_CHISMA_18; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_Castle_Vault_DebrisMound_CHISMA_17; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_Castle_Vault_DebrisMound_CHISMA_16; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_Castle_Vault_DebrisMound_CHISMA_15; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_Castle_Vault_DebrisMound_CHISMA_14; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_Castle_Vault_DebrisMound_CHISMA_13; // 0x300(0x08)
	struct UStaticMeshComponent* SM_Castle_Vault_DebrisMound_CHISMA_12; // 0x308(0x08)
	struct UStaticMeshComponent* SM_Castle_Vault_DebrisMound_CHISMA_11; // 0x310(0x08)
	struct UStaticMeshComponent* SM_Castle_Vault_DebrisMound_CHISMA_10; // 0x318(0x08)
	struct UStaticMeshComponent* SM_Castle_Vault_DebrisMound_CHISMA_9; // 0x320(0x08)
	struct UStaticMeshComponent* SM_Castle_Vault_DebrisMound_CHISMA_8; // 0x328(0x08)
	struct UStaticMeshComponent* SM_Castle_Vault_DebrisMound_CHISMA_7; // 0x330(0x08)
	struct UStaticMeshComponent* SM_Castle_Vault_DebrisMound_CHISMA_6; // 0x338(0x08)
	struct UStaticMeshComponent* SM_Castle_Vault_DebrisMound_CHISMA_5; // 0x340(0x08)
	struct UStaticMeshComponent* SM_Castle_Vault_DebrisMound_CHISMA_4; // 0x348(0x08)
	struct UStaticMeshComponent* SM_Castle_Vault_DebrisMound_CHISMA_3; // 0x350(0x08)
	struct UStaticMeshComponent* SM_Castle_Vault_DebrisMound_CHISMA_2; // 0x358(0x08)
	struct UStaticMeshComponent* SM_Castle_Vault_DebrisMound_CHISMA_1; // 0x360(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_CHISMA_27; // 0x368(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_CHISMA_26; // 0x370(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_CHISMA_25; // 0x378(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_CHISMA_24; // 0x380(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_CHISMA_23; // 0x388(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_CHISMA_22; // 0x390(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_CHISMA_21; // 0x398(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_CHISMA_20; // 0x3a0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_CHISMA_19; // 0x3a8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_CHISMA_18; // 0x3b0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_CHISMA_17; // 0x3b8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_CHISMA_16; // 0x3c0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_CHISMA_15; // 0x3c8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_CHISMA_14; // 0x3d0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_CHISMA_13; // 0x3d8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_CHISMA_12; // 0x3e0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_CHISMA_11; // 0x3e8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_CHISMA_10; // 0x3f0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_CHISMA_9; // 0x3f8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_CHISMA_8; // 0x400(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_CHISMA_7; // 0x408(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_CHISMA_6; // 0x410(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_CHISMA_5; // 0x418(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_CHISMA_4; // 0x420(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_CHISMA_3; // 0x428(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_CHISMA_2; // 0x430(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_CHISMA_1; // 0x438(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_Cap_BHISMA_12; // 0x440(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_Cap_BHISMA_11; // 0x448(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_Cap_BHISMA_10; // 0x450(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_Cap_BHISMA_9; // 0x458(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_Cap_BHISMA_8; // 0x460(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_Cap_BHISMA_7; // 0x468(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_Cap_BHISMA_6; // 0x470(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_Cap_BHISMA_5; // 0x478(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_Cap_BHISMA_4; // 0x480(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_Cap_BHISMA_3; // 0x488(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_Cap_BHISMA_2; // 0x490(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_Cap_BHISMA_1; // 0x498(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Wall_Damaged_AHISMA_20; // 0x4a0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Wall_Damaged_AHISMA_19; // 0x4a8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Wall_Damaged_AHISMA_18; // 0x4b0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Wall_Damaged_AHISMA_17; // 0x4b8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Wall_Damaged_AHISMA_16; // 0x4c0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Wall_Damaged_AHISMA_15; // 0x4c8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Wall_Damaged_AHISMA_14; // 0x4d0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Wall_Damaged_AHISMA_13; // 0x4d8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Wall_Damaged_AHISMA_12; // 0x4e0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Wall_Damaged_AHISMA_11; // 0x4e8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Wall_Damaged_AHISMA_10; // 0x4f0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Wall_Damaged_AHISMA_9; // 0x4f8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Wall_Damaged_AHISMA_8; // 0x500(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Wall_Damaged_AHISMA_7; // 0x508(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Wall_Damaged_AHISMA_6; // 0x510(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Wall_Damaged_AHISMA_5; // 0x518(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Wall_Damaged_AHISMA_4; // 0x520(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Wall_Damaged_AHISMA_3; // 0x528(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Wall_Damaged_AHISMA_2; // 0x530(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Wall_Damaged_AHISMA_1; // 0x538(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Arch_Pillar_BHISMA_8; // 0x540(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Arch_Pillar_BHISMA_7; // 0x548(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Arch_Pillar_BHISMA_6; // 0x550(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Arch_Pillar_BHISMA_5; // 0x558(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Arch_Pillar_BHISMA_4; // 0x560(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Arch_Pillar_BHISMA_3; // 0x568(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Arch_Pillar_BHISMA_2; // 0x570(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Arch_Pillar_BHISMA_1; // 0x578(0x08)
	struct UStaticMeshComponent* SM_Cairn_Stairs_A7_805; // 0x580(0x08)
	struct UStaticMeshComponent* SM_Cairn_Stairs_A6_803; // 0x588(0x08)
	struct UStaticMeshComponent* SM_BeardMoss_C2_801; // 0x590(0x08)
	struct UStaticMeshComponent* SM_BeardMoss_C_799; // 0x598(0x08)
	struct UStaticMeshComponent* SM_CaveRoots_Set1_B3_797; // 0x5a0(0x08)
	struct UStaticMeshComponent* SM_CaveRoots_Set1_B2_795; // 0x5a8(0x08)
	struct UStaticMeshComponent* SM_CaveRoots_Flat_A_793; // 0x5b0(0x08)
	struct UStaticMeshComponent* SM_CaveRoots_Set1_G2_791; // 0x5b8(0x08)
	struct UStaticMeshComponent* SM_CaveRoots_Set1_B_789; // 0x5c0(0x08)
	struct UStaticMeshComponent* SM_CaveRoots_Set1_G_787; // 0x5c8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Stone_Table_Slab_C5_785; // 0x5d0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Stone_Table_Slab_C4_783; // 0x5d8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Stone_Table_Slab_C3_781; // 0x5e0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Stone_Table_Slab_C2_779; // 0x5e8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Stone_Table_Slab_A4_777; // 0x5f0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Stone_Table_Slab_A3_775; // 0x5f8(0x08)
	struct UStaticMeshComponent* SM_Vault_Castle_Roof_E3_773; // 0x600(0x08)
	struct UStaticMeshComponent* SM_Vault_Castle_Roof_E2_771; // 0x608(0x08)
	struct UStaticMeshComponent* SM_Vault_Castle_Roof_E_769; // 0x610(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_B5_767; // 0x618(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Stone_Table_A4_765; // 0x620(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Stone_Table_A3_763; // 0x628(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Stone_Table_A2_761; // 0x630(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Stone_Table_A_759; // 0x638(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_B4_757; // 0x640(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_B3_755; // 0x648(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Stone_Table_Slab_B2_753; // 0x650(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Stone_Table_Slab_C_751; // 0x658(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Stone_Table_Slab_B_749; // 0x660(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Stone_Table_Slab_A2_747; // 0x668(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Stone_Table_Slab_A_745; // 0x670(0x08)
	struct UStaticMeshComponent* SM_Cairn_Stairs_A5_743; // 0x678(0x08)
	struct UStaticMeshComponent* SM_Cairn_Stairs_A4_741; // 0x680(0x08)
	struct UStaticMeshComponent* SM_Cairn_Stairs_A3_739; // 0x688(0x08)
	struct UStaticMeshComponent* SM_Cairn_Stairs_A2_737; // 0x690(0x08)
	struct UStaticMeshComponent* SM_Cairn_Stairs_A_735; // 0x698(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_B2_733; // 0x6a0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_B_731; // 0x6a8(0x08)
	struct UStaticMeshComponent* SM_Vault_CastleStairs_Shell_729; // 0x6b0(0x08)
	struct USceneComponent* SharedRoot; // 0x6b8(0x08)
};

