// BlueprintGeneratedClass BP_Vault_Castle_B_Stairs_Small.BP_Vault_Castle_B_Stairs_Small_C
// Size: 0x2e0 (Inherited: 0x248)
struct ABP_Vault_Castle_B_Stairs_Small_C : AActor {
	struct UCameraStackVolumeComponent* CameraStackVolume2; // 0x248(0x08)
	struct UBoxComponent* Box3; // 0x250(0x08)
	struct UStaticMeshComponent* StaticMesh2; // 0x258(0x08)
	struct UStaticMeshComponent* StaticMesh1; // 0x260(0x08)
	struct UStaticMeshComponent* StaticMesh10; // 0x268(0x08)
	struct UStaticMeshComponent* StaticMesh9; // 0x270(0x08)
	struct UStaticMeshComponent* StaticMesh4; // 0x278(0x08)
	struct UStaticMeshComponent* StaticMesh3; // 0x280(0x08)
	struct UStaticMeshComponent* StaticMesh8; // 0x288(0x08)
	struct UStaticMeshComponent* StaticMesh7; // 0x290(0x08)
	struct UStaticMeshComponent* StaticMesh6; // 0x298(0x08)
	struct UStaticMeshComponent* StaticMesh5; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Bottom_Brick_A; // 0x2a8(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_A; // 0x2b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent07; // 0x2c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent06; // 0x2c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent04; // 0x2d0(0x08)
	struct USceneComponent* SharedRoot; // 0x2d8(0x08)
};

