// BlueprintGeneratedClass BP_Vault_Castle_B_Hallway_Corner.BP_Vault_Castle_B_Hallway_Corner_C
// Size: 0x288 (Inherited: 0x248)
struct ABP_Vault_Castle_B_Hallway_Corner_C : AActor {
	struct UCameraStackVolumeComponent* CameraStackVolume2; // 0x248(0x08)
	struct UBoxComponent* Box3; // 0x250(0x08)
	struct UStaticMeshComponent* StaticMesh5; // 0x258(0x08)
	struct UStaticMeshComponent* StaticMesh10; // 0x260(0x08)
	struct UStaticMeshComponent* StaticMesh9; // 0x268(0x08)
	struct UStaticMeshComponent* StaticMesh4; // 0x270(0x08)
	struct UStaticMeshComponent* StaticMeshComponent04; // 0x278(0x08)
	struct USceneComponent* SharedRoot; // 0x280(0x08)
};

