// BlueprintGeneratedClass BP_Vault_Cave_HallwayLeft_01.BP_Vault_Cave_HallwayLeft_01_C
// Size: 0x4b0 (Inherited: 0x248)
struct ABP_Vault_Cave_HallwayLeft_01_C : AActor {
	struct UHierarchicalInstancedStaticMeshComponent* SM_OL_CliffRock_B4_1 (HISMA)_HierarchicalInstancedStaticMesh4; // 0x248(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* SM_OL_CliffRock_B4_1 (HISMA)_HierarchicalInstancedStaticMesh3; // 0x250(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* SM_OL_CliffRock_B4_1 (HISMA)_HierarchicalInstancedStaticMesh2; // 0x258(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* SM_OL_CliffRock_B4_1 (HISMA)_HierarchicalInstancedStaticMesh1; // 0x260(0x08)
	struct UChildActorComponent* BP_Int_BCProps_OpenCrate_Small_003; // 0x268(0x08)
	struct UChildActorComponent* BP_Int_BCProps_OpenCrate_Small_002; // 0x270(0x08)
	struct UChildActorComponent* BP_Int_BCProps_OpenCrate_Small_001; // 0x278(0x08)
	struct UChildActorComponent* BP_Int_BCProps_CloseCrate_Small_002; // 0x280(0x08)
	struct UChildActorComponent* BP_Int_BCProps_CloseCrate_Small_001; // 0x288(0x08)
	struct UChildActorComponent* BP_Int_BCProps_CloseCrate_Medium_001; // 0x290(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* SM_Vault_Cave_RockPile_03 (HISMA)_HierarchicalInstancedStaticMesh; // 0x298(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* SM_RockStack_A (HISMA)_HierarchicalInstancedStaticMesh; // 0x2a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* SM_OL_MossRock_Md_E_2 (HISMA)_HierarchicalInstancedStaticMesh; // 0x2a8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* SM_OL_MossRock_Md_A_2 (HISMA)_HierarchicalInstancedStaticMesh; // 0x2b0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* SM_OL_CliffRock_B5_1 (HISMA)_HierarchicalInstancedStaticMesh; // 0x2b8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* SM_OL_CliffRock_B4_1 (HISMA)_HierarchicalInstancedStaticMesh; // 0x2c0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* SM_OL_CliffRock_B2_1 (HISMA)_HierarchicalInstancedStaticMesh1; // 0x2c8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* SM_OL_CliffRock_B2_1 (HISMA)_HierarchicalInstancedStaticMesh; // 0x2d0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* SM_OL_CliffRock_B1_1 (HISMA)_HierarchicalInstancedStaticMesh; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_OL2_RockAssembly_B_StaticMeshComponent0; // 0x2e0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* SM_Int_BCProps_Shovel_001_W (HISMA)_HierarchicalInstancedStaticMesh; // 0x2e8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* SM_GrassMain (HISMA)_HierarchicalInstancedStaticMesh; // 0x2f0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* SM_DeadLeafThin_01_Master (HISMA)_HierarchicalInstancedStaticMesh; // 0x2f8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* SM_CaveRoots_Set1_G (HISMA)_HierarchicalInstancedStaticMesh; // 0x300(0x08)
	struct UStaticMeshComponent* SM_CastleDun_Jail_TreeRoots_C4_StaticMeshComponent0; // 0x308(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* SM_BeardMoss_C (HISMA)_HierarchicalInstancedStaticMesh; // 0x310(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* SM_BeardMoss_A (HISMA)_HierarchicalInstancedStaticMesh; // 0x318(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* SM_BCProps_Rope_001 (HISMA)_HierarchicalInstancedStaticMesh; // 0x320(0x08)
	struct UDecalComponent* MI_Sanc_BIO_COAST_Decal_WetSand_6_NewDecalComponent; // 0x328(0x08)
	struct UDecalComponent* MI_Sanc_BIO_COAST_Decal_WetSand_5_NewDecalComponent; // 0x330(0x08)
	struct UDecalComponent* MI_Sanc_BIO_COAST_Decal_WetSand_04_NewDecalComponent; // 0x338(0x08)
	struct UDecalComponent* MI_P_Cav_Decal_Stain_10_NewDecalComponent; // 0x340(0x08)
	struct UDecalComponent* MI_P_Cav_Decal_Stain_9_NewDecalComponent; // 0x348(0x08)
	struct UDecalComponent* MI_P_Cav_Decal_Stain_8_NewDecalComponent; // 0x350(0x08)
	struct UDecalComponent* MI_P_Cav_Decal_Stain_7_NewDecalComponent; // 0x358(0x08)
	struct UDecalComponent* MI_P_Cav_Decal_Stain_6_NewDecalComponent; // 0x360(0x08)
	struct UDecalComponent* MI_P_Cav_Decal_Stain_5_NewDecalComponent; // 0x368(0x08)
	struct UDecalComponent* MI_P_Cav_Decal_Stain_3_NewDecalComponent; // 0x370(0x08)
	struct UDecalComponent* MI_P_Cav_Decal_Stain_2_NewDecalComponent; // 0x378(0x08)
	struct UDecalComponent* MI_P_Cav_Decal_Stain_01_NewDecalComponent; // 0x380(0x08)
	struct UDecalComponent* MI_OL_WetStreaks_8_NewDecalComponent; // 0x388(0x08)
	struct UDecalComponent* MI_OL_WetStreaks_7_NewDecalComponent; // 0x390(0x08)
	struct UDecalComponent* MI_OL_WetStreaks_5_NewDecalComponent; // 0x398(0x08)
	struct UStaticMeshComponent* Vult_CaveA_Collisionmesh2_StaticMeshComponent0; // 0x3a0(0x08)
	struct UDecalComponent* MI_OL_WetStreaks_4_NewDecalComponent; // 0x3a8(0x08)
	struct UDecalComponent* MI_OL_WetStreaks_3_NewDecalComponent; // 0x3b0(0x08)
	struct UDecalComponent* MI_OL_WetStreaks_2_NewDecalComponent; // 0x3b8(0x08)
	struct UDecalComponent* MI_CliffFaceIronDeposits_Decal9_NewDecalComponent; // 0x3c0(0x08)
	struct UDecalComponent* MI_CliffFaceIronDeposits_Decal8_NewDecalComponent; // 0x3c8(0x08)
	struct UDecalComponent* MI_CliffFaceIronDeposits_Decal7_NewDecalComponent; // 0x3d0(0x08)
	struct UDecalComponent* MI_CliffFaceIronDeposits_Decal6_NewDecalComponent; // 0x3d8(0x08)
	struct UDecalComponent* MI_CliffFaceIronDeposits_Decal5_NewDecalComponent; // 0x3e0(0x08)
	struct UDecalComponent* MI_CliffFaceIronDeposits_Decal4_NewDecalComponent; // 0x3e8(0x08)
	struct UDecalComponent* MI_CliffFaceIronDeposits_Decal3_NewDecalComponent; // 0x3f0(0x08)
	struct UDecalComponent* MI_CliffFaceIronDeposits_Decal2_NewDecalComponent; // 0x3f8(0x08)
	struct UDecalComponent* MI_CliffFaceIronDeposits_Decal_NewDecalComponent; // 0x400(0x08)
	struct UDecalComponent* MI_Cav_Decal_Rock_Lime11_NewDecalComponent; // 0x408(0x08)
	struct UDecalComponent* MI_Cav_Decal_Rock_Lime9_NewDecalComponent; // 0x410(0x08)
	struct UDecalComponent* MI_Cav_Decal_Rock_Lime8_NewDecalComponent; // 0x418(0x08)
	struct UDecalComponent* MI_Cav_Decal_Rock_Lime7_NewDecalComponent; // 0x420(0x08)
	struct UDecalComponent* MI_Cav_Decal_Rock_Lime6_NewDecalComponent; // 0x428(0x08)
	struct UDecalComponent* MI_Cav_Decal_Rock_Lime5_NewDecalComponent; // 0x430(0x08)
	struct UDecalComponent* MI_Cav_Decal_Rock_Lime4_NewDecalComponent; // 0x438(0x08)
	struct UDecalComponent* MI_Cav_Decal_Rock_Lime3_NewDecalComponent; // 0x440(0x08)
	struct UDecalComponent* MI_Cav_Decal_Rock_Lime2_NewDecalComponent; // 0x448(0x08)
	struct UDecalComponent* MI_Cav_Decal_Rock_Lime_NewDecalComponent; // 0x450(0x08)
	struct UDecalComponent* MI_Cairn_Decal_MossPatch_B8_NewDecalComponent; // 0x458(0x08)
	struct UDecalComponent* MI_Cairn_Decal_MossPatch_B7_NewDecalComponent; // 0x460(0x08)
	struct UDecalComponent* MI_Cairn_Decal_MossPatch_B6_NewDecalComponent; // 0x468(0x08)
	struct UDecalComponent* MI_Cairn_Decal_MossPatch_B5_NewDecalComponent; // 0x470(0x08)
	struct UDecalComponent* MI_Cairn_Decal_MossPatch_B4_NewDecalComponent; // 0x478(0x08)
	struct UDecalComponent* MI_Cairn_Decal_MossPatch_B3_NewDecalComponent; // 0x480(0x08)
	struct UDecalComponent* MI_Cairn_Decal_MossPatch_B2_NewDecalComponent; // 0x488(0x08)
	struct UDecalComponent* MI_Cairn_Decal_MossPatch_B_NewDecalComponent; // 0x490(0x08)
	struct UStaticMeshComponent* SM_Vault_HallwayRockTunnelRight_01_StaticMeshComponent0; // 0x498(0x08)
	struct UDecalComponent* MI_OL_WetStreaks_6_NewDecalComponent; // 0x4a0(0x08)
	struct USceneComponent* SharedRoot; // 0x4a8(0x08)
};

