// BlueprintGeneratedClass BP_Vault_Castle_B_Stairs_Entrance.BP_Vault_Castle_B_Stairs_Entrance_C
// Size: 0x320 (Inherited: 0x248)
struct ABP_Vault_Castle_B_Stairs_Entrance_C : AActor {
	struct UStaticMeshComponent* StaticMesh19; // 0x248(0x08)
	struct UStaticMeshComponent* StaticMesh18; // 0x250(0x08)
	struct UStaticMeshComponent* StaticMesh17; // 0x258(0x08)
	struct UStaticMeshComponent* StaticMesh14; // 0x260(0x08)
	struct UStaticMeshComponent* StaticMesh13; // 0x268(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Debris_A; // 0x270(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_C; // 0x278(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Wall_Roof_Beam_A_a; // 0x280(0x08)
	struct UStaticMeshComponent* StaticMesh12; // 0x288(0x08)
	struct UStaticMeshComponent* StaticMesh11; // 0x290(0x08)
	struct UStaticMeshComponent* StaticMesh10; // 0x298(0x08)
	struct UStaticMeshComponent* StaticMesh9; // 0x2a0(0x08)
	struct UStaticMeshComponent* StaticMesh23; // 0x2a8(0x08)
	struct UStaticMeshComponent* StaticMesh7; // 0x2b0(0x08)
	struct UStaticMeshComponent* StaticMesh6; // 0x2b8(0x08)
	struct UStaticMeshComponent* StaticMesh5; // 0x2c0(0x08)
	struct UStaticMeshComponent* StaticMesh4; // 0x2c8(0x08)
	struct UStaticMeshComponent* StaticMesh3; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Wall_Corner_Cap_A1_C; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_1_Broken_End_Cap_A_b1; // 0x2e0(0x08)
	struct UStaticMeshComponent* StaticMesh1; // 0x2e8(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x2f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent033; // 0x2f8(0x08)
	struct UStaticMeshComponent* StaticMesh8; // 0x300(0x08)
	struct UStaticMeshComponent* StaticMesh22; // 0x308(0x08)
	struct UStaticMeshComponent* StaticMesh21; // 0x310(0x08)
	struct USceneComponent* SharedRoot; // 0x318(0x08)
};

