// BlueprintGeneratedClass BP_Vault_Cairn_Stair_01.BP_Vault_Cairn_Stair_01_C
// Size: 0x530 (Inherited: 0x248)
struct ABP_Vault_Cairn_Stair_01_C : AActor {
	struct UStaticMeshComponent* SM_MERGED_CairnVault_Floor_A2; // 0x248(0x08)
	struct UDecalComponent* MI_Castle_Ruin1_Wetness_drips_20; // 0x250(0x08)
	struct UDecalComponent* MI_Cairn_Decal_Damage_A2_18; // 0x258(0x08)
	struct UDecalComponent* MI_Cairn_Decal_Damage_A_16; // 0x260(0x08)
	struct UDecalComponent* MI_Castle_Ruin1_Wetness_drips_14; // 0x268(0x08)
	struct UStaticMeshComponent* SM_MERGED_SM_BeardMoss_A_475; // 0x270(0x08)
	struct UStaticMeshComponent* SM_Cairn_StoneDebris34_473; // 0x278(0x08)
	struct UStaticMeshComponent* SM_Cairn_StoneDebris33_471; // 0x280(0x08)
	struct UStaticMeshComponent* SM_Cairn_StoneDebris32_469; // 0x288(0x08)
	struct UStaticMeshComponent* SM_Cairn_StoneDebris31_467; // 0x290(0x08)
	struct UStaticMeshComponent* SM_Cairn_StoneDebris30_465; // 0x298(0x08)
	struct UStaticMeshComponent* SM_Cairn_StoneDebris29_463; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_Cairn_StoneDebris28_461; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_Cairn_StoneDebris27_459; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_Cairn_StoneDebris26_457; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_Cairn_StoneDebris25_455; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_Cairn_StoneDebris24_453; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_Cairn_StoneDebris23_451; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_Cairn_StoneDebris22_449; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_Cairn_ColumnDebris4_447; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_Cairn_ColumnDebris03_445; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_Cairn_StoneDebris21_443; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_Cairn_StoneDebris20_441; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_Cairn_StoneDebris06_439; // 0x300(0x08)
	struct UStaticMeshComponent* SM_Cairn_StoneDebris19_437; // 0x308(0x08)
	struct UStaticMeshComponent* SM_Cairn_StoneDebris18_435; // 0x310(0x08)
	struct UStaticMeshComponent* SM_Cairn_StoneDebris17_433; // 0x318(0x08)
	struct UStaticMeshComponent* SM_Cairn_StoneDebris16_431; // 0x320(0x08)
	struct UStaticMeshComponent* SM_Cairn_StoneDebris15_429; // 0x328(0x08)
	struct UStaticMeshComponent* SM_Cairn_StoneDebris14_427; // 0x330(0x08)
	struct UStaticMeshComponent* SM_Cairn_StoneDebris09_425; // 0x338(0x08)
	struct UStaticMeshComponent* SM_Cairn_SideHall_Roof_B_423; // 0x340(0x08)
	struct UStaticMeshComponent* SM_Cairn_SideHall_Roof_B_421; // 0x348(0x08)
	struct UStaticMeshComponent* SM_Cairn_SideHall_Roof_B_419; // 0x350(0x08)
	struct UStaticMeshComponent* SM_Cairn_SideHall_Roof_B_417; // 0x358(0x08)
	struct UStaticMeshComponent* SM_Cairn_SideHall_Roof_B_415; // 0x360(0x08)
	struct UStaticMeshComponent* SM_Cairn_SideHall_Roof_B_413; // 0x368(0x08)
	struct UStaticMeshComponent* SM_Cairn_SideHall_Roof_B_411; // 0x370(0x08)
	struct UStaticMeshComponent* SM_Cairn_SideHall_Roof_B_409; // 0x378(0x08)
	struct UStaticMeshComponent* SM_Cairn_SideHall_Roof_B_407; // 0x380(0x08)
	struct UStaticMeshComponent* SM_Cairn_StoneDebris9_405; // 0x388(0x08)
	struct UStaticMeshComponent* SM_Cairn_StoneDebris8_403; // 0x390(0x08)
	struct UStaticMeshComponent* SM_Cairn_StoneDebris7_401; // 0x398(0x08)
	struct UStaticMeshComponent* SM_Cairn_StoneDebris6_399; // 0x3a0(0x08)
	struct UStaticMeshComponent* SM_Cairn_StoneDebris5_397; // 0x3a8(0x08)
	struct UStaticMeshComponent* SM_Cairn_StoneDebris4_395; // 0x3b0(0x08)
	struct UStaticMeshComponent* SM_Cairn_StoneDebris03_393; // 0x3b8(0x08)
	struct UStaticMeshComponent* SM_Cairn_RockPile_A_391; // 0x3c0(0x08)
	struct UStaticMeshComponent* SM_Cairn_RockPile_A_389; // 0x3c8(0x08)
	struct UStaticMeshComponent* SM_Cairn_RockPile_A_387; // 0x3d0(0x08)
	struct UStaticMeshComponent* SM_Cairn_RockPile_A_385; // 0x3d8(0x08)
	struct UStaticMeshComponent* SM_Cairn_RockPile_A_383; // 0x3e0(0x08)
	struct UStaticMeshComponent* SM_Cairn_RockPile_A_381; // 0x3e8(0x08)
	struct UStaticMeshComponent* SM_Cairn_RockPile_A_379; // 0x3f0(0x08)
	struct UStaticMeshComponent* SM_Cairn_RockPile_A_377; // 0x3f8(0x08)
	struct UStaticMeshComponent* SM_Cairn_RockPile_A_375; // 0x400(0x08)
	struct UStaticMeshComponent* SM_Cairn_RockPile_A_001_373; // 0x408(0x08)
	struct UStaticMeshComponent* SM_Cairn_Stairs_A7_371; // 0x410(0x08)
	struct UStaticMeshComponent* SM_Cairn_Stairs_A6_369; // 0x418(0x08)
	struct UStaticMeshComponent* SM_Cairn_Stairs_A5_367; // 0x420(0x08)
	struct UStaticMeshComponent* SM_Cairn_Stairs_A4_365; // 0x428(0x08)
	struct UStaticMeshComponent* SM_Cairn_Stairs_A3_363; // 0x430(0x08)
	struct UStaticMeshComponent* SM_Cairn_Stairs_A2_361; // 0x438(0x08)
	struct UStaticMeshComponent* SM_Cairn_Stairs_A_359; // 0x440(0x08)
	struct UStaticMeshComponent* SM_Cairn_SideHall_Roof_A_357; // 0x448(0x08)
	struct UStaticMeshComponent* SM_Cairn_SideHall_Roof_A_355; // 0x450(0x08)
	struct UStaticMeshComponent* SM_Cairn_SideHall_Roof_A_353; // 0x458(0x08)
	struct UStaticMeshComponent* SM_Cairn_SideHall_Roof_A_351; // 0x460(0x08)
	struct UStaticMeshComponent* SM_cairn_Vault_wallStairs_349; // 0x468(0x08)
	struct UStaticMeshComponent* SM_Cairn_StoneDebris13_347; // 0x470(0x08)
	struct UStaticMeshComponent* SM_Cairn_StoneDebris12_345; // 0x478(0x08)
	struct UStaticMeshComponent* SM_Cairn_StoneDebris11_343; // 0x480(0x08)
	struct UStaticMeshComponent* SM_Cairn_StoneDebris10_341; // 0x488(0x08)
	struct UStaticMeshComponent* SM_Cairn_RockPile_B_337; // 0x490(0x08)
	struct UStaticMeshComponent* SM_Cairn_RockPile_B_335; // 0x498(0x08)
	struct UStaticMeshComponent* SM_Cairn_RockPile_B_333; // 0x4a0(0x08)
	struct UStaticMeshComponent* SM_Cairn_RockPile_B_331; // 0x4a8(0x08)
	struct UStaticMeshComponent* SM_Cairn_RockPile_B_329; // 0x4b0(0x08)
	struct UStaticMeshComponent* SM_Cairn_RockPile_B_327; // 0x4b8(0x08)
	struct UStaticMeshComponent* SM_Cairn_RockPile_B_325; // 0x4c0(0x08)
	struct UStaticMeshComponent* SM_Cairn_RockPile_B_323; // 0x4c8(0x08)
	struct UStaticMeshComponent* SM_Cairn_RockPile_B_001_321; // 0x4d0(0x08)
	struct UStaticMeshComponent* SM_Cairn_RockPile_E_319; // 0x4d8(0x08)
	struct UStaticMeshComponent* SM_Cairn_RockPile_E_317; // 0x4e0(0x08)
	struct UStaticMeshComponent* SM_Cairn_RockPile_E_315; // 0x4e8(0x08)
	struct UStaticMeshComponent* SM_Cairn_RockPile_E_313; // 0x4f0(0x08)
	struct UStaticMeshComponent* SM_Cairn_RockPile_E_311; // 0x4f8(0x08)
	struct UStaticMeshComponent* SM_Cairn_RockPile_E_309; // 0x500(0x08)
	struct UStaticMeshComponent* SM_Cairn_RockPile_E_307; // 0x508(0x08)
	struct UStaticMeshComponent* SM_Cairn_RockPile_E_305; // 0x510(0x08)
	struct UStaticMeshComponent* SM_Cairn_RockPile_E_303; // 0x518(0x08)
	struct UStaticMeshComponent* SM_Cairn_RockPile_E_001_301; // 0x520(0x08)
	struct USceneComponent* SharedRoot; // 0x528(0x08)
};

