// BlueprintGeneratedClass BP_Vault_Castle_HallwayRight_01.BP_Vault_Castle_HallwayRight_01_C
// Size: 0x400 (Inherited: 0x248)
struct ABP_Vault_Castle_HallwayRight_01_C : AActor {
	struct UHierarchicalInstancedStaticMeshComponent* HISM_7SM_C_Dun_Fastener_2; // 0x248(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_CaveRoots_Set1_G; // 0x250(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_46SM_CastleRuins_1_Pillar_Variant_A; // 0x258(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_15SM_CastleRuins_1_Broken_End_cap_C; // 0x260(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_17SM_CastleRuins_1_Broken_End_Cap_B; // 0x268(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_23SM_CastleRuins_1_Bottom_Wall_Damaged_A; // 0x270(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_7SM_BeardMoss_C; // 0x278(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_CastleRuins_1_Arch_Pillar_B; // 0x280(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_CastleRuins_1_Arch_Pillar_A; // 0x288(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_10SM_CastleRuins_1_Arched_Window_D; // 0x290(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuin1_Stair_A3; // 0x298(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_21SM_CastleRuin1_DebrisMound_C; // 0x2a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_16SM_BeardMoss_A; // 0x2a8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_31SM_CastleRuins_1_Bottom_Stone_Table_A; // 0x2b0(0x08)
	struct UDecalComponent* MI_P_Decal_Stain8; // 0x2b8(0x08)
	struct UDecalComponent* MI_Cairn_Decal_Damage_A18; // 0x2c0(0x08)
	struct UDecalComponent* MI_Cairn_Decal_Damage_A17; // 0x2c8(0x08)
	struct UDecalComponent* MI_Cairn_Decal_Damage_A16; // 0x2d0(0x08)
	struct UDecalComponent* MI_Cairn_Decal_Damage_A15; // 0x2d8(0x08)
	struct UDecalComponent* MI_Cairn_Decal_Damage_A14; // 0x2e0(0x08)
	struct UDecalComponent* MI_Cairn_Decal_Damage_A13; // 0x2e8(0x08)
	struct UDecalComponent* MI_Cairn_Decal_Damage_A12; // 0x2f0(0x08)
	struct UDecalComponent* MI_Cairn_Decal_Damage_A11; // 0x2f8(0x08)
	struct UDecalComponent* MI_Cairn_Decal_Damage_A10; // 0x300(0x08)
	struct UDecalComponent* MI_Cairn_Decal_Damage_A9; // 0x308(0x08)
	struct UDecalComponent* MI_Cairn_Decal_Damage_A8; // 0x310(0x08)
	struct UDecalComponent* MI_Cairn_Decal_Damage_A7; // 0x318(0x08)
	struct UDecalComponent* MI_P_Decal_Stain7; // 0x320(0x08)
	struct UDecalComponent* MI_Cairn_Decal_Damage_A6; // 0x328(0x08)
	struct UDecalComponent* MI_Cairn_Decal_Damage_A5; // 0x330(0x08)
	struct UDecalComponent* MI_Cairn_Decal_Damage_A4; // 0x338(0x08)
	struct UDecalComponent* MI_Cairn_Decal_Damage_A3; // 0x340(0x08)
	struct UDecalComponent* MI_Cairn_Decal_Damage_A2; // 0x348(0x08)
	struct UDecalComponent* MI_Cairn_Decal_Damage_A; // 0x350(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_E4; // 0x358(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_E3; // 0x360(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_E2; // 0x368(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_E; // 0x370(0x08)
	struct UDecalComponent* MI_P_Decal_Stain6; // 0x378(0x08)
	struct UDecalComponent* MI_P_Decal_Stain5; // 0x380(0x08)
	struct UDecalComponent* MI_P_Decal_Stain4; // 0x388(0x08)
	struct UDecalComponent* MI_P_Decal_Stain3; // 0x390(0x08)
	struct UDecalComponent* MI_P_Decal_Stain2; // 0x398(0x08)
	struct UDecalComponent* MI_P_Decal_Stain1; // 0x3a0(0x08)
	struct UStaticMeshComponent* SM_Vault_Castle_Hallway_Right; // 0x3a8(0x08)
	struct UChildActorComponent* BP_Int_BCProps_Pot_002_W1; // 0x3b0(0x08)
	struct UChildActorComponent* BP_Int_BCProps_Pot_002_W; // 0x3b8(0x08)
	struct UChildActorComponent* BP_Int_BCProps_Pot_001_W2; // 0x3c0(0x08)
	struct UChildActorComponent* BP_Int_BCProps_Pot_001_W1; // 0x3c8(0x08)
	struct UChildActorComponent* BP_Int_BCProps_Pot_001_W; // 0x3d0(0x08)
	struct UChildActorComponent* BP_Int_BCProps_Jug_002_W1; // 0x3d8(0x08)
	struct UChildActorComponent* BP_Int_BCProps_Jug_002_W; // 0x3e0(0x08)
	struct UChildActorComponent* BP_Int_BCProps_Jug_001_W1; // 0x3e8(0x08)
	struct UChildActorComponent* BP_Int_BCProps_Jug_001_W; // 0x3f0(0x08)
	struct USceneComponent* Scene; // 0x3f8(0x08)
};

