// BlueprintGeneratedClass BP_Vaults_Cairn_HallwayLeft_A.BP_Vaults_Cairn_HallwayLeft_A_C
// Size: 0x3f0 (Inherited: 0x248)
struct ABP_Vaults_Cairn_HallwayLeft_A_C : AActor {
	struct UStaticMeshComponent* SM_Cairn_StoneDebris11; // 0x248(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_29SM_Cairn_SideHall_Roof_B_2; // 0x250(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Wetness_drips_B3; // 0x258(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Wetness_drips_B2; // 0x260(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Wetness_drips_B; // 0x268(0x08)
	struct UDecalComponent* MI_Cav_Decal_Rock_Lime10; // 0x270(0x08)
	struct UDecalComponent* MI_Cav_Decal_Rock_Lime9; // 0x278(0x08)
	struct UDecalComponent* MI_Cav_Decal_Rock_Lime8; // 0x280(0x08)
	struct UDecalComponent* MI_Cav_Decal_Rock_Lime7; // 0x288(0x08)
	struct UDecalComponent* MI_Cav_Decal_Rock_Lime6; // 0x290(0x08)
	struct UDecalComponent* MI_Cav_Decal_Rock_Lime5; // 0x298(0x08)
	struct UDecalComponent* MI_Cav_Decal_Rock_Lime4; // 0x2a0(0x08)
	struct UDecalComponent* MI_Cav_Decal_Rock_Lime3; // 0x2a8(0x08)
	struct UDecalComponent* MI_Cav_Decal_Rock_Lime2; // 0x2b0(0x08)
	struct UDecalComponent* MI_Cav_Decal_Rock_Lime; // 0x2b8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_8SM_Cairn_StoneDebris03; // 0x2c0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_BeardMoss_A; // 0x2c8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_BeardMoss_C; // 0x2d0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_Cairn_ColumnDebris02; // 0x2d8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_Cairn_ColumnDebris03; // 0x2e0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_Cairn_Column_MainHall_Broken_D; // 0x2e8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_Cairn_Column_Trim_B; // 0x2f0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_10SM_Cairn_RockPile_B_001; // 0x2f8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_16SM_Cairn_RockPile_E_001; // 0x300(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_Cairn_StoneDebris06; // 0x308(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_7SM_Cairn_StoneDebris09; // 0x310(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Cairn_StoneDebris10; // 0x318(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CaveRoots_Set1_B; // 0x320(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_12SM_Cairn_StoneDebris04; // 0x328(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_DeadLeafThin_01_Master; // 0x330(0x08)
	struct UStaticMeshComponent* SM_Vault_Cairn_HallWall; // 0x338(0x08)
	struct UStaticMeshComponent* SM_Vault_Cairn_HallwayFloorLeft; // 0x340(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_CaveRoots_Set1_G; // 0x348(0x08)
	struct UStaticMeshComponent* SM_Cairn_StoneDebris10; // 0x350(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_15SM_Cairn_SideHall_Roof_A_2; // 0x358(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_Cairn_StoneDebris04; // 0x360(0x08)
	struct UStaticMeshComponent* SM_Cairn_StoneDebris06; // 0x368(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_7SM_BeardMoss_A; // 0x370(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_BeardMoss_C; // 0x378(0x08)
	struct UStaticMeshComponent* SM_Cairn_StoneDebris09; // 0x380(0x08)
	struct UChildActorComponent* BP_Int_BCProps_Pot_002_W2; // 0x388(0x08)
	struct UChildActorComponent* BP_Int_BCProps_Pot_002_W1; // 0x390(0x08)
	struct UChildActorComponent* BP_Int_BCProps_Pot_002_W; // 0x398(0x08)
	struct UChildActorComponent* BP_Int_BCProps_Pot_001_W3; // 0x3a0(0x08)
	struct UChildActorComponent* BP_Int_BCProps_Pot_001_W2; // 0x3a8(0x08)
	struct UChildActorComponent* BP_Int_BCProps_Pot_001_W1; // 0x3b0(0x08)
	struct UChildActorComponent* BP_Int_BCProps_Pot_001_W; // 0x3b8(0x08)
	struct UChildActorComponent* BP_Int_BCProps_Jug_002_W1; // 0x3c0(0x08)
	struct UChildActorComponent* BP_Int_BCProps_Jug_002_W; // 0x3c8(0x08)
	struct UChildActorComponent* BP_Int_BCProps_Jug_001_W2; // 0x3d0(0x08)
	struct UChildActorComponent* BP_Int_BCProps_Jug_001_W1; // 0x3d8(0x08)
	struct UChildActorComponent* BP_Int_BCProps_Jug_001_W; // 0x3e0(0x08)
	struct USceneComponent* SharedRoot; // 0x3e8(0x08)
};

