// BlueprintGeneratedClass BP_WoodenPlatform_Chepstow.BP_WoodenPlatform_Chepstow_C
// Size: 0x388 (Inherited: 0x248)
struct ABP_WoodenPlatform_Chepstow_C : AActor {
	struct UStaticMeshComponent* Cube; // 0x248(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeLashing_A (HISMA)_0_StaticMeshComponent3; // 0x250(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeLashing_A (HISMA)_0_StaticMeshComponent2; // 0x258(0x08)
	struct UStaticMeshComponent* SM_Int_Cavern_5m_PlankA_D (HISMA)_7_StaticMeshComponent2; // 0x260(0x08)
	struct UStaticMeshComponent* SM_Int_Cavern_2m_PlankA_D_StaticMeshComponent2; // 0x268(0x08)
	struct UStaticMeshComponent* SM_Int_Cavern_2m_PlankA_D_StaticMeshComponent1; // 0x270(0x08)
	struct UStaticMeshComponent* SM_Int_Cavern_5m_PostA_D (HISMA)_2_StaticMeshComponent2; // 0x278(0x08)
	struct UStaticMeshComponent* SM_Int_Cavern_5m_PostA_D (HISMA)_2_StaticMeshComponent1; // 0x280(0x08)
	struct UBoxComponent* Box; // 0x288(0x08)
	struct UBoxComponent* Box1; // 0x290(0x08)
	struct UStaticMeshComponent* SM_Int_Cavern_5m_PlankA_D (HISMA)_7_StaticMeshComponent1; // 0x298(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeLashing_A (HISMA)_0_StaticMeshComponent1; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_Int_Cavern_5m_PlankA_D (HISMA)_6_StaticMeshComponent1; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_Int_Cavern_5m_PostA_D (HISMA)_22_StaticMeshComponent0; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_Int_Cavern_5m_PlankA_D (HISMA)_13_StaticMeshComponent0; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_Int_Cavern_5m_PostA_D (HISMA)_20_StaticMeshComponent0; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_Int_Cavern_5m_PostA_D (HISMA)_10_StaticMeshComponent0; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_Int_Cavern_5m_PlankA_D (HISMA)_12_StaticMeshComponent0; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_Int_Cavern_5m_PostA_D (HISMA)_12_StaticMeshComponent0; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_Int_Cavern_2m_PlankA_D3_StaticMeshComponent0; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_Int_Cavern_5m_PostA_D (HISMA)_11_StaticMeshComponent0; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_Int_Cavern_5m_PlankA_D (HISMA)_1_StaticMeshComponent0; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_Int_Cavern_5m_PlankA_D (HISMA)_2_StaticMeshComponent0; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_Int_Cavern_5m_PlankA_D (HISMA)_3_StaticMeshComponent0; // 0x300(0x08)
	struct UStaticMeshComponent* SM_Int_Cavern_5m_PostA_D (HISMA)_16_StaticMeshComponent0; // 0x308(0x08)
	struct UStaticMeshComponent* SM_Int_Cavern_5m_PostA_D (HISMA)_19_StaticMeshComponent0; // 0x310(0x08)
	struct UStaticMeshComponent* SM_Int_Cavern_5m_PlankA_D (HISMA)_6_StaticMeshComponent0; // 0x318(0x08)
	struct UStaticMeshComponent* SM_Int_Cavern_5m_PlankA_D (HISMA)_5_StaticMeshComponent0; // 0x320(0x08)
	struct UStaticMeshComponent* SM_Int_Cavern_2m_PlankA_D2_StaticMeshComponent0; // 0x328(0x08)
	struct UStaticMeshComponent* SM_Int_Cavern_5m_PostA_D (HISMA)_3_StaticMeshComponent0; // 0x330(0x08)
	struct UStaticMeshComponent* SM_Int_Cavern_2m_PlankA_D_StaticMeshComponent0; // 0x338(0x08)
	struct UStaticMeshComponent* SM_Int_Cavern_5m_PostA_D (HISMA)_4_StaticMeshComponent0; // 0x340(0x08)
	struct UStaticMeshComponent* SM_BCProps_RopeLashing_A (HISMA)_0_StaticMeshComponent0; // 0x348(0x08)
	struct UStaticMeshComponent* SM_Int_Cavern_5m_PlankA_D (HISMA)_14_StaticMeshComponent0; // 0x350(0x08)
	struct UStaticMeshComponent* SM_Int_Cavern_5m_PlankA_D (HISMA)_11_StaticMeshComponent0; // 0x358(0x08)
	struct UStaticMeshComponent* SM_Int_Cavern_5m_PostA_D (HISMA)_21_StaticMeshComponent0; // 0x360(0x08)
	struct UStaticMeshComponent* SM_Int_Cavern_5m_PostA_D (HISMA)_8_StaticMeshComponent0; // 0x368(0x08)
	struct UStaticMeshComponent* SM_Int_Cavern_5m_PlankA_D (HISMA)_7_StaticMeshComponent0; // 0x370(0x08)
	struct UStaticMeshComponent* SM_Int_Cavern_5m_PostA_D (HISMA)_2_StaticMeshComponent0; // 0x378(0x08)
	struct USceneComponent* SharedRoot; // 0x380(0x08)
};

