// BlueprintGeneratedClass BP_WE_TableDressing_Cake.BP_WE_TableDressing_Cake_C
// Size: 0x350 (Inherited: 0x280)
struct ABP_WE_TableDressing_Cake_C : AWorldEventActor {
	struct UDecalComponent* MI_WE_Food_Decal_01; // 0x280(0x08)
	struct UDecalComponent* MI_CavernDun_Decal_Algae_B1; // 0x288(0x08)
	struct UDecalComponent* MI_WE_Food_Decal_02; // 0x290(0x08)
	struct UDecalComponent* MI_CavernDun_Decal_Algae_B3; // 0x298(0x08)
	struct UStaticMeshComponent* SM_WE_Floral_Centerpiece1; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_WE_TableCloth; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Dishware_Old_G; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Dishware_Old_B; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_WE_Floral_Centerpiece; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_WE_Table_Flowers; // 0x2c8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_HW_Food_Dishware_Old_X; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Desert_BD; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Dishware_Old_N; // 0x2e0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_WE_Table_Cake_Flowers; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_WE_Cake; // 0x2f0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HW_Food_Dishware_Old_S; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_WE_CakeCutter; // 0x300(0x08)
	struct UStaticMeshComponent* SM_WE_Cake_Slice; // 0x308(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_Light_Candle_4; // 0x310(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_HW_Food_Dishware_Old_M; // 0x318(0x08)
	struct UMaterialBillboardComponent* MaterialBillboard3; // 0x320(0x08)
	struct UMaterialBillboardComponent* MaterialBillboard2; // 0x328(0x08)
	struct UMaterialBillboardComponent* MaterialBillboard1; // 0x330(0x08)
	struct UMaterialBillboardComponent* MaterialBillboard; // 0x338(0x08)
	struct UPointLightComponent* PointLight2; // 0x340(0x08)
	struct UPointLightComponent* PointLight1; // 0x348(0x08)
};

