// BlueprintGeneratedClass BP_WE_WNAT_MazeLayout_02.BP_WE_WNAT_MazeLayout_02_C
// Size: 0x4e8 (Inherited: 0x480)
struct ABP_WE_WNAT_MazeLayout_02_C : ABP_WE_WNAT_MazeLayout_C {
	struct UChildActorComponent* BP_MazeBlock_1m3; // 0x480(0x08)
	struct UChildActorComponent* BP_MazeBlock_1m2; // 0x488(0x08)
	struct UChildActorComponent* BP_MazeBlock_1m1; // 0x490(0x08)
	struct UChildActorComponent* BP_MazeBlock_1m; // 0x498(0x08)
	struct UChildActorComponent* BP_MazeBlock_Corner4; // 0x4a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SW_WE_Hedge_4m; // 0x4a8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_8SW_WE_Hedge_8m; // 0x4b0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_21SM_WE_HedgeMaze_Corner; // 0x4b8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_9SW_WE_Hedge_1m; // 0x4c0(0x08)
	struct UBillboardComponent* Billboard3; // 0x4c8(0x08)
	struct USceneComponent* PlinthLocation4; // 0x4d0(0x08)
	struct UBillboardComponent* Billboard2_1; // 0x4d8(0x08)
	struct USceneComponent* PlinthLocation3; // 0x4e0(0x08)
};

