// BlueprintGeneratedClass BP_WE_LateNightStudy_PropSet1.BP_WE_LateNightStudy_PropSet1_C
// Size: 0x348 (Inherited: 0x280)
struct ABP_WE_LateNightStudy_PropSet1_C : AWorldEventActor {
	struct UStaticMeshComponent* SM_HM_PotionBottle3; // 0x280(0x08)
	struct UStaticMeshComponent* SM_CastleDun_GOB_PotionContainer_A; // 0x288(0x08)
	struct UPointLightComponent* PointLight_Purple; // 0x290(0x08)
	struct UStaticMeshComponent* SM_PotionSpoon1; // 0x298(0x08)
	struct UStaticMeshComponent* SM_HW_Scrolls_A; // 0x2a0(0x08)
	struct UChildActorComponent* BP_WE_PotionBottle_03; // 0x2a8(0x08)
	struct UChildActorComponent* BP_WE_PotionBottle_02; // 0x2b0(0x08)
	struct UChildActorComponent* BP_WE_PotionBottle_01; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_HW_OpenBook_A; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_PotionSpoon; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_Potion_SpiderEye; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_HW_CircularRugA; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_HM_TeaShop_TeaCup_A1; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_Potion_05; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_Potion_12; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_Potion_14; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_Potion_13; // 0x300(0x08)
	struct UStaticMeshComponent* SM_Potion_11; // 0x308(0x08)
	struct UStaticMeshComponent* SM_HW_L_New_Book_F_3; // 0x310(0x08)
	struct UStaticMeshComponent* SM_HM_PotionBottle11; // 0x318(0x08)
	struct UStaticMeshComponent* SM_HM_TeaShop_TeaCup_A; // 0x320(0x08)
	struct UStaticMeshComponent* SM_HM_Potions_Cauldron_A_Med; // 0x328(0x08)
	struct UStaticMeshComponent* SM_HW_LetterCluster_B; // 0x330(0x08)
	struct UStaticMeshComponent* SM_HW_LetterCluster_C; // 0x338(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x340(0x08)
};

