// BlueprintGeneratedClass BP_WE_TableDressing_Food_01.BP_WE_TableDressing_Food_01_C
// Size: 0x378 (Inherited: 0x248)
struct ABP_WE_TableDressing_Food_01_C : AActor {
	struct UDecalComponent* MI_CavernDun_Decal_Algae_B4; // 0x248(0x08)
	struct UDecalComponent* MI_CavernDun_Decal_Algae_B3_19; // 0x250(0x08)
	struct UDecalComponent* MI_WE_Food_Decal_02_17; // 0x258(0x08)
	struct UDecalComponent* MI_CavernDun_Decal_Algae_B2; // 0x260(0x08)
	struct UDecalComponent* MI_CavernDun_Decal_Algae_B1_14; // 0x268(0x08)
	struct UDecalComponent* MI_WE_Food_Decal_03; // 0x270(0x08)
	struct UStaticMeshComponent* SM_WE_TableCloth; // 0x278(0x08)
	struct UStaticMeshComponent* SM_WE_Food_Items_SM_Potato_Chunk; // 0x280(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_WE_Food_Items_SM_Pea_02; // 0x288(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Bottle_001; // 0x290(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Singles_Toast_CProp; // 0x298(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_Light_Candle_4; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Dishware_Old_P; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Dishware_Old_H; // 0x2b0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_HW_Food_Dishware_Old_A; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_HW_Dishes_ForkFood_Potato_CProp; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Dishware_Old_R; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Main_FD; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Dishware_Old_B; // 0x2d8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_HW_Food_Dishware_Old_X; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Bottle_003; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Main_BB; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_WE_Table_Flowers1; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Main_FG; // 0x300(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_WE_Food_Items_SM_Pea_03; // 0x308(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HW_Food_Dishware_Old_T; // 0x310(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Dishes_CC; // 0x318(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Singles_Corn1; // 0x320(0x08)
	struct USkeletalMeshComponent* SK_CCL_Food_Bread_A; // 0x328(0x08)
	struct UStaticMeshComponent* SM_WE_Table_Flowers; // 0x330(0x08)
	struct USkeletalMeshComponent* SK_CCL_Food_Bread_A1; // 0x338(0x08)
	struct UMaterialBillboardComponent* MaterialBillboard4; // 0x340(0x08)
	struct UMaterialBillboardComponent* MaterialBillboard3; // 0x348(0x08)
	struct UMaterialBillboardComponent* MaterialBillboard2; // 0x350(0x08)
	struct UPointLightComponent* PointLight1; // 0x358(0x08)
	struct UMaterialBillboardComponent* MaterialBillboard1; // 0x360(0x08)
	struct UPointLightComponent* PointLight2; // 0x368(0x08)
	struct UMaterialBillboardComponent* MaterialBillboard; // 0x370(0x08)
};

