// BlueprintGeneratedClass BP_WE_DeathDay_Band.BP_WE_DeathDay_Band_C
// Size: 0x298 (Inherited: 0x248)
struct ABP_WE_DeathDay_Band_C : AActor {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x248(0x08)
	struct UAkComponent* Ak_DeathDayParty_Music; // 0x250(0x08)
	struct USkeletalMeshComponent* SK_WE_Violin_Bow; // 0x258(0x08)
	struct USkeletalMeshComponent* SK_WE_SerpentWoodwind; // 0x260(0x08)
	struct USkeletalMeshComponent* SK_WE_HandHeldHarp; // 0x268(0x08)
	struct USkeletalMeshComponent* SK_WE_Guitar; // 0x270(0x08)
	struct USkeletalMeshComponent* SK_WE_FluteB; // 0x278(0x08)
	struct USkeletalMeshComponent* SK_WE_Drum; // 0x280(0x08)
	struct USkeletalMeshComponent* SK_WE_Accordian; // 0x288(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x290(0x08)

	void ReceiveBeginPlay(); // Function BP_WE_DeathDay_Band.BP_WE_DeathDay_Band_C.ReceiveBeginPlay // (Event|Protected|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_BP_WE_DeathDay_Band(int32_t EntryPoint); // Function BP_WE_DeathDay_Band.BP_WE_DeathDay_Band_C.ExecuteUbergraph_BP_WE_DeathDay_Band // (Final|UbergraphFunction|HasDefaults) // @ game+0x38a7480
};

