// BlueprintGeneratedClass BP_WE_TableDressing_Food_02.BP_WE_TableDressing_Food_02_C
// Size: 0x310 (Inherited: 0x248)
struct ABP_WE_TableDressing_Food_02_C : AActor {
	struct UDecalComponent* MI_WE_Food_Decal_02; // 0x248(0x08)
	struct UDecalComponent* MI_CavernDun_Decal_Algae_B3; // 0x250(0x08)
	struct UStaticMeshComponent* SM_WE_TableCloth; // 0x258(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Main_BC; // 0x260(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Main_GB; // 0x268(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_Light_Candle_4; // 0x270(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_HW_Food_Dishware_Old_X; // 0x278(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_WE_Table_Cake_Flowers; // 0x280(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Main_AH; // 0x288(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Main_GG; // 0x290(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Dishware_Old_O; // 0x298(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Main_FC; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Dishware_Old_M; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_WE_Table_Flowers1; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Dishware_Old_Q; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Dishware_Old_P; // 0x2c0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HM_ButterBeer; // 0x2c8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_7SM_HW_Food_Dishware_Old_A; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_WE_Table_Flowers; // 0x2d8(0x08)
	struct UMaterialBillboardComponent* MaterialBillboard3; // 0x2e0(0x08)
	struct UMaterialBillboardComponent* MaterialBillboard2; // 0x2e8(0x08)
	struct UMaterialBillboardComponent* MaterialBillboard1; // 0x2f0(0x08)
	struct UPointLightComponent* PointLight1; // 0x2f8(0x08)
	struct UMaterialBillboardComponent* MaterialBillboard; // 0x300(0x08)
	struct UPointLightComponent* PointLight2; // 0x308(0x08)
};

