// BlueprintGeneratedClass BP_WE_LateNightStudy_PropSet5.BP_WE_LateNightStudy_PropSet5_C
// Size: 0x378 (Inherited: 0x280)
struct ABP_WE_LateNightStudy_PropSet5_C : AWorldEventActor {
	struct UPointLightComponent* PointLight; // 0x280(0x08)
	struct UDecalComponent* Decal; // 0x288(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Singles_Muffin; // 0x290(0x08)
	struct UStaticMeshComponent* SM_HM_Quill_InkBottles_D; // 0x298(0x08)
	struct UStaticMeshComponent* SM_HW_Scroll; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_HW_Scrolls_C1; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_BCProps_Apple_C; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_ArmillarySphere_A; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_QuestItem_QQT_Quill; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_HW_LetterCluster_A; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_HW_LetterBundle_A; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_WE_ScrunchedPaper2; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_WE_ScrunchedPaper1; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_WE_ScrunchedPaper; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_HW_Trash_PaperScraps_B; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_IsidoraBook; // 0x2f8(0x08)
	struct UParticleSystemComponent* P_Candleflame; // 0x300(0x08)
	struct UStaticMeshComponent* SM_CastleDun_GOB_Telescope; // 0x308(0x08)
	struct UStaticMeshComponent* SM_Cairn_SpineCandle_Low_C; // 0x310(0x08)
	struct UStaticMeshComponent* SM_HM_Candlestick_A; // 0x318(0x08)
	struct UStaticMeshComponent* SM_HW_RugRoundB; // 0x320(0x08)
	struct UStaticMeshComponent* SM_HW_Scrolls_C; // 0x328(0x08)
	struct UStaticMeshComponent* SM_HW_L_New_Book_G_3; // 0x330(0x08)
	struct UStaticMeshComponent* SM_HW_Scrolls_A; // 0x338(0x08)
	struct UStaticMeshComponent* SM_HW_OpenBook_A; // 0x340(0x08)
	struct UStaticMeshComponent* SM_HW_L_New_Book_F_3; // 0x348(0x08)
	struct UStaticMeshComponent* SM_HM_TeaShop_TeaCup_A; // 0x350(0x08)
	struct UStaticMeshComponent* SM_HW_Dishes_Plate; // 0x358(0x08)
	struct UStaticMeshComponent* SM_HW_LetterCluster_B; // 0x360(0x08)
	struct UStaticMeshComponent* SM_HW_LetterCluster_C; // 0x368(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x370(0x08)
};

