// BlueprintGeneratedClass BP_WE_LateNightStudy_PropSet2.BP_WE_LateNightStudy_PropSet2_C
// Size: 0x310 (Inherited: 0x280)
struct ABP_WE_LateNightStudy_PropSet2_C : AWorldEventActor {
	struct UStaticMeshComponent* SM_HW_DAO_ShrunkenHeadA; // 0x280(0x08)
	struct UParticleSystemComponent* P_Candleflame; // 0x288(0x08)
	struct UPointLightComponent* PointLight_Red; // 0x290(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Singles_Cupcake; // 0x298(0x08)
	struct UStaticMeshComponent* SM_Cairn_SpineCandle_Low_C; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_HM_Candlestick_A; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_HW_RugRoundB; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_HW_Scrolls_C; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_Sanc_Skull_Dwiz_01A; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_HW_DAO_DriedWolfBaby_A; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_HW_Scrolls_A; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_HW_OpenBook_A; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_HW_L_New_Book_F_3; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_HM_TeaShop_TeaCup_A; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_HW_Dishes_Plate; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_HW_LetterCluster_B; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_HW_LetterCluster_C; // 0x300(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x308(0x08)
};

