// BlueprintGeneratedClass BP_WE_WNAT_MazeLayout_03.BP_WE_WNAT_MazeLayout_03_C
// Size: 0x4c0 (Inherited: 0x480)
struct ABP_WE_WNAT_MazeLayout_03_C : ABP_WE_WNAT_MazeLayout_C {
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_WE_HedgeMaze_Corner; // 0x480(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_8SW_WE_Hedge_8m; // 0x488(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SW_WE_Hedge_4m; // 0x490(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SW_WE_Hedge_1m; // 0x498(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_21SM_WE_HedgeMaze_Corner; // 0x4a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SW_WE_Hedge_2m; // 0x4a8(0x08)
	struct UBillboardComponent* Billboard2_1; // 0x4b0(0x08)
	struct USceneComponent* PlinthLocation3; // 0x4b8(0x08)
};

