// BlueprintGeneratedClass BP_WE_LateNightStudy_PropSet3.BP_WE_LateNightStudy_PropSet3_C
// Size: 0x370 (Inherited: 0x280)
struct ABP_WE_LateNightStudy_PropSet3_C : AWorldEventActor {
	struct UPointLightComponent* Mushroom_PointLight; // 0x280(0x08)
	struct UStaticMeshComponent* SM_XeromphalinaClump_02; // 0x288(0x08)
	struct UStaticMeshComponent* SM_XeromphalinaClump_03; // 0x290(0x08)
	struct UStaticMeshComponent* SM_HW_OpenBook_A; // 0x298(0x08)
	struct UStaticMeshComponent* SM_HM_InkBottleWithQuills_B; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_HW_LetterCluster_C; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_HW_LetterCluster_B; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_HM_Candlestick_A; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_PlantStage5; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_Aglonema_Var4_Master; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Knife_001; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_DeadLeafThin_01_Master; // 0x2d8(0x08)
	struct UStaticMeshComponent* VFX_SM_ChompCabbage_Leaf; // 0x2e0(0x08)
	struct UStaticMeshComponent* VFX_SM_ChompCabbage_Leaf1; // 0x2e8(0x08)
	struct UPointLightComponent* Candle_PointLight; // 0x2f0(0x08)
	struct UParticleSystemComponent* P_Candleflame; // 0x2f8(0x08)
	struct UDecalComponent* Dirt_Decal_02; // 0x300(0x08)
	struct UStaticMeshComponent* SM_HW_L_New_Book_Small_A_LOD; // 0x308(0x08)
	struct UStaticMeshComponent* SM_PotStack; // 0x310(0x08)
	struct UStaticMeshComponent* SM_PlantingPotSmall2; // 0x318(0x08)
	struct UStaticMeshComponent* SM_HM_TeaShop_Cake_D; // 0x320(0x08)
	struct UStaticMeshComponent* SM_HM_TeaShop_Saucer_A; // 0x328(0x08)
	struct UStaticMeshComponent* SM_Sanc_PestleMortar_01A; // 0x330(0x08)
	struct UStaticMeshComponent* SM_Cav_Mushroom_Cluster_01; // 0x338(0x08)
	struct UStaticMeshComponent* SM_HM_Neep_PlantK_Berry_Plant; // 0x340(0x08)
	struct UStaticMeshComponent* SM_PlantingPotMed_01; // 0x348(0x08)
	struct UStaticMeshComponent* SM_Cairn_SpineCandle_Low_C; // 0x350(0x08)
	struct UStaticMeshComponent* SM_HW_RugRoundB; // 0x358(0x08)
	struct UStaticMeshComponent* SM_HW_L_New_Book_F_3; // 0x360(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x368(0x08)
};

