// BlueprintGeneratedClass BP_WallChunkA.BP_WallChunkA_C
// Size: 0x428 (Inherited: 0x248)
struct ABP_WallChunkA_C : AActor {
	struct UStaticMeshComponent* SM_GobMine_BeamConnector_V1_D641_StaticMeshComponent0; // 0x248(0x08)
	struct UStaticMeshComponent* SM_GobMine_BeamConnector_V1_D638_StaticMeshComponent0; // 0x250(0x08)
	struct UStaticMeshComponent* SM_GobMine_BeamConnector_V1_D573_StaticMeshComponent2; // 0x258(0x08)
	struct UStaticMeshComponent* SM_GobMine_BeamConnector_V1_D573_StaticMeshComponent19; // 0x260(0x08)
	struct UStaticMeshComponent* SM_GobMine_BeamConnector_V1_D573_StaticMeshComponent18; // 0x268(0x08)
	struct UStaticMeshComponent* SM_GobMine_BeamConnector_V1_D573_StaticMeshComponent0; // 0x270(0x08)
	struct UStaticMeshComponent* SM_GobMine_BeamConnector_V1_D573_StaticMeshComponent1; // 0x278(0x08)
	struct UStaticMeshComponent* SM_GobMine_BeamConnector_V1_D573_StaticMeshComponent8; // 0x280(0x08)
	struct UStaticMeshComponent* SM_GobMine_BeamConnector_V1_D573_StaticMeshComponent7; // 0x288(0x08)
	struct UStaticMeshComponent* SM_GobMine_BeamConnector_V1_D573_StaticMeshComponent3; // 0x290(0x08)
	struct UStaticMeshComponent* SM_GobMine_BeamConnector_V1_D573_StaticMeshComponent4; // 0x298(0x08)
	struct UStaticMeshComponent* SM_GobMine_BeamConnector_V1_D573_StaticMeshComponent5; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_GobMine_BeamConnector_V1_D573_StaticMeshComponent6; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_GobMine_BeamConnector_V1_D573_StaticMeshComponent22; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_GobMine_BeamConnector_V1_D573_StaticMeshComponent23; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_GobMine_BeamConnector_V1_D573_StaticMeshComponent9; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_GobMine_BeamConnector_V1_D573_StaticMeshComponent10; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_GobMine_BeamConnector_V1_D573_StaticMeshComponent11; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_GobMine_BeamConnector_V1_D573_StaticMeshComponent12; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_GobMine_BeamConnector_V1_D573_StaticMeshComponent13; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_GobMine_BeamConnector_V1_D573_StaticMeshComponent14; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_GobMine_BeamConnector_V1_D573_StaticMeshComponent15; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_GobMine_BeamConnector_V1_D573_StaticMeshComponent16; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_GobMine_BeamConnector_V1_D573_StaticMeshComponent17; // 0x300(0x08)
	struct UStaticMeshComponent* SM_GobMine_BeamConnector_V1_D573_StaticMeshComponent20; // 0x308(0x08)
	struct UStaticMeshComponent* SM_GobMine_BeamConnector_V1_D573_StaticMeshComponent21; // 0x310(0x08)
	struct USceneComponent* SM_GobMine_BeamConnector_V1_D573_SharedRoot; // 0x318(0x08)
	struct USceneComponent* SM_GobMine_BeamConnector_V1_D573_DefaultSceneRoot; // 0x320(0x08)
	struct UStaticMeshComponent* SM_GobMine_BeamConnector_V1_D318_StaticMeshComponent2; // 0x328(0x08)
	struct UStaticMeshComponent* SM_GobMine_BeamConnector_V1_D318_StaticMeshComponent19; // 0x330(0x08)
	struct UStaticMeshComponent* SM_GobMine_BeamConnector_V1_D318_StaticMeshComponent18; // 0x338(0x08)
	struct UStaticMeshComponent* SM_GobMine_BeamConnector_V1_D318_StaticMeshComponent0; // 0x340(0x08)
	struct UStaticMeshComponent* SM_GobMine_BeamConnector_V1_D318_StaticMeshComponent1; // 0x348(0x08)
	struct UStaticMeshComponent* SM_GobMine_BeamConnector_V1_D318_StaticMeshComponent8; // 0x350(0x08)
	struct UStaticMeshComponent* SM_GobMine_BeamConnector_V1_D318_StaticMeshComponent7; // 0x358(0x08)
	struct UStaticMeshComponent* SM_GobMine_BeamConnector_V1_D318_StaticMeshComponent3; // 0x360(0x08)
	struct UStaticMeshComponent* SM_GobMine_BeamConnector_V1_D318_StaticMeshComponent4; // 0x368(0x08)
	struct UStaticMeshComponent* SM_GobMine_BeamConnector_V1_D318_StaticMeshComponent5; // 0x370(0x08)
	struct UStaticMeshComponent* SM_GobMine_BeamConnector_V1_D318_StaticMeshComponent6; // 0x378(0x08)
	struct UStaticMeshComponent* SM_GobMine_BeamConnector_V1_D318_StaticMeshComponent22; // 0x380(0x08)
	struct UStaticMeshComponent* SM_GobMine_BeamConnector_V1_D318_StaticMeshComponent23; // 0x388(0x08)
	struct UStaticMeshComponent* SM_GobMine_BeamConnector_V1_D318_StaticMeshComponent9; // 0x390(0x08)
	struct UStaticMeshComponent* SM_GobMine_BeamConnector_V1_D318_StaticMeshComponent10; // 0x398(0x08)
	struct UStaticMeshComponent* SM_GobMine_BeamConnector_V1_D318_StaticMeshComponent11; // 0x3a0(0x08)
	struct UStaticMeshComponent* SM_GobMine_BeamConnector_V1_D318_StaticMeshComponent12; // 0x3a8(0x08)
	struct UStaticMeshComponent* SM_GobMine_BeamConnector_V1_D318_StaticMeshComponent13; // 0x3b0(0x08)
	struct UStaticMeshComponent* SM_GobMine_BeamConnector_V1_D318_StaticMeshComponent14; // 0x3b8(0x08)
	struct UStaticMeshComponent* SM_GobMine_BeamConnector_V1_D318_StaticMeshComponent15; // 0x3c0(0x08)
	struct UStaticMeshComponent* SM_GobMine_BeamConnector_V1_D318_StaticMeshComponent16; // 0x3c8(0x08)
	struct UStaticMeshComponent* SM_GobMine_BeamConnector_V1_D318_StaticMeshComponent17; // 0x3d0(0x08)
	struct UStaticMeshComponent* SM_GobMine_BeamConnector_V1_D318_StaticMeshComponent20; // 0x3d8(0x08)
	struct UStaticMeshComponent* SM_GobMine_BeamConnector_V1_D318_StaticMeshComponent21; // 0x3e0(0x08)
	struct USceneComponent* SM_GobMine_BeamConnector_V1_D318_SharedRoot; // 0x3e8(0x08)
	struct USceneComponent* SM_GobMine_BeamConnector_V1_D318_DefaultSceneRoot; // 0x3f0(0x08)
	struct UStaticMeshComponent* SM_GobMine_BeamConnector_V1_D1609_StaticMeshComponent0; // 0x3f8(0x08)
	struct UStaticMeshComponent* SM_GobMine_BeamConnector_V1_D1660_StaticMeshComponent0; // 0x400(0x08)
	struct UStaticMeshComponent* SM_GobMine_BeamConnector_V1_D574_StaticMeshComponent0; // 0x408(0x08)
	struct UStaticMeshComponent* SM_GobMine_BeamConnector_V1_D575_StaticMeshComponent0; // 0x410(0x08)
	struct UStaticMeshComponent* SM_GobMine_Wall_Hole_A5_StaticMeshComponent0; // 0x418(0x08)
	struct USceneComponent* SharedRoot; // 0x420(0x08)
};

