// BlueprintGeneratedClass BP_WE_TableDressing_05.BP_WE_TableDressing_05_C
// Size: 0x368 (Inherited: 0x248)
struct ABP_WE_TableDressing_05_C : AActor {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x248(0x08)
	struct UMaterialBillboardComponent* MaterialBillboard1; // 0x250(0x08)
	struct UMaterialBillboardComponent* MaterialBillboard; // 0x258(0x08)
	struct UPointLightComponent* PointLight2; // 0x260(0x08)
	struct UChildActorComponent* BP_StationTableChair1p; // 0x268(0x08)
	struct UStaticMeshComponent* SM_WE_Floral_Centerpiece; // 0x270(0x08)
	struct UStaticMeshComponent* SM_WE_DeathDay_Round_TableCloth; // 0x278(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Bottle_001; // 0x280(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Bottle_003_LOD; // 0x288(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Bottle_B; // 0x290(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Dishware_Old_R2; // 0x298(0x08)
	struct UDecalComponent* Decal4; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Singles_Baguette; // 0x2a8(0x08)
	struct UDecalComponent* Decal3; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Dishware_Old_Q; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Dishware_O; // 0x2c0(0x08)
	struct UDecalComponent* Decal2; // 0x2c8(0x08)
	struct UDecalComponent* Decal1; // 0x2d0(0x08)
	struct UDecalComponent* Decal; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Dishware_Old_S1; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Main_FG; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Dishware_Old_X; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Dishware_Old_X1; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Dishes_BA; // 0x300(0x08)
	struct UPointLightComponent* PointLight1; // 0x308(0x08)
	struct UStaticMeshComponent* SM_Light_Candle_5; // 0x310(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Dishware_Old_N; // 0x318(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Dishware_Old_T; // 0x320(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Dishware_Old_P; // 0x328(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Dishware_Old_O; // 0x330(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Dishes_CE1; // 0x338(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Dishes_CE; // 0x340(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Dishware_Old_R1; // 0x348(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Dishware_Old_R; // 0x350(0x08)
	struct UStaticMeshComponent* SM_Light_Candle_4; // 0x358(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x360(0x08)

	void ReceiveEndPlay(enum class EEndPlayReason EndPlayReason); // Function BP_WE_TableDressing_05.BP_WE_TableDressing_05_C.ReceiveEndPlay // (Event|Protected|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_BP_WE_TableDressing_05(int32_t EntryPoint); // Function BP_WE_TableDressing_05.BP_WE_TableDressing_05_C.ExecuteUbergraph_BP_WE_TableDressing_05 // (Final|UbergraphFunction) // @ game+0x38a7480
};

