// BlueprintGeneratedClass BP_WE_TableDressing_06.BP_WE_TableDressing_06_C
// Size: 0x2e8 (Inherited: 0x248)
struct ABP_WE_TableDressing_06_C : AActor {
	struct UMaterialBillboardComponent* MaterialBillboard1; // 0x248(0x08)
	struct UMaterialBillboardComponent* MaterialBillboard; // 0x250(0x08)
	struct UStaticMeshComponent* SM_WE_Floral_Centerpiece; // 0x258(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Jug_C; // 0x260(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Bottle_002; // 0x268(0x08)
	struct UStaticMeshComponent* SM_WE_DeathDay_Round_TableCloth; // 0x270(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Bottle_001; // 0x278(0x08)
	struct UStaticMeshComponent* SM_Int_BCProps_Bottle_003_LOD; // 0x280(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Bottle_B; // 0x288(0x08)
	struct UDecalComponent* Decal3; // 0x290(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Dishware_Old_S1; // 0x298(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Dishware_Old_S; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Dishware_Old_X; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Dishware_Old_X1; // 0x2b0(0x08)
	struct UPointLightComponent* PointLight1; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_Light_Candle_5; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Dishware_Old_R1; // 0x2c8(0x08)
	struct UPointLightComponent* PointLight; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_Light_Candle_4; // 0x2d8(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x2e0(0x08)
};

