// BlueprintGeneratedClass BP_WE_TableDressing_Punch.BP_WE_TableDressing_Punch_C
// Size: 0x2f0 (Inherited: 0x248)
struct ABP_WE_TableDressing_Punch_C : AActor {
	struct UDecalComponent* MI_WE_Food_Decal_02_35; // 0x248(0x08)
	struct UStaticMeshComponent* SM_WE_TableCloth; // 0x250(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_HW_Food_Dishware_Old_R; // 0x258(0x08)
	struct UStaticMeshComponent* SM_WE_Table_Cake_Flowers; // 0x260(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Dishware_Old_P; // 0x268(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_HW_Food_Dishware_Old_S; // 0x270(0x08)
	struct UStaticMeshComponent* SM_HM_3Broom_Jug_A; // 0x278(0x08)
	struct UStaticMeshComponent* SM_WE_Table_Flowers; // 0x280(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_Light_Candle_4; // 0x288(0x08)
	struct UStaticMeshComponent* SM_HW_Food_Dishware_Old_N; // 0x290(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_HW_Food_Dishware_Old_X; // 0x298(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_HM_3Broom_Jug_C; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_WE_PunchBowl; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_CastleDun_Kitchen_Ladle_A; // 0x2b0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_WE_Floral_Centerpiece; // 0x2b8(0x08)
	struct UPointLightComponent* PointLight2; // 0x2c0(0x08)
	struct UMaterialBillboardComponent* MaterialBillboard2; // 0x2c8(0x08)
	struct UMaterialBillboardComponent* MaterialBillboard3; // 0x2d0(0x08)
	struct UMaterialBillboardComponent* MaterialBillboard1; // 0x2d8(0x08)
	struct UPointLightComponent* PointLight1; // 0x2e0(0x08)
	struct UMaterialBillboardComponent* MaterialBillboard; // 0x2e8(0x08)
};

