// BlueprintGeneratedClass BTS_Biped_TopLevel.BTS_Biped_TopLevel_C
// Size: 0x2a8 (Inherited: 0xf8)
struct UBTS_Biped_TopLevel_C : UBTService_AvaAITree_Input {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0xf8(0x08)
	struct FTimerHandle SprintTimerHandle; // 0x100(0x08)
	bool TimeDilated; // 0x108(0x01)
	char pad_109[0x7]; // 0x109(0x07)
	struct UAblAbilityContext* AdditiveAbilityContext; // 0x110(0x08)
	bool AnimDebugOn; // 0x118(0x01)
	char pad_119[0x3]; // 0x119(0x03)
	int32_t ReactionIndex; // 0x11c(0x04)
	struct UAblAbility* DebugReactionAbility; // 0x120(0x08)
	int32_t SpellSlot; // 0x128(0x04)
	enum class EBTCustomActionType BTActionType; // 0x12c(0x01)
	char pad_12D[0x3]; // 0x12d(0x03)
	struct FTimerHandle LockOnTimerHandle; // 0x130(0x08)
	struct FTimerHandle FullBodyWandCastTimerHandle; // 0x138(0x08)
	struct FTimerHandle SpellButtonTimerHandle; // 0x140(0x08)
	bool UsingInventoryItem; // 0x148(0x01)
	char pad_149[0x7]; // 0x149(0x07)
	struct AActor* InteractSenseTarget; // 0x150(0x08)
	struct AActor* InteractActor; // 0x158(0x08)
	struct FVariantMapHandle FullBodyCastVariantHandle; // 0x160(0x04)
	bool StealthMode; // 0x164(0x01)
	bool FinisherInitiated; // 0x165(0x01)
	char pad_166[0x2]; // 0x166(0x02)
	float DodgeCoolDownTime; // 0x168(0x04)
	char pad_16C[0x4]; // 0x16c(0x04)
	struct FTimerHandle ProximityTimerHandle; // 0x170(0x08)
	bool FaceShiftButtonHeld; // 0x178(0x01)
	bool AltModifierPressed; // 0x179(0x01)
	bool CogTargetDebugDraw; // 0x17a(0x01)
	bool CancelQueuedStupefy; // 0x17b(0x01)
	char pad_17C[0x4]; // 0x17c(0x04)
	struct FString CurrentHealthItem; // 0x180(0x10)
	float TimeDeadBeforeDialog; // 0x190(0x04)
	bool SoftLanding; // 0x194(0x01)
	bool MedLanding; // 0x195(0x01)
	bool FaceTarget; // 0x196(0x01)
	bool IsMoving; // 0x197(0x01)
	bool isSprinting; // 0x198(0x01)
	enum class ELandingType LandingType; // 0x199(0x01)
	char pad_19A[0x6]; // 0x19a(0x06)
	struct FTimerHandle ActivateActionsOnHUDTimerHandle; // 0x1a0(0x08)
	bool HUDActionsShown; // 0x1a8(0x01)
	bool MoveStickPressed; // 0x1a9(0x01)
	bool ShouldSprintOnStartMoving; // 0x1aa(0x01)
	char pad_1AB[0x5]; // 0x1ab(0x05)
	struct FTimerHandle ShouldSprintOnStartMovingTimerHandle; // 0x1b0(0x08)
	float DelayBeforeActionHud; // 0x1b8(0x04)
	int32_t LoadOutSlot; // 0x1bc(0x04)
	bool RagdollCriteriaMet; // 0x1c0(0x01)
	char pad_1C1[0x7]; // 0x1c1(0x07)
	struct FTimerHandle CastFailedTimerHandle; // 0x1c8(0x08)
	enum class EBTCustomActionType ActionType; // 0x1d0(0x01)
	char pad_1D1[0x3]; // 0x1d1(0x03)
	float InjuryHeight; // 0x1d4(0x04)
	float DeathHeight; // 0x1d8(0x04)
	float LastTwitchSpellCastAtTime; // 0x1dc(0x04)
	struct FString TakedownTutorialString; // 0x1e0(0x10)
	int32_t SpellTestIndex; // 0x1f0(0x04)
	int32_t SpellTestSlot; // 0x1f4(0x04)
	struct AActor* SpellTestSpawnedActor; // 0x1f8(0x08)
	struct TArray<struct FString> ItemNameArray; // 0x200(0x10)
	struct TArray<struct FString> SpellNameArray; // 0x210(0x10)
	struct FTimerHandle ItemMenuTimerHandle; // 0x220(0x08)
	struct FTimerHandle DodgeTimerHandle; // 0x228(0x08)
	struct FTimerHandle SprintStopTimerHandle; // 0x230(0x08)
	struct FTimerHandle WalkStopTimerHandle; // 0x238(0x08)
	struct UUI_BP_GadgetWheel_C* ItemWheelWidget; // 0x240(0x08)
	float FallHeightAdjust; // 0x248(0x04)
	bool IsWalking; // 0x24c(0x01)
	char pad_24D[0x3]; // 0x24d(0x03)
	int32_t SpellWheelActiveSpellIndex; // 0x250(0x04)
	char pad_254[0x4]; // 0x254(0x04)
	struct FTimerHandle WalkStopTimerHandle_Idle; // 0x258(0x08)
	struct FTimerHandle FieldGuideTimerHandle; // 0x260(0x08)
	struct FTimerHandle OppugnoTimerHandle; // 0x268(0x08)
	bool ItemMenuButtonHeld; // 0x270(0x01)
	bool OppugnoButtonHeld; // 0x271(0x01)
	bool InteractButtonPressed; // 0x272(0x01)
	bool Stealing; // 0x273(0x01)
	bool InteractStarted; // 0x274(0x01)
	bool InteractDebug; // 0x275(0x01)
	bool StupefyButtonHeld; // 0x276(0x01)
	bool LockOnButtonHeld; // 0x277(0x01)
	bool SprintButtonHeld; // 0x278(0x01)
	char pad_279[0x7]; // 0x279(0x07)
	struct ABP_StealthTakedownInteractActor_C* StealthInteractActor; // 0x280(0x08)
	bool OppugnoSenseEnabled; // 0x288(0x01)
	bool AimModeActive; // 0x289(0x01)
	bool AimModeWasStartedInCombat; // 0x28a(0x01)
	char pad_28B[0x1]; // 0x28b(0x01)
	float LoadoutNextTimeout; // 0x28c(0x04)
	struct TArray<struct FName> ItemPickupLocks; // 0x290(0x10)
	float BroomcastTime; // 0x2a0(0x04)
	float BroomcastCooldownDuration; // 0x2a4(0x04)

	void SelectedLockedDiamond(int32_t Current, int32_t NEW); // Function BTS_Biped_TopLevel.BTS_Biped_TopLevel_C.SelectedLockedDiamond // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void IsItemWheelAvailable(bool& IsAvailable); // Function BTS_Biped_TopLevel.BTS_Biped_TopLevel_C.IsItemWheelAvailable // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void SetNextLightWandCast(bool Casual); // Function BTS_Biped_TopLevel.BTS_Biped_TopLevel_C.SetNextLightWandCast // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void FlushQueuedActions(struct AActor* Owner); // Function BTS_Biped_TopLevel.BTS_Biped_TopLevel_C.FlushQueuedActions // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void EndAimMode(); // Function BTS_Biped_TopLevel.BTS_Biped_TopLevel_C.EndAimMode // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
