// ControlRigBlueprintGeneratedClass CR_Fwooper.CR_Fwooper_C
// Size: 0x700 (Inherited: 0x650)
struct UCR_Fwooper_C : UControlRig {
	struct FTransform Foot_Back_R; // 0x650(0x30)
	struct FTransform Foot_Back_L; // 0x680(0x30)
	struct FTransform Pelvis; // 0x6b0(0x30)
	float Foot_Back_R_Alpha; // 0x6e0(0x04)
	float Foot_Back_L_Alpha; // 0x6e4(0x04)
	float Pelvis_Alpha; // 0x6e8(0x04)
	float AimAlpha; // 0x6ec(0x04)
	float AimLooseness; // 0x6f0(0x04)
	struct FVector AimTarget; // 0x6f4(0x0c)
};

