// ControlRigBlueprintGeneratedClass CR_HebrideanBlack.CR_HebrideanBlack_C
// Size: 0x858 (Inherited: 0x650)
struct UCR_HebrideanBlack_C : UControlRig {
	struct FTransform Foot_R; // 0x650(0x30)
	float Foot_R_Alpha; // 0x680(0x04)
	char pad_684[0xc]; // 0x684(0x0c)
	struct FTransform Foot_L; // 0x690(0x30)
	float Foot_L_Alpha; // 0x6c0(0x04)
	char pad_6C4[0xc]; // 0x6c4(0x0c)
	struct FTransform Wrist_R; // 0x6d0(0x30)
	float Wrist_R_Alpha; // 0x700(0x04)
	char pad_704[0xc]; // 0x704(0x0c)
	struct FTransform Wrist_L; // 0x710(0x30)
	float Wrist_L_Alpha; // 0x740(0x04)
	char pad_744[0xc]; // 0x744(0x0c)
	struct FTransform Pelvis; // 0x750(0x30)
	float Pelvis_Alpha; // 0x780(0x04)
	char pad_784[0xc]; // 0x784(0x0c)
	struct FTransform Chest; // 0x790(0x30)
	float Chest_Alpha; // 0x7c0(0x04)
	char pad_7C4[0xc]; // 0x7c4(0x0c)
	struct FTransform tail01; // 0x7d0(0x30)
	float Tail01_Alpha; // 0x800(0x04)
	char pad_804[0xc]; // 0x804(0x0c)
	struct FTransform tail02; // 0x810(0x30)
	float Tail02_Alpha; // 0x840(0x04)
	struct FVector AimTarget; // 0x844(0x0c)
	float AimAlpha; // 0x850(0x04)
	float AimLooseness; // 0x854(0x04)
};

