// ControlRigBlueprintGeneratedClass CR_Kneazle.CR_Kneazle_C
// Size: 0x79c (Inherited: 0x650)
struct UCR_Kneazle_C : UControlRig {
	struct FTransform Foot_Back_R; // 0x650(0x30)
	struct FTransform Foot_Back_L; // 0x680(0x30)
	struct FTransform Foot_Front_R; // 0x6b0(0x30)
	struct FTransform Foot_Front_L; // 0x6e0(0x30)
	struct FTransform Pelvis; // 0x710(0x30)
	struct FTransform Chest; // 0x740(0x30)
	float Foot_Back_R_Alpha; // 0x770(0x04)
	float Foot_Back_L_Alpha; // 0x774(0x04)
	float Foot_Front_R_Alpha; // 0x778(0x04)
	float Foot_Front_L_Alpha; // 0x77c(0x04)
	float Pelvis_Alpha; // 0x780(0x04)
	float Chest_Alpha; // 0x784(0x04)
	float AimAlpha; // 0x788(0x04)
	float AimLooseness; // 0x78c(0x04)
	struct FVector AimTarget; // 0x790(0x0c)
};

