// ScriptStruct FluidSim.FluidSimEmitterParams
// Size: 0x40 (Inherited: 0x00)
struct FFluidSimEmitterParams {
	float EmitterMultiplier; // 0x00(0x04)
	char pad_4[0xc]; // 0x04(0x0c)
	struct FVector4 EmitterDir; // 0x10(0x10)
	float EmitterBias; // 0x20(0x04)
	float MotionVectorStrength; // 0x24(0x04)
	char pad_28[0x18]; // 0x28(0x18)
};

// ScriptStruct FluidSim.CompiledFluidSimParams
// Size: 0x90 (Inherited: 0x00)
struct FCompiledFluidSimParams {
	struct FFluidSimParams Params; // 0x00(0x88)
	struct UTexture2D* ColorMap; // 0x88(0x08)
};

// ScriptStruct FluidSim.FluidSimParams
// Size: 0x88 (Inherited: 0x00)
struct FFluidSimParams {
	bool Enabled; // 0x00(0x01)
	bool DrawDebugBounds; // 0x01(0x01)
	bool Optimize; // 0x02(0x01)
	char pad_3[0x1]; // 0x03(0x01)
	float OptimizationThreshold; // 0x04(0x04)
	struct FVector VolumeScale; // 0x08(0x0c)
	struct FVector ComputeDimensions; // 0x14(0x0c)
	struct UCurveLinearColor* ColorCurve; // 0x20(0x08)
	float ColorCurveScale; // 0x28(0x04)
	float ColorIntensity; // 0x2c(0x04)
	bool FadeEdges; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	struct FVector BuoyancyGravity; // 0x34(0x0c)
	bool LocalSpaceBuoyancyGravity; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	float MotionVectorStrength; // 0x44(0x04)
	bool VolumeMotion; // 0x48(0x01)
	char pad_49[0x3]; // 0x49(0x03)
	float VelocityDissipation; // 0x4c(0x04)
	float SourceDissipation; // 0x50(0x04)
	float Vorticity; // 0x54(0x04)
	float VorticityTrails; // 0x58(0x04)
	char pad_5C[0x8]; // 0x5c(0x08)
	float TimeStep; // 0x64(0x04)
	int32_t iterations; // 0x68(0x04)
	float Density; // 0x6c(0x04)
	char pad_70[0x1]; // 0x70(0x01)
	bool SlowLighting; // 0x71(0x01)
	char pad_72[0x2]; // 0x72(0x02)
	float EdgeFadeScale; // 0x74(0x04)
	float EdgeFadeBias; // 0x78(0x04)
	char pad_7C[0xc]; // 0x7c(0x0c)
};

