// BlueprintGeneratedClass HN_AP_Tech.HN_AP_Tech_C
// Size: 0x2a0 (Inherited: 0x250)
struct AHN_AP_Tech_C : ALevelScriptActor {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x250(0x08)
	struct ADynamicObjectVolume* HN_AP_GC_M_EVJ_2_LOC_Patrol_1_DOV_0_ExecuteUbergraph_HN_AP_Tech_RefProperty; // 0x258(0x08)
	struct ASceneRigActor* CIV_EVJ_02_GoblinCamp2_Post_ExecuteUbergraph_HN_AP_Tech_RefProperty; // 0x260(0x08)
	struct ASceneRigActor* CIV_EVJ_01_ForestOverlook2_5_ExecuteUbergraph_HN_AP_Tech_RefProperty; // 0x268(0x08)
	struct ADynamicObjectVolume* DynamicObjectVolume_1_ExecuteUbergraph_HN_AP_Tech_RefProperty; // 0x270(0x08)
	struct ANone* BP_PerformTasksForAI_2_ExecuteUbergraph_HN_AP_Tech_RefProperty; // 0x278(0x08)
	struct ADynamicObjectVolume* EVJSnipeRoof_LOC_Guard_1_DOV_0_ExecuteUbergraph_HN_AP_Tech_RefProperty; // 0x280(0x08)
	struct ADynamicObjectVolume* EVJSnipeRoof_LOC_Guard_1_DOV_1_ExecuteUbergraph_HN_AP_Tech_RefProperty; // 0x288(0x08)
	struct ADynamicObjectVolume* EVJChiefGobCamp2_LOC_Guard_1_DOV_0_ExecuteUbergraph_HN_AP_Tech_RefProperty; // 0x290(0x08)
	struct ADynamicObjectVolume* EVJGobMeleeCamp2Patrol_LOC_Guard_1_DOV_0_ExecuteUbergraph_HN_AP_Tech_RefProperty; // 0x298(0x08)

	void PlaybackComplete_1EF7AFCE4962F5C948354587AA68F9EA(struct USceneRigPlayer* SceneRigPlayer); // Function HN_AP_Tech.HN_AP_Tech_C.PlaybackComplete_1EF7AFCE4962F5C948354587AA68F9EA // (BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void PlaybackStarted_1EF7AFCE4962F5C948354587AA68F9EA(struct USceneRigPlayer* SceneRigPlayer); // Function HN_AP_Tech.HN_AP_Tech_C.PlaybackStarted_1EF7AFCE4962F5C948354587AA68F9EA // (BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void PlayerAssigned_1EF7AFCE4962F5C948354587AA68F9EA(struct USceneRigPlayer* SceneRigPlayer); // Function HN_AP_Tech.HN_AP_Tech_C.PlayerAssigned_1EF7AFCE4962F5C948354587AA68F9EA // (BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void PlaybackComplete_3E86BAE44C0261ED80114287E061598E(struct USceneRigPlayer* SceneRigPlayer); // Function HN_AP_Tech.HN_AP_Tech_C.PlaybackComplete_3E86BAE44C0261ED80114287E061598E // (BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void PlaybackStarted_3E86BAE44C0261ED80114287E061598E(struct USceneRigPlayer* SceneRigPlayer); // Function HN_AP_Tech.HN_AP_Tech_C.PlaybackStarted_3E86BAE44C0261ED80114287E061598E // (BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void PlayerAssigned_3E86BAE44C0261ED80114287E061598E(struct USceneRigPlayer* SceneRigPlayer); // Function HN_AP_Tech.HN_AP_Tech_C.PlayerAssigned_3E86BAE44C0261ED80114287E061598E // (BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void ReceiveBeginPlay(); // Function HN_AP_Tech.HN_AP_Tech_C.ReceiveBeginPlay // (Event|Protected|BlueprintEvent) // @ game+0x38a7480
	void GC_M_EVJ_2 Dead(); // Function HN_AP_Tech.HN_AP_Tech_C.GC_M_EVJ_2 Dead // (BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void CustomEvent_1(); // Function HN_AP_Tech.HN_AP_Tech_C.CustomEvent_1 // (BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void BndEvt__HN_AP_Tech_TriggerBox_1_K2Node_ActorBoundEvent_0_ActorBeginOverlapSignature__DelegateSignature(struct AActor* OverlappedActor, struct AActor* OtherActor); // Function HN_AP_Tech.HN_AP_Tech_C.BndEvt__HN_AP_Tech_TriggerBox_1_K2Node_ActorBoundEvent_0_ActorBeginOverlapSignature__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__HN_AP_Tech_DynamicObjectVolume_1_K2Node_ActorBoundEvent_1_AllEnemiesDeadEvent__DelegateSignature(); // Function HN_AP_Tech.HN_AP_Tech_C.BndEvt__HN_AP_Tech_DynamicObjectVolume_1_K2Node_ActorBoundEvent_1_AllEnemiesDeadEvent__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_HN_AP_Tech(int32_t EntryPoint); // Function HN_AP_Tech.HN_AP_Tech_C.ExecuteUbergraph_HN_AP_Tech // (Final|UbergraphFunction|HasDefaults) // @ game+0x38a7480
};

