// BlueprintGeneratedClass HN_AW_Tech.HN_AW_Tech_C
// Size: 0x290 (Inherited: 0x250)
struct AHN_AW_Tech_C : ALevelScriptActor {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x250(0x08)
	struct ANone* BP_StationDrinkTea7_5_ExecuteUbergraph_HN_AW_Tech_RefProperty; // 0x258(0x08)
	struct ABP_Stand4PFriendlyConvoStation_C* BP_Stand4PFriendlyConvoStation2_4_ExecuteUbergraph_HN_AW_Tech_RefProperty; // 0x260(0x08)
	struct ABP_Stand4PStation_C* BP_Stand4PStation3_2_ExecuteUbergraph_HN_AW_Tech_RefProperty; // 0x268(0x08)
	struct ABP_StandStation_LookingAt_4p_C* BP_StandStation_LookingAt_4p7_2_ExecuteUbergraph_HN_AW_Tech_RefProperty; // 0x270(0x08)
	struct ANone* BP_Stand2PStation_2_ExecuteUbergraph_HN_AW_Tech_RefProperty; // 0x278(0x08)
	struct ABP_Stand4PGossipStation_C* BP_Stand4PGossipStation5_2_ExecuteUbergraph_HN_AW_Tech_RefProperty; // 0x280(0x08)
	struct ANone* BP_StationDrinkTea6_2_ExecuteUbergraph_HN_AW_Tech_RefProperty; // 0x288(0x08)

	void ReceiveBeginPlay(); // Function HN_AW_Tech.HN_AW_Tech_C.ReceiveBeginPlay // (Event|Protected|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_HN_AW_Tech(int32_t EntryPoint); // Function HN_AW_Tech.HN_AW_Tech_C.ExecuteUbergraph_HN_AW_Tech // (Final|UbergraphFunction|HasDefaults) // @ game+0x38a7480
};

