// BlueprintGeneratedClass HN_BB_Tech.HN_BB_Tech_C
// Size: 0x2a0 (Inherited: 0x250)
struct AHN_BB_Tech_C : ALevelScriptActor {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x250(0x08)
	struct FName COM_12_MissionName; // 0x258(0x08)
	struct ABP_Stand2PStation_C* BP_Stand2PStation_2_ExecuteUbergraph_HN_BB_Tech_RefProperty; // 0x260(0x08)
	struct ABP_GlassWaller_v2__C* BP_GlassWaller_v2__C_8_ExecuteUbergraph_HN_BB_Tech_RefProperty; // 0x268(0x08)
	struct ABP_GlassWaller_v2__C* BP_GlassWaller_v2__C_6_ExecuteUbergraph_HN_BB_Tech_RefProperty; // 0x270(0x08)
	struct ABP_GlassWaller_v2__C* BP_GlassWaller_v2__C_1_ExecuteUbergraph_HN_BB_Tech_RefProperty; // 0x278(0x08)
	struct ABP_GlassWaller_v2__C* BP_GlassWaller_v2__C_3_ExecuteUbergraph_HN_BB_Tech_RefProperty; // 0x280(0x08)
	struct ABP_GlassWaller_v2__C* BP_GlassWaller_v2__C_5_ExecuteUbergraph_HN_BB_Tech_RefProperty; // 0x288(0x08)
	struct ABP_GlassWaller_v2__C* BP_GlassWaller_v2__C_7_ExecuteUbergraph_HN_BB_Tech_RefProperty; // 0x290(0x08)
	struct ABP_Station_Stand_Kid_Dock_EdgeSit_2P_C* BP_Station_Stand_Kid_Dock_EdgeSit_2P_2_ExecuteUbergraph_HN_BB_Tech_RefProperty; // 0x298(0x08)

	void ReceiveBeginPlay(); // Function HN_BB_Tech.HN_BB_Tech_C.ReceiveBeginPlay // (Event|Protected|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_HN_BB_Tech(int32_t EntryPoint); // Function HN_BB_Tech.HN_BB_Tech_C.ExecuteUbergraph_HN_BB_Tech // (Final|UbergraphFunction) // @ game+0x38a7480
};

