// BlueprintGeneratedClass Hogwarts_LevelInstance_34.Hogwarts_C
// Size: 0xbc8 (Inherited: 0x250)
struct AHogwarts_C : ALevelScriptActor {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x250(0x08)
	struct FMulticastInlineDelegate OverlandLoaded; // 0x258(0x10)
	bool LoadedFromOverland; // 0x268(0x01)
	char pad_269[0x7]; // 0x269(0x07)
	struct TSoftObjectPtr<UWorld> SUB_Audio_Hogwarts; // 0x270(0x28)
	bool IsLevelLoadCritical; // 0x298(0x01)
	char pad_299[0x7]; // 0x299(0x07)
	struct AActor* PROXY_Rotated; // 0x2a0(0x08)
	struct AActor* PROXY_AxisAligned; // 0x2a8(0x08)
	struct AActor* PROXY_Origin; // 0x2b0(0x08)
	struct AActor* Proxy_Ravenclaw; // 0x2b8(0x08)
	struct AActor* Proxy_StoneBridge; // 0x2c0(0x08)
	struct AActor* PROXY_ViaductBridge; // 0x2c8(0x08)
	struct TSoftObjectPtr<UWorld> Nav_A; // 0x2d0(0x28)
	struct TSoftObjectPtr<UWorld> Nav_B; // 0x2f8(0x28)
	struct FTransform 0_Transform; // 0x320(0x30)
	bool CritLoadComplete; // 0x350(0x01)
	char pad_351[0x7]; // 0x351(0x07)
	struct TArray<struct AActor*> StreamingVolumes; // 0x358(0x10)
	struct TSoftObjectPtr<UWorld> SUB_AstronomyTower_STREAM; // 0x368(0x28)
	struct TSoftObjectPtr<UWorld> SUB_BellTowers_STREAM; // 0x390(0x28)
	struct TSoftObjectPtr<UWorld> SUB_Boathouse_STREAM; // 0x3b8(0x28)
	struct TSoftObjectPtr<UWorld> SUB_BoathouseStairway_STREAM; // 0x3e0(0x28)
	struct TSoftObjectPtr<UWorld> SUB_CentralTower_STREAM; // 0x408(0x28)
	struct TSoftObjectPtr<UWorld> SUB_ClockTower_STREAM; // 0x430(0x28)
	struct TSoftObjectPtr<UWorld> SUB_ClockTowerCourtyard_STREAM; // 0x458(0x28)
	struct TSoftObjectPtr<UWorld> SUB_DADATower_Master_STREAM; // 0x480(0x28)
	struct TSoftObjectPtr<UWorld> SUB_EntranceHall_STREAM; // 0x4a8(0x28)
	struct TSoftObjectPtr<UWorld> SUB_FacultyTower_Master_STREAM; // 0x4d0(0x28)
	struct TSoftObjectPtr<UWorld> SUB_Garden_STREAM; // 0x4f8(0x28)
	struct TSoftObjectPtr<UWorld> SUB_GrandStaircaseTower_STREAM; // 0x520(0x28)
	struct TSoftObjectPtr<UWorld> SUB_GreatHall_STREAM; // 0x548(0x28)
	struct TSoftObjectPtr<UWorld> SUB_Greenhouses_STREAM; // 0x570(0x28)
	struct TSoftObjectPtr<UWorld> SUB_GroundsQ_STREAM; // 0x598(0x28)
	struct TSoftObjectPtr<UWorld> SUB_GryffindorTower_Master_STREAM; // 0x5c0(0x28)
	struct TSoftObjectPtr<UWorld> SUB_HospitalWing_STREAM; // 0x5e8(0x28)
	struct TSoftObjectPtr<UWorld> SUB_HufflepuffBasement_STREAM; // 0x610(0x28)
	struct TSoftObjectPtr<UWorld> SUB_Kitchens_STREAM; // 0x638(0x28)
	struct TSoftObjectPtr<UWorld> SUB_Library_Master_STREAM; // 0x660(0x28)
	struct TSoftObjectPtr<UWorld> SUB_MagicalCreatures_STREAM; // 0x688(0x28)
	struct TSoftObjectPtr<UWorld> SUB_NorthHall_STREAM; // 0x6b0(0x28)
	struct TSoftObjectPtr<UWorld> SUB_NorthTower_STREAM; // 0x6d8(0x28)
	struct TSoftObjectPtr<UWorld> SUB_Owlery_STREAM; // 0x700(0x28)
	struct TSoftObjectPtr<UWorld> SUB_PotionsClassroom_STREAM; // 0x728(0x28)
	struct TSoftObjectPtr<UWorld> SUB_QuadCourtyard_STREAM; // 0x750(0x28)
	struct TSoftObjectPtr<UWorld> SUB_QuadEastHall_STREAM; // 0x778(0x28)
	struct TSoftObjectPtr<UWorld> SUB_QuadNorthHall_STREAM; // 0x7a0(0x28)
	struct TSoftObjectPtr<UWorld> SUB_QuadSouthHall_STREAM; // 0x7c8(0x28)
	struct TSoftObjectPtr<UWorld> SUB_RavenclawTower_STREAM; // 0x7f0(0x28)
	struct TSoftObjectPtr<UWorld> SUB_Sanctum_STREAM; // 0x818(0x28)
	struct TSoftObjectPtr<UWorld> SUB_SlytherinDungeon_STREAM; // 0x840(0x28)
	struct TSoftObjectPtr<UWorld> SUB_StoneBridge_STREAM; // 0x868(0x28)
	struct TSoftObjectPtr<UWorld> SUB_SuspensionBridge_STREAM; // 0x890(0x28)
	struct TSoftObjectPtr<UWorld> SUB_TransfigurationCourtyard_STREAM; // 0x8b8(0x28)
	struct TSoftObjectPtr<UWorld> SUB_UndergroundHarbor_STREAM; // 0x8e0(0x28)
	struct TSoftObjectPtr<UWorld> SUB_ViaductBridge_STREAM; // 0x908(0x28)
	struct TSoftObjectPtr<UWorld> SUB_ViaductCourtyard_STREAM; // 0x930(0x28)
	struct TSoftObjectPtr<UWorld> SUB_ViaductEntrance_STREAM; // 0x958(0x28)
	struct TSoftObjectPtr<UWorld> SUB_WestHall_STREAM; // 0x980(0x28)
	struct TSoftObjectPtr<UWorld> SUB_WoodenBridge_STREAM; // 0x9a8(0x28)
	struct FTransform StartNavPath; // 0x9d0(0x30)
	struct TSoftObjectPtr<UWorld> SUB_SchoolDungeon_STREAM; // 0xa00(0x28)
	bool forceTECH; // 0xa28(0x01)
	char pad_A29[0x7]; // 0xa29(0x07)
	struct TMap<struct TSoftObjectPtr<UWorld>, struct AActor*> TECH; // 0xa30(0x50)
	struct TSoftObjectPtr<UWorld> SUB_GrandStaircase_STREAM; // 0xa80(0x28)
	struct TSoftObjectPtr<UWorld> SUB_QuidditchPitch_STREAM; // 0xaa8(0x28)
	struct TSoftObjectPtr<UWorld> Hogwarts_Global_STREAM; // 0xad0(0x28)
	struct TSoftObjectPtr<UWorld> SUB_LongGallery_STREAM; // 0xaf8(0x28)
	struct TSoftObjectPtr<UWorld> SUB_NorthHallBasement_STREAM; // 0xb20(0x28)
	struct TSoftObjectPtr<UWorld> Hogwarts_Levels; // 0xb48(0x28)
	struct TSoftObjectPtr<UWorld> SUB_Undercroft_STREAM; // 0xb70(0x28)
	struct AActor* PROXY_Rotated_ExecuteUbergraph_Hogwarts_RefProperty; // 0xb98(0x08)
	struct AActor* PROXY_AxisAligned_ExecuteUbergraph_Hogwarts_RefProperty; // 0xba0(0x08)
	struct AStaticMeshActor* PROXY_Origin_ExecuteUbergraph_Hogwarts_RefProperty; // 0xba8(0x08)
	struct AActor* PROXY_StoneBridge_ExecuteUbergraph_Hogwarts_RefProperty; // 0xbb0(0x08)
	struct AActor* PROXY_ViaductBridge_ExecuteUbergraph_Hogwarts_RefProperty; // 0xbb8(0x08)
	struct AActor* PROXY_Ravenclaw_ExecuteUbergraph_Hogwarts_RefProperty; // 0xbc0(0x08)

	void ReceiveBeginPlay(); // Function Hogwarts_LevelInstance_34.Hogwarts_C.ReceiveBeginPlay // (Event|Protected|BlueprintEvent) // @ game+0x38a7480
	void StreamingComplete(); // Function Hogwarts_LevelInstance_34.Hogwarts_C.StreamingComplete // (BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_Hogwarts(int32_t EntryPoint); // Function Hogwarts_LevelInstance_34.Hogwarts_C.ExecuteUbergraph_Hogwarts // (Final|UbergraphFunction|HasDefaults) // @ game+0x38a7480
	void OverlandLoaded__DelegateSignature(); // Function Hogwarts_LevelInstance_34.Hogwarts_C.OverlandLoaded__DelegateSignature // (Public|Delegate|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
};

