// BlueprintGeneratedClass HS_AI_Tech.HS_AI_Tech_C
// Size: 0x2c0 (Inherited: 0x250)
struct AHS_AI_Tech_C : ALevelScriptActor {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x250(0x08)
	struct ADynamicObjectVolume* DOV_Wolfden_ExecuteUbergraph_HS_AI_Tech_RefProperty; // 0x258(0x08)
	struct ADynamicObjectVolume* DOV_Wolfden_Wave2_2_ExecuteUbergraph_HS_AI_Tech_RefProperty; // 0x260(0x08)
	struct ANone* BP_StationDrinkTea5_2_ExecuteUbergraph_HS_AI_Tech_RefProperty; // 0x268(0x08)
	struct ABP_Stand4PGossipStation_C* BP_Stand4PGossipStation_2_ExecuteUbergraph_HS_AI_Tech_RefProperty; // 0x270(0x08)
	struct ABP_Stand4PFriendlyConvoStation_C* BP_Stand4PFriendlyConvoStation_2_ExecuteUbergraph_HS_AI_Tech_RefProperty; // 0x278(0x08)
	struct ANone* BP_StationDrinkTea_2_ExecuteUbergraph_HS_AI_Tech_RefProperty; // 0x280(0x08)
	struct ANone* BP_Stand2PStation_2_ExecuteUbergraph_HS_AI_Tech_RefProperty; // 0x288(0x08)
	struct ANone* BP_StationBrowsingShelvesLow_2_ExecuteUbergraph_HS_AI_Tech_RefProperty; // 0x290(0x08)
	struct ABP_Stand4PGossipStation_C* BP_Stand4PGossipStation2_5_ExecuteUbergraph_HS_AI_Tech_RefProperty; // 0x298(0x08)
	struct ANone* BP_StationDrinkTea2_5_ExecuteUbergraph_HS_AI_Tech_RefProperty; // 0x2a0(0x08)
	struct ANone* BP_StationWallStand2P_2_ExecuteUbergraph_HS_AI_Tech_RefProperty; // 0x2a8(0x08)
	struct ABP_Stand4PFriendlyConvoStation_C* BP_Stand4PFriendlyConvoStation2_8_ExecuteUbergraph_HS_AI_Tech_RefProperty; // 0x2b0(0x08)
	struct ANone* BP_StationWallStand2P2_5_ExecuteUbergraph_HS_AI_Tech_RefProperty; // 0x2b8(0x08)

	void ReceiveBeginPlay(); // Function HS_AI_Tech.HS_AI_Tech_C.ReceiveBeginPlay // (Event|Protected|BlueprintEvent) // @ game+0x38a7480
	void WolfSpawn(struct AActor* SpawnedActor, struct FName& GroupName); // Function HS_AI_Tech.HS_AI_Tech_C.WolfSpawn // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_HS_AI_Tech(int32_t EntryPoint); // Function HS_AI_Tech.HS_AI_Tech_C.ExecuteUbergraph_HS_AI_Tech // (Final|UbergraphFunction|HasDefaults) // @ game+0x38a7480
};

