// BlueprintGeneratedClass M_WET_01_4.M_WET_01_C
// Size: 0x310 (Inherited: 0x250)
struct AM_WET_01_C : ALevelScriptActor {
	struct FString Defeat_DummyA; // 0x250(0x10)
	struct FString Defeat_DummyB; // 0x260(0x10)
	struct FString Finish_CP; // 0x270(0x10)
	struct FString Spawn_DummyA; // 0x280(0x10)
	struct FString Spawn_DummyB; // 0x290(0x10)
	struct FString Dummies_Finished; // 0x2a0(0x10)
	char PERK_PURCHASED; // 0x2b0(0x01)
	char pad_2B1[0x7]; // 0x2b1(0x07)
	struct UContextFilterComponent* MovingDisabled_Component; // 0x2b8(0x08)
	struct AActor* DummyA; // 0x2c0(0x08)
	struct AActor* DummyB; // 0x2c8(0x08)
	struct FString Unlock_TalentsTab; // 0x2d0(0x10)
	struct FString CIV_LetsBeginDummy; // 0x2e0(0x10)
	struct FString SR_Wait_ConjureDummiesFinish; // 0x2f0(0x10)
	struct FString Tutorial_Talents; // 0x300(0x10)
};

