// BlueprintGeneratedClass None.BP_Small_CastleRuins_2_G_C
// Size: 0x2f0 (Inherited: 0x248)
struct ABP_Small_CastleRuins_2_G_C : AActor {
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_F11; // 0x248(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_F10; // 0x250(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_F5; // 0x258(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_F4; // 0x260(0x08)
	struct UDecalComponent* MI_Castle_Ruin1_Decal_SootSmudge_6; // 0x268(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_F3_49; // 0x270(0x08)
	struct UDecalComponent* MI_CastleDun_Decal_Lichen_Test_F2_47; // 0x278(0x08)
	struct UStaticMeshComponent* SM_CastleRuinsSmall_2_Wall_A_02; // 0x280(0x08)
	struct UStaticMeshComponent* SM_CastleRuinsSmall_2_Wall_A; // 0x288(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_Broken_B_a; // 0x290(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_2_Broken_C_b; // 0x298(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_CastleRuins_2_Broken_B_b; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_Broken_C_a1; // 0x2a8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_CastleRuins_2_Wall_Corner_Cap_A; // 0x2b0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_CastleRuins_2_Window_J; // 0x2b8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_CastleRuins_2_Window_G; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_Broken_E; // 0x2c8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_2_Broken_F_b; // 0x2d0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_4SM_CastleRuins_2_Broken_G; // 0x2d8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_2_Broken_P_c; // 0x2e0(0x08)
	struct USceneComponent* SharedRoot; // 0x2e8(0x08)
};

