// Class Phoenix.Ability_Character_Interface
// Size: 0x28 (Inherited: 0x28)
struct UAbility_Character_Interface : UInterface {

	void StopCustomAbility(); // Function Phoenix.Ability_Character_Interface.StopCustomAbility // (Native|Public|BlueprintCallable) // @ game+0x318b7c0
	void PlayCustomAbility(struct UAblAbility* InAbility, bool bPreventReactions); // Function Phoenix.Ability_Character_Interface.PlayCustomAbility // (Native|Public|BlueprintCallable) // @ game+0x318b6f0
};

// Class Phoenix.ablAbilityDoneTaskScratchPad
// Size: 0x58 (Inherited: 0x50)
struct UablAbilityDoneTaskScratchPad : UAblBranchTaskScratchPad {
	bool bDone; // 0x50(0x01)
	char pad_51[0x7]; // 0x51(0x07)
};

// Class Phoenix.ablAbilityDoneTask
// Size: 0xa0 (Inherited: 0x70)
struct UablAbilityDoneTask : UAblAbilityTask {
	enum class EEnemy_Ability NextAbility; // 0x70(0x01)
	bool bDelayBranchIfNextIsIdle; // 0x71(0x01)
	char pad_72[0x6]; // 0x72(0x06)
	struct TArray<enum class EEnemyAIState> DelayBranchStates; // 0x78(0x10)
	struct TArray<struct UAblBranchCondition*> Conditions; // 0x88(0x10)
	bool bMustPassAllConditions; // 0x98(0x01)
	char pad_99[0x7]; // 0x99(0x07)
};

// Class Phoenix.AblAddLinearImpulseBaseTask
// Size: 0x70 (Inherited: 0x70)
struct UAblAddLinearImpulseBaseTask : UAblAbilityTask {
};

// Class Phoenix.AblAddLinearImpulseTask
// Size: 0x90 (Inherited: 0x70)
struct UAblAddLinearImpulseTask : UAblAddLinearImpulseBaseTask {
	struct FVector ImpulseDirection; // 0x70(0x0c)
	float ImpulseDamping; // 0x7c(0x04)
	float ImpulseStrengthMin; // 0x80(0x04)
	float ImpulseStrengthMax; // 0x84(0x04)
	enum class EAblAddLinearImpulseDirectionType DirectionType; // 0x88(0x01)
	char pad_89[0x7]; // 0x89(0x07)
};

// Class Phoenix.AblAvaMotionWarpSyncPointUpdaterScratchpad
// Size: 0x28 (Inherited: 0x28)
struct UAblAvaMotionWarpSyncPointUpdaterScratchpad : UObject {
};

// Class Phoenix.AblAvaMotionWarpSyncPointUpdater
// Size: 0x28 (Inherited: 0x28)
struct UAblAvaMotionWarpSyncPointUpdater : UObject {
};

// Class Phoenix.AblAddOrUpdateAvaMotionWarpSyncPointScratchpad
// Size: 0x40 (Inherited: 0x28)
struct UAblAddOrUpdateAvaMotionWarpSyncPointScratchpad : UAblAbilityTaskScratchPad {
	struct TArray<struct UAmbulatory_MovementComponent*> MovementComponents; // 0x28(0x10)
	struct UAblAvaMotionWarpSyncPointUpdaterScratchpad* UpdaterScratchpad; // 0x38(0x08)
};

// Class Phoenix.AblAddOrUpdateAvaMotionWarpSyncPointTask
// Size: 0x88 (Inherited: 0x70)
struct UAblAddOrUpdateAvaMotionWarpSyncPointTask : UAblAbilityTask {
	struct FName SyncPointName; // 0x70(0x08)
	struct UAblAvaMotionWarpSyncPointUpdater* SyncPointUpdater; // 0x78(0x08)
	bool bUpdateSyncPointOnTick; // 0x80(0x01)
	bool bRemoveSyncPointOnEndOfTask; // 0x81(0x01)
	char pad_82[0x6]; // 0x82(0x06)
};

// Class Phoenix.AblAdjustCamTask
// Size: 0x70 (Inherited: 0x70)
struct UAblAdjustCamTask : UAblAbilityTask {
};

// Class Phoenix.AblAkEventLookupTask
// Size: 0xa0 (Inherited: 0x70)
struct UAblAkEventLookupTask : UAblAbilityTask {
	struct FGameplayTagContainer LookupTags; // 0x70(0x20)
	bool bFollow; // 0x90(0x01)
	char pad_91[0x3]; // 0x91(0x03)
	struct FName SocketName; // 0x94(0x08)
	char pad_9C[0x4]; // 0x9c(0x04)
};

// Class Phoenix.ablAkSetMurmurationRTPCTask
// Size: 0xa0 (Inherited: 0x70)
struct UablAkSetMurmurationRTPCTask : UAblAbilityTask {
	int32_t RTPC_Step; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)
	struct FString RTPC_Name; // 0x78(0x10)
	struct FName OnStartEventName; // 0x88(0x08)
	struct FName OnEndEventName; // 0x90(0x08)
	bool bPlayerOnly; // 0x98(0x01)
	bool bDecay; // 0x99(0x01)
	enum class EMurmurationValueType RTPC_ValueType; // 0x9a(0x01)
	char pad_9B[0x5]; // 0x9b(0x05)
};

// Class Phoenix.ablAllowWalkOffLedgesTaskScratchPad
// Size: 0x28 (Inherited: 0x28)
struct UablAllowWalkOffLedgesTaskScratchPad : UAblAbilityTaskScratchPad {
};

// Class Phoenix.ablAllowWalkOffLedgesTask
// Size: 0x78 (Inherited: 0x70)
struct UablAllowWalkOffLedgesTask : UAblAbilityTask {
	bool bAllowWalkOffLedges; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
};

// Class Phoenix.AblAnimationAssetChooser_CreatureSlot
// Size: 0x48 (Inherited: 0x48)
struct UAblAnimationAssetChooser_CreatureSlot : UAmbulatoryAnimationAssetChooser {
};

// Class Phoenix.AblAnimationAssetChooser_WorldEvent
// Size: 0x48 (Inherited: 0x48)
struct UAblAnimationAssetChooser_WorldEvent : UAmbulatoryAnimationAssetChooser {
};

// Class Phoenix.FlightAnimationComponent
// Size: 0x128 (Inherited: 0xc8)
struct UFlightAnimationComponent : UActorComponent {
	struct FBoneReferenceEx RootBone; // 0xc8(0x10)
	struct FBoneReferenceEx NeckBone; // 0xd8(0x10)
	float MinLiftSpeedPercent; // 0xe8(0x04)
	float MaxLiftSpeedPercent; // 0xec(0x04)
	float MaxLiftAngle; // 0xf0(0x04)
	float MaxNeckRollAngle; // 0xf4(0x04)
	float MinAccelerationPercent; // 0xf8(0x04)
	float MaxAnimRate; // 0xfc(0x04)
	float MaxAccelerationPercent; // 0x100(0x04)
	float MinVelocityPercent; // 0x104(0x04)
	float MaxGlideTime; // 0x108(0x04)
	float MinGlideResetTime; // 0x10c(0x04)
	float GlideTimeDescentSpeedThreshold; // 0x110(0x04)
	char pad_114[0x14]; // 0x114(0x14)
};

// Class Phoenix.AblAnimationModifier_Flight
// Size: 0x28 (Inherited: 0x28)
struct UAblAnimationModifier_Flight : UAblAnimationModifier {
};

// Class Phoenix.AblAnimationModifier_MountRider
// Size: 0x28 (Inherited: 0x28)
struct UAblAnimationModifier_MountRider : UAblAnimationModifier {
};

// Class Phoenix.AnimMetaDataNPCStrafe
// Size: 0xb0 (Inherited: 0x28)
struct UAnimMetaDataNPCStrafe : UAnimMetaData {
	struct FRuntimeFloatCurve BlendInputToHipRotationCurve; // 0x28(0x88)
};

// Class Phoenix.AblAnimationModifier_NPCStrafe
// Size: 0x28 (Inherited: 0x28)
struct UAblAnimationModifier_NPCStrafe : UAblAnimationModifier {
};

// Class Phoenix.AblAnimationModifier_ParryAdvance
// Size: 0x28 (Inherited: 0x28)
struct UAblAnimationModifier_ParryAdvance : UAblAnimationModifier {
};

// Class Phoenix.QuadrupedSpineComponent
// Size: 0x3c0 (Inherited: 0xc8)
struct UQuadrupedSpineComponent : UActorComponent {
	bool bAffectPose; // 0xc8(0x01)
	char pad_C9[0x7]; // 0xc9(0x07)
	struct FQuadrupedSpineBoneChain NeckChain; // 0xd0(0x38)
	struct FQuadrupedSpineBoneChain SpineChain; // 0x108(0x38)
	struct FQuadrupedSpineBoneChain TailChain; // 0x140(0x38)
	struct TArray<struct FQuadrupedSpineRebase> RebaseBones; // 0x178(0x10)
	float SpineInterpTime; // 0x188(0x04)
	char pad_18C[0x4]; // 0x18c(0x04)
	struct FRuntimeFloatCurve SpeedToSpineInterpTimeMultiplier; // 0x190(0x88)
	struct FRuntimeFloatCurve SpeedToTurnRateMultiplier; // 0x218(0x88)
	float TurningFactor; // 0x2a0(0x04)
	char pad_2A4[0x4]; // 0x2a4(0x04)
	struct FRuntimeFloatCurve SpeedToTurningFactor; // 0x2a8(0x88)
	float BlendDurationIntoRootMotionAnim; // 0x330(0x04)
	float BlendDurationOutOfRootMotionAnim; // 0x334(0x04)
	float RootMotionAngleRemainingToStartBlendingIntoBent; // 0x338(0x04)
	char pad_33C[0xc]; // 0x33c(0x0c)
	struct URootMotionModifier_QuadrupedSpine* RootMotionModifier; // 0x348(0x08)
	char pad_350[0x70]; // 0x350(0x70)

	float GetInterpTimeAtSpeed(struct UQuadrupedSpineComponent* InSpineComponent, float InNormalizedSpeed); // Function Phoenix.QuadrupedSpineComponent.GetInterpTimeAtSpeed // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x318b620
};

// Class Phoenix.RootMotionModifier_QuadrupedSpine
// Size: 0x60 (Inherited: 0x50)
struct URootMotionModifier_QuadrupedSpine : URootMotionModifier {
	char pad_50[0x10]; // 0x50(0x10)
};

// Class Phoenix.RootMotionModifierProperties_QuadrupedSpine
// Size: 0x30 (Inherited: 0x30)
struct URootMotionModifierProperties_QuadrupedSpine : URootMotionModifierProperties {
};

// Class Phoenix.AnimMetaDataQuadrupedSpine
// Size: 0x250 (Inherited: 0x28)
struct UAnimMetaDataQuadrupedSpine : UAnimMetaData {
	bool bEnableSpineBending; // 0x28(0x01)
	char pad_29[0x7]; // 0x29(0x07)
	struct FRuntimeFloatCurve SpineStartCurve; // 0x30(0x88)
	struct FRuntimeFloatCurve SpineEndCurve; // 0xb8(0x88)
	struct FRuntimeFloatCurve TurnRateStartCurve; // 0x140(0x88)
	struct FRuntimeFloatCurve TurnRateEndCurve; // 0x1c8(0x88)
};

// Class Phoenix.AblAnimationModifier_QuadrupedSpine
// Size: 0x28 (Inherited: 0x28)
struct UAblAnimationModifier_QuadrupedSpine : UAblAnimationModifier {
};

// Class Phoenix.AnimNotify_ResetQuadrupedSpineDirection
// Size: 0x38 (Inherited: 0x38)
struct UAnimNotify_ResetQuadrupedSpineDirection : UAnimNotify {
};

// Class Phoenix.AblBlendSpaceParameterGetter_MoveQuadrupedSpine
// Size: 0x28 (Inherited: 0x28)
struct UAblBlendSpaceParameterGetter_MoveQuadrupedSpine : UAblBlendSpaceParameterGetter {
};

// Class Phoenix.AblBranchConditionQuadrupedSpineAngle
// Size: 0x38 (Inherited: 0x30)
struct UAblBranchConditionQuadrupedSpineAngle : UAblBranchCondition {
	struct FVector2D AngleRange; // 0x30(0x08)
};

// Class Phoenix.AblAnimationModifier_WandCastAim
// Size: 0x58 (Inherited: 0x28)
struct UAblAnimationModifier_WandCastAim : UAblAnimationModifier {
	struct FBoneReferenceEx ShoulderBone; // 0x28(0x10)
	struct FName BoneName; // 0x38(0x08)
	struct FName EventName; // 0x40(0x08)
	float DefaultInterpTime; // 0x48(0x04)
	bool bLoop; // 0x4c(0x01)
	bool bAlwaysUseCurrentAimInfo; // 0x4d(0x01)
	char pad_4E[0x2]; // 0x4e(0x02)
	float AimYawInterpSpeed; // 0x50(0x04)
	float AimPitchInterpSpeed; // 0x54(0x04)
};

// Class Phoenix.AblAnimationTagChooser_AimModeTurnToFace
// Size: 0x68 (Inherited: 0x50)
struct UAblAnimationTagChooser_AimModeTurnToFace : UAblAnimationTagChooser {
	struct FVector FootPositionWeight; // 0x50(0x0c)
	struct FVector FootVelocityWeight; // 0x5c(0x0c)
};

// Class Phoenix.AblAnimationTagChooser_Array
// Size: 0x60 (Inherited: 0x50)
struct UAblAnimationTagChooser_Array : UAblAnimationTagChooser {
	struct TArray<struct UAblAnimationTagChooser*> TagChooserArray; // 0x50(0x10)
};

// Class Phoenix.AblAnimationTagChooser_CapturedCreatureType
// Size: 0x50 (Inherited: 0x50)
struct UAblAnimationTagChooser_CapturedCreatureType : UAblAnimationTagChooser {
};

// Class Phoenix.AblAnimationTagChooser_ClimbLadder
// Size: 0x58 (Inherited: 0x50)
struct UAblAnimationTagChooser_ClimbLadder : UAblAnimationTagChooser {
	char pad_50[0x8]; // 0x50(0x08)
};

// Class Phoenix.AblAnimationTagChooser_CreatureAnimationVariation
// Size: 0x50 (Inherited: 0x50)
struct UAblAnimationTagChooser_CreatureAnimationVariation : UAblAnimationTagChooser {
};

// Class Phoenix.AblAnimationTagChooser_CreatureCurrentStance
// Size: 0x50 (Inherited: 0x50)
struct UAblAnimationTagChooser_CreatureCurrentStance : UAblAnimationTagChooser {
};

// Class Phoenix.AblAnimationTagChooser_CreatureBecomeAwareStance
// Size: 0x50 (Inherited: 0x50)
struct UAblAnimationTagChooser_CreatureBecomeAwareStance : UAblAnimationTagChooser {
};

// Class Phoenix.AblAnimationTagChooser_CreatureLastAnimNotify
// Size: 0x60 (Inherited: 0x50)
struct UAblAnimationTagChooser_CreatureLastAnimNotify : UAblAnimationTagChooser {
	struct TArray<struct FName> Names; // 0x50(0x10)
};

// Class Phoenix.AblAnimationTagChooser_CreatureTakeoff
// Size: 0x50 (Inherited: 0x50)
struct UAblAnimationTagChooser_CreatureTakeoff : UAblAnimationTagChooser {
};

// Class Phoenix.AblAnimationTagChooser_TurnDirection
// Size: 0x68 (Inherited: 0x50)
struct UAblAnimationTagChooser_TurnDirection : UAblAnimationTagChooser {
	struct TArray<struct FVector2D> AngleRanges; // 0x50(0x10)
	struct UTurnDirectionTagChooser_TargetDirectionGetter* TargetDirectionGetter; // 0x60(0x08)
};

// Class Phoenix.AblAnimationTagChooser_CreatureTurnDirectionWithNavCheck
// Size: 0x78 (Inherited: 0x68)
struct UAblAnimationTagChooser_CreatureTurnDirectionWithNavCheck : UAblAnimationTagChooser_TurnDirection {
	struct TArray<struct FTurnDirectionNavMeshCheckSettings> NavMeshCheckSettings; // 0x68(0x10)
};

// Class Phoenix.TurnDirectionTagChooser_TargetDirectionGetter
// Size: 0x28 (Inherited: 0x28)
struct UTurnDirectionTagChooser_TargetDirectionGetter : UObject {
};

// Class Phoenix.TurnDirectionTagChooser_QuadrupedSpineAngleGetter
// Size: 0x28 (Inherited: 0x28)
struct UTurnDirectionTagChooser_QuadrupedSpineAngleGetter : UTurnDirectionTagChooser_TargetDirectionGetter {
};

// Class Phoenix.AblAnimationTagChooser_CrouchTurnMoveStart
// Size: 0x70 (Inherited: 0x50)
struct UAblAnimationTagChooser_CrouchTurnMoveStart : UAblAnimationTagChooser {
	bool bMotionMatching; // 0x50(0x01)
	char pad_51[0x3]; // 0x51(0x03)
	struct FVector FootPositionWeight; // 0x54(0x0c)
	struct FVector FootVelocityWeight; // 0x60(0x0c)
	char pad_6C[0x4]; // 0x6c(0x04)
};

// Class Phoenix.AblAnimationTagChooser_CrouchTurnMoveStop
// Size: 0x68 (Inherited: 0x50)
struct UAblAnimationTagChooser_CrouchTurnMoveStop : UAblAnimationTagChooser {
	struct FVector FootPositionWeight; // 0x50(0x0c)
	struct FVector FootVelocityWeight; // 0x5c(0x0c)
};

// Class Phoenix.AblAnimationTagChooser_DeathlyHallows
// Size: 0x98 (Inherited: 0x50)
struct UAblAnimationTagChooser_DeathlyHallows : UAblAnimationTagChooser {
	struct FGameplayTagContainer BaseTags; // 0x50(0x20)
	struct FGameplayTag LeftFootTag; // 0x70(0x08)
	struct FGameplayTag RightFootTag; // 0x78(0x08)
	struct FGameplayTag StoneTag; // 0x80(0x08)
	struct FGameplayTag WandTag; // 0x88(0x08)
	struct FGameplayTag CloakTag; // 0x90(0x08)
};

// Class Phoenix.AblAnimationTagChooser_DirectionalTurns
// Size: 0x50 (Inherited: 0x50)
struct UAblAnimationTagChooser_DirectionalTurns : UAblAnimationTagChooser {
};

// Class Phoenix.AblAnimationTagChooser_DirectionBased
// Size: 0x60 (Inherited: 0x50)
struct UAblAnimationTagChooser_DirectionBased : UAblAnimationTagChooser {
	int32_t NumAngles; // 0x50(0x04)
	bool bWrapAngles; // 0x54(0x01)
	bool bSetFixedToDesiredDirection; // 0x55(0x01)
	bool bLeftFootAtEndOfList; // 0x56(0x01)
	char pad_57[0x1]; // 0x57(0x01)
	int32_t NumSpeeds; // 0x58(0x04)
	bool bUseFootPlacement; // 0x5c(0x01)
	enum class EDirectionType DirectionType; // 0x5d(0x01)
	bool bDebugDraw; // 0x5e(0x01)
	char pad_5F[0x1]; // 0x5f(0x01)
};

// Class Phoenix.AblAnimationTagChooser_DodgeDuck
// Size: 0x50 (Inherited: 0x50)
struct UAblAnimationTagChooser_DodgeDuck : UAblAnimationTagChooser {
};

// Class Phoenix.AblAnimationTagChooser_DodgeRoll
// Size: 0x50 (Inherited: 0x50)
struct UAblAnimationTagChooser_DodgeRoll : UAblAnimationTagChooser {
};

// Class Phoenix.AblAnimationTagChooser_Enemy
// Size: 0x58 (Inherited: 0x50)
struct UAblAnimationTagChooser_Enemy : UAblAnimationTagChooser {
	enum class EEnemy_TagContainer TagContainer; // 0x50(0x01)
	char pad_51[0x7]; // 0x51(0x07)
};

// Class Phoenix.AblAnimationTagChooser_EnemyContainer
// Size: 0xc8 (Inherited: 0x50)
struct UAblAnimationTagChooser_EnemyContainer : UAblAnimationTagChooser {
	enum class EEnemy_TagContainer ContainerSource; // 0x50(0x01)
	char pad_51[0x7]; // 0x51(0x07)
	struct FGameplayTagContainer AttackTagContainer; // 0x58(0x20)
	bool bAddWeaponTags; // 0x78(0x01)
	bool bAddWeaponsTagsIfMatchAttackType; // 0x79(0x01)
	char pad_7A[0x6]; // 0x7a(0x06)
	struct FGameplayTagContainer WeaponTagsAttackTagContainer; // 0x80(0x20)
	bool bAddDirectionalTags; // 0xa0(0x01)
	bool bAddDirectionalTagsIfMatchAttackType; // 0xa1(0x01)
	char pad_A2[0x6]; // 0xa2(0x06)
	struct FGameplayTagContainer DirectionalTagsAttackTagContainer; // 0xa8(0x20)
};

// Class Phoenix.AblAnimationTagChooser_EnemyAlert
// Size: 0xd0 (Inherited: 0xc8)
struct UAblAnimationTagChooser_EnemyAlert : UAblAnimationTagChooser_EnemyContainer {
	enum class EEnemy_AlertState AlertState; // 0xc8(0x01)
	char pad_C9[0x7]; // 0xc9(0x07)
};

// Class Phoenix.AblAnimationTagChooser_EnemyAttack
// Size: 0xc8 (Inherited: 0xc8)
struct UAblAnimationTagChooser_EnemyAttack : UAblAnimationTagChooser_EnemyContainer {
};

// Class Phoenix.AblAnimationTagChooser_EnemyCounterAttack
// Size: 0x80 (Inherited: 0x50)
struct UAblAnimationTagChooser_EnemyCounterAttack : UAblAnimationTagChooser {
	struct FGameplayTagContainer CounterTagContainer; // 0x50(0x20)
	struct TArray<struct AEnemyAIWeapon*> RequiredList; // 0x70(0x10)
};

// Class Phoenix.AblAnimationTagChooser_EnemyDirectionBased
// Size: 0x58 (Inherited: 0x50)
struct UAblAnimationTagChooser_EnemyDirectionBased : UAblAnimationTagChooser {
	bool bCloseBackAngle; // 0x50(0x01)
	char pad_51[0x7]; // 0x51(0x07)
};

// Class Phoenix.AblAppendToBaseChooser_EnemyDirectionToTarget
// Size: 0x38 (Inherited: 0x28)
struct UAblAppendToBaseChooser_EnemyDirectionToTarget : UAblAnimationTagChooser_AppendToBaseChooser {
	int32_t MinFrontAngle; // 0x28(0x04)
	int32_t MaxFrontAngle; // 0x2c(0x04)
	int32_t MinLeftAngle; // 0x30(0x04)
	int32_t MaxRightAngle; // 0x34(0x04)
};

// Class Phoenix.AblAnimationTagChooser_EnemyIdle
// Size: 0x50 (Inherited: 0x50)
struct UAblAnimationTagChooser_EnemyIdle : UAblAnimationTagChooser {
};

// Class Phoenix.AblAnimationTagChooser_EnemyMove
// Size: 0x58 (Inherited: 0x50)
struct UAblAnimationTagChooser_EnemyMove : UAblAnimationTagChooser {
	char pad_50[0x8]; // 0x50(0x08)
};

// Class Phoenix.AblAnimationTagChooser_EnemyMovePivot
// Size: 0x58 (Inherited: 0x50)
struct UAblAnimationTagChooser_EnemyMovePivot : UAblAnimationTagChooser {
	char pad_50[0x8]; // 0x50(0x08)
};

// Class Phoenix.AblAnimationTagChooser_EnemyMoveStart
// Size: 0x58 (Inherited: 0x50)
struct UAblAnimationTagChooser_EnemyMoveStart : UAblAnimationTagChooser {
	char pad_50[0x8]; // 0x50(0x08)
};

// Class Phoenix.AblAnimationTagChooser_EnemyMoveStop
// Size: 0x58 (Inherited: 0x50)
struct UAblAnimationTagChooser_EnemyMoveStop : UAblAnimationTagChooser {
	char pad_50[0x8]; // 0x50(0x08)
};

// Class Phoenix.AblAnimationTagChooser_EnemyMoveType
// Size: 0x50 (Inherited: 0x50)
struct UAblAnimationTagChooser_EnemyMoveType : UAblAnimationTagChooser {
};

// Class Phoenix.AblAnimationTagChooser_EnemyShuffle
// Size: 0x58 (Inherited: 0x50)
struct UAblAnimationTagChooser_EnemyShuffle : UAblAnimationTagChooser {
	char pad_50[0x8]; // 0x50(0x08)
};

// Class Phoenix.AblAnimationTagChooser_EnemyTaunt
// Size: 0x50 (Inherited: 0x50)
struct UAblAnimationTagChooser_EnemyTaunt : UAblAnimationTagChooser {
};

// Class Phoenix.AblAnimationTagChooser_EnemyTurnInPlace
// Size: 0x50 (Inherited: 0x50)
struct UAblAnimationTagChooser_EnemyTurnInPlace : UAblAnimationTagChooser {
};

// Class Phoenix.AblAnimationTagChooser_EnemyType
// Size: 0x50 (Inherited: 0x50)
struct UAblAnimationTagChooser_EnemyType : UAblAnimationTagChooser {
};

// Class Phoenix.AblAnimationTagChooser_EnemyWeapon
// Size: 0x58 (Inherited: 0x50)
struct UAblAnimationTagChooser_EnemyWeapon : UAblAnimationTagChooser {
	enum class EEnemy_WeaponSource WeaponSource; // 0x50(0x01)
	char pad_51[0x7]; // 0x51(0x07)
};

// Class Phoenix.AblAnimationTagChooser_FallLandStudent
// Size: 0x50 (Inherited: 0x50)
struct UAblAnimationTagChooser_FallLandStudent : UAblAnimationTagChooser {
};

// Class Phoenix.AblAnimationTagChooser_FeedPelletsToolReleaseType
// Size: 0x50 (Inherited: 0x50)
struct UAblAnimationTagChooser_FeedPelletsToolReleaseType : UAblAnimationTagChooser {
};

// Class Phoenix.AblAnimationTagChooser_FlipendoFlourish
// Size: 0x50 (Inherited: 0x50)
struct UAblAnimationTagChooser_FlipendoFlourish : UAblAnimationTagChooser {
};

// Class Phoenix.AblAnimationTagChooser_FootMatch
// Size: 0x78 (Inherited: 0x50)
struct UAblAnimationTagChooser_FootMatch : UAblAnimationTagChooser {
	float MinTimeIntoMotion; // 0x50(0x04)
	float TimeIntoMotion; // 0x54(0x04)
	float SourceTimeOffset; // 0x58(0x04)
	struct FVector FootPositionWeight; // 0x5c(0x0c)
	struct FVector FootVelocityWeight; // 0x68(0x0c)
	char pad_74[0x4]; // 0x74(0x04)
};

// Class Phoenix.AblAnimationTagChooser_GaitSpeed
// Size: 0xa8 (Inherited: 0x50)
struct UAblAnimationTagChooser_GaitSpeed : UAblAnimationTagChooser {
	struct TMap<enum class EAblGaitSpeed, struct FGameplayTagContainer> GaitTags; // 0x50(0x50)
	enum class ESpeedType SpeedType; // 0xa0(0x01)
	char pad_A1[0x7]; // 0xa1(0x07)
};

// Class Phoenix.AblAnimationTagChooser_Getup
// Size: 0x60 (Inherited: 0x50)
struct UAblAnimationTagChooser_Getup : UAblAnimationTagChooser {
	struct TArray<struct FVector2D> AngleRanges; // 0x50(0x10)
};

// Class Phoenix.AblAnimationTagChooser_HandMatch
// Size: 0x68 (Inherited: 0x50)
struct UAblAnimationTagChooser_HandMatch : UAblAnimationTagChooser {
	struct FVector HandsPositionWeight; // 0x50(0x0c)
	struct FVector HandsVelocityWeight; // 0x5c(0x0c)
};

// Class Phoenix.AblAnimationTagChooser_Idle
// Size: 0x50 (Inherited: 0x50)
struct UAblAnimationTagChooser_Idle : UAblAnimationTagChooser {
};

// Class Phoenix.AblAnimationTagChooser_IdleBreak
// Size: 0x98 (Inherited: 0x50)
struct UAblAnimationTagChooser_IdleBreak : UAblAnimationTagChooser {
	struct FGameplayTagContainer BaseTags; // 0x50(0x20)
	bool bFootMatch; // 0x70(0x01)
	char pad_71[0x3]; // 0x71(0x03)
	struct FGameplayTag LeftFootTag; // 0x74(0x08)
	struct FGameplayTag RightFootTag; // 0x7c(0x08)
	bool bIndoorOutdoorMatch; // 0x84(0x01)
	char pad_85[0x3]; // 0x85(0x03)
	struct FGameplayTag OutdoorsTag; // 0x88(0x08)
	struct FGameplayTag IndoorsTag; // 0x90(0x08)
};

// Class Phoenix.AblAnimationTagChooser_IdleTurnToFace
// Size: 0x50 (Inherited: 0x50)
struct UAblAnimationTagChooser_IdleTurnToFace : UAblAnimationTagChooser {
};

// Class Phoenix.AblAnimationTagChooser_Jump
// Size: 0x70 (Inherited: 0x50)
struct UAblAnimationTagChooser_Jump : UAblAnimationTagChooser {
	struct FVector2D FootMatchTimeRange; // 0x50(0x08)
	struct FVector FootPositionWeight; // 0x58(0x0c)
	struct FVector FootVelocityWeight; // 0x64(0x0c)
};

// Class Phoenix.AblAnimationTagChooser_Jump_New
// Size: 0x70 (Inherited: 0x50)
struct UAblAnimationTagChooser_Jump_New : UAblAnimationTagChooser {
	struct FVector2D FootMatchTimeRange; // 0x50(0x08)
	struct FVector FootPositionWeight; // 0x58(0x0c)
	struct FVector FootVelocityWeight; // 0x64(0x0c)
};

// Class Phoenix.AblAnimationTagChooser_Jump_Student
// Size: 0x50 (Inherited: 0x50)
struct UAblAnimationTagChooser_Jump_Student : UAblAnimationTagChooser {
};

// Class Phoenix.AblAnimationTagChooser_MountGait
// Size: 0xa0 (Inherited: 0x50)
struct UAblAnimationTagChooser_MountGait : UAblAnimationTagChooser {
	struct TMap<enum class ECreatureMovementSpeed, struct FGameplayTagContainer> GaitToTagsMap; // 0x50(0x50)
};

// Class Phoenix.AblAnimationTagChooser_MountLadder
// Size: 0x50 (Inherited: 0x50)
struct UAblAnimationTagChooser_MountLadder : UAblAnimationTagChooser {
};

// Class Phoenix.AblAnimationTagChooser_MountType
// Size: 0x50 (Inherited: 0x50)
struct UAblAnimationTagChooser_MountType : UAblAnimationTagChooser {
};

// Class Phoenix.AblAnimationTagChooser_MoveJump
// Size: 0x70 (Inherited: 0x50)
struct UAblAnimationTagChooser_MoveJump : UAblAnimationTagChooser {
	struct FVector2D FootMatchTimeRange; // 0x50(0x08)
	struct FVector FootPositionWeight; // 0x58(0x0c)
	struct FVector FootVelocityWeight; // 0x64(0x0c)
};

// Class Phoenix.AblAnimationTagChooser_MoveJumpLand
// Size: 0x70 (Inherited: 0x50)
struct UAblAnimationTagChooser_MoveJumpLand : UAblAnimationTagChooser {
	struct FVector2D FootMatchTimeRange; // 0x50(0x08)
	struct FVector FootPositionWeight; // 0x58(0x0c)
	struct FVector FootVelocityWeight; // 0x64(0x0c)
};

// Class Phoenix.AblAnimationTagChooser_MovingOverEdge
// Size: 0x70 (Inherited: 0x50)
struct UAblAnimationTagChooser_MovingOverEdge : UAblAnimationTagChooser {
	float TimeIntoMotion; // 0x50(0x04)
	struct FVector FootPositionWeight; // 0x54(0x0c)
	struct FVector FootVelocityWeight; // 0x60(0x0c)
	char pad_6C[0x4]; // 0x6c(0x04)
};

// Class Phoenix.AblAnimationTagChooser_NPCImpactDirection
// Size: 0x88 (Inherited: 0x50)
struct UAblAnimationTagChooser_NPCImpactDirection : UAblAnimationTagChooser {
	struct FGameplayTag ReactionAnimationTag; // 0x50(0x08)
	struct FGameplayTag ReactFrontTag; // 0x58(0x08)
	struct FGameplayTag ReactBackTag; // 0x60(0x08)
	struct FGameplayTag ReactRightTag; // 0x68(0x08)
	struct FGameplayTag ReactLeftTag; // 0x70(0x08)
	struct FGameplayTag ReactUpTag; // 0x78(0x08)
	struct FGameplayTag ReactDownTag; // 0x80(0x08)
};

// Class Phoenix.AblAnimationTagChooser_Phase
// Size: 0x50 (Inherited: 0x50)
struct UAblAnimationTagChooser_Phase : UAblAnimationTagChooser {
};

// Class Phoenix.AblAnimationTagChooser_PhysicalReactionGetupPose
// Size: 0x50 (Inherited: 0x50)
struct UAblAnimationTagChooser_PhysicalReactionGetupPose : UAblAnimationTagChooser {
};

// Class Phoenix.AblAnimationTagChooser_Pivot
// Size: 0x50 (Inherited: 0x50)
struct UAblAnimationTagChooser_Pivot : UAblAnimationTagChooser {
};

// Class Phoenix.AblAnimationTagChooser_Protego
// Size: 0x50 (Inherited: 0x50)
struct UAblAnimationTagChooser_Protego : UAblAnimationTagChooser {
};

// Class Phoenix.AblAnimationTagChooser_ProtegoParry
// Size: 0x50 (Inherited: 0x50)
struct UAblAnimationTagChooser_ProtegoParry : UAblAnimationTagChooser {
};

// Class Phoenix.AblAnimationTagChooser_ProtegoRetaliate
// Size: 0x60 (Inherited: 0x50)
struct UAblAnimationTagChooser_ProtegoRetaliate : UAblAnimationTagChooser {
	struct TArray<struct USpellToolRecord*> SpellToEquip; // 0x50(0x10)
};

// Class Phoenix.AblAnimationTagChooser_RagdollBehavior
// Size: 0x50 (Inherited: 0x50)
struct UAblAnimationTagChooser_RagdollBehavior : UAblAnimationTagChooser {
};

// Class Phoenix.AblAnimationTagChooser_Random
// Size: 0x50 (Inherited: 0x50)
struct UAblAnimationTagChooser_Random : UAblAnimationTagChooser {
};

// Class Phoenix.AblAnimationTagChooser_SlideRecovery
// Size: 0x50 (Inherited: 0x50)
struct UAblAnimationTagChooser_SlideRecovery : UAblAnimationTagChooser {
};

// Class Phoenix.AblAnimationTagChooser_StairsAndSlopes
// Size: 0x58 (Inherited: 0x50)
struct UAblAnimationTagChooser_StairsAndSlopes : UAblAnimationTagChooser {
	enum class EStairsDirectionState StairsDirection; // 0x50(0x01)
	char pad_51[0x7]; // 0x51(0x07)
};

// Class Phoenix.AblAnimationTagChooser_StealthTurnMoveStart
// Size: 0x68 (Inherited: 0x50)
struct UAblAnimationTagChooser_StealthTurnMoveStart : UAblAnimationTagChooser {
	struct FVector FootPositionWeight; // 0x50(0x0c)
	struct FVector FootVelocityWeight; // 0x5c(0x0c)
};

// Class Phoenix.AblAnimationTagChooser_StealthTurnMoveStop
// Size: 0x68 (Inherited: 0x50)
struct UAblAnimationTagChooser_StealthTurnMoveStop : UAblAnimationTagChooser {
	struct FVector FootPositionWeight; // 0x50(0x0c)
	struct FVector FootVelocityWeight; // 0x5c(0x0c)
};

// Class Phoenix.AblAnimationTagChooser_StepBack
// Size: 0x68 (Inherited: 0x50)
struct UAblAnimationTagChooser_StepBack : UAblAnimationTagChooser {
	struct FVector FootPositionWeight; // 0x50(0x0c)
	struct FVector FootVelocityWeight; // 0x5c(0x0c)
};

// Class Phoenix.AblAnimationTagChooser_Strafe
// Size: 0x50 (Inherited: 0x50)
struct UAblAnimationTagChooser_Strafe : UAblAnimationTagChooser {
};

// Class Phoenix.AblAnimationTagChooser_StrafeMoveLoop
// Size: 0x50 (Inherited: 0x50)
struct UAblAnimationTagChooser_StrafeMoveLoop : UAblAnimationTagChooser {
};

// Class Phoenix.AblAnimationTagChooser_StrafeMoveStartStop
// Size: 0x78 (Inherited: 0x50)
struct UAblAnimationTagChooser_StrafeMoveStartStop : UAblAnimationTagChooser {
	struct FVector FootPositionWeight; // 0x50(0x0c)
	struct FVector FootVelocityWeight; // 0x5c(0x0c)
	float FootMatchSearchTime; // 0x68(0x04)
	bool bStopping; // 0x6c(0x01)
	char pad_6D[0x3]; // 0x6d(0x03)
	float StickFlickTime; // 0x70(0x04)
	float ShuffleStepInterpTime; // 0x74(0x04)
};

// Class Phoenix.AblAnimationTagChooser_Swim
// Size: 0x50 (Inherited: 0x50)
struct UAblAnimationTagChooser_Swim : UAblAnimationTagChooser {
};

// Class Phoenix.AblAnimationTagChooser_ThrowItem
// Size: 0x58 (Inherited: 0x50)
struct UAblAnimationTagChooser_ThrowItem : UAblAnimationTagChooser {
	float ThrowLongDistance; // 0x50(0x04)
	float ThrowMedDistance; // 0x54(0x04)
};

// Class Phoenix.TurnDirectionTagChooser_DesiredDirectionGetter
// Size: 0x28 (Inherited: 0x28)
struct UTurnDirectionTagChooser_DesiredDirectionGetter : UTurnDirectionTagChooser_TargetDirectionGetter {
};

// Class Phoenix.TurnDirectionTagChooser_DesiredWorldDirectionGetter
// Size: 0x28 (Inherited: 0x28)
struct UTurnDirectionTagChooser_DesiredWorldDirectionGetter : UTurnDirectionTagChooser_TargetDirectionGetter {
};

// Class Phoenix.TurnDirectionTagChooser_BlackboardDirectionGetter
// Size: 0x30 (Inherited: 0x28)
struct UTurnDirectionTagChooser_BlackboardDirectionGetter : UTurnDirectionTagChooser_TargetDirectionGetter {
	struct FName BlackboardKeyName; // 0x28(0x08)
};

// Class Phoenix.AblAnimationTagChooser_TurnMoveStart
// Size: 0x70 (Inherited: 0x50)
struct UAblAnimationTagChooser_TurnMoveStart : UAblAnimationTagChooser {
	struct FVector FootPositionWeight; // 0x50(0x0c)
	struct FVector FootVelocityWeight; // 0x5c(0x0c)
	float ShortStartTime; // 0x68(0x04)
	char pad_6C[0x4]; // 0x6c(0x04)
};

// Class Phoenix.AblAnimationTagChooser_TurnMoveStop
// Size: 0x88 (Inherited: 0x50)
struct UAblAnimationTagChooser_TurnMoveStop : UAblAnimationTagChooser {
	struct FVector FootPositionWeight; // 0x50(0x0c)
	struct FVector FootVelocityWeight; // 0x5c(0x0c)
	float StickFlickTime; // 0x68(0x04)
	float ShortStopTime; // 0x6c(0x04)
	float ShuffleStepInterpTime; // 0x70(0x04)
	float PivotStopTime; // 0x74(0x04)
	float StartStopTime; // 0x78(0x04)
	float NoRootStopTime; // 0x7c(0x04)
	bool bEnableFwdStart2Stop; // 0x80(0x01)
	char pad_81[0x7]; // 0x81(0x07)
};

// Class Phoenix.AblAnimationTagChooser_WandCast
// Size: 0x80 (Inherited: 0x50)
struct UAblAnimationTagChooser_WandCast : UAblAnimationTagChooser {
	struct FGameplayTagContainer TooCloseToEnemyTag; // 0x50(0x20)
	float SpinMoveBlendTime; // 0x70(0x04)
	float MeleeMoveBlendTime; // 0x74(0x04)
	enum class EWandCastCommand WandCastCommand; // 0x78(0x01)
	bool bSampleYawRemainingFromCurve; // 0x79(0x01)
	char pad_7A[0x2]; // 0x7a(0x02)
	float YawRemainingSampleEndTime; // 0x7c(0x04)
};

// Class Phoenix.AblAnimationTagChooser_Wave
// Size: 0x50 (Inherited: 0x50)
struct UAblAnimationTagChooser_Wave : UAblAnimationTagChooser {
};

// Class Phoenix.AblAnimationTagChooser_WeaponVariant
// Size: 0x50 (Inherited: 0x50)
struct UAblAnimationTagChooser_WeaponVariant : UAblAnimationTagChooser {
};

// Class Phoenix.ablAnimDoneTaskScratchPad
// Size: 0x30 (Inherited: 0x28)
struct UablAnimDoneTaskScratchPad : UAblAbilityTaskScratchPad {
	float ElapsedTime; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
};

// Class Phoenix.ablAnimDoneTask
// Size: 0x78 (Inherited: 0x70)
struct UablAnimDoneTask : UAblAbilityTask {
	enum class EEnemyAIAnimState State; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
};

// Class Phoenix.ablAnimEndCallback_Enemy
// Size: 0x28 (Inherited: 0x28)
struct UablAnimEndCallback_Enemy : UAblAnimationEndCallback {
};

// Class Phoenix.ablAnimEventTaskScratchPad
// Size: 0x40 (Inherited: 0x28)
struct UablAnimEventTaskScratchPad : UAblAbilityTaskScratchPad {
	struct TArray<struct UAblTaskConditionScratchpad*> TaskConditionScratchpads; // 0x28(0x10)
	char pad_38[0x8]; // 0x38(0x08)
};

// Class Phoenix.ablAnimEventTask
// Size: 0x90 (Inherited: 0x70)
struct UablAnimEventTask : UAblAbilityTask {
	enum class EEnemy_AbilityEvent Event; // 0x70(0x01)
	enum class EEnemy_AbilityEvent EndEvent; // 0x71(0x01)
	char pad_72[0x2]; // 0x72(0x02)
	float MinIntervalSeconds; // 0x74(0x04)
	struct TArray<struct UAblTaskCondition*> Conditions; // 0x78(0x10)
	bool bMustPassAllConditions; // 0x88(0x01)
	char pad_89[0x7]; // 0x89(0x07)
};

// Class Phoenix.AblAnimRateGetter_Flight
// Size: 0x28 (Inherited: 0x28)
struct UAblAnimRateGetter_Flight : UAblAnimRateGetter {
};

// Class Phoenix.AblAnimRateGetter_IdleTurnInPlace
// Size: 0x28 (Inherited: 0x28)
struct UAblAnimRateGetter_IdleTurnInPlace : UAblAnimRateGetter {
};

// Class Phoenix.AblAnimRateGetter_MoveFwdLoop
// Size: 0x28 (Inherited: 0x28)
struct UAblAnimRateGetter_MoveFwdLoop : UAblAnimRateGetter {
};

// Class Phoenix.AblAnimRateGetter_OpenDoor
// Size: 0x30 (Inherited: 0x28)
struct UAblAnimRateGetter_OpenDoor : UAblAnimRateGetter {
	float MinPlayRate; // 0x28(0x04)
	float MaxPlayRate; // 0x2c(0x04)
};

// Class Phoenix.AblAnimRateGetter_Protego
// Size: 0x30 (Inherited: 0x28)
struct UAblAnimRateGetter_Protego : UAblAnimRateGetter {
	int32_t ImpactFrame; // 0x28(0x04)
	float MaxMultiplier; // 0x2c(0x04)
};

// Class Phoenix.AblAnimRateGetter_RagdollBehavior
// Size: 0x28 (Inherited: 0x28)
struct UAblAnimRateGetter_RagdollBehavior : UAblAnimRateGetter {
};

// Class Phoenix.AblAnimRateGetter_SpeedAdjust
// Size: 0x40 (Inherited: 0x28)
struct UAblAnimRateGetter_SpeedAdjust : UAblAnimRateGetter {
	struct FVector2D AngleRange; // 0x28(0x08)
	struct FVector2D AnimRateRange; // 0x30(0x08)
	float StairsJogMultiplier; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
};

// Class Phoenix.AblAnimRateGetter_StealthMoveFwdLoop
// Size: 0x30 (Inherited: 0x28)
struct UAblAnimRateGetter_StealthMoveFwdLoop : UAblAnimRateGetter {
	float MinWadingAnimRate; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
};

// Class Phoenix.AblAnimRateGetter_Strafe
// Size: 0x28 (Inherited: 0x28)
struct UAblAnimRateGetter_Strafe : UAblAnimRateGetter {
};

// Class Phoenix.AblAnimRateGetter_SyncAnimationPosition
// Size: 0xc0 (Inherited: 0x28)
struct UAblAnimRateGetter_SyncAnimationPosition : UAblAnimRateGetter {
	struct FRuntimeFloatCurve DeltaToPlayRate; // 0x28(0x88)
	float MinimumPlayRate; // 0xb0(0x04)
	float MaximumPlayRate; // 0xb4(0x04)
	struct UAblAbility* RequiredAbility; // 0xb8(0x08)
};

// Class Phoenix.AblAnimRateGetter_WandCast
// Size: 0x30 (Inherited: 0x28)
struct UAblAnimRateGetter_WandCast : UAblAnimRateGetter {
	float FireWandFrame; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
};

// Class Phoenix.ablAnimStateTaskScratchPad
// Size: 0x28 (Inherited: 0x28)
struct UablAnimStateTaskScratchPad : UAblAbilityTaskScratchPad {
};

// Class Phoenix.ablAnimStateTask
// Size: 0x78 (Inherited: 0x70)
struct UablAnimStateTask : UAblAbilityTask {
	enum class EEnemyAIAnimState State; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
};

// Class Phoenix.AblAnimTransitionInOverriderer_Enemy
// Size: 0x28 (Inherited: 0x28)
struct UAblAnimTransitionInOverriderer_Enemy : UAblAnimTransitionInOverriderer {
};

// Class Phoenix.AblAppendToBaseChooser_FlipFlop
// Size: 0x68 (Inherited: 0x28)
struct UAblAppendToBaseChooser_FlipFlop : UAblAnimationTagChooser_AppendToBaseChooser {
	struct FGameplayTagContainer FirstTags; // 0x28(0x20)
	struct FGameplayTagContainer SecondTags; // 0x48(0x20)
};

// Class Phoenix.AblAppendToBaseChooser_InAir
// Size: 0x30 (Inherited: 0x28)
struct UAblAppendToBaseChooser_InAir : UAblAnimationTagChooser_AppendToBaseChooser {
	char pad_28[0x8]; // 0x28(0x08)
};

// Class Phoenix.AblAppendToBaseChooser_NpcImpactDirection
// Size: 0x30 (Inherited: 0x28)
struct UAblAppendToBaseChooser_NpcImpactDirection : UAblAnimationTagChooser_AppendToBaseChooser {
	bool bAllowForwardBackwardOnly; // 0x28(0x01)
	bool bAllowLeftRightOnly; // 0x29(0x01)
	bool bInverse; // 0x2a(0x01)
	char pad_2B[0x5]; // 0x2b(0x05)
};

// Class Phoenix.AblAppendToBaseChooser_NpcReactMunitionCheck
// Size: 0x78 (Inherited: 0x28)
struct UAblAppendToBaseChooser_NpcReactMunitionCheck : UAblAnimationTagChooser_AppendToBaseChooser {
	struct TArray<struct UInteractionArchitectAsset*> MunitionAssetsToFind; // 0x28(0x10)
	struct FGameplayTagContainer MunitionTagsToFind; // 0x38(0x20)
	struct FGameplayTagContainer AnimationTagsToAppend; // 0x58(0x20)
};

// Class Phoenix.AblAppendToBaseChooser_NpcReactVelocityDirection
// Size: 0x30 (Inherited: 0x28)
struct UAblAppendToBaseChooser_NpcReactVelocityDirection : UAblAnimationTagChooser_AppendToBaseChooser {
	bool bAllowForwardBackwardOnly; // 0x28(0x01)
	bool bAllowLeftRightOnly; // 0x29(0x01)
	bool bInverse; // 0x2a(0x01)
	char pad_2B[0x5]; // 0x2b(0x05)
};

// Class Phoenix.AblAppendToBaseChooser_PoseMatching
// Size: 0x38 (Inherited: 0x28)
struct UAblAppendToBaseChooser_PoseMatching : UAblAnimationTagChooser_AppendToBaseChooser {
	struct TArray<struct FGameplayTagContainer> AnimationArchitectTags; // 0x28(0x10)
};

// Class Phoenix.AblAppendToBaseChooser_TrollSwing
// Size: 0x58 (Inherited: 0x28)
struct UAblAppendToBaseChooser_TrollSwing : UAblAnimationTagChooser_AppendToBaseChooser {
	struct FGameplayTag ForehandTag; // 0x28(0x08)
	struct FGameplayTag BackhandTag; // 0x30(0x08)
	struct FGameplayTag SplitTag; // 0x38(0x08)
	struct FGameplayTag FromRunTag; // 0x40(0x08)
	struct FGameplayTag StepBackTag; // 0x48(0x08)
	float StepBackDistance; // 0x50(0x04)
	char pad_54[0x4]; // 0x54(0x04)
};

// Class Phoenix.AblAppendToBaseChooser_WeaponState
// Size: 0x28 (Inherited: 0x28)
struct UAblAppendToBaseChooser_WeaponState : UAblAnimationTagChooser_AppendToBaseChooser {
};

// Class Phoenix.AblTransformMultiChildScratchpad
// Size: 0xb0 (Inherited: 0x28)
struct UAblTransformMultiChildScratchpad : UAblAbilityTaskScratchPad {
	struct TArray<struct UAblTaskConditionScratchpad*> TaskConditionScratchpads; // 0x28(0x10)
	char pad_38[0x78]; // 0x38(0x78)
};

// Class Phoenix.AblApplyTransformMultiChildTask
// Size: 0x100 (Inherited: 0x70)
struct UAblApplyTransformMultiChildTask : UAblAbilityTask {
	struct FName AttachPointName; // 0x70(0x08)
	struct TArray<struct UAblTaskCondition*> TaskConditions; // 0x78(0x10)
	struct TArray<struct FAblTransformMultiChildTask> ChildTasks; // 0x88(0x10)
	struct FAlphaBlend BlendIn; // 0x98(0x30)
	bool RestoreValueOnEnd; // 0xc8(0x01)
	char pad_C9[0x7]; // 0xc9(0x07)
	struct FAlphaBlend BlendOut; // 0xd0(0x30)
};

// Class Phoenix.ablAttackCollisionTaskScratchPad
// Size: 0x30 (Inherited: 0x28)
struct UablAttackCollisionTaskScratchPad : UAblAbilityTaskScratchPad {
	float ElapsedTime; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
};

// Class Phoenix.ablAttackCollisionTask
// Size: 0x78 (Inherited: 0x70)
struct UablAttackCollisionTask : UAblAbilityTask {
	enum class AttackCollisionType CollisionType; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
};

// Class Phoenix.ablAttackHitboxTaskScratchPad
// Size: 0x30 (Inherited: 0x28)
struct UablAttackHitboxTaskScratchPad : UAblAbilityTaskScratchPad {
	struct AMunitionType_Hitbox* MunitionInstance; // 0x28(0x08)
};

// Class Phoenix.ablAttackHitboxTask
// Size: 0xd8 (Inherited: 0x70)
struct UablAttackHitboxTask : UAblAbilityTask {
	struct AMunitionType_Hitbox* MunitionType; // 0x70(0x08)
	struct FName MunitionImpactType; // 0x78(0x08)
	struct FGameplayTagContainer MunitionTagContainer; // 0x80(0x20)
	struct UInteractionArchitectAsset* MunitionDataAsset; // 0xa0(0x08)
	struct FAblAbilityTargetTypeLocation HitboxLocation; // 0xa8(0x28)
	bool bAttachToSocket; // 0xd0(0x01)
	bool bNotifyParrySystem; // 0xd1(0x01)
	char pad_D2[0x6]; // 0xd2(0x06)
};

// Class Phoenix.AblBallisticBounceBackTaskScratchPad
// Size: 0x38 (Inherited: 0x28)
struct UAblBallisticBounceBackTaskScratchPad : UAblAbilityTaskScratchPad {
	struct FVector VectorAwayFromAttacked; // 0x28(0x0c)
	char pad_34[0x4]; // 0x34(0x04)
};

// Class Phoenix.AblBallisticBounceBackTask
// Size: 0x80 (Inherited: 0x70)
struct UAblBallisticBounceBackTask : UAblAbilityTask {
	float Speed; // 0x70(0x04)
	float Gravity; // 0x74(0x04)
	bool ChooseRandomDirection; // 0x78(0x01)
	char pad_79[0x3]; // 0x79(0x03)
	float MaxAngle; // 0x7c(0x04)
};

// Class Phoenix.AblBallisticFromReactionVelocityTask
// Size: 0x70 (Inherited: 0x70)
struct UAblBallisticFromReactionVelocityTask : UAblAbilityTask {
};

// Class Phoenix.AblBallisticTask
// Size: 0xa8 (Inherited: 0x70)
struct UAblBallisticTask : UAblAbilityTask {
	enum class EBallisticTaskDestinationSource DestSource; // 0x70(0x01)
	char pad_71[0x3]; // 0x71(0x03)
	struct FVector Destination; // 0x74(0x0c)
	float OverrideGravity; // 0x80(0x04)
	float ArcParamMin; // 0x84(0x04)
	float ArcParamMax; // 0x88(0x04)
	float TimeMult; // 0x8c(0x04)
	struct FVector TargetOffset; // 0x90(0x0c)
	float Distance; // 0x9c(0x04)
	float MaxDistance; // 0xa0(0x04)
	bool bIgnoreNonStatic; // 0xa4(0x01)
	bool bCollateralDamage; // 0xa5(0x01)
	char pad_A6[0x2]; // 0xa6(0x02)
};

// Class Phoenix.AblBallisticToTargetTask
// Size: 0xa8 (Inherited: 0x70)
struct UAblBallisticToTargetTask : UAblAbilityTask {
	float Speed; // 0x70(0x04)
	float OverrideGravity; // 0x74(0x04)
	float ArcParam; // 0x78(0x04)
	float TimeMult; // 0x7c(0x04)
	struct FVector TargetOffset; // 0x80(0x0c)
	float MaxDistance; // 0x8c(0x04)
	bool bBounce; // 0x90(0x01)
	bool bIgnoreNonStatic; // 0x91(0x01)
	bool bCollateralDamage; // 0x92(0x01)
	char pad_93[0x1]; // 0x93(0x01)
	float fRandomAngleDeviationMin; // 0x94(0x04)
	float fRandomAngleDeviationMax; // 0x98(0x04)
	float fRandomDistanceDeviationMin; // 0x9c(0x04)
	float fRandomDistanceDeviationMax; // 0xa0(0x04)
	char pad_A4[0x4]; // 0xa4(0x04)
};

// Class Phoenix.AblBlendSpaceParameterGetter_AimWand
// Size: 0x28 (Inherited: 0x28)
struct UAblBlendSpaceParameterGetter_AimWand : UAblBlendSpaceParameterGetter {
};

// Class Phoenix.AblBlendSpaceParameterGetter_AttackAnticipation
// Size: 0x38 (Inherited: 0x28)
struct UAblBlendSpaceParameterGetter_AttackAnticipation : UAblBlendSpaceParameterGetter {
	float DeadZoneAngle; // 0x28(0x04)
	float ClampDesiredAngle; // 0x2c(0x04)
	float ToExtremesSpeed; // 0x30(0x04)
	float ToZeroSpeed; // 0x34(0x04)
};

// Class Phoenix.AblBlendSpaceParameterGetter_BodyLean
// Size: 0x58 (Inherited: 0x28)
struct UAblBlendSpaceParameterGetter_BodyLean : UAblBlendSpaceParameterGetter {
	struct FVector2D SpeedRange; // 0x28(0x08)
	struct FVector2D BlendSpaceMaxRange; // 0x30(0x08)
	struct FVector2D InterpSpeedRange; // 0x38(0x08)
	bool bUseSpringInterp; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	float SpringHalflife; // 0x44(0x04)
	char pad_48[0x10]; // 0x48(0x10)

	void OnTeleport(struct AAmbulatory_Character* Character, struct FVector AmountDisplaced, struct FRotator AmountRotated); // Function Phoenix.AblBlendSpaceParameterGetter_BodyLean.OnTeleport // (Final|Native|Protected|HasDefaults) // @ game+0x3194d20
};

// Class Phoenix.AblBlendSpaceParameterGetter_BodyLean2D
// Size: 0x50 (Inherited: 0x28)
struct UAblBlendSpaceParameterGetter_BodyLean2D : UAblBlendSpaceParameterGetter {
	float MinMaxForwardAcceleration; // 0x28(0x04)
	float MinMaxSideAcceleration; // 0x2c(0x04)
	float InterpAlphaX; // 0x30(0x04)
	float InterpAlphaY; // 0x34(0x04)
	char pad_38[0x18]; // 0x38(0x18)
};

// Class Phoenix.AblBlendSpaceParameterGetter_CastAnticipationPose
// Size: 0x28 (Inherited: 0x28)
struct UAblBlendSpaceParameterGetter_CastAnticipationPose : UAblBlendSpaceParameterGetter {
};

// Class Phoenix.AblBlendSpaceParameterGetter_CenterOfMass
// Size: 0x28 (Inherited: 0x28)
struct UAblBlendSpaceParameterGetter_CenterOfMass : UAblBlendSpaceParameterGetter {
};

// Class Phoenix.AblBlendSpaceParameterGetter_CombatLean
// Size: 0x30 (Inherited: 0x28)
struct UAblBlendSpaceParameterGetter_CombatLean : UAblBlendSpaceParameterGetter {
	float MinValue; // 0x28(0x04)
	float MaxValue; // 0x2c(0x04)
};

// Class Phoenix.AblBlendSpaceParameterGetter_EnemyMove
// Size: 0x28 (Inherited: 0x28)
struct UAblBlendSpaceParameterGetter_EnemyMove : UAblSpeedCompensateBlendSpaceParameterGetter {
};

// Class Phoenix.AblBlendSpaceParameterGetter_EnemyMovePivot
// Size: 0x28 (Inherited: 0x28)
struct UAblBlendSpaceParameterGetter_EnemyMovePivot : UAblBlendSpaceParameterGetter {
};

// Class Phoenix.AblBlendSpaceParameterGetter_EnemyMoveSlopeLoop
// Size: 0x28 (Inherited: 0x28)
struct UAblBlendSpaceParameterGetter_EnemyMoveSlopeLoop : UAblBlendSpaceParameterGetter {
};

// Class Phoenix.AblBlendSpaceParameterGetter_EnemyMoveStart
// Size: 0x28 (Inherited: 0x28)
struct UAblBlendSpaceParameterGetter_EnemyMoveStart : UAblBlendSpaceParameterGetter {
};

// Class Phoenix.AblBlendSpaceParameterGetter_EnemyMoveStop
// Size: 0x28 (Inherited: 0x28)
struct UAblBlendSpaceParameterGetter_EnemyMoveStop : UAblBlendSpaceParameterGetter {
};

// Class Phoenix.AblBlendSpaceParameterGetter_EnemyMoveTurn
// Size: 0x28 (Inherited: 0x28)
struct UAblBlendSpaceParameterGetter_EnemyMoveTurn : UAblSpeedCompensateBlendSpaceParameterGetter {
};

// Class Phoenix.AblBlendSpaceParameterGetter_EnemyProtego
// Size: 0x28 (Inherited: 0x28)
struct UAblBlendSpaceParameterGetter_EnemyProtego : UAblBlendSpaceParameterGetter {
};

// Class Phoenix.AblBlendSpaceParameterGetter_EnemyShuffle
// Size: 0x28 (Inherited: 0x28)
struct UAblBlendSpaceParameterGetter_EnemyShuffle : UAblBlendSpaceParameterGetter {
};

// Class Phoenix.AblBlendSpaceParameterGetter_EnemyTurnInPlace
// Size: 0x28 (Inherited: 0x28)
struct UAblBlendSpaceParameterGetter_EnemyTurnInPlace : UAblBlendSpaceParameterGetter {
};

// Class Phoenix.AblBlendSpaceParameterGetter_EnemyTurnToPlayer
// Size: 0x28 (Inherited: 0x28)
struct UAblBlendSpaceParameterGetter_EnemyTurnToPlayer : UAblBlendSpaceParameterGetter {
};

// Class Phoenix.AblBlendSpaceParameterGetter_EnemyTurnToTarget
// Size: 0x28 (Inherited: 0x28)
struct UAblBlendSpaceParameterGetter_EnemyTurnToTarget : UAblBlendSpaceParameterGetter {
};

// Class Phoenix.AblBlendSpaceParameterGetter_Fall
// Size: 0x28 (Inherited: 0x28)
struct UAblBlendSpaceParameterGetter_Fall : UAblBlendSpaceParameterGetter {
};

// Class Phoenix.AblBlendSpaceParameterGetter_FlyingBroom
// Size: 0x30 (Inherited: 0x28)
struct UAblBlendSpaceParameterGetter_FlyingBroom : UAblBlendSpaceParameterGetter {
	bool bUseUpAndDown; // 0x28(0x01)
	char pad_29[0x7]; // 0x29(0x07)
};

// Class Phoenix.AblBlendSpaceParameterGetter_Hitch
// Size: 0x28 (Inherited: 0x28)
struct UAblBlendSpaceParameterGetter_Hitch : UAblBlendSpaceParameterGetter {
};

// Class Phoenix.AblBlendSpaceParameterGetter_Jump
// Size: 0x30 (Inherited: 0x28)
struct UAblBlendSpaceParameterGetter_Jump : UAblBlendSpaceParameterGetter {
	float ClampDesiredAngle; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
};

// Class Phoenix.AblBlendSpaceParameterGetter_JumpLand2Move
// Size: 0x30 (Inherited: 0x28)
struct UAblBlendSpaceParameterGetter_JumpLand2Move : UAblBlendSpaceParameterGetter {
	float ClampDesiredAngle; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
};

// Class Phoenix.AblBlendSpaceParameterGetter_Loot
// Size: 0x28 (Inherited: 0x28)
struct UAblBlendSpaceParameterGetter_Loot : UAblBlendSpaceParameterGetter {
};

// Class Phoenix.AblBlendSpaceParameterGetter_LumosHold
// Size: 0x28 (Inherited: 0x28)
struct UAblBlendSpaceParameterGetter_LumosHold : UAblBlendSpaceParameterGetter {
};

// Class Phoenix.AblBlendSpaceParameterGetter_MountRiderHeadTurn
// Size: 0x28 (Inherited: 0x28)
struct UAblBlendSpaceParameterGetter_MountRiderHeadTurn : UAblBlendSpaceParameterGetter {
};

// Class Phoenix.AblBlendSpaceParameterGetter_Move
// Size: 0x28 (Inherited: 0x28)
struct UAblBlendSpaceParameterGetter_Move : UAblBlendSpaceParameterGetter {
};

// Class Phoenix.AblBlendSpaceParameterGetter_MoveFlinchLoop
// Size: 0x28 (Inherited: 0x28)
struct UAblBlendSpaceParameterGetter_MoveFlinchLoop : UAblBlendSpaceParameterGetter {
};

// Class Phoenix.AblBlendSpaceParameterGetter_MoveFwdLoop
// Size: 0x38 (Inherited: 0x28)
struct UAblBlendSpaceParameterGetter_MoveFwdLoop : UAblBlendSpaceParameterGetter {
	float InterpSpeed; // 0x28(0x04)
	float WadingInterpSpeed; // 0x2c(0x04)
	enum class ECustomInterpType InterpType; // 0x30(0x01)
	bool bBlendInputOnTransitionOut; // 0x31(0x01)
	bool bUseVelocity; // 0x32(0x01)
	char pad_33[0x5]; // 0x33(0x05)
};

// Class Phoenix.AblBlendSpaceParameterGetter_MoveStart
// Size: 0x28 (Inherited: 0x28)
struct UAblBlendSpaceParameterGetter_MoveStart : UAblBlendSpaceParameterGetter {
};

// Class Phoenix.AblBlendSpaceParameterGetter_MoveStop
// Size: 0x28 (Inherited: 0x28)
struct UAblBlendSpaceParameterGetter_MoveStop : UAblBlendSpaceParameterGetter {
};

// Class Phoenix.AblBlendSpaceParameterGetter_MoveStrafe
// Size: 0x38 (Inherited: 0x28)
struct UAblBlendSpaceParameterGetter_MoveStrafe : UAblBlendSpaceParameterGetter {
	float MagnitudeInterpSpeed; // 0x28(0x04)
	float AngleInterpSpeed; // 0x2c(0x04)
	bool bBlendInputOnTransitionOut; // 0x30(0x01)
	bool bUseVelocity; // 0x31(0x01)
	char pad_32[0x6]; // 0x32(0x06)
};

// Class Phoenix.AblBlendSpaceParameterGetter_NPCFollowSpline
// Size: 0x28 (Inherited: 0x28)
struct UAblBlendSpaceParameterGetter_NPCFollowSpline : UAblSpeedCompensateBlendSpaceParameterGetter {
};

// Class Phoenix.AblBlendSpaceParameterGetter_NpcHitch
// Size: 0x30 (Inherited: 0x28)
struct UAblBlendSpaceParameterGetter_NpcHitch : UAblBlendSpaceParameterGetter {
	char pad_28[0x8]; // 0x28(0x08)
};

// Class Phoenix.AblBlendSpaceParameterGetter_ProceduralLocomotion
// Size: 0x28 (Inherited: 0x28)
struct UAblBlendSpaceParameterGetter_ProceduralLocomotion : UAblBlendSpaceParameterGetter {
};

// Class Phoenix.AblBlendSpaceParameterGetter_RailTravelStatue
// Size: 0x28 (Inherited: 0x28)
struct UAblBlendSpaceParameterGetter_RailTravelStatue : UAblBlendSpaceParameterGetter {
};

// Class Phoenix.AblBlendSpaceParameterGetter_Rotation
// Size: 0x30 (Inherited: 0x28)
struct UAblBlendSpaceParameterGetter_Rotation : UAblBlendSpaceParameterGetter {
	bool bUseAttachParent; // 0x28(0x01)
	char pad_29[0x7]; // 0x29(0x07)
};

// Class Phoenix.AblBlendSpaceParameterGetter_SEMove
// Size: 0x28 (Inherited: 0x28)
struct UAblBlendSpaceParameterGetter_SEMove : UAblSpeedCompensateBlendSpaceParameterGetter {
};

// Class Phoenix.AblBlendSpaceParameterGetter_Slide
// Size: 0x50 (Inherited: 0x28)
struct UAblBlendSpaceParameterGetter_Slide : UAblBlendSpaceParameterGetter {
	float NonStickMax; // 0x28(0x04)
	float DeadZone; // 0x2c(0x04)
	enum class ECustomInterpType XInterpType; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	float XInterpSpeed; // 0x34(0x04)
	enum class ECustomInterpType XFastInterpType; // 0x38(0x01)
	char pad_39[0x3]; // 0x39(0x03)
	float XFastInterpSpeed; // 0x3c(0x04)
	enum class ECustomInterpType YInterpType; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	float YInterpSpeed; // 0x44(0x04)
	bool bSlipAndFall; // 0x48(0x01)
	bool bReverseDirection; // 0x49(0x01)
	bool bGetBlendParamsFromLast; // 0x4a(0x01)
	char pad_4B[0x5]; // 0x4b(0x05)
};

// Class Phoenix.AblBlendSpaceParameterGetter_Speed
// Size: 0x28 (Inherited: 0x28)
struct UAblBlendSpaceParameterGetter_Speed : UAblBlendSpaceParameterGetter {
};

// Class Phoenix.AblBlendSpaceParameterGetter_Sprint
// Size: 0x50 (Inherited: 0x28)
struct UAblBlendSpaceParameterGetter_Sprint : UAblBlendSpaceParameterGetter {
	float MaxAngle; // 0x28(0x04)
	float AngleRatioNearZeroTolerance; // 0x2c(0x04)
	float XInterpInSpeed; // 0x30(0x04)
	enum class ECustomInterpType XInterpInType; // 0x34(0x01)
	char pad_35[0x3]; // 0x35(0x03)
	float XInterpOutSpeed; // 0x38(0x04)
	enum class ECustomInterpType XInterpOutType; // 0x3c(0x01)
	char pad_3D[0x3]; // 0x3d(0x03)
	float MinSlope; // 0x40(0x04)
	float MaxSlope; // 0x44(0x04)
	bool bBlendInputOnTransitionOut; // 0x48(0x01)
	bool bUseVelocity; // 0x49(0x01)
	char pad_4A[0x6]; // 0x4a(0x06)
};

// Class Phoenix.AblBlendSpaceParameterGetter_StairsAndSlopes
// Size: 0x38 (Inherited: 0x28)
struct UAblBlendSpaceParameterGetter_StairsAndSlopes : UAblBlendSpaceParameterGetter {
	enum class EStairsDirectionState StairsDirection; // 0x28(0x01)
	char pad_29[0x3]; // 0x29(0x03)
	float MinSlope; // 0x2c(0x04)
	float MaxSlope; // 0x30(0x04)
	bool bBlendInputOnTransitionOut; // 0x34(0x01)
	bool bUseVelocity; // 0x35(0x01)
	char pad_36[0x2]; // 0x36(0x02)
};

// Class Phoenix.AblBlendSpaceParameterGetter_Strafe
// Size: 0x30 (Inherited: 0x28)
struct UAblBlendSpaceParameterGetter_Strafe : UAblBlendSpaceParameterGetter {
	float SpeedInterpSpeed; // 0x28(0x04)
	float AngleInterpSpeed; // 0x2c(0x04)
};

// Class Phoenix.AblBlendSpaceParameterGetter_StrafeMoveStart
// Size: 0x38 (Inherited: 0x38)
struct UAblBlendSpaceParameterGetter_StrafeMoveStart : UAblBlendSpaceParameterGetter_MoveStrafe {
};

// Class Phoenix.AblBlendSpaceParameterGetter_StrafeMoveStop
// Size: 0x48 (Inherited: 0x38)
struct UAblBlendSpaceParameterGetter_StrafeMoveStop : UAblBlendSpaceParameterGetter_MoveStrafe {
	bool bUseWorldSpeedTracker; // 0x38(0x01)
	bool bOverrideWalkSpeed; // 0x39(0x01)
	char pad_3A[0x2]; // 0x3a(0x02)
	float WalkSpeedOverride; // 0x3c(0x04)
	bool bOverrideJogSpeed; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	float JogSpeedOverride; // 0x44(0x04)
};

// Class Phoenix.AblBlendSpaceParameterGetter_StrafePivot
// Size: 0x38 (Inherited: 0x38)
struct UAblBlendSpaceParameterGetter_StrafePivot : UAblBlendSpaceParameterGetter_MoveStrafe {
};

// Class Phoenix.AblBlendSpaceParameterGetter_StrafeUpperBody
// Size: 0x40 (Inherited: 0x28)
struct UAblBlendSpaceParameterGetter_StrafeUpperBody : UAblBlendSpaceParameterGetter {
	struct FName HipBoneName; // 0x28(0x08)
	struct FVector HipForwardLocal; // 0x30(0x0c)
	char pad_3C[0x4]; // 0x3c(0x04)
};

// Class Phoenix.AblBlendSpaceParameterGetter_StrafeUpperBodyTurn
// Size: 0x28 (Inherited: 0x28)
struct UAblBlendSpaceParameterGetter_StrafeUpperBodyTurn : UAblBlendSpaceParameterGetter {
};

// Class Phoenix.AblBlendSpaceParameterGetter_SwimMove1D
// Size: 0x28 (Inherited: 0x28)
struct UAblBlendSpaceParameterGetter_SwimMove1D : UAblBlendSpaceParameterGetter {
};

// Class Phoenix.AblBlendSpaceParameterGetter_VelocityZ
// Size: 0x28 (Inherited: 0x28)
struct UAblBlendSpaceParameterGetter_VelocityZ : UAblBlendSpaceParameterGetter {
};

// Class Phoenix.AblBlendWeightMultiplierGetter_FallBlend
// Size: 0x30 (Inherited: 0x28)
struct UAblBlendWeightMultiplierGetter_FallBlend : UAblBlendWeightMultiplierGetter {
	float BlendSpeed; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
};

// Class Phoenix.AblBranchActorTagCondition
// Size: 0x38 (Inherited: 0x30)
struct UAblBranchActorTagCondition : UAblBranchCondition {
	struct FName TagName; // 0x30(0x08)
};

// Class Phoenix.AblBranchAllowSprintOnStairsCondition
// Size: 0x30 (Inherited: 0x30)
struct UAblBranchAllowSprintOnStairsCondition : UAblBranchCondition {
};

// Class Phoenix.AblBranchConditionAnimMechanic
// Size: 0x38 (Inherited: 0x30)
struct UAblBranchConditionAnimMechanic : UAblBranchCondition {
	enum class EAnimMechanicType AnimMechanicType; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
};

// Class Phoenix.AblBranchConditionAnimSpeed
// Size: 0x38 (Inherited: 0x30)
struct UAblBranchConditionAnimSpeed : UAblBranchCondition {
	enum class EAnimSpeedType AnimSpeedType; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
};

// Class Phoenix.AblBranchConditionBasicMobilityMode
// Size: 0x38 (Inherited: 0x30)
struct UAblBranchConditionBasicMobilityMode : UAblBranchCondition {
	enum class EBasicMobilityMode BasicMobilityMode; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
};

// Class Phoenix.AblBranchBlackboardBoolCondition
// Size: 0x38 (Inherited: 0x30)
struct UAblBranchBlackboardBoolCondition : UAblBranchCondition {
	struct FName BlackboardKeyName; // 0x30(0x08)
};

// Class Phoenix.AblBranchConditionBroomIdleBreak
// Size: 0x30 (Inherited: 0x30)
struct UAblBranchConditionBroomIdleBreak : UAblBranchCondition {
};

// Class Phoenix.AblBranchClimbingLadderStateCondition
// Size: 0x40 (Inherited: 0x30)
struct UAblBranchClimbingLadderStateCondition : UAblBranchCondition {
	struct TArray<enum class EClimbingLadderState> LadderStates; // 0x30(0x10)
};

// Class Phoenix.AblBranchConditionCognitionTarget
// Size: 0x40 (Inherited: 0x30)
struct UAblBranchConditionCognitionTarget : UAblBranchCondition {
	struct UAISense_Cognition* CognitionSense; // 0x30(0x08)
	struct AActor* MatchActorType; // 0x38(0x08)
};

// Class Phoenix.ablBranchCondition_Broom
// Size: 0x38 (Inherited: 0x30)
struct UablBranchCondition_Broom : UAblBranchCondition {
	enum class EFlyingBroomState FlyingBroomCheckState; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
};

// Class Phoenix.ablBranchCondition_BroomCollide
// Size: 0x38 (Inherited: 0x30)
struct UablBranchCondition_BroomCollide : UAblBranchCondition {
	enum class EFlyingBroomHitObjectType FlyingBroomCheckHitObject; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
};

// Class Phoenix.ablBranchCondition_CautionMode
// Size: 0x30 (Inherited: 0x30)
struct UablBranchCondition_CautionMode : UAblBranchCondition {
};

// Class Phoenix.AblBranchConditionEnemyAbilitySupported
// Size: 0x38 (Inherited: 0x30)
struct UAblBranchConditionEnemyAbilitySupported : UAblBranchCondition {
	enum class EEnemy_Ability Ability; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
};

// Class Phoenix.AblBranchConditionEnemyCase
// Size: 0x40 (Inherited: 0x30)
struct UAblBranchConditionEnemyCase : UAblBranchCondition {
	enum class EAbilityTaskScratchPadCondition Condition; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	float fMinTime; // 0x34(0x04)
	float fMaxTime; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
};

// Class Phoenix.AblBranchConditionEnemyGroundDetection
// Size: 0x38 (Inherited: 0x30)
struct UAblBranchConditionEnemyGroundDetection : UAblBranchCondition {
	float OnGroundDistance; // 0x30(0x04)
	bool bIncludeCharacterHeightBounds; // 0x34(0x01)
	char pad_35[0x3]; // 0x35(0x03)
};

// Class Phoenix.AblBranchConditionEnemyInSight
// Size: 0x30 (Inherited: 0x30)
struct UAblBranchConditionEnemyInSight : UAblBranchCondition {
};

// Class Phoenix.AblBranchConditionEnemyMoveEnd
// Size: 0x40 (Inherited: 0x30)
struct UAblBranchConditionEnemyMoveEnd : UAblBranchCondition {
	enum class EEnemyMoveEndType MoveType; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	float SlideLinkEndXYTolerance; // 0x34(0x04)
	float SlideLinkEndZTolerance; // 0x38(0x04)
	bool bSlideCheckSurfaceType; // 0x3c(0x01)
	char pad_3D[0x3]; // 0x3d(0x03)
};

// Class Phoenix.AblBranchConditionEnemyMoveHit
// Size: 0x38 (Inherited: 0x30)
struct UAblBranchConditionEnemyMoveHit : UAblBranchCondition {
	bool bOnlyTriggerOnGroundMatch; // 0x30(0x01)
	bool bOnGroundRequirement; // 0x31(0x01)
	bool bOnAirRequirement; // 0x32(0x01)
	bool bIgnoreHitAfterDeath; // 0x33(0x01)
	char pad_34[0x4]; // 0x34(0x04)
};

// Class Phoenix.AblBranchConditionEnemyPhysics
// Size: 0x38 (Inherited: 0x30)
struct UAblBranchConditionEnemyPhysics : UAblBranchCondition {
	bool bOnPhysicsMovementStop; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
};

// Class Phoenix.AblBranchConditionEnemyReachTarget
// Size: 0x38 (Inherited: 0x30)
struct UAblBranchConditionEnemyReachTarget : UAblBranchCondition {
	bool bOnlyTriggerOnGroundMatch; // 0x30(0x01)
	bool bOnGroundRequirement; // 0x31(0x01)
	char pad_32[0x6]; // 0x32(0x06)
};

// Class Phoenix.AblBranchConditionEnemyStateDone
// Size: 0x30 (Inherited: 0x30)
struct UAblBranchConditionEnemyStateDone : UAblBranchCondition {
};

// Class Phoenix.AblBranchConditionVelocity
// Size: 0x38 (Inherited: 0x30)
struct UAblBranchConditionVelocity : UAblBranchCondition {
	bool bMinSpeed; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	float MinSpeed; // 0x34(0x04)
};

// Class Phoenix.AblBranchConditionGameplayTag
// Size: 0x50 (Inherited: 0x28)
struct UAblBranchConditionGameplayTag : UAblTaskCondition {
	struct FGameplayTagContainer TagContainer; // 0x28(0x20)
	bool bInverse; // 0x48(0x01)
	char pad_49[0x7]; // 0x49(0x07)
};

// Class Phoenix.AblAmbulatoryGroundDetectionScratchpad
// Size: 0x38 (Inherited: 0x30)
struct UAblAmbulatoryGroundDetectionScratchpad : UAblTaskConditionScratchpad {
	struct UAmbulatory_MovementComponent* MovementComp; // 0x30(0x08)
};

// Class Phoenix.AblAmbulatoryGroundDetection
// Size: 0x30 (Inherited: 0x28)
struct UAblAmbulatoryGroundDetection : UAblTaskCondition {
	float OnGroundDistance; // 0x28(0x04)
	bool bGroundMustBeWalkable; // 0x2c(0x01)
	bool bGroundMustNotBePawn; // 0x2d(0x01)
	bool bInverse; // 0x2e(0x01)
	char pad_2F[0x1]; // 0x2f(0x01)
};

// Class Phoenix.AblBranchConditionMovementModeScratchpad
// Size: 0x40 (Inherited: 0x30)
struct UAblBranchConditionMovementModeScratchpad : UAblTaskConditionScratchpad {
	struct UCharacterMovementComponent* MovementComp; // 0x30(0x08)
	float TimeInMode; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
};

// Class Phoenix.AblBranchConditionMovementMode
// Size: 0x30 (Inherited: 0x28)
struct UAblBranchConditionMovementMode : UAblTaskCondition {
	enum class EMovementMode MovementMode; // 0x28(0x01)
	char pad_29[0x3]; // 0x29(0x03)
	float MinDuration; // 0x2c(0x04)
};

// Class Phoenix.AblNoMovementBranchTaskScratchpad
// Size: 0x60 (Inherited: 0x50)
struct UAblNoMovementBranchTaskScratchpad : UAblBranchTaskScratchPad {
	char pad_50[0x10]; // 0x50(0x10)
};

// Class Phoenix.AblBranchConditionNoMovement
// Size: 0x38 (Inherited: 0x30)
struct UAblBranchConditionNoMovement : UAblBranchCondition {
	float DistanceSquaredTolerance; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
};

// Class Phoenix.AblBranchConditionRPGTag
// Size: 0x38 (Inherited: 0x28)
struct UAblBranchConditionRPGTag : UAblTaskCondition {
	struct FGameplayTag RPGTag; // 0x28(0x08)
	bool bInverse; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
};

// Class Phoenix.AblBranchConditionTimer
// Size: 0x38 (Inherited: 0x30)
struct UAblBranchConditionTimer : UAblBranchCondition {
	float CountdownTime; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
};

// Class Phoenix.AblBranchConditionTimerScratchpad
// Size: 0x38 (Inherited: 0x30)
struct UAblBranchConditionTimerScratchpad : UAblTaskConditionScratchpad {
	char pad_30[0x8]; // 0x30(0x08)
};

// Class Phoenix.AblBranchConditionTimer_New
// Size: 0x30 (Inherited: 0x28)
struct UAblBranchConditionTimer_New : UAblTaskCondition {
	float MinTime; // 0x28(0x04)
	float MaxTime; // 0x2c(0x04)
};

// Class Phoenix.AblBranchConditionVelocityScratchpad
// Size: 0x30 (Inherited: 0x30)
struct UAblBranchConditionVelocityScratchpad : UAblTaskConditionScratchpad {
};

// Class Phoenix.AblBranchConditionVelocity_New
// Size: 0x48 (Inherited: 0x28)
struct UAblBranchConditionVelocity_New : UAblTaskCondition {
	bool bSpeedIsGreaterThan; // 0x28(0x01)
	char pad_29[0x3]; // 0x29(0x03)
	float SpeedIsGreaterThan; // 0x2c(0x04)
	bool bSpeedIsLessThan; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	float SpeedIsLessThan; // 0x34(0x04)
	bool bZIsGreaterThan; // 0x38(0x01)
	char pad_39[0x3]; // 0x39(0x03)
	float ZIsGreaterThan; // 0x3c(0x04)
	bool bZIsLessThan; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	float ZIsLessThan; // 0x44(0x04)
};

// Class Phoenix.AblBranchCreatureContinueInteraction
// Size: 0x30 (Inherited: 0x30)
struct UAblBranchCreatureContinueInteraction : UAblBranchCondition {
};

// Class Phoenix.AblBranchConditionCreatureIdleBreak
// Size: 0x30 (Inherited: 0x30)
struct UAblBranchConditionCreatureIdleBreak : UAblBranchCondition {
};

// Class Phoenix.ablBranchCreatureIsMountCondition
// Size: 0x30 (Inherited: 0x30)
struct UablBranchCreatureIsMountCondition : UAblBranchCondition {
};

// Class Phoenix.ablBranchConditionMountAnimNotify
// Size: 0x48 (Inherited: 0x40)
struct UablBranchConditionMountAnimNotify : UAblBranchConditionAnimNotify {
	bool bReturnTrueIfMount; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)
};

// Class Phoenix.AblCreatureNavLinkCondition
// Size: 0x38 (Inherited: 0x30)
struct UAblCreatureNavLinkCondition : UAblBranchCondition {
	enum class ECreatureNavLinkType LinkType; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
};

// Class Phoenix.AblBranchCreaturePathTeleport
// Size: 0x30 (Inherited: 0x30)
struct UAblBranchCreaturePathTeleport : UAblBranchCondition {
};

// Class Phoenix.AblBranchCreatureStance
// Size: 0x48 (Inherited: 0x30)
struct UAblBranchCreatureStance : UAblBranchCondition {
	bool bUseCurrentStance; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
	struct TArray<enum class ECreatureStance> CreatureStances; // 0x38(0x10)
};

// Class Phoenix.AblBranchCreatureStoppingModeCondition
// Size: 0x38 (Inherited: 0x30)
struct UAblBranchCreatureStoppingModeCondition : UAblBranchCondition {
	enum class ECreatureStoppingMode StoppingMode; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
};

// Class Phoenix.AblBranchConditionDesiredDirectionDelta
// Size: 0x48 (Inherited: 0x30)
struct UAblBranchConditionDesiredDirectionDelta : UAblBranchCondition {
	enum class EDesiredDeltaSourceDirection UseSourceDirection; // 0x30(0x01)
	enum class EDesiredDeltaTargetTracker UseTracker; // 0x31(0x01)
	char pad_32[0x2]; // 0x32(0x02)
	float BufferSampleTime; // 0x34(0x04)
	bool bAbsoulteValue; // 0x38(0x01)
	enum class EDesiredDeltaOperator UseOperator; // 0x39(0x01)
	char pad_3A[0x2]; // 0x3a(0x02)
	struct FVector2D AngleRange; // 0x3c(0x08)
	char pad_44[0x4]; // 0x44(0x04)
};

// Class Phoenix.AblBranchConditionDiscreteSpeedChanged
// Size: 0x58 (Inherited: 0x30)
struct UAblBranchConditionDiscreteSpeedChanged : UAblBranchCondition {
	bool bSpeedsMustMatch; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
	struct TArray<enum class EAblGaitSpeed> LastGaitSpeeds; // 0x38(0x10)
	struct TArray<enum class EAblGaitSpeed> NewGaitSpeeds; // 0x48(0x10)
};

// Class Phoenix.AblBranchConditionEdgeState
// Size: 0x40 (Inherited: 0x30)
struct UAblBranchConditionEdgeState : UAblBranchCondition {
	struct TArray<enum class EEdgeState> EdgeStates; // 0x30(0x10)
};

// Class Phoenix.AblBranchConditionFlightGliding
// Size: 0x30 (Inherited: 0x30)
struct UAblBranchConditionFlightGliding : UAblBranchCondition {
};

// Class Phoenix.AblBranchConditionFlightIsGliding
// Size: 0x30 (Inherited: 0x30)
struct UAblBranchConditionFlightIsGliding : UAblBranchCondition {
};

// Class Phoenix.AblBranchConditionFlying
// Size: 0x30 (Inherited: 0x30)
struct UAblBranchConditionFlying : UAblBranchCondition {
};

// Class Phoenix.AblBranchConditionCanFly
// Size: 0x30 (Inherited: 0x30)
struct UAblBranchConditionCanFly : UAblBranchCondition {
};

// Class Phoenix.AblBranchConditionIsLanding
// Size: 0x30 (Inherited: 0x30)
struct UAblBranchConditionIsLanding : UAblBranchCondition {
};

// Class Phoenix.AblBranchConditionDesiredFlightState
// Size: 0x38 (Inherited: 0x30)
struct UAblBranchConditionDesiredFlightState : UAblBranchCondition {
	enum class ECreatureFlightState DesiredFlightState; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
};

// Class Phoenix.AblBranchConditionDesiredLandingType
// Size: 0x40 (Inherited: 0x30)
struct UAblBranchConditionDesiredLandingType : UAblBranchCondition {
	struct TArray<enum class ECreatureLandingType> LandingTypes; // 0x30(0x10)
};

// Class Phoenix.AblTaskCondition_IsFlying
// Size: 0x30 (Inherited: 0x28)
struct UAblTaskCondition_IsFlying : UAblTaskCondition {
	bool bNegate; // 0x28(0x01)
	char pad_29[0x7]; // 0x29(0x07)
};

// Class Phoenix.AblBranchFromLightDirectional
// Size: 0x30 (Inherited: 0x30)
struct UAblBranchFromLightDirectional : UAblBranchCondition {
};

// Class Phoenix.AblBranchConditionFullBodyState
// Size: 0x38 (Inherited: 0x30)
struct UAblBranchConditionFullBodyState : UAblBranchCondition {
	enum class EFullBodyState FullBodyState; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
};

// Class Phoenix.AblBranchConditionGaitSpeed
// Size: 0x48 (Inherited: 0x30)
struct UAblBranchConditionGaitSpeed : UAblBranchCondition {
	struct TArray<enum class EAblGaitSpeed> GaitSpeeds; // 0x30(0x10)
	enum class ESpeedType SpeedType; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	float BufferSampleTime; // 0x44(0x04)
};

// Class Phoenix.AblBranchConditionGaitSpeedScratchpad
// Size: 0x30 (Inherited: 0x30)
struct UAblBranchConditionGaitSpeedScratchpad : UAblTaskConditionScratchpad {
};

// Class Phoenix.AblBranchConditionGaitSpeed_New
// Size: 0x40 (Inherited: 0x28)
struct UAblBranchConditionGaitSpeed_New : UAblTaskCondition {
	struct TArray<enum class EAblGaitSpeed> GaitSpeeds; // 0x28(0x10)
	enum class ESpeedType SpeedType; // 0x38(0x01)
	char pad_39[0x3]; // 0x39(0x03)
	float BufferSampleTime; // 0x3c(0x04)
};

// Class Phoenix.AblBranchConditionGameLogic
// Size: 0x38 (Inherited: 0x30)
struct UAblBranchConditionGameLogic : UAblBranchCondition {
	struct FName_GameLogicBoolResult BoolResultName; // 0x30(0x08)
};

// Class Phoenix.AblBranchConditionGetupFromPhysicalReaction
// Size: 0x30 (Inherited: 0x30)
struct UAblBranchConditionGetupFromPhysicalReaction : UAblBranchCondition {
};

// Class Phoenix.AblBranchConditionRecoverInAirFromPhysicalReaction
// Size: 0x30 (Inherited: 0x30)
struct UAblBranchConditionRecoverInAirFromPhysicalReaction : UAblBranchCondition {
};

// Class Phoenix.AblBranchConditionRecoverInWaterFromPhysicalReaction
// Size: 0x30 (Inherited: 0x30)
struct UAblBranchConditionRecoverInWaterFromPhysicalReaction : UAblBranchCondition {
};

// Class Phoenix.AblBranchConditionWasForcedOutOfRagdoll
// Size: 0x30 (Inherited: 0x30)
struct UAblBranchConditionWasForcedOutOfRagdoll : UAblBranchCondition {
};

// Class Phoenix.AblBranchConditionIdleTimeElapsed
// Size: 0x38 (Inherited: 0x30)
struct UAblBranchConditionIdleTimeElapsed : UAblBranchCondition {
	float TimeElapsed; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
};

// Class Phoenix.AblBranchConditionInCombatMode
// Size: 0x38 (Inherited: 0x30)
struct UAblBranchConditionInCombatMode : UAblBranchCondition {
	bool bCheckDelayedState; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
};

// Class Phoenix.AblBranchConditionInSocialMode
// Size: 0x30 (Inherited: 0x30)
struct UAblBranchConditionInSocialMode : UAblBranchCondition {
};

// Class Phoenix.AblBranchIsBroomMoving
// Size: 0x38 (Inherited: 0x30)
struct UAblBranchIsBroomMoving : UAblBranchCondition {
	bool bCheckHorizontal; // 0x30(0x01)
	bool bCheckVertical; // 0x31(0x01)
	char pad_32[0x6]; // 0x32(0x06)
};

// Class Phoenix.AblBranchConditionIsMovement
// Size: 0x30 (Inherited: 0x30)
struct UAblBranchConditionIsMovement : UAblBranchCondition {
};

// Class Phoenix.AblBranchConditionIsSprinting
// Size: 0x30 (Inherited: 0x30)
struct UAblBranchConditionIsSprinting : UAblBranchCondition {
};

// Class Phoenix.AblBranchConditionIsTesting
// Size: 0x30 (Inherited: 0x30)
struct UAblBranchConditionIsTesting : UAblBranchCondition {
};

// Class Phoenix.AblBranchConditionJumpHeight
// Size: 0x38 (Inherited: 0x30)
struct UAblBranchConditionJumpHeight : UAblBranchCondition {
	struct FVector2D Range; // 0x30(0x08)
};

// Class Phoenix.AblBranchConditionJumpType
// Size: 0x38 (Inherited: 0x30)
struct UAblBranchConditionJumpType : UAblBranchCondition {
	enum class EJumpingType JumpType; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
};

// Class Phoenix.AblBranchConditionMobilityType
// Size: 0x38 (Inherited: 0x30)
struct UAblBranchConditionMobilityType : UAblBranchCondition {
	enum class EMobilityActionState MobilityActionState; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
};

// Class Phoenix.AblBranchConditionMountFlyingSpeed
// Size: 0x48 (Inherited: 0x30)
struct UAblBranchConditionMountFlyingSpeed : UAblBranchCondition {
	struct TArray<enum class EMountFlyingGait> FlyingGaits; // 0x30(0x10)
	enum class ESpeedType SpeedType; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	float BufferSampleTime; // 0x44(0x04)
};

// Class Phoenix.AblBranchConditionMountIdleBreak
// Size: 0x30 (Inherited: 0x30)
struct UAblBranchConditionMountIdleBreak : UAblBranchCondition {
};

// Class Phoenix.AblBranchConditionMountRiderGaitSpeed
// Size: 0x48 (Inherited: 0x48)
struct UAblBranchConditionMountRiderGaitSpeed : UAblBranchConditionGaitSpeed {
};

// Class Phoenix.AblBranchMovementMode
// Size: 0x40 (Inherited: 0x30)
struct UAblBranchMovementMode : UAblBranchCondition {
	struct TArray<enum class EMovementMode> MovementModes; // 0x30(0x10)
};

// Class Phoenix.AblBranchMovementPredictedCollision
// Size: 0x38 (Inherited: 0x30)
struct UAblBranchMovementPredictedCollision : UAblBranchCondition {
	float MaxGlancingAngle; // 0x30(0x04)
	float MaxTimeFromNow; // 0x34(0x04)
};

// Class Phoenix.AblBranchMovementPredictedEvent
// Size: 0x40 (Inherited: 0x30)
struct UAblBranchMovementPredictedEvent : UAblBranchCondition {
	struct FName EventName; // 0x30(0x08)
	float TimeThreshold; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
};

// Class Phoenix.AblBranchMovementPredictedEventScratchpad
// Size: 0x38 (Inherited: 0x30)
struct UAblBranchMovementPredictedEventScratchpad : UAblTaskConditionScratchpad {
	struct UMovementPredictionComponent* MovementPredictionComponent; // 0x30(0x08)
};

// Class Phoenix.AblBranchMovementPredictedEvent_New
// Size: 0x38 (Inherited: 0x28)
struct UAblBranchMovementPredictedEvent_New : UAblTaskCondition {
	struct FName EventName; // 0x28(0x08)
	float TimeThreshold; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
};

// Class Phoenix.AblBranchConditionNPCAttackingPlayer
// Size: 0x30 (Inherited: 0x30)
struct UAblBranchConditionNPCAttackingPlayer : UAblBranchCondition {
};

// Class Phoenix.AblBranchConditionPhase
// Size: 0x40 (Inherited: 0x30)
struct UAblBranchConditionPhase : UAblBranchCondition {
	struct TArray<struct FVector2D> PhaseRanges; // 0x30(0x10)
};

// Class Phoenix.AblBranchProbability
// Size: 0x38 (Inherited: 0x30)
struct UAblBranchProbability : UAblBranchCondition {
	float Probability; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
};

// Class Phoenix.RagdollDrivenAnimationChangeBranchTaskScratchPad
// Size: 0x58 (Inherited: 0x50)
struct URagdollDrivenAnimationChangeBranchTaskScratchPad : UAblBranchTaskScratchPad {
	char pad_50[0x8]; // 0x50(0x08)
};

// Class Phoenix.RagdollDrivenAnimationChangeBranchTask
// Size: 0x118 (Inherited: 0x118)
struct URagdollDrivenAnimationChangeBranchTask : UAblBranchTask {
};

// Class Phoenix.AblBranchConditionRagdollDrivenAnimationChange
// Size: 0x30 (Inherited: 0x30)
struct UAblBranchConditionRagdollDrivenAnimationChange : UAblBranchCondition {
};

// Class Phoenix.AblBranchConditionRagdollBehaviorFound
// Size: 0x30 (Inherited: 0x30)
struct UAblBranchConditionRagdollBehaviorFound : UAblBranchCondition {
};

// Class Phoenix.AblBranchConditionRightArmState
// Size: 0x48 (Inherited: 0x30)
struct UAblBranchConditionRightArmState : UAblBranchCondition {
	struct TArray<enum class ERightArmState> RightArmStates; // 0x30(0x10)
	enum class ERightArmPriority RightArmPriority; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)
};

// Class Phoenix.AblBranchConditionSpeed
// Size: 0x40 (Inherited: 0x30)
struct UAblBranchConditionSpeed : UAblBranchCondition {
	enum class ESpeedType SpeedType; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	struct FVector2D SpeedRange; // 0x34(0x08)
	enum class ESpeedInclusivity Inclusivity; // 0x3c(0x01)
	char pad_3D[0x3]; // 0x3d(0x03)
};

// Class Phoenix.AblBranchConditionStairsAndSlopes
// Size: 0x30 (Inherited: 0x30)
struct UAblBranchConditionStairsAndSlopes : UAblBranchCondition {
};

// Class Phoenix.AblBranchConditionStairsAndSlopesDirection
// Size: 0x38 (Inherited: 0x30)
struct UAblBranchConditionStairsAndSlopesDirection : UAblBranchCondition {
	enum class EStairsDirectionState StairsDirection; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
};

// Class Phoenix.AblBranchConditionStairsAndSlopesOrientation
// Size: 0x38 (Inherited: 0x30)
struct UAblBranchConditionStairsAndSlopesOrientation : UAblBranchCondition {
	float MinAngle; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
};

// Class Phoenix.AblBranchConditionStationState
// Size: 0x38 (Inherited: 0x30)
struct UAblBranchConditionStationState : UAblBranchCondition {
	enum class EStationState StationState; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
};

// Class Phoenix.AblBranchConditionSwimFast
// Size: 0x30 (Inherited: 0x30)
struct UAblBranchConditionSwimFast : UAblBranchCondition {
};

// Class Phoenix.AblBranchConditionTargetTracker_AnyValidTargets
// Size: 0x38 (Inherited: 0x30)
struct UAblBranchConditionTargetTracker_AnyValidTargets : UAblBranchCondition {
	enum class EUseTargetTracker UseTracker; // 0x30(0x01)
	bool bReturnTrueIfTargetListEmptyThisFrame; // 0x31(0x01)
	enum class ETargetID MatchTargetID; // 0x32(0x01)
	enum class ETargetType MatchTargetType; // 0x33(0x01)
	char pad_34[0x4]; // 0x34(0x04)
};

// Class Phoenix.AblBranchConditionTier3Pivot
// Size: 0x30 (Inherited: 0x30)
struct UAblBranchConditionTier3Pivot : UAblBranchCondition {
};

// Class Phoenix.AblBranchConditionUseStairs
// Size: 0x38 (Inherited: 0x30)
struct UAblBranchConditionUseStairs : UAblBranchCondition {
	float AllowableAngleRange; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
};

// Class Phoenix.AblBranchConditionWading
// Size: 0x30 (Inherited: 0x30)
struct UAblBranchConditionWading : UAblBranchCondition {
};

// Class Phoenix.AblBranchConditionWaterDepth
// Size: 0x38 (Inherited: 0x30)
struct UAblBranchConditionWaterDepth : UAblBranchCondition {
	float GreaterThanWaterDepth; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
};

// Class Phoenix.ablBroomDismountBlendOutOffsetsScratchPad
// Size: 0x48 (Inherited: 0x28)
struct UablBroomDismountBlendOutOffsetsScratchPad : UAblAbilityTaskScratchPad {
	char pad_28[0x20]; // 0x28(0x20)
};

// Class Phoenix.ablBroomDismountBlendOutOffsetsTask
// Size: 0x70 (Inherited: 0x70)
struct UablBroomDismountBlendOutOffsetsTask : UAblAbilityTask {
};

// Class Phoenix.ablBroomMountKeepAboveGroundScratchPad
// Size: 0x38 (Inherited: 0x28)
struct UablBroomMountKeepAboveGroundScratchPad : UAblAbilityTaskScratchPad {
	char pad_28[0x10]; // 0x28(0x10)
};

// Class Phoenix.ablBroomMountKeepAboveGroundTask
// Size: 0x80 (Inherited: 0x70)
struct UablBroomMountKeepAboveGroundTask : UAblAbilityTask {
	float MinHeightAboveGround; // 0x70(0x04)
	float MaxDeltaV; // 0x74(0x04)
	float VelocityEaseSpeed; // 0x78(0x04)
	char pad_7C[0x4]; // 0x7c(0x04)
};

// Class Phoenix.AblCabbageMobilityTaskScratchPad
// Size: 0x38 (Inherited: 0x28)
struct UAblCabbageMobilityTaskScratchPad : UAblAbilityTaskScratchPad {
	bool bIsDone; // 0x28(0x01)
	char pad_29[0x3]; // 0x29(0x03)
	struct FVector VectorAwayFromAttacked; // 0x2c(0x0c)
};

// Class Phoenix.ablCabbageMobilityTask
// Size: 0xa0 (Inherited: 0x70)
struct UablCabbageMobilityTask : UAblAbilityTask {
	float Speed; // 0x70(0x04)
	float Gravity; // 0x74(0x04)
	float ArcParam; // 0x78(0x04)
	char pad_7C[0x4]; // 0x7c(0x04)
	struct UAkAudioEvent* m_actorBounceSfx; // 0x80(0x08)
	enum class ECabbage_Mobility MobilityState; // 0x88(0x01)
	char pad_89[0x3]; // 0x89(0x03)
	float JumpBoost; // 0x8c(0x04)
	float MinBounceBack; // 0x90(0x04)
	float MaxBounceBack; // 0x94(0x04)
	float Deceleration; // 0x98(0x04)
	float LandingSpeed; // 0x9c(0x04)
};

// Class Phoenix.AblCameraStackAnimationTaskScratchPad
// Size: 0x30 (Inherited: 0x28)
struct UAblCameraStackAnimationTaskScratchPad : UAblAbilityTaskScratchPad {
	struct UAnimSequence* ChosenAnimSequence; // 0x28(0x08)
};

// Class Phoenix.AblCameraStackAnimationTask
// Size: 0x1f0 (Inherited: 0x70)
struct UAblCameraStackAnimationTask : UAblAbilityTask {
	struct TArray<struct UAnimSequence*> AnimSequences; // 0x70(0x10)
	enum class ECameraStackAnimationSelection SelectionMethod; // 0x80(0x01)
	char pad_81[0x3]; // 0x81(0x03)
	float BlendInDuration; // 0x84(0x04)
	float BlendOutDuration; // 0x88(0x04)
	float CrossBlendTimeOverlap; // 0x8c(0x04)
	bool bLazyBlendOut; // 0x90(0x01)
	char pad_91[0x3]; // 0x91(0x03)
	float RetargetingHeightOffset; // 0x94(0x04)
	char pad_98[0x8]; // 0x98(0x08)
	struct FCameraStackAnimData AnimData; // 0xa0(0x150)
};

// Class Phoenix.AblCameraStackContextTask
// Size: 0x80 (Inherited: 0x70)
struct UAblCameraStackContextTask : UAblAbilityTask {
	enum class EAblCameraStackContextOperation TaskStartOperation; // 0x70(0x01)
	enum class EAblCameraStackContextOperation TaskEndOperation; // 0x71(0x01)
	char pad_72[0x2]; // 0x72(0x02)
	struct FName ContextName; // 0x74(0x08)
	char pad_7C[0x4]; // 0x7c(0x04)
};

// Class Phoenix.AblCapsulePhysicsScratchPad
// Size: 0x30 (Inherited: 0x28)
struct UAblCapsulePhysicsScratchPad : UAblAbilityTaskScratchPad {
	bool bInitLockXRotation; // 0x28(0x01)
	bool bInitLockYRotation; // 0x29(0x01)
	bool bInitLockZRotation; // 0x2a(0x01)
	char pad_2B[0x1]; // 0x2b(0x01)
	float LinearDampening; // 0x2c(0x04)
};

// Class Phoenix.AblCapsulePhysicsTask
// Size: 0x80 (Inherited: 0x70)
struct UAblCapsulePhysicsTask : UAblAbilityTask {
	bool bEnablePhysicsAtStart; // 0x70(0x01)
	bool bEnableGravityAtStart; // 0x71(0x01)
	bool bEnablePhysicsAtEnd; // 0x72(0x01)
	bool bEnableGravityAtEnd; // 0x73(0x01)
	bool bLockXRotation; // 0x74(0x01)
	bool bLockYRotation; // 0x75(0x01)
	bool bLockZRotation; // 0x76(0x01)
	char pad_77[0x1]; // 0x77(0x01)
	float LinearDampening; // 0x78(0x04)
	char pad_7C[0x4]; // 0x7c(0x04)
};

// Class Phoenix.ablCastSpellTaskScratchPad
// Size: 0x30 (Inherited: 0x28)
struct UablCastSpellTaskScratchPad : UAblAbilityTaskScratchPad {
	float ElapsedTime; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
};

// Class Phoenix.ablCastSpellTask
// Size: 0x78 (Inherited: 0x70)
struct UablCastSpellTask : UAblAbilityTask {
	struct FName Socket; // 0x70(0x08)
};

// Class Phoenix.AblCentaurSpawnMunitionTaskScratchPad
// Size: 0x30 (Inherited: 0x28)
struct UAblCentaurSpawnMunitionTaskScratchPad : UAblAbilityTaskScratchPad {
	struct AActor* EquipArrowActor; // 0x28(0x08)
};

// Class Phoenix.ablCentaurSpawnMunitionTask
// Size: 0x98 (Inherited: 0x70)
struct UablCentaurSpawnMunitionTask : UAblAbilityTask {
	struct AActor* EquipArrowClass; // 0x70(0x08)
	struct AMunitionType_Base* MunitionClass; // 0x78(0x08)
	struct FName ArrowSocketName; // 0x80(0x08)
	float MunitionSocketOffsetX; // 0x88(0x04)
	struct FName BlackboardTargetActorKeyName; // 0x8c(0x08)
	bool bTrackTargetLocation; // 0x94(0x01)
	char pad_95[0x3]; // 0x95(0x03)
};

// Class Phoenix.AblChangeCollisionCapsuleDimensionsScratchPad
// Size: 0x28 (Inherited: 0x28)
struct UAblChangeCollisionCapsuleDimensionsScratchPad : UAblAbilityTaskScratchPad {
};

// Class Phoenix.AblChangeCollisionCapsuleDimensions
// Size: 0x78 (Inherited: 0x70)
struct UAblChangeCollisionCapsuleDimensions : UAblAbilityTask {
	float CollisionCapsuleHalfHeight; // 0x70(0x04)
	float CollisionCapsuleRadius; // 0x74(0x04)
};

// Class Phoenix.AblCheckJumpLandTaskScratchPad
// Size: 0x28 (Inherited: 0x28)
struct UAblCheckJumpLandTaskScratchPad : UAblAbilityTaskScratchPad {
};

// Class Phoenix.AblCheckJumpLandTask
// Size: 0x78 (Inherited: 0x70)
struct UAblCheckJumpLandTask : UAblAbilityTask {
	bool bIsPerformTask; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
};

// Class Phoenix.ablClothTask
// Size: 0x78 (Inherited: 0x70)
struct UablClothTask : UAblAbilityTask {
	bool bEnableClothSimulation; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
};

// Class Phoenix.ablClothOptionsScratchpad
// Size: 0xc8 (Inherited: 0x28)
struct UablClothOptionsScratchpad : UAblAbilityTaskScratchPad {
	char pad_28[0xa0]; // 0x28(0xa0)
};

// Class Phoenix.ablClothOptionsTask
// Size: 0x190 (Inherited: 0x70)
struct UablClothOptionsTask : UAblAbilityTask {
	bool bPiecesListIsInclusive; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
	struct TArray<struct FCharacterPieceType> PiecesList; // 0x78(0x10)
	struct TSet<struct FClothingAssetName> ClothingAssetList; // 0x88(0x50)
	struct UIntProvider* IterationCount; // 0xd8(0x08)
	struct UIntProvider* MaxIterationCount; // 0xe0(0x08)
	struct UIntProvider* SubdivisionCount; // 0xe8(0x08)
	struct UFloatProvider* TeleportDistanceThreshold; // 0xf0(0x08)
	struct UFloatProvider* TeleportRotationThreshold; // 0xf8(0x08)
	struct UFloatProvider* ClothBlendWeight; // 0x100(0x08)
	struct UFloatProvider* ClothMaxDistanceScale; // 0x108(0x08)
	struct UFloatProvider* EdgeStiffness; // 0x110(0x08)
	struct UFloatProvider* BendingStiffness; // 0x118(0x08)
	struct UFloatProvider* AreaStiffness; // 0x120(0x08)
	struct UVector2DProvider* TetherStiffness; // 0x128(0x08)
	struct UFloatProvider* DampingCoefficient; // 0x130(0x08)
	struct UFloatProvider* DragCoefficient; // 0x138(0x08)
	struct UFloatProvider* LiftCoefficient; // 0x140(0x08)
	struct UVectorProvider* AdditionalWindVelocity; // 0x148(0x08)
	struct UFloatProvider* GravityScale; // 0x150(0x08)
	struct UVectorProvider* GravityOverride; // 0x158(0x08)
	struct UVector2DProvider* AnimDriveStiffness; // 0x160(0x08)
	struct UVector2DProvider* AnimDriveDamping; // 0x168(0x08)
	struct UFloatProvider* WindVelocityScale; // 0x170(0x08)
	struct UFloatProvider* LinearVelocityScale; // 0x178(0x08)
	struct UFloatProvider* AngularVelocityScale; // 0x180(0x08)
	struct UFloatProvider* FictitiousAngularScale; // 0x188(0x08)
};

// Class Phoenix.ablClothResetTask
// Size: 0x78 (Inherited: 0x70)
struct UablClothResetTask : UAblAbilityTask {
	enum class UablResetReset_ClothingTeleportMode ClothTeleportMode; // 0x70(0x01)
	bool bExecuteOnStart; // 0x71(0x01)
	char pad_72[0x6]; // 0x72(0x06)
};

// Class Phoenix.AblCollisionBranchConditionScratchpad
// Size: 0x38 (Inherited: 0x30)
struct UAblCollisionBranchConditionScratchpad : UAblTaskConditionScratchpad {
	char pad_30[0x8]; // 0x30(0x08)

	void HandleActorHit(struct AActor* SelfActor, struct AActor* OtherActor, struct FVector NormalImpulse, struct FHitResult& Hit); // Function Phoenix.AblCollisionBranchConditionScratchpad.HandleActorHit // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x31a3670
};

// Class Phoenix.AblCollisionBranchCondition
// Size: 0x50 (Inherited: 0x28)
struct UAblCollisionBranchCondition : UAblTaskCondition {
	enum class EAblCollisionBranchDetectionType DetectionType; // 0x28(0x01)
	char pad_29[0x3]; // 0x29(0x03)
	float DotProductLowerBound; // 0x2c(0x04)
	float DotProductUpperBound; // 0x30(0x04)
	float BranchOnImminentCollisionLength; // 0x34(0x04)
	float MinSpeed; // 0x38(0x04)
	bool bCheckForInheritance; // 0x3c(0x01)
	char pad_3D[0x3]; // 0x3d(0x03)
	struct TArray<struct AActor*> OtherActorMustBeA; // 0x40(0x10)
};

// Class Phoenix.AblComboAbility
// Size: 0xd0 (Inherited: 0xc8)
struct UAblComboAbility : UAblAbility {
	struct USpellToolRecord* ComboSpellToolRecord; // 0xc8(0x08)
};

// Class Phoenix.ablMotionAdjustTask
// Size: 0xd0 (Inherited: 0x70)
struct UablMotionAdjustTask : UAblAbilityTask {
	struct UablMotionAdjustTargetLocationGetter* TargetLocationGetter; // 0x70(0x08)
	bool bTrackTarget; // 0x78(0x01)
	bool bUseRootMotionForPrediction; // 0x79(0x01)
	bool bIgnoreMeshScale; // 0x7a(0x01)
	char pad_7B[0x1]; // 0x7b(0x01)
	float InterceptTime; // 0x7c(0x04)
	struct FVector InterceptOffset; // 0x80(0x0c)
	bool bLimitMaxImpulse; // 0x8c(0x01)
	char pad_8D[0x3]; // 0x8d(0x03)
	float MaxImpulse; // 0x90(0x04)
	enum class EAlphaBlendOption AdjustCurve; // 0x94(0x01)
	char pad_95[0x3]; // 0x95(0x03)
	struct FAlphaBlend BlendIn; // 0x98(0x30)
	bool bCanAdjustZAxis; // 0xc8(0x01)
	bool bGuaranteeOnTargetAtTaskEnd; // 0xc9(0x01)
	enum class EMovementMode TaskEndMovementMode; // 0xca(0x01)
	bool bDebugDrawEnabled; // 0xcb(0x01)
	bool bDebugDrawTranslationCorrection; // 0xcc(0x01)
	bool bDebugDrawTarget; // 0xcd(0x01)
	bool bDebugDrawRootMotion; // 0xce(0x01)
	bool bDebugDrawTransform; // 0xcf(0x01)
};

// Class Phoenix.ablCreatureAttackMotionAdjustTask
// Size: 0xd8 (Inherited: 0xd0)
struct UablCreatureAttackMotionAdjustTask : UablMotionAdjustTask {
	struct UCreatureCombatAttackData* AttackData; // 0xd0(0x08)
};

// Class Phoenix.ablTurnAdjustTaskScratchPad
// Size: 0x38 (Inherited: 0x28)
struct UablTurnAdjustTaskScratchPad : UAblAbilityTaskScratchPad {
	char pad_28[0x10]; // 0x28(0x10)
};

// Class Phoenix.ablCreatureAttackTurnAdjustTaskScratchPad
// Size: 0x58 (Inherited: 0x38)
struct UablCreatureAttackTurnAdjustTaskScratchPad : UablTurnAdjustTaskScratchPad {
	char pad_38[0x20]; // 0x38(0x20)
};

// Class Phoenix.ablTurnAdjustTask
// Size: 0xc0 (Inherited: 0x70)
struct UablTurnAdjustTask : UAblAbilityTask {
	float m_MaxAdjustAngle; // 0x70(0x04)
	bool m_TrackTarget; // 0x74(0x01)
	char pad_75[0x3]; // 0x75(0x03)
	struct FAlphaBlend m_Blend; // 0x78(0x30)
	struct UTurnAdjust_TargetDirectionGetter* m_TargetDirectionGetter; // 0xa8(0x08)
	float m_YawOffset; // 0xb0(0x04)
	bool m_bOverrideRootMotionLookAheadTime; // 0xb4(0x01)
	char pad_B5[0x3]; // 0xb5(0x03)
	float m_RootMotionLookAheadTime; // 0xb8(0x04)
	bool m_bUseTaskEndTime; // 0xbc(0x01)
	bool bGuaranteeOnTargetAtTaskEnd; // 0xbd(0x01)
	bool m_bDebugDraw; // 0xbe(0x01)
	char pad_BF[0x1]; // 0xbf(0x01)
};

// Class Phoenix.ablCreatureAttackTurnAdjustTask
// Size: 0xc8 (Inherited: 0xc0)
struct UablCreatureAttackTurnAdjustTask : UablTurnAdjustTask {
	struct UCreatureCombatAttackData* AttackData; // 0xc0(0x08)
};

// Class Phoenix.AblCreatureCurrentAnimStateTask
// Size: 0x78 (Inherited: 0x70)
struct UAblCreatureCurrentAnimStateTask : UAblAbilityTask {
	enum class ECreatureStance CurrentStance; // 0x70(0x01)
	enum class ECreatureStance NextStance; // 0x71(0x01)
	enum class ECreatureMovementSpeed CurrentGait; // 0x72(0x01)
	enum class ECreatureMovementSpeed NextGait; // 0x73(0x01)
	bool bInIdleVariation; // 0x74(0x01)
	char pad_75[0x3]; // 0x75(0x03)
};

// Class Phoenix.AblCreatureMakeNoiseTask
// Size: 0x80 (Inherited: 0x70)
struct UAblCreatureMakeNoiseTask : UAblAbilityTask {
	struct FName NoiseEventTag; // 0x70(0x08)
	float Loudness; // 0x78(0x04)
	char pad_7C[0x4]; // 0x7c(0x04)
};

// Class Phoenix.AblCreatureMoveToDesiredDirectionOverrideTask
// Size: 0x78 (Inherited: 0x70)
struct UAblCreatureMoveToDesiredDirectionOverrideTask : UAblAbilityTask {
	struct FName TargetActorOrLocationKeyName; // 0x70(0x08)
};

// Class Phoenix.AblCreatureNavLinkTeleportTask
// Size: 0x70 (Inherited: 0x70)
struct UAblCreatureNavLinkTeleportTask : UAblAbilityTask {
};

// Class Phoenix.AblCreaturePathTeleportTask
// Size: 0x70 (Inherited: 0x70)
struct UAblCreaturePathTeleportTask : UAblAbilityTask {
};

// Class Phoenix.AblCreatureSetupPathTeleportTask
// Size: 0x78 (Inherited: 0x70)
struct UAblCreatureSetupPathTeleportTask : UAblAbilityTask {
	float TeleportChanceOnStart; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)
};

// Class Phoenix.ablDeathRespawnTaskScratchPad
// Size: 0x28 (Inherited: 0x28)
struct UablDeathRespawnTaskScratchPad : UAblAbilityTaskScratchPad {
};

// Class Phoenix.ablDeathRespawnTask
// Size: 0x70 (Inherited: 0x70)
struct UablDeathRespawnTask : UAblAbilityTask {
};

// Class Phoenix.AblDisableAutoTargetingTask
// Size: 0x70 (Inherited: 0x70)
struct UAblDisableAutoTargetingTask : UAblAbilityTask {
};

// Class Phoenix.AblDisableCognitionSenseTask
// Size: 0x88 (Inherited: 0x70)
struct UAblDisableCognitionSenseTask : UAblAbilityTask {
	struct TArray<struct UAISense*> SensesToDisable; // 0x70(0x10)
	bool bForce; // 0x80(0x01)
	char pad_81[0x7]; // 0x81(0x07)
};

// Class Phoenix.ablDragonMobilityTaskScratchPad
// Size: 0x30 (Inherited: 0x28)
struct UablDragonMobilityTaskScratchPad : UAblAbilityTaskScratchPad {
	float ElapsedTime; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
};

// Class Phoenix.ablDragonMobilityTask
// Size: 0x80 (Inherited: 0x70)
struct UablDragonMobilityTask : UAblAbilityTask {
	enum class EablEnemy_DragonMobilityType MobilityType; // 0x70(0x01)
	char pad_71[0x3]; // 0x71(0x03)
	float DistFromTarget; // 0x74(0x04)
	float HeightAboveTarget; // 0x78(0x04)
	float MoveSpeed; // 0x7c(0x04)
};

// Class Phoenix.AblDugbogLungeAttackTaskScratchPad
// Size: 0x38 (Inherited: 0x28)
struct UAblDugbogLungeAttackTaskScratchPad : UAblAbilityTaskScratchPad {
	bool bIsDone; // 0x28(0x01)
	char pad_29[0x3]; // 0x29(0x03)
	struct FVector AwayVector; // 0x2c(0x0c)
};

// Class Phoenix.ablDugbogLungeAttackTask
// Size: 0xa0 (Inherited: 0x70)
struct UablDugbogLungeAttackTask : UAblAbilityTask {
	float MaxSpeed; // 0x70(0x04)
	bool useOffset; // 0x74(0x01)
	char pad_75[0x3]; // 0x75(0x03)
	float ArcParam; // 0x78(0x04)
	float Gravity; // 0x7c(0x04)
	float SlamGravity; // 0x80(0x04)
	struct FVector TargetOffset; // 0x84(0x0c)
	float MaxHeightDelta; // 0x90(0x04)
	float MaxDistance; // 0x94(0x04)
	bool continueMove; // 0x98(0x01)
	char pad_99[0x7]; // 0x99(0x07)
};

// Class Phoenix.ablEnemiesCowerTask
// Size: 0x98 (Inherited: 0x70)
struct UablEnemiesCowerTask : UAblAbilityTask {
	enum class EFacialEmotion FacialEmotion; // 0x70(0x01)
	enum class EManagedFacialEmotionPriority FacialEmotionPriority; // 0x71(0x01)
	char pad_72[0x2]; // 0x72(0x02)
	float TransitionTime; // 0x74(0x04)
	struct FGameplayTagContainer AnimTags; // 0x78(0x20)
};

// Class Phoenix.ablEnemy_AUSDecisionTaskScratchPad
// Size: 0x28 (Inherited: 0x28)
struct UablEnemy_AUSDecisionTaskScratchPad : UAblAbilityTaskScratchPad {
};

// Class Phoenix.ablEnemy_AUSDecisionTask
// Size: 0x78 (Inherited: 0x70)
struct UablEnemy_AUSDecisionTask : UAblAbilityTask {
	float DecisionBranchChance; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)
};

// Class Phoenix.AblEnemyAnimNotify
// Size: 0x48 (Inherited: 0x40)
struct UAblEnemyAnimNotify : UAblAnimNotify {
	enum class EEnemy_AbilityEvent AbilityEvent; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)
};

// Class Phoenix.AblEnemyAttackTargetSyncPointUpdaterScratchpad
// Size: 0x40 (Inherited: 0x28)
struct UAblEnemyAttackTargetSyncPointUpdaterScratchpad : UAblAvaMotionWarpSyncPointUpdaterScratchpad {
	char pad_28[0x18]; // 0x28(0x18)
};

// Class Phoenix.AblEnemyAttackTargetSyncPointUpdater
// Size: 0x30 (Inherited: 0x28)
struct UAblEnemyAttackTargetSyncPointUpdater : UAblAvaMotionWarpSyncPointUpdater {
	float DesiredDistanceToTarget; // 0x28(0x04)
	bool bAllowPositiveTravel; // 0x2c(0x01)
	bool bAllowNegativeTravel; // 0x2d(0x01)
	char pad_2E[0x2]; // 0x2e(0x02)
};

// Class Phoenix.AblEnemyChannelingCustomConditional
// Size: 0x48 (Inherited: 0x30)
struct UAblEnemyChannelingCustomConditional : UAblChannelingBase {
	struct UAblAbility* BranchAbility; // 0x30(0x08)
	bool bBreakChannelingNearInstigator; // 0x38(0x01)
	char pad_39[0x3]; // 0x39(0x03)
	float NearRange; // 0x3c(0x04)
	struct UAblAbility* BreakBranchAbility; // 0x40(0x08)
};

// Class Phoenix.AblEnemyDamageEventTask
// Size: 0xa0 (Inherited: 0x98)
struct UAblEnemyDamageEventTask : UAblDamageEventTask {
	bool bUseDamageSystem; // 0x98(0x01)
	char pad_99[0x7]; // 0x99(0x07)
};

// Class Phoenix.ablEnemyDynamicAbility
// Size: 0xc8 (Inherited: 0xc8)
struct UablEnemyDynamicAbility : UAblAbility {
};

// Class Phoenix.AblEnemyDynamicBranchTaskScratchPad
// Size: 0x60 (Inherited: 0x50)
struct UAblEnemyDynamicBranchTaskScratchPad : UAblBranchTaskScratchPad {
	float ElapsedTime; // 0x50(0x04)
	enum class EEnemy_Ability TaskState; // 0x54(0x01)
	bool BranchCriteriaFromParent; // 0x55(0x01)
	char pad_56[0xa]; // 0x56(0x0a)
};

// Class Phoenix.AblEnemyDynamicBranchTask
// Size: 0x120 (Inherited: 0x118)
struct UAblEnemyDynamicBranchTask : UAblBranchTask {
	enum class EEnemy_Ability AbilityState; // 0x118(0x01)
	char pad_119[0x7]; // 0x119(0x07)
};

// Class Phoenix.AblEnemyHoverTaskScratchPad
// Size: 0x30 (Inherited: 0x28)
struct UAblEnemyHoverTaskScratchPad : UAblAbilityTaskScratchPad {
	float ElapsedTime; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
};

// Class Phoenix.AblEnemyHoverTask
// Size: 0x90 (Inherited: 0x70)
struct UAblEnemyHoverTask : UAblAbilityTask {
	enum class EEnemyHoverTaskMode Mode; // 0x70(0x01)
	char pad_71[0x3]; // 0x71(0x03)
	float HoverTime; // 0x74(0x04)
	struct UNiagaraSystem* AttackerLocationVFX; // 0x78(0x08)
	struct UNiagaraSystem* TargetLocationVFX; // 0x80(0x08)
	struct UNiagaraSystem* AttackLandVFX; // 0x88(0x08)
};

// Class Phoenix.AblEnemyMaintainVelocityTask
// Size: 0x78 (Inherited: 0x70)
struct UAblEnemyMaintainVelocityTask : UAblAbilityTask {
	float Speed; // 0x70(0x04)
	float Gravity; // 0x74(0x04)
};

// Class Phoenix.AblEnemyMoveTaskScratchPad
// Size: 0xc0 (Inherited: 0x28)
struct UAblEnemyMoveTaskScratchPad : UAblAbilityTaskScratchPad {
	char pad_28[0x8]; // 0x28(0x08)
	struct FEnemyMoveTaskEntry MoveData; // 0x30(0x90)
};

// Class Phoenix.AblEnemyMoveTask
// Size: 0xe8 (Inherited: 0x70)
struct UAblEnemyMoveTask : UAblAbilityTask {
	enum class EAblAbilityTargetType m_Target; // 0x70(0x01)
	enum class EAblAbilityEnemyMoveVelocitySource VelocitySource; // 0x71(0x01)
	char pad_72[0x2]; // 0x72(0x02)
	struct FVector CustomVelocity; // 0x74(0x0c)
	float CustomSpeed; // 0x80(0x04)
	float ZDirectionOffset; // 0x84(0x04)
	bool bRestoreMovementMode; // 0x88(0x01)
	bool bApplyGravity; // 0x89(0x01)
	char pad_8A[0x2]; // 0x8a(0x02)
	float GravityMultiplier; // 0x8c(0x04)
	float MaxDownwardVelocityDueToGravity; // 0x90(0x04)
	bool bOverrideJumpArc; // 0x94(0x01)
	char pad_95[0x3]; // 0x95(0x03)
	float OverrideJumpArc; // 0x98(0x04)
	bool bForceApplyingGravityForJumps; // 0x9c(0x01)
	bool bDebugDrawJump; // 0x9d(0x01)
	char pad_9E[0x2]; // 0x9e(0x02)
	float SlideSpeed; // 0xa0(0x04)
	float SlideTargetTolerance; // 0xa4(0x04)
	float ZeroVelocityTolerance; // 0xa8(0x04)
	bool bApplyVelocityTowardsInstigator; // 0xac(0x01)
	char pad_AD[0x3]; // 0xad(0x03)
	float NoMovementOccuredTolerance; // 0xb0(0x04)
	float AcceptanceDistance; // 0xb4(0x04)
	bool bDiminishVelocity; // 0xb8(0x01)
	char pad_B9[0x3]; // 0xb9(0x03)
	float TimeToStop; // 0xbc(0x04)
	float DegreeOfEaseOutCurve; // 0xc0(0x04)
	bool bCanVaryTowardsInstigator; // 0xc4(0x01)
	char pad_C5[0x3]; // 0xc5(0x03)
	struct UCurveFloat* VaryingCurve; // 0xc8(0x08)
	float MinimumDistance; // 0xd0(0x04)
	bool bDiminishVelocityDueToGravity; // 0xd4(0x01)
	char pad_D5[0x3]; // 0xd5(0x03)
	float OnGroundDetectionDistance; // 0xd8(0x04)
	bool bIgnoreAllFloorHits; // 0xdc(0x01)
	bool bSlideAcrossGroundInitially; // 0xdd(0x01)
	bool bSlideAcrossGroundAlways; // 0xde(0x01)
	bool bLockZPosition; // 0xdf(0x01)
	bool bCutOffMovement; // 0xe0(0x01)
	char pad_E1[0x3]; // 0xe1(0x03)
	float CutoffDistance; // 0xe4(0x04)
};

// Class Phoenix.ablExecuteTaskSubScratchPad
// Size: 0x28 (Inherited: 0x28)
struct UablExecuteTaskSubScratchPad : UObject {
};

// Class Phoenix.ExecuteTask
// Size: 0x28 (Inherited: 0x28)
struct UExecuteTask : UObject {
};

// Class Phoenix.ablExecuteTaskScratchPad
// Size: 0x30 (Inherited: 0x28)
struct UablExecuteTaskScratchPad : UAblAbilityTaskScratchPad {
	struct UablExecuteTaskSubScratchPad* SubTaskScratchPad; // 0x28(0x08)
};

// Class Phoenix.ablExecuteTask
// Size: 0x78 (Inherited: 0x70)
struct UablExecuteTask : UAblAbilityTask {
	struct UExecuteTask* ExecuteTask; // 0x70(0x08)
};

// Class Phoenix.ablFacialAnimationScratchpad
// Size: 0x38 (Inherited: 0x28)
struct UablFacialAnimationScratchpad : UAblAbilityTaskScratchPad {
	char pad_28[0x10]; // 0x28(0x10)
};

// Class Phoenix.ablFacialAnimationStateTask
// Size: 0xa8 (Inherited: 0x70)
struct UablFacialAnimationStateTask : UAblAbilityTask {
	struct FFacialAnimation FacialAnimation; // 0x70(0x30)
	enum class EManagedFacialAnimationPriority FacialAnimationPriority; // 0xa0(0x01)
	char pad_A1[0x7]; // 0xa1(0x07)
};

// Class Phoenix.ablFacialEmotionScratchpad
// Size: 0x28 (Inherited: 0x28)
struct UablFacialEmotionScratchpad : UAblAbilityTaskScratchPad {
};

// Class Phoenix.ablFacialEmotionStateTask
// Size: 0x98 (Inherited: 0x70)
struct UablFacialEmotionStateTask : UAblAbilityTask {
	enum class EFacialEmotion FacialEmotion; // 0x70(0x01)
	enum class EManagedFacialEmotionPriority FacialEmotionPriority; // 0x71(0x01)
	char pad_72[0x2]; // 0x72(0x02)
	float TransitionTime; // 0x74(0x04)
	struct FGameplayTagContainer AnimTags; // 0x78(0x20)
};

// Class Phoenix.AblFlightAnimStateTask
// Size: 0x78 (Inherited: 0x70)
struct UAblFlightAnimStateTask : UAblAbilityTask {
	bool bIsGliding; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
};

// Class Phoenix.AblFlyToLocationScratchpad
// Size: 0x38 (Inherited: 0x28)
struct UAblFlyToLocationScratchpad : UAblAbilityTaskScratchPad {
	char pad_28[0x10]; // 0x28(0x10)
};

// Class Phoenix.AblFlyToLocationTaskBase
// Size: 0x70 (Inherited: 0x70)
struct UAblFlyToLocationTaskBase : UAblAbilityTask {
};

// Class Phoenix.AblGameLogicSwitchBranchTaskScratchPad
// Size: 0x48 (Inherited: 0x28)
struct UAblGameLogicSwitchBranchTaskScratchPad : UAblAbilityTaskScratchPad {
	struct TArray<struct UGameLogicBoolBase*> BoolResults; // 0x28(0x10)
	struct TArray<struct UAblAbility*> Abilities; // 0x38(0x10)
};

// Class Phoenix.AblGameLogicSwitchBranchTask
// Size: 0x138 (Inherited: 0x70)
struct UAblGameLogicSwitchBranchTask : UAblAbilityTask {
	struct TMap<struct FName_GameLogicBoolResult, struct UAblAbility*> BoolResultToAbility; // 0x70(0x50)
	struct UAblAbility* DefaultAbility; // 0xc0(0x08)
	bool m_CopyTargetsOnBranch; // 0xc8(0x01)
	bool m_bOverrideTransitionBlend; // 0xc9(0x01)
	bool m_bOverrideTransitionBlendOut; // 0xca(0x01)
	char pad_CB[0x5]; // 0xcb(0x05)
	struct FAlphaBlend m_TransitionBlend; // 0xd0(0x30)
	struct FAlphaBlend m_TransitionBlendOut; // 0x100(0x30)
	bool bClampBlendOutTime; // 0x130(0x01)
	enum class EEvaluatorRootMotion m_UseSourceRootMotion; // 0x131(0x01)
	enum class EEvaluatorRootMotion m_UseDestRootMotion; // 0x132(0x01)
	bool m_OverrideRootMotion; // 0x133(0x01)
	bool m_OverrideBlendTickStyle; // 0x134(0x01)
	enum class EAnimBlendTickStyle m_BlendTickStyle; // 0x135(0x01)
	char pad_136[0x2]; // 0x136(0x02)
};

// Class Phoenix.ablGameLogicTask
// Size: 0x80 (Inherited: 0x70)
struct UablGameLogicTask : UAblAbilityTask {
	struct FName_GameLogicVarBool BoolVar; // 0x70(0x08)
	struct FName_GameLogicVarInt32 Int32Var; // 0x78(0x08)
};

// Class Phoenix.AblGameRenderStencil
// Size: 0x80 (Inherited: 0x70)
struct UAblGameRenderStencil : UAblAbilityTask {
	struct FStencilManagerEffectName StencilEffect; // 0x70(0x08)
	bool resetStencilOnExit; // 0x78(0x01)
	char pad_79[0x7]; // 0x79(0x07)
};

// Class Phoenix.AblHeadTrackingTaskScratchPad
// Size: 0x28 (Inherited: 0x28)
struct UAblHeadTrackingTaskScratchPad : UAblAbilityTaskScratchPad {
};

// Class Phoenix.AblHeadTrackingTask
// Size: 0x70 (Inherited: 0x70)
struct UAblHeadTrackingTask : UAblAbilityTask {
};

// Class Phoenix.AblHideAndDisableCharacterScratchpad
// Size: 0x28 (Inherited: 0x28)
struct UAblHideAndDisableCharacterScratchpad : UAblAbilityTaskScratchPad {
};

// Class Phoenix.AblHideAndDisableCharacterTask
// Size: 0x70 (Inherited: 0x70)
struct UAblHideAndDisableCharacterTask : UAblAbilityTask {
};

// Class Phoenix.ablIKBlendTaskScratchPad
// Size: 0x28 (Inherited: 0x28)
struct UablIKBlendTaskScratchPad : UAblAbilityTaskScratchPad {
};

// Class Phoenix.ablIKBlendTask
// Size: 0x80 (Inherited: 0x70)
struct UablIKBlendTask : UAblAbilityTask {
	bool bDisableAllIK; // 0x70(0x01)
	bool bDisableFloorContact; // 0x71(0x01)
	bool bDisableLookAt; // 0x72(0x01)
	bool bDisablePoseFixup; // 0x73(0x01)
	float BlendOutDuration; // 0x74(0x04)
	float BlendInDuration; // 0x78(0x04)
	enum class EAnimationDirectionSource LowestAllowedLookAtPriority; // 0x7c(0x01)
	char pad_7D[0x3]; // 0x7d(0x03)
};

// Class Phoenix.ablIKLedgeContactTask
// Size: 0x80 (Inherited: 0x70)
struct UablIKLedgeContactTask : UAblAbilityTask {
	float BlendInDuration; // 0x70(0x04)
	float BlendOutDuration; // 0x74(0x04)
	bool bLockHandsToLedge; // 0x78(0x01)
	char pad_79[0x7]; // 0x79(0x07)
};

// Class Phoenix.ablIKPoseFixupTaskScratchPad
// Size: 0x38 (Inherited: 0x28)
struct UablIKPoseFixupTaskScratchPad : UAblAbilityTaskScratchPad {
	char pad_28[0x10]; // 0x28(0x10)
};

// Class Phoenix.ablIKPoseFixupTask
// Size: 0x130 (Inherited: 0x70)
struct UablIKPoseFixupTask : UAblAbilityTask {
	struct FIKPoseFixupDefinition Definition; // 0x70(0xc0)
};

// Class Phoenix.ablImpulseToTargetTaskScratchPad
// Size: 0x30 (Inherited: 0x28)
struct UablImpulseToTargetTaskScratchPad : UAblAbilityTaskScratchPad {
	float ElapsedTime; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
};

// Class Phoenix.ablImpulseToTargetTask
// Size: 0xa8 (Inherited: 0x70)
struct UablImpulseToTargetTask : UAblAbilityTask {
	float DistFromTarget; // 0x70(0x04)
	float MaxTravelDist; // 0x74(0x04)
	bool bAllowNegative; // 0x78(0x01)
	bool bAllowPositive; // 0x79(0x01)
	bool bStopOnTargetHit; // 0x7a(0x01)
	bool bAddCapsuleRadiusToDistanceFromTarget; // 0x7b(0x01)
	float CapsuleRadiusMultiplier; // 0x7c(0x04)
	bool bAddTargetCapsuleRadiusToDistanceFromTarget; // 0x80(0x01)
	bool bOnlyTowardsAvatar; // 0x81(0x01)
	bool bApplyCurrentHeightAsOffset; // 0x82(0x01)
	bool bApplyCustomOffset; // 0x83(0x01)
	struct FVector CustomOffset; // 0x84(0x0c)
	bool bUseForImpact; // 0x90(0x01)
	bool bTrackTarget; // 0x91(0x01)
	bool bTrackLateral; // 0x92(0x01)
	char pad_93[0x1]; // 0x93(0x01)
	float TrackTargetMinDist; // 0x94(0x04)
	float TrackTargetMaxDist; // 0x98(0x04)
	bool bUseMaxHeadingFromFwd; // 0x9c(0x01)
	char pad_9D[0x3]; // 0x9d(0x03)
	float MaxHeadingFromFwd; // 0xa0(0x04)
	char pad_A4[0x4]; // 0xa4(0x04)
};

// Class Phoenix.ablInputContextTaskScratchPad
// Size: 0x30 (Inherited: 0x28)
struct UablInputContextTaskScratchPad : UAblAbilityTaskScratchPad {
	bool bAllowModifyContexts; // 0x28(0x01)
	char pad_29[0x7]; // 0x29(0x07)

	void LeafNodeSwitched(); // Function Phoenix.ablInputContextTaskScratchPad.LeafNodeSwitched // (Final|Native|Public) // @ game+0x31abe60
};

// Class Phoenix.ablInputContextTask
// Size: 0x88 (Inherited: 0x70)
struct UablInputContextTask : UAblAbilityTask {
	struct TArray<struct FInputContextWithType> Contexts; // 0x70(0x10)
	enum class EContextTaskOperationType ContextTaskOperation; // 0x80(0x01)
	bool bOnlyDoOperationDuringCombatMode; // 0x81(0x01)
	bool bOnlyDoOperationInNonCombatMode; // 0x82(0x01)
	char pad_83[0x5]; // 0x83(0x05)
};

// Class Phoenix.AblJuggernautTask
// Size: 0x70 (Inherited: 0x70)
struct UAblJuggernautTask : UAblAbilityTask {
};

// Class Phoenix.ablJumpAdjustTaskScratchPad
// Size: 0x68 (Inherited: 0x28)
struct UablJumpAdjustTaskScratchPad : UAblAbilityTaskScratchPad {
	char pad_28[0x40]; // 0x28(0x40)
};

// Class Phoenix.ablJumpAdjustTask
// Size: 0xd8 (Inherited: 0x70)
struct UablJumpAdjustTask : UAblAbilityTask {
	struct FVector2D NormalLandingOffset; // 0x70(0x08)
	struct FVector2D IdealKneeLandingOffset; // 0x78(0x08)
	struct FVector2D IdealWaistLandingOffset; // 0x80(0x08)
	struct FVector2D IdealHandLandingOffset; // 0x88(0x08)
	float MaximumLedgeHeight; // 0x90(0x04)
	bool bLimitMaxImpulse; // 0x94(0x01)
	char pad_95[0x3]; // 0x95(0x03)
	float MaxImpulse; // 0x98(0x04)
	char pad_9C[0x4]; // 0x9c(0x04)
	struct FAlphaBlend BlendIn; // 0xa0(0x30)
	bool bDebugDrawEnabled; // 0xd0(0x01)
	char pad_D1[0x7]; // 0xd1(0x07)
};

// Class Phoenix.AblJumpTaskScratchPad
// Size: 0x28 (Inherited: 0x28)
struct UAblJumpTaskScratchPad : UAblAbilityTaskScratchPad {
};

// Class Phoenix.AblJumpTask
// Size: 0x70 (Inherited: 0x70)
struct UAblJumpTask : UAblAbilityTask {
};

// Class Phoenix.AblLeavingNavMeshScratchpad
// Size: 0x30 (Inherited: 0x30)
struct UAblLeavingNavMeshScratchpad : UAblTaskConditionScratchpad {
};

// Class Phoenix.AblLeavingNavMeshTaskCondition
// Size: 0x38 (Inherited: 0x28)
struct UAblLeavingNavMeshTaskCondition : UAblTaskCondition {
	float MinSpeed; // 0x28(0x04)
	float Distance; // 0x2c(0x04)
	float DotProductCheck; // 0x30(0x04)
	bool bCheckForCollision; // 0x34(0x01)
	char pad_35[0x3]; // 0x35(0x03)
};

// Class Phoenix.ablLedgeAssistTaskScratchPad
// Size: 0x88 (Inherited: 0x28)
struct UablLedgeAssistTaskScratchPad : UAblAbilityTaskScratchPad {
	struct TArray<struct FLedgeAssistTaskEntry> InProgressTurn; // 0x28(0x10)
	struct FVector StartingRootPos; // 0x38(0x0c)
	struct FVector DeltaRootPos; // 0x44(0x0c)
	struct FVector DeltaAdded; // 0x50(0x0c)
	struct FRotator DeltaRotation; // 0x5c(0x0c)
	struct FRotator RotationAdded; // 0x68(0x0c)
	float ElapsedTime; // 0x74(0x04)
	float AblitityLength; // 0x78(0x04)
	struct FRotator StartingRotation; // 0x7c(0x0c)
};

// Class Phoenix.ablLedgeAssistTask
// Size: 0x90 (Inherited: 0x70)
struct UablLedgeAssistTask : UAblAbilityTask {
	float DesiredRootUpOffsetM; // 0x70(0x04)
	float DesiredRootNormalOffsetM; // 0x74(0x04)
	float DesiredRootUpOffsetF; // 0x78(0x04)
	float DesiredRootNormalOffsetF; // 0x7c(0x04)
	float DesiredRootUpOffsetC; // 0x80(0x04)
	bool AlignRotation; // 0x84(0x01)
	char pad_85[0x3]; // 0x85(0x03)
	float RotationOffset; // 0x88(0x04)
	bool AlignToMount; // 0x8c(0x01)
	bool TurnOffCollisionDuringAlign; // 0x8d(0x01)
	char pad_8E[0x2]; // 0x8e(0x02)
};

// Class Phoenix.AblLookupBranchTask
// Size: 0x110 (Inherited: 0x70)
struct UAblLookupBranchTask : UAblAbilityTask {
	struct UInteractionArchitectAsset* InteractionArchitectAsset; // 0x70(0x08)
	enum class EInteractionProject Project; // 0x78(0x01)
	char pad_79[0x7]; // 0x79(0x07)
	struct FGameplayTagContainer Tags; // 0x80(0x20)
	struct FGameplayTagContainer TargetTags; // 0xa0(0x20)
	struct TArray<struct UAblBranchCondition*> Conditions; // 0xc0(0x10)
	bool bMustPassAllConditions; // 0xd0(0x01)
	bool bCopyTargetsOnBranch; // 0xd1(0x01)
	bool bOverrideTransitionBlend; // 0xd2(0x01)
	char pad_D3[0x5]; // 0xd3(0x05)
	struct FAlphaBlend TransitionBlend; // 0xd8(0x30)
	bool bClampBlendOutTime; // 0x108(0x01)
	char pad_109[0x7]; // 0x109(0x07)
};

// Class Phoenix.AblConditionalLookupBranchTask
// Size: 0xf8 (Inherited: 0xc0)
struct UAblConditionalLookupBranchTask : UAblConditionalBranchTaskBase {
	struct UInteractionArchitectAsset* InteractionArchitectAsset; // 0xc0(0x08)
	enum class EInteractionProject Project; // 0xc8(0x01)
	char pad_C9[0x7]; // 0xc9(0x07)
	struct FGameplayTagContainer Tags; // 0xd0(0x20)
	bool bAllowBranchingIntoCurrentAbility; // 0xf0(0x01)
	char pad_F1[0x7]; // 0xf1(0x07)
};

// Class Phoenix.ablMotionAdjustTargetLocationGetter
// Size: 0x28 (Inherited: 0x28)
struct UablMotionAdjustTargetLocationGetter : UObject {
};

// Class Phoenix.ablMotionAdjustCreatureAttackLocationGetter
// Size: 0x28 (Inherited: 0x28)
struct UablMotionAdjustCreatureAttackLocationGetter : UablMotionAdjustTargetLocationGetter {
};

// Class Phoenix.ablMotionAdjustBlackboardLocationGetter
// Size: 0x30 (Inherited: 0x28)
struct UablMotionAdjustBlackboardLocationGetter : UablMotionAdjustTargetLocationGetter {
	struct FName BlackboardKeyName; // 0x28(0x08)
};

// Class Phoenix.ablMotionAdjustLedgeLocationGetter
// Size: 0x28 (Inherited: 0x28)
struct UablMotionAdjustLedgeLocationGetter : UablMotionAdjustTargetLocationGetter {
};

// Class Phoenix.ablMotionAdjustJumpDownLocationGetter
// Size: 0x28 (Inherited: 0x28)
struct UablMotionAdjustJumpDownLocationGetter : UablMotionAdjustTargetLocationGetter {
};

// Class Phoenix.ablMotionAdjustClimbingLadderLocationGetter
// Size: 0x30 (Inherited: 0x28)
struct UablMotionAdjustClimbingLadderLocationGetter : UablMotionAdjustTargetLocationGetter {
	enum class EClimbingLadderState ClimbingLadderState; // 0x28(0x01)
	char pad_29[0x7]; // 0x29(0x07)
};

// Class Phoenix.ablMotionAdjustTaskScratchPad
// Size: 0x90 (Inherited: 0x28)
struct UablMotionAdjustTaskScratchPad : UAblAbilityTaskScratchPad {
	char pad_28[0x68]; // 0x28(0x68)
};

// Class Phoenix.AblTaskMotionWarpWindowFinder
// Size: 0x38 (Inherited: 0x38)
struct UAblTaskMotionWarpWindowFinder : UAvaMotionWarpWindowFinder {
};

// Class Phoenix.AblMotionWarpScratchpad
// Size: 0x50 (Inherited: 0x28)
struct UAblMotionWarpScratchpad : UAblAbilityTaskScratchPad {
	char pad_28[0x18]; // 0x28(0x18)
	struct TArray<struct UAblTaskConditionScratchpad*> BranchConditionScratchpads; // 0x40(0x10)
};

// Class Phoenix.AblMotionWarpTask
// Size: 0x90 (Inherited: 0x70)
struct UAblMotionWarpTask : UAblAbilityTask {
	struct UAvaMotionWarpingModifierConfig* RootMotionModifierConfig; // 0x70(0x08)
	struct TArray<struct UAblTaskCondition*> Conditions; // 0x78(0x10)
	bool bMustPassAllConditions; // 0x88(0x01)
	char pad_89[0x7]; // 0x89(0x07)
};

// Class Phoenix.AblMotionWarpWindowFinder
// Size: 0x40 (Inherited: 0x38)
struct UAblMotionWarpWindowFinder : UAvaMotionWarpWindowFinder {
	struct UAblAbilityComponent* AblAbilityComponent; // 0x38(0x08)
};

// Class Phoenix.AblMountFlightAnimStateTask
// Size: 0x78 (Inherited: 0x70)
struct UAblMountFlightAnimStateTask : UAblAbilityTask {
	enum class EMountFlyingGait MountFlyingGait; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
};

// Class Phoenix.AblMountPlayingIdleBreakTask
// Size: 0x70 (Inherited: 0x70)
struct UAblMountPlayingIdleBreakTask : UAblAbilityTask {
};

// Class Phoenix.AblMountIdleBreakCameraTask
// Size: 0x70 (Inherited: 0x70)
struct UAblMountIdleBreakCameraTask : UAblAbilityTask {
};

// Class Phoenix.AblMountRiderAbleEventTask
// Size: 0x78 (Inherited: 0x70)
struct UAblMountRiderAbleEventTask : UAblAbilityTask {
	struct FName EventName; // 0x70(0x08)
};

// Class Phoenix.AblMountTransitionAdjustTask
// Size: 0x120 (Inherited: 0x70)
struct UAblMountTransitionAdjustTask : UAblAbilityTask {
	struct FName CreatureMountSocketName; // 0x70(0x08)
	struct FName CreatureTransitionBoneName; // 0x78(0x08)
	struct FName CreatureAttachSocketName; // 0x80(0x08)
	float AttachBlendTime; // 0x88(0x04)
	float MaxInterpolateFactor; // 0x8c(0x04)
	struct FRuntimeFloatCurve InterpolateWeightCurve; // 0x90(0x88)
	bool bDrawDebug; // 0x118(0x01)
	char pad_119[0x7]; // 0x119(0x07)
};

// Class Phoenix.MatchAnimationPositionCharacterGetter
// Size: 0x28 (Inherited: 0x28)
struct UMatchAnimationPositionCharacterGetter : UObject {
};

// Class Phoenix.MatchAnimationPositionMountRiderGetter
// Size: 0x28 (Inherited: 0x28)
struct UMatchAnimationPositionMountRiderGetter : UMatchAnimationPositionCharacterGetter {
};

// Class Phoenix.AblMovementModeTaskScratchPad
// Size: 0x30 (Inherited: 0x28)
struct UAblMovementModeTaskScratchPad : UAblAbilityTaskScratchPad {
	enum class EMovementMode OriginalMovementMode; // 0x28(0x01)
	char pad_29[0x7]; // 0x29(0x07)
};

// Class Phoenix.AblMovementModeTask
// Size: 0x78 (Inherited: 0x70)
struct UAblMovementModeTask : UAblAbilityTask {
	enum class EMovementMode StartMovement; // 0x70(0x01)
	bool bUseEndMovement; // 0x71(0x01)
	enum class EMovementMode EndMovement; // 0x72(0x01)
	char pad_73[0x5]; // 0x73(0x05)
};

// Class Phoenix.AblMoveTask
// Size: 0xb0 (Inherited: 0x70)
struct UAblMoveTask : UAblAbilityTask {
	enum class EAblMoveTaskVelocitySource VelocitySource; // 0x70(0x01)
	char pad_71[0x3]; // 0x71(0x03)
	struct FVector CustomVelocity; // 0x74(0x0c)
	enum class EAblMoveTaskBallisticDestinationSource DestSource; // 0x80(0x01)
	bool bApplyGravity; // 0x81(0x01)
	char pad_82[0x2]; // 0x82(0x02)
	float OverrideGravity; // 0x84(0x04)
	float ArcParamMin; // 0x88(0x04)
	float ArcParamMax; // 0x8c(0x04)
	float TimeMult; // 0x90(0x04)
	struct FVector TargetOffset; // 0x94(0x0c)
	float Distance; // 0xa0(0x04)
	float MaxDistance; // 0xa4(0x04)
	bool bIgnoreNonStatic; // 0xa8(0x01)
	bool bCollateralDamage; // 0xa9(0x01)
	char pad_AA[0x6]; // 0xaa(0x06)
};

// Class Phoenix.ablNamedEventTaskScratchPad
// Size: 0x30 (Inherited: 0x28)
struct UablNamedEventTaskScratchPad : UAblAbilityTaskScratchPad {
	float ElapsedTime; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
};

// Class Phoenix.ablNamedEventTask
// Size: 0x78 (Inherited: 0x70)
struct UablNamedEventTask : UAblAbilityTask {
	struct FName Event; // 0x70(0x08)
};

// Class Phoenix.AblNewCamTaskScratchPad
// Size: 0x28 (Inherited: 0x28)
struct UAblNewCamTaskScratchPad : UAblAbilityTaskScratchPad {
};

// Class Phoenix.AblNewCamTask
// Size: 0xa8 (Inherited: 0x70)
struct UAblNewCamTask : UAblAbilityTask {
	struct TArray<struct FCameraProperties> camProperties; // 0x70(0x10)
	float customCameraWeight; // 0x80(0x04)
	enum class LookAtType LookAtTarget; // 0x84(0x01)
	bool alwaysLookAtTarget; // 0x85(0x01)
	bool SequentiallyPlayAllCameras; // 0x86(0x01)
	bool Disable; // 0x87(0x01)
	char pad_88[0x20]; // 0x88(0x20)
};

// Class Phoenix.ablNiagaraPlayEffectTaskScratchPad
// Size: 0x38 (Inherited: 0x28)
struct UablNiagaraPlayEffectTaskScratchPad : UAblAbilityTaskScratchPad {
	float ElapsedTime; // 0x28(0x04)
	char pad_2C[0xc]; // 0x2c(0x0c)
};

// Class Phoenix.ablNiagaraPlayEffectTask
// Size: 0xb0 (Inherited: 0x70)
struct UablNiagaraPlayEffectTask : UAblAbilityTask {
	struct UNiagaraSystem* NiagaraVFX; // 0x70(0x08)
	bool bAttachToWand; // 0x78(0x01)
	bool bAttachToSocket; // 0x79(0x01)
	char pad_7A[0x2]; // 0x7a(0x02)
	struct FName BlackboardKeyName; // 0x7c(0x08)
	bool bDestroyAtTaskEnd; // 0x84(0x01)
	char pad_85[0x3]; // 0x85(0x03)
	float DestroyComponentDelay; // 0x88(0x04)
	struct FName m_Socket; // 0x8c(0x08)
	bool bUseSpawnRateMultiply; // 0x94(0x01)
	char pad_95[0x3]; // 0x95(0x03)
	float SpawnRateMultiply; // 0x98(0x04)
	char pad_9C[0x14]; // 0x9c(0x14)

	void DestroyNiagraEffects(struct UNiagaraComponent* InNiagaraComponent); // Function Phoenix.ablNiagaraPlayEffectTask.DestroyNiagraEffects // (Final|Native|Protected) // @ game+0x31abdd0
};

// Class Phoenix.ablNPC_AnimUtilTaskScratchPad
// Size: 0x30 (Inherited: 0x28)
struct UablNPC_AnimUtilTaskScratchPad : UAblAbilityTaskScratchPad {
	float ElapsedTime; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
};

// Class Phoenix.ablNPC_AnimUtilTask
// Size: 0x78 (Inherited: 0x70)
struct UablNPC_AnimUtilTask : UAblAbilityTask {
	enum class EEnemy_Ability BranchToAbilityOnRelease; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
};

// Class Phoenix.NPCAbl_BranchCondition_MoveTurn
// Size: 0x38 (Inherited: 0x30)
struct UNPCAbl_BranchCondition_MoveTurn : UAblBranchCondition {
	float MinThresholdAngleDeg; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
};

// Class Phoenix.AblNPC_DilateTaskScratchPad
// Size: 0x30 (Inherited: 0x28)
struct UAblNPC_DilateTaskScratchPad : UAblAbilityTaskScratchPad {
	char pad_28[0x8]; // 0x28(0x08)
};

// Class Phoenix.AblNPC_DilateTask
// Size: 0x80 (Inherited: 0x70)
struct UAblNPC_DilateTask : UAblAbilityTask {
	enum class ENPC_DilateSource Source; // 0x70(0x01)
	char pad_71[0x3]; // 0x71(0x03)
	float DilationParam; // 0x74(0x04)
	float DilationTime; // 0x78(0x04)
	char pad_7C[0x4]; // 0x7c(0x04)
};

// Class Phoenix.ablNPC_MobilityTurnAssistTask
// Size: 0x78 (Inherited: 0x70)
struct UablNPC_MobilityTurnAssistTask : UAblAbilityTask {
	enum class ENPC_TurnAssist TurnAssistMode; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
};

// Class Phoenix.AblNPC_ParryAdvanceTaskScratchPad
// Size: 0x30 (Inherited: 0x28)
struct UAblNPC_ParryAdvanceTaskScratchPad : UAblAbilityTaskScratchPad {
	char pad_28[0x8]; // 0x28(0x08)
};

// Class Phoenix.AblNPC_ParryAdvanceTask
// Size: 0x90 (Inherited: 0x70)
struct UAblNPC_ParryAdvanceTask : UAblAbilityTask {
	enum class EEnemy_ParryWindowType Type; // 0x70(0x01)
	bool bKeepWindowOpen; // 0x71(0x01)
	bool bTriggerFiredEvent; // 0x72(0x01)
	enum class EEnemy_ParryType FiredEventType; // 0x73(0x01)
	bool bOverrideDBParryLeadIn; // 0x74(0x01)
	char pad_75[0x3]; // 0x75(0x03)
	float ParryLeadIn; // 0x78(0x04)
	bool bOverrideDBParryToRelease; // 0x7c(0x01)
	char pad_7D[0x3]; // 0x7d(0x03)
	float ParryToRelease; // 0x80(0x04)
	bool bOverrideDBCounterType; // 0x84(0x01)
	enum class EEnemy_ParryCounterType OverrideCounterType; // 0x85(0x01)
	bool bOverrideDBResponseType; // 0x86(0x01)
	enum class EEnemy_ParryResponseType OverrideResponseType; // 0x87(0x01)
	bool bOverrideDBCounterStepDirection; // 0x88(0x01)
	enum class EEnemy_ParryCounterStepDirection OverrideCounterStepDirection; // 0x89(0x01)
	bool bOverrideDBCounterStyle; // 0x8a(0x01)
	enum class EEnemy_ParryCounterStyle OverrideCounterStyle; // 0x8b(0x01)
	bool bOverrideDBDodgeStyle; // 0x8c(0x01)
	enum class EEnemy_ParryDodgeStyle OverrideDodgeStyle; // 0x8d(0x01)
	char pad_8E[0x2]; // 0x8e(0x02)
};

// Class Phoenix.AblNPC_ParryAnimationFireTaskScratchPad
// Size: 0x30 (Inherited: 0x28)
struct UAblNPC_ParryAnimationFireTaskScratchPad : UAblAbilityTaskScratchPad {
	char pad_28[0x8]; // 0x28(0x08)
};

// Class Phoenix.AblNPC_ParryAnimationFireTask
// Size: 0x70 (Inherited: 0x70)
struct UAblNPC_ParryAnimationFireTask : UAblAbilityTask {
};

// Class Phoenix.AblNPC_ParryExternalLeadInTaskScratchPad
// Size: 0x30 (Inherited: 0x28)
struct UAblNPC_ParryExternalLeadInTaskScratchPad : UAblAbilityTaskScratchPad {
	char pad_28[0x8]; // 0x28(0x08)
};

// Class Phoenix.AblNPC_ParryExternalLeadInTask
// Size: 0x78 (Inherited: 0x70)
struct UAblNPC_ParryExternalLeadInTask : UAblAbilityTask {
	float DistanceTrigger; // 0x70(0x04)
	float AdditionalLeadInTime; // 0x74(0x04)
};

// Class Phoenix.AblNPC_ParryLeadInLoopingTaskScratchPad
// Size: 0x40 (Inherited: 0x28)
struct UAblNPC_ParryLeadInLoopingTaskScratchPad : UAblAbilityTaskScratchPad {
	char pad_28[0x18]; // 0x28(0x18)
};

// Class Phoenix.AblNPC_ParryLeadInLoopingTask
// Size: 0x90 (Inherited: 0x70)
struct UAblNPC_ParryLeadInLoopingTask : UAblAbilityTask {
	bool bOverrideRunAtDataLeadInTime; // 0x70(0x01)
	char pad_71[0x3]; // 0x71(0x03)
	float ParryLeadIn; // 0x74(0x04)
	bool bOverrideDBParryToRelease; // 0x78(0x01)
	char pad_79[0x3]; // 0x79(0x03)
	float ParryToRelease; // 0x7c(0x04)
	bool bOverrideDBCounterType; // 0x80(0x01)
	enum class EEnemy_ParryCounterType OverrideCounterType; // 0x81(0x01)
	bool bOverrideDBResponseType; // 0x82(0x01)
	enum class EEnemy_ParryResponseType OverrideResponseType; // 0x83(0x01)
	bool bOverrideDBCounterStepDirection; // 0x84(0x01)
	enum class EEnemy_ParryCounterStepDirection OverrideCounterStepDirection; // 0x85(0x01)
	bool bOverrideDBCounterStyle; // 0x86(0x01)
	enum class EEnemy_ParryCounterStyle OverrideCounterStyle; // 0x87(0x01)
	bool bOverrideDBDodgeStyle; // 0x88(0x01)
	enum class EEnemy_ParryDodgeStyle OverrideDodgeStyle; // 0x89(0x01)
	bool bParryWindowPersistPastImpact; // 0x8a(0x01)
	bool bParryWindowForceCloseOnTaskEnd; // 0x8b(0x01)
	char pad_8C[0x4]; // 0x8c(0x04)
};

// Class Phoenix.AblNPC_ParryLeadInPreLoopingTaskScratchPad
// Size: 0x38 (Inherited: 0x28)
struct UAblNPC_ParryLeadInPreLoopingTaskScratchPad : UAblAbilityTaskScratchPad {
	char pad_28[0x10]; // 0x28(0x10)
};

// Class Phoenix.AblNPC_ParryLeadInPreLoopingTask
// Size: 0x78 (Inherited: 0x70)
struct UAblNPC_ParryLeadInPreLoopingTask : UAblAbilityTask {
	bool bParryWindowPersistPastImpact; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
};

// Class Phoenix.AblNPC_ParryLeadInTaskScratchPad
// Size: 0x30 (Inherited: 0x28)
struct UAblNPC_ParryLeadInTaskScratchPad : UAblAbilityTaskScratchPad {
	char pad_28[0x8]; // 0x28(0x08)
};

// Class Phoenix.AblNPC_ParryLeadInTask
// Size: 0x80 (Inherited: 0x70)
struct UAblNPC_ParryLeadInTask : UAblAbilityTask {
	bool bOverrideDBParryLeadIn; // 0x70(0x01)
	char pad_71[0x3]; // 0x71(0x03)
	float ParryLeadIn; // 0x74(0x04)
	float CustomProjectileSpeed; // 0x78(0x04)
	char pad_7C[0x4]; // 0x7c(0x04)
};

// Class Phoenix.AblNPC_ParryReleaseTaskScratchPad
// Size: 0x30 (Inherited: 0x28)
struct UAblNPC_ParryReleaseTaskScratchPad : UAblAbilityTaskScratchPad {
	char pad_28[0x8]; // 0x28(0x08)
};

// Class Phoenix.AblNPC_ParryReleaseTask
// Size: 0x80 (Inherited: 0x70)
struct UAblNPC_ParryReleaseTask : UAblAbilityTask {
	bool bOverrideDBParryToRelease; // 0x70(0x01)
	char pad_71[0x3]; // 0x71(0x03)
	float ParryToRelease; // 0x74(0x04)
	bool bTriggerFiredEvent; // 0x78(0x01)
	enum class EEnemy_ParryType FiredEventType; // 0x79(0x01)
	char pad_7A[0x6]; // 0x7a(0x06)
};

// Class Phoenix.AblNPC_PhysicalReactionTask
// Size: 0x88 (Inherited: 0x70)
struct UAblNPC_PhysicalReactionTask : UAblAbilityTask {
	enum class EPhysicalReactionTaskAction Action; // 0x70(0x01)
	enum class EImpactReactionStrength ReactionStrength; // 0x71(0x01)
	bool bBlendBackOnTaskEnd; // 0x72(0x01)
	enum class ERagdollDrivingSetting SetPoseDrivingMode; // 0x73(0x01)
	enum class ERagdollPoseDrivingMode PoseDrivingMode; // 0x74(0x01)
	char pad_75[0x3]; // 0x75(0x03)
	float PoseDrivingBlendDuration; // 0x78(0x04)
	bool bSetCenterOfMassDrivingModes; // 0x7c(0x01)
	enum class ERagdollCOMLocationDrivingMode LocationDrivingMode; // 0x7d(0x01)
	enum class ERagdollCOMRotationDrivingMode RotationDrivingMode; // 0x7e(0x01)
	bool bEnableCcd; // 0x7f(0x01)
	float CcdTime; // 0x80(0x04)
	char pad_84[0x4]; // 0x84(0x04)
};

// Class Phoenix.AblNPC_PhysicalReactionBlendBackTask
// Size: 0x70 (Inherited: 0x70)
struct UAblNPC_PhysicalReactionBlendBackTask : UAblAbilityTask {
};

// Class Phoenix.AblNPC_PhysicalReactionCOMVelocityTask
// Size: 0x80 (Inherited: 0x70)
struct UAblNPC_PhysicalReactionCOMVelocityTask : UAblAbilityTask {
	enum class EAblNpcReactCapsuleImpulseVelocitySource VelocitySource; // 0x70(0x01)
	char pad_71[0x3]; // 0x71(0x03)
	float Magnitude; // 0x74(0x04)
	float Angle; // 0x78(0x04)
	char pad_7C[0x4]; // 0x7c(0x04)
};

// Class Phoenix.AblPhysicsBallisticToTargetScratchpad
// Size: 0x48 (Inherited: 0x28)
struct UAblPhysicsBallisticToTargetScratchpad : UAblAbilityTaskScratchPad {
	char pad_28[0x20]; // 0x28(0x20)
};

// Class Phoenix.AblNPC_PhysicsBallisticToTargetTask
// Size: 0xd0 (Inherited: 0x70)
struct UAblNPC_PhysicsBallisticToTargetTask : UAblAbilityTask {
	enum class ENPC_PhysicsBallisticType Type; // 0x70(0x01)
	bool bUseTarget; // 0x71(0x01)
	enum class ENPC_PhysicsBallisticToTargetTaskMode Mode; // 0x72(0x01)
	enum class ENPC_PhysicsBallisticToTargetTaskMode EndMode; // 0x73(0x01)
	bool bBallisticFromAttackData; // 0x74(0x01)
	char pad_75[0x3]; // 0x75(0x03)
	float OverrideGravity; // 0x78(0x04)
	bool bTrackTarget; // 0x7c(0x01)
	char pad_7D[0x3]; // 0x7d(0x03)
	float ArcParam; // 0x80(0x04)
	float TimeMult; // 0x84(0x04)
	struct FVector TargetOffset; // 0x88(0x0c)
	float TargetVelocityPredictionTime; // 0x94(0x04)
	float MaxDistance; // 0x98(0x04)
	bool bIgnoreCollisionUntilApex; // 0x9c(0x01)
	bool bIgnoreNonStatic; // 0x9d(0x01)
	bool bCollateralDamage; // 0x9e(0x01)
	char pad_9F[0x1]; // 0x9f(0x01)
	float fRandomAngleDeviationMin; // 0xa0(0x04)
	float fRandomAngleDeviationMax; // 0xa4(0x04)
	float fRandomDistanceDeviationMin; // 0xa8(0x04)
	float fRandomDistanceDeviationMax; // 0xac(0x04)
	struct FName TargetPointName; // 0xb0(0x08)
	float PhysicsOnGroundMinTime; // 0xb8(0x04)
	float PhysicsOnGroundTimeout; // 0xbc(0x04)
	float PhysicsMinTime; // 0xc0(0x04)
	float PhysicsTimeout; // 0xc4(0x04)
	float MovementStopTolerance; // 0xc8(0x04)
	bool bDisableCollisionResolution; // 0xcc(0x01)
	char pad_CD[0x3]; // 0xcd(0x03)
};

// Class Phoenix.ablNPC_SpawnJumpSplineWaitTaskScratchPad
// Size: 0x30 (Inherited: 0x28)
struct UablNPC_SpawnJumpSplineWaitTaskScratchPad : UAblAbilityTaskScratchPad {
	float ElapsedTime; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
};

// Class Phoenix.ablNPC_SpawnJumpSplineWaitTask
// Size: 0x78 (Inherited: 0x70)
struct UablNPC_SpawnJumpSplineWaitTask : UAblAbilityTask {
	enum class EEnemy_Ability BranchToAbilityOnRelease; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
};

// Class Phoenix.ablNPC_SplitTaskScratchPad
// Size: 0x58 (Inherited: 0x50)
struct UablNPC_SplitTaskScratchPad : UAblBranchTaskScratchPad {
	bool bDone; // 0x50(0x01)
	char pad_51[0x7]; // 0x51(0x07)
};

// Class Phoenix.ablNPC_SplitTask
// Size: 0xb0 (Inherited: 0x70)
struct UablNPC_SplitTask : UAblAbilityTask {
	enum class ENPC_Split SplitMode; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
	struct FGameplayTagContainer ContextTags; // 0x78(0x20)
	struct TArray<struct UEnemyAIAttackData*> m_PossibleSplits; // 0x98(0x10)
	bool bIgnoreSelectRanges; // 0xa8(0x01)
	bool bIgnoreMinAttackAngle; // 0xa9(0x01)
	bool bGetSplitFromCurrentAttackData; // 0xaa(0x01)
	char pad_AB[0x5]; // 0xab(0x05)
};

// Class Phoenix.AblNPC_TargetableToggleScratchPad
// Size: 0x28 (Inherited: 0x28)
struct UAblNPC_TargetableToggleScratchPad : UAblAbilityTaskScratchPad {
};

// Class Phoenix.AblNPC_TargetableToggleTask
// Size: 0x78 (Inherited: 0x70)
struct UAblNPC_TargetableToggleTask : UAblAbilityTask {
	bool bRegisterAsTargetableAtStart; // 0x70(0x01)
	bool bRegisterAsTargetableAtEnd; // 0x71(0x01)
	char pad_72[0x6]; // 0x72(0x06)
};

// Class Phoenix.ablNPC_TurnAssistTask
// Size: 0x80 (Inherited: 0x70)
struct UablNPC_TurnAssistTask : UAblAbilityTask {
	enum class ENPC_TurnAssist TurnAssistMode; // 0x70(0x01)
	bool bUseFixedDirection; // 0x71(0x01)
	enum class EablNPC_FixedSource FixedSource; // 0x72(0x01)
	char pad_73[0x1]; // 0x73(0x01)
	float FixedRelativeAngle; // 0x74(0x04)
	bool bFollowPlayer; // 0x78(0x01)
	bool bTurnToPlayer; // 0x79(0x01)
	bool bFollowTarget; // 0x7a(0x01)
	bool bTurnToTarget; // 0x7b(0x01)
	bool bFollowInstigator; // 0x7c(0x01)
	bool bTurnToInstigator; // 0x7d(0x01)
	bool bIgnoreTargetTracker; // 0x7e(0x01)
	char pad_7F[0x1]; // 0x7f(0x01)
};

// Class Phoenix.AblNPCAbilityScratchPad
// Size: 0x28 (Inherited: 0x28)
struct UAblNPCAbilityScratchPad : UAblAbilityBaseScratchPad {
};

// Class Phoenix.AblNPCAbility
// Size: 0xc8 (Inherited: 0xc8)
struct UAblNPCAbility : UAblAbility {
};

// Class Phoenix.AblNpcBakedPoseRigidbodyScratchpad
// Size: 0x48 (Inherited: 0x28)
struct UAblNpcBakedPoseRigidbodyScratchpad : UAblAbilityTaskScratchPad {
	char pad_28[0x20]; // 0x28(0x20)

	void OnBakedRigidBodyAttachedEvent(); // Function Phoenix.AblNpcBakedPoseRigidbodyScratchpad.OnBakedRigidBodyAttachedEvent // (Final|Native|Public) // @ game+0x31af120
};

// Class Phoenix.AblNpcBakedPoseRigidbodyTask
// Size: 0x98 (Inherited: 0x70)
struct UAblNpcBakedPoseRigidbodyTask : UAblAbilityTask {
	bool bAttachBakedPoseOnTaskStart; // 0x70(0x01)
	bool bRemoveBakedPoseOnTaskStart; // 0x71(0x01)
	bool bAttachBakedPoseOnTaskEnd; // 0x72(0x01)
	bool bRemoveBakedPoseOnTaskEnd; // 0x73(0x01)
	bool bApplyForcesToBakedPose; // 0x74(0x01)
	char pad_75[0x3]; // 0x75(0x03)
	struct FVector LinearVelocity; // 0x78(0x0c)
	struct FVector AngularVelocityInDegrees; // 0x84(0x0c)
	bool bVelocityAwayFromInstigator; // 0x90(0x01)
	char pad_91[0x7]; // 0x91(0x07)
};

// Class Phoenix.AblNpcCapsuleScalingScratchpad
// Size: 0x90 (Inherited: 0x28)
struct UAblNpcCapsuleScalingScratchpad : UAblAbilityTaskScratchPad {
	char pad_28[0x68]; // 0x28(0x68)
};

// Class Phoenix.AblNpcCapsuleScalingTask
// Size: 0xb0 (Inherited: 0x70)
struct UAblNpcCapsuleScalingTask : UAblAbilityTask {
	bool bUseHeightAsRadius; // 0x70(0x01)
	char pad_71[0x3]; // 0x71(0x03)
	float RadiusMultiplier; // 0x74(0x04)
	float HalfHeightMultiplier; // 0x78(0x04)
	bool bRestoreAtEndTask; // 0x7c(0x01)
	char pad_7D[0x3]; // 0x7d(0x03)
	struct FAlphaBlend BlendTime; // 0x80(0x30)
};

// Class Phoenix.AblNpcCollisionBranchCondition
// Size: 0x48 (Inherited: 0x30)
struct UAblNpcCollisionBranchCondition : UAblBranchCondition {
	enum class EAblNpcCollisionDetectionType DetectionType; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	float DotProductLowerBound; // 0x34(0x04)
	float DotProductUpperBound; // 0x38(0x04)
	float BranchOnImminentCollisionLength; // 0x3c(0x04)
	float MinSpeed; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
};

// Class Phoenix.AblNpcCollisionBranchTaskScratchPad
// Size: 0xe8 (Inherited: 0x50)
struct UAblNpcCollisionBranchTaskScratchPad : UAblBranchTaskScratchPad {
	char pad_50[0x98]; // 0x50(0x98)

	void OnNpcCapsuleHit(struct AActor* SelfActor, struct AActor* OtherActor, struct FVector NormalImpulse, struct FHitResult& Hit); // Function Phoenix.AblNpcCollisionBranchTaskScratchPad.OnNpcCapsuleHit // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x31af140
};

// Class Phoenix.AblNpcCollisionBranchTask
// Size: 0x118 (Inherited: 0x118)
struct UAblNpcCollisionBranchTask : UAblBranchTask {
};

// Class Phoenix.AblNpcCollisionScratchpad
// Size: 0x48 (Inherited: 0x28)
struct UAblNpcCollisionScratchpad : UAblAbilityTaskScratchPad {
	char pad_28[0x20]; // 0x28(0x20)
};

// Class Phoenix.AblNpcCollisionTask
// Size: 0x78 (Inherited: 0x70)
struct UAblNpcCollisionTask : UAblAbilityTask {
	bool bOverrideSpellResponse; // 0x70(0x01)
	bool bOverrideWeaponResponse; // 0x71(0x01)
	bool bOverrideAimConeResponse; // 0x72(0x01)
	bool bOverridePawnResponse; // 0x73(0x01)
	enum class ECollisionResponse TaskSpellResponse; // 0x74(0x01)
	enum class ECollisionResponse TaskWeaponResponse; // 0x75(0x01)
	enum class ECollisionResponse TaskAimConeResponse; // 0x76(0x01)
	enum class ECollisionResponse TaskPawnResponse; // 0x77(0x01)
};

// Class Phoenix.AblNPCDynamicBranchChannelingConditional
// Size: 0x70 (Inherited: 0x30)
struct UAblNPCDynamicBranchChannelingConditional : UAblChannelingBase {
	bool m_CopyTargetsOnBranch; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
	struct FAlphaBlend m_TransitionBlend; // 0x38(0x30)
	enum class EEnemy_Ability AbilityState; // 0x68(0x01)
	char pad_69[0x7]; // 0x69(0x07)
};

// Class Phoenix.AblNpcFeetIkScratchpad
// Size: 0x28 (Inherited: 0x28)
struct UAblNpcFeetIkScratchpad : UAblAbilityTaskScratchPad {
};

// Class Phoenix.AblNpcFeetIkTask
// Size: 0x78 (Inherited: 0x70)
struct UAblNpcFeetIkTask : UAblAbilityTask {
	enum class EAblNpcReactEventAction IkOnTaskStartEvent; // 0x70(0x01)
	enum class EAblNpcReactEventAction IkOnTaskEndEvent; // 0x71(0x01)
	char pad_72[0x6]; // 0x72(0x06)
};

// Class Phoenix.AblNpcForceFeedbackScratchpad
// Size: 0x48 (Inherited: 0x28)
struct UAblNpcForceFeedbackScratchpad : UAblAbilityTaskScratchPad {
	char pad_28[0x8]; // 0x28(0x08)
	struct TArray<struct UAblTaskConditionScratchpad*> ConditionScratchpads; // 0x30(0x10)
	char pad_40[0x8]; // 0x40(0x08)
};

// Class Phoenix.AblNpcForceFeedbackTask
// Size: 0xa0 (Inherited: 0x70)
struct UAblNpcForceFeedbackTask : UAblAbilityTask {
	struct UForceFeedbackEffect* ForceFeedbackEffect; // 0x70(0x08)
	struct FName FeedbackTagName; // 0x78(0x08)
	bool bStopFeedbackAtTaskEnd; // 0x80(0x01)
	bool bLoop; // 0x81(0x01)
	bool bOnlyRumbleIfInstigatorIsPlayer; // 0x82(0x01)
	bool bUseAttenuation; // 0x83(0x01)
	char pad_84[0x4]; // 0x84(0x04)
	struct TArray<struct UAblTaskCondition*> Conditions; // 0x88(0x10)
	bool bMustPassAllConditions; // 0x98(0x01)
	bool bOnlyCheckConditionsOnTaskStart; // 0x99(0x01)
	char pad_9A[0x6]; // 0x9a(0x06)
};

// Class Phoenix.AblNpcHeadTrackingScratchpad
// Size: 0x28 (Inherited: 0x28)
struct UAblNpcHeadTrackingScratchpad : UAblAbilityTaskScratchPad {
};

// Class Phoenix.AblNpcHeadTrackingTask
// Size: 0x78 (Inherited: 0x70)
struct UAblNpcHeadTrackingTask : UAblAbilityTask {
	bool bEnableHeadTracking; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
};

// Class Phoenix.AblNpcHitPauseScratchpad
// Size: 0x28 (Inherited: 0x28)
struct UAblNpcHitPauseScratchpad : UAblAbilityTaskScratchPad {
};

// Class Phoenix.AblNpcHitPauseTask
// Size: 0x78 (Inherited: 0x70)
struct UAblNpcHitPauseTask : UAblAbilityTask {
	float Time; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)
};

// Class Phoenix.AblNpcMoveInDirectionScratchpad
// Size: 0x78 (Inherited: 0x28)
struct UAblNpcMoveInDirectionScratchpad : UAblAbilityTaskScratchPad {
	char pad_28[0x50]; // 0x28(0x50)
};

// Class Phoenix.AblNpcMoveInDirectionTask
// Size: 0xc0 (Inherited: 0x70)
struct UAblNpcMoveInDirectionTask : UAblAbilityTask {
	enum class ENpcMoveDirectionType DirectionType; // 0x70(0x01)
	char pad_71[0x3]; // 0x71(0x03)
	struct FVector Direction; // 0x74(0x0c)
	float MinSpeed; // 0x80(0x04)
	float MaxSpeed; // 0x84(0x04)
	float RandAngleCone; // 0x88(0x04)
	enum class EMovementMode MovementMode; // 0x8c(0x01)
	bool bModifyGravityAtTaskStart; // 0x8d(0x01)
	char pad_8E[0x2]; // 0x8e(0x02)
	float GravityScaleAtTaskStart; // 0x90(0x04)
	bool bRestoreGravityScaleAtTaskEnd; // 0x94(0x01)
	bool bAddMomentumAtTaskEnd; // 0x95(0x01)
	bool bIgnoreZ; // 0x96(0x01)
	bool bUseNpcMaxHeight; // 0x97(0x01)
	bool bOverrideMaxHeight; // 0x98(0x01)
	char pad_99[0x3]; // 0x99(0x03)
	float MaxHeightOverride; // 0x9c(0x04)
	bool bUseCurveSpeedManipulation; // 0xa0(0x01)
	char pad_A1[0x7]; // 0xa1(0x07)
	struct TArray<struct UCurveFloat*> Curves; // 0xa8(0x10)
	bool bLoopCurve; // 0xb8(0x01)
	bool bRandStartTimeOnCurve; // 0xb9(0x01)
	bool bUseCurveValueAsMultiplier; // 0xba(0x01)
	bool bFitCurveToTaskDuration; // 0xbb(0x01)
	char pad_BC[0x4]; // 0xbc(0x04)
};

// Class Phoenix.ablNPCPhysicsTaskScratchPad
// Size: 0x30 (Inherited: 0x28)
struct UablNPCPhysicsTaskScratchPad : UAblAbilityTaskScratchPad {
	float ElapsedTime; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
};

// Class Phoenix.ablNPCPhysicsTask
// Size: 0x78 (Inherited: 0x70)
struct UablNPCPhysicsTask : UAblAbilityTask {
	bool bOverrideCapsulePhysicsSettings; // 0x70(0x01)
	bool bEnableCapsuleGravity; // 0x71(0x01)
	bool bSimulateCapsulePhysics; // 0x72(0x01)
	char pad_73[0x5]; // 0x73(0x05)
};

// Class Phoenix.AblNpcPopupScratchpad
// Size: 0x60 (Inherited: 0x28)
struct UAblNpcPopupScratchpad : UAblAbilityTaskScratchPad {
	char pad_28[0x38]; // 0x28(0x38)
};

// Class Phoenix.AblNpcPopupTask
// Size: 0xc0 (Inherited: 0x70)
struct UAblNpcPopupTask : UAblAbilityTask {
	enum class EAblNpcPopupDirection PopupDirection; // 0x70(0x01)
	bool bUseMagnitudeAndAngle; // 0x71(0x01)
	char pad_72[0x2]; // 0x72(0x02)
	float Magnitude; // 0x74(0x04)
	float MagnitudeVariance; // 0x78(0x04)
	float Angle; // 0x7c(0x04)
	float AngleVariance; // 0x80(0x04)
	float MagnitudeHorz; // 0x84(0x04)
	float MagnitudeVert; // 0x88(0x04)
	float HorizontalDamping; // 0x8c(0x04)
	float CollisionVsFloorInitialDamping; // 0x90(0x04)
	float CollisionVsFloorDamping; // 0x94(0x04)
	bool bUseNpcMaxHeight; // 0x98(0x01)
	bool bOverrideMaxHeight; // 0x99(0x01)
	char pad_9A[0x2]; // 0x9a(0x02)
	float MaxHeightOverride; // 0x9c(0x04)
	bool bModifyGravityAtTaskStart; // 0xa0(0x01)
	char pad_A1[0x3]; // 0xa1(0x03)
	float GravityScaleAtTaskStart; // 0xa4(0x04)
	bool bModifyGravityAtMaxHeight; // 0xa8(0x01)
	char pad_A9[0x3]; // 0xa9(0x03)
	float GravityScaleAtMaxHeight; // 0xac(0x04)
	bool bModifyGravityAtApex; // 0xb0(0x01)
	char pad_B1[0x3]; // 0xb1(0x03)
	float GravityScaleAtApex; // 0xb4(0x04)
	bool bRestoreGravityScaleAtTaskEnd; // 0xb8(0x01)
	bool bStompVelocityAtTaskStart; // 0xb9(0x01)
	bool bStompVelocityAtTaskEnd; // 0xba(0x01)
	bool bIgnoreInAirCollisions; // 0xbb(0x01)
	enum class EMovementMode MovementMode; // 0xbc(0x01)
	char pad_BD[0x3]; // 0xbd(0x03)
};

// Class Phoenix.AblNpcReactAnimRateModifierScratchpad
// Size: 0x58 (Inherited: 0x28)
struct UAblNpcReactAnimRateModifierScratchpad : UAblAbilityTaskScratchPad {
	char pad_28[0x30]; // 0x28(0x30)
};

// Class Phoenix.AblNpcReactAnimRateModifierTask
// Size: 0x78 (Inherited: 0x70)
struct UAblNpcReactAnimRateModifierTask : UAblAbilityTask {
	float TargetValue; // 0x70(0x04)
	enum class EAlphaBlendOption AlphaBlendOption; // 0x74(0x01)
	char pad_75[0x3]; // 0x75(0x03)
};

// Class Phoenix.AblNpcReactFlyToLocation
// Size: 0x78 (Inherited: 0x70)
struct UAblNpcReactFlyToLocation : UAblFlyToLocationTaskBase {
	enum class ENpcReactFlyToLocationOption TargetLocation; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
};

// Class Phoenix.AblNpcReactGravityScratchpad
// Size: 0x30 (Inherited: 0x28)
struct UAblNpcReactGravityScratchpad : UAblAbilityTaskScratchPad {
	char pad_28[0x8]; // 0x28(0x08)
};

// Class Phoenix.AblNpcReactGravityTask
// Size: 0x98 (Inherited: 0x70)
struct UAblNpcReactGravityTask : UAblAbilityTask {
	bool bModifyGravityAtTaskStart; // 0x70(0x01)
	char pad_71[0x3]; // 0x71(0x03)
	float TaskStartGravityMultiplier; // 0x74(0x04)
	bool bModifyGravityAtTaskEnd; // 0x78(0x01)
	char pad_79[0x3]; // 0x79(0x03)
	float TaskEndGravityMultiplier; // 0x7c(0x04)
	bool bRestoreGravityAtTaskEnd; // 0x80(0x01)
	char pad_81[0x7]; // 0x81(0x07)
	struct TArray<struct UAblAbility*> AbilitiesToIgnoreTaskEndGravityRestoration; // 0x88(0x10)
};

// Class Phoenix.AblNpcReactMoveToScratchpad
// Size: 0x88 (Inherited: 0x28)
struct UAblNpcReactMoveToScratchpad : UAblAbilityTaskScratchPad {
	char pad_28[0x60]; // 0x28(0x60)
};

// Class Phoenix.AblNpcReactMoveToTask
// Size: 0xa0 (Inherited: 0x70)
struct UAblNpcReactMoveToTask : UAblAbilityTask {
	enum class EAblNpcReactMoveToDestinationType DestinationType; // 0x70(0x01)
	char pad_71[0x3]; // 0x71(0x03)
	struct FVector CustomDestination; // 0x74(0x0c)
	enum class EAblNpcReactMoveToSpeedType SpeedType; // 0x80(0x01)
	char pad_81[0x7]; // 0x81(0x07)
	struct UCurveFloat* Curve; // 0x88(0x08)
	float CustomSpeed; // 0x90(0x04)
	bool bTrackTarget; // 0x94(0x01)
	bool bStompVelocityAtStart; // 0x95(0x01)
	bool bDoNotAllowHorizontalMovementAwayFromInstigator; // 0x96(0x01)
	bool bUseMaxHeight; // 0x97(0x01)
	bool bIgnoreCapsuleHalfHeight; // 0x98(0x01)
	char pad_99[0x7]; // 0x99(0x07)
};

// Class Phoenix.AblPlayObjectArchitectVfxScratchpad
// Size: 0x48 (Inherited: 0x28)
struct UAblPlayObjectArchitectVfxScratchpad : UAblAbilityTaskScratchPad {
	struct UNiagaraComponent* NiagaraComp; // 0x28(0x08)
	struct UParticleSystemComponent* ParticleComp; // 0x30(0x08)
	struct TArray<struct UAblTaskConditionScratchpad*> ConditionScratchpads; // 0x38(0x10)
};

// Class Phoenix.AblNpcReactPlayObjectArchitectVfxScratchpad
// Size: 0x58 (Inherited: 0x48)
struct UAblNpcReactPlayObjectArchitectVfxScratchpad : UAblPlayObjectArchitectVfxScratchpad {
	char pad_48[0x10]; // 0x48(0x10)
};

// Class Phoenix.AblPlayObjectArchitectVfxTaskBase
// Size: 0xc8 (Inherited: 0x70)
struct UAblPlayObjectArchitectVfxTaskBase : UAblAbilityTask {
	struct FGameplayTagContainer BaseObjectArchitectTags; // 0x70(0x20)
	struct TArray<struct UAblObjectArchitectTagChooser*> TagChoosers; // 0x90(0x10)
	struct TArray<struct UAblTaskCondition*> Conditions; // 0xa0(0x10)
	bool bSpawnSystemAttached; // 0xb0(0x01)
	char pad_B1[0x3]; // 0xb1(0x03)
	struct FName AttachPointName; // 0xb4(0x08)
	bool bAutoDestroy; // 0xbc(0x01)
	bool bDeactivateAtTaskEnd; // 0xbd(0x01)
	bool bDestroyAtTaskEnd; // 0xbe(0x01)
	bool bIncludeActorScale; // 0xbf(0x01)
	enum class EAttachLocation AttachLocation; // 0xc0(0x01)
	enum class EObjectArchitectVfxWorldLocalType WorldOrLocalSpace; // 0xc1(0x01)
	char pad_C2[0x6]; // 0xc2(0x06)
};

// Class Phoenix.AblPlayObjectArchitectVfxTask
// Size: 0x108 (Inherited: 0xc8)
struct UAblPlayObjectArchitectVfxTask : UAblPlayObjectArchitectVfxTaskBase {
	struct FVector Location; // 0xc8(0x0c)
	struct FRotator Rotation; // 0xd4(0x0c)
	struct FVector Scale; // 0xe0(0x0c)
	float LifeSpan; // 0xec(0x04)
	struct FVector DecalSize; // 0xf0(0x0c)
	float FadeInTime; // 0xfc(0x04)
	float FadeOutTime; // 0x100(0x04)
	char pad_104[0x4]; // 0x104(0x04)
};

// Class Phoenix.AblNpcReactPlayObjectArchitectVfxTask
// Size: 0x108 (Inherited: 0x108)
struct UAblNpcReactPlayObjectArchitectVfxTask : UAblPlayObjectArchitectVfxTask {
};

// Class Phoenix.AblNpcReactPopupScratchpad
// Size: 0x70 (Inherited: 0x60)
struct UAblNpcReactPopupScratchpad : UAblNpcPopupScratchpad {
	struct UAblReactionData* ReactionData; // 0x60(0x08)
	char pad_68[0x8]; // 0x68(0x08)
};

// Class Phoenix.AblNpcReactPopupTask
// Size: 0xd0 (Inherited: 0xc0)
struct UAblNpcReactPopupTask : UAblNpcPopupTask {
	bool bUseReactionPopupType; // 0xc0(0x01)
	enum class EAblNpcReactPopupTaskType ReactPopupType; // 0xc1(0x01)
	bool bInvertReactPopupTypeDirection; // 0xc2(0x01)
	bool bConvertReactPopupTypeDirectionTo2D; // 0xc3(0x01)
	bool bUseReactionVelocityIfSendTargetExists; // 0xc4(0x01)
	bool bUseReactionDataMagnitude; // 0xc5(0x01)
	bool bModifyGravityAtReactionEnd; // 0xc6(0x01)
	char pad_C7[0x1]; // 0xc7(0x01)
	float GravityScaleAtReactionEnd; // 0xc8(0x04)
	char pad_CC[0x4]; // 0xcc(0x04)
};

// Class Phoenix.AblNpcRotateScratchpad
// Size: 0x38 (Inherited: 0x28)
struct UAblNpcRotateScratchpad : UAblAbilityTaskScratchPad {
	char pad_28[0x10]; // 0x28(0x10)
};

// Class Phoenix.AblNpcRotateTask
// Size: 0x98 (Inherited: 0x70)
struct UAblNpcRotateTask : UAblAbilityTask {
	bool bRotateAroundX; // 0x70(0x01)
	char pad_71[0x3]; // 0x71(0x03)
	float MinRotationSpeedX; // 0x74(0x04)
	float MaxRotationSpeedX; // 0x78(0x04)
	bool bRotateAroundY; // 0x7c(0x01)
	char pad_7D[0x3]; // 0x7d(0x03)
	float MinRotationSpeedY; // 0x80(0x04)
	float MaxRotationSpeedY; // 0x84(0x04)
	bool bRotateAroundZ; // 0x88(0x01)
	char pad_89[0x3]; // 0x89(0x03)
	float MinRotationSpeedZ; // 0x8c(0x04)
	float MaxRotationSpeedZ; // 0x90(0x04)
	char pad_94[0x4]; // 0x94(0x04)
};

// Class Phoenix.AblNpcScaleScratchpad
// Size: 0xb0 (Inherited: 0x28)
struct UAblNpcScaleScratchpad : UAblAbilityTaskScratchPad {
	char pad_28[0x88]; // 0x28(0x88)
};

// Class Phoenix.AblNpcScaleTask
// Size: 0x88 (Inherited: 0x70)
struct UAblNpcScaleTask : UAblAbilityTask {
	float ScaleStart; // 0x70(0x04)
	float ScaleEnd; // 0x74(0x04)
	bool bScaleToPreviousValue; // 0x78(0x01)
	bool bRestoreScaleAtTaskEnd; // 0x79(0x01)
	bool bUseCurve; // 0x7a(0x01)
	char pad_7B[0x5]; // 0x7b(0x05)
	struct UCurveFloat* Curve; // 0x80(0x08)
};

// Class Phoenix.AblSetCharacterTagsTaskScratchPad
// Size: 0x40 (Inherited: 0x28)
struct UAblSetCharacterTagsTaskScratchPad : UAblAbilityTaskScratchPad {
	struct TArray<struct UAblTaskConditionScratchpad*> TaskConditionScratchpads; // 0x28(0x10)
	char pad_38[0x8]; // 0x38(0x08)
};

// Class Phoenix.AblSetCharacterTagsTask
// Size: 0xb0 (Inherited: 0x70)
struct UAblSetCharacterTagsTask : UAblAbilityTask {
	struct FGameplayTagContainer CharacterTags; // 0x70(0x20)
	bool RemoveTagsAtEndOfTask; // 0x90(0x01)
	bool AddTheseTags; // 0x91(0x01)
	bool RemoveTheseTags; // 0x92(0x01)
	char pad_93[0x5]; // 0x93(0x05)
	struct TArray<struct UAblTaskCondition*> TaskConditions; // 0x98(0x10)
	bool bMustPassAllConditions; // 0xa8(0x01)
	char pad_A9[0x7]; // 0xa9(0x07)
};

// Class Phoenix.AblNpcSpawnMunitionTask
// Size: 0x98 (Inherited: 0x70)
struct UAblNpcSpawnMunitionTask : UAblAbilityTask {
	struct AMunitionType_Base* MunitionClass; // 0x70(0x08)
	bool bUseReactionInstigatorAsMunitionInstigator; // 0x78(0x01)
	char pad_79[0x7]; // 0x79(0x07)
	struct TArray<struct UAblTaskCondition*> Conditions; // 0x80(0x10)
	bool bMustPassAllConditions; // 0x90(0x01)
	char pad_91[0x7]; // 0x91(0x07)
};

// Class Phoenix.AblNpcStartReactionScratchpad
// Size: 0x40 (Inherited: 0x28)
struct UAblNpcStartReactionScratchpad : UAblAbilityTaskScratchPad {
	struct TArray<struct UAblTaskConditionScratchpad*> TaskConditionScratchpads; // 0x28(0x10)
	char pad_38[0x8]; // 0x38(0x08)
};

// Class Phoenix.AblNpcStartReactionTask
// Size: 0x108 (Inherited: 0x70)
struct UAblNpcStartReactionTask : UAblAbilityTask {
	struct UAblReactionAbility* ReactionAbility; // 0x70(0x08)
	struct TArray<struct UAblTaskCondition*> TaskConditions; // 0x78(0x10)
	bool bStartReactionOnlyOnce; // 0x88(0x01)
	bool bMustPassAllConditions; // 0x89(0x01)
	bool bUseCurrentReactionData; // 0x8a(0x01)
	char pad_8B[0x5]; // 0x8b(0x05)
	struct FQueueReactionParams ReactionParams; // 0x90(0x78)
};

// Class Phoenix.AblAddPassiveReactionScratchpad
// Size: 0x38 (Inherited: 0x28)
struct UAblAddPassiveReactionScratchpad : UAblAbilityTaskScratchPad {
	struct TArray<struct UAblTaskConditionScratchpad*> TaskConditionScratchpads; // 0x28(0x10)
};

// Class Phoenix.AblAddPassiveReactionTask
// Size: 0x88 (Inherited: 0x70)
struct UAblAddPassiveReactionTask : UAblAbilityTask {
	struct UAblReactionAbility* PassiveReactionAbility; // 0x70(0x08)
	struct TArray<struct UAblTaskCondition*> TaskConditions; // 0x78(0x10)
};

// Class Phoenix.AblNpcTargetingModifierScratchpad
// Size: 0x30 (Inherited: 0x28)
struct UAblNpcTargetingModifierScratchpad : UAblAbilityTaskScratchPad {
	char pad_28[0x8]; // 0x28(0x08)
};

// Class Phoenix.AblNpcTargetingModifierTask
// Size: 0x88 (Inherited: 0x70)
struct UAblNpcTargetingModifierTask : UAblAbilityTask {
	bool bModifyTargetingModifierAtTaskStart; // 0x70(0x01)
	char pad_71[0x3]; // 0x71(0x03)
	float TargetingModifierAtTaskStart; // 0x74(0x04)
	bool bModifyTargetingModifierAtTaskEnd; // 0x78(0x01)
	char pad_79[0x3]; // 0x79(0x03)
	float TargetingModifierAtTaskEnd; // 0x7c(0x04)
	bool bRestoreTargetingModifierAtTaskEnd; // 0x80(0x01)
	char pad_81[0x7]; // 0x81(0x07)
};

// Class Phoenix.AblDisarmEventListenerScratchpad
// Size: 0x38 (Inherited: 0x38)
struct UAblDisarmEventListenerScratchpad : UAblCustomEventListenerOnceScratchpad {
};

// Class Phoenix.AblDisarmEventListenerTask
// Size: 0x78 (Inherited: 0x78)
struct UAblDisarmEventListenerTask : UAblCustomEventListenerOnceTask {
};

// Class Phoenix.AblRootMotionModifiersEventListenerScratchpad
// Size: 0x38 (Inherited: 0x38)
struct UAblRootMotionModifiersEventListenerScratchpad : UAblCustomEventListenerStartEndScratchpad {
};

// Class Phoenix.AblRootMotionModifiersEventListenerTask
// Size: 0x90 (Inherited: 0x80)
struct UAblRootMotionModifiersEventListenerTask : UAblCustomEventListenerStartEndTask {
	struct TArray<struct URootMotionModifierProperties*> RootMotionModifiers; // 0x80(0x10)
};

// Class Phoenix.AblCustomEventFiredOnMeshOverlapScratchpad
// Size: 0x88 (Inherited: 0x28)
struct UAblCustomEventFiredOnMeshOverlapScratchpad : UAblAbilityTaskScratchPad {
	char pad_28[0x60]; // 0x28(0x60)

	void HandleOverlapBegin(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function Phoenix.AblCustomEventFiredOnMeshOverlapScratchpad.HandleOverlapBegin // (Final|Native|Public|HasOutParms) // @ game+0x31b51f0
};

// Class Phoenix.AblCustomEventFiredOnMeshOverlapTask
// Size: 0x90 (Inherited: 0x70)
struct UAblCustomEventFiredOnMeshOverlapTask : UAblAbilityTask {
	struct TArray<struct FName> BodyNames; // 0x70(0x10)
	struct FName CollisionProfileName; // 0x80(0x08)
	struct FName CustomEventName; // 0x88(0x08)
};

// Class Phoenix.AblRipApartScratchpad
// Size: 0x40 (Inherited: 0x28)
struct UAblRipApartScratchpad : UAblAbilityTaskScratchPad {
	char pad_28[0x18]; // 0x28(0x18)
};

// Class Phoenix.AblRipApartTask
// Size: 0x180 (Inherited: 0x70)
struct UAblRipApartTask : UAblAbilityTask {
	bool bReinitPose; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
	struct TMap<struct FGameplayTag, struct USkeletalMesh*> BodyMeshes; // 0x78(0x50)
	struct TMap<struct FGameplayTag, struct USkeletalMesh*> LegMeshes; // 0xc8(0x50)
	struct TArray<struct FName> BodyLegSocketNames; // 0x118(0x10)
	struct FName LegFxSocketName; // 0x128(0x08)
	struct FGameplayTagContainer LegSocketParticleTags; // 0x130(0x20)
	struct FGameplayTagContainer LegParticleTags; // 0x150(0x20)
	float MinImpulse; // 0x170(0x04)
	float MaxImpulse; // 0x174(0x04)
	bool bSpawnActorInstead; // 0x178(0x01)
	char pad_179[0x3]; // 0x179(0x03)
	float LegLifetime; // 0x17c(0x04)
};

// Class Phoenix.AblTransformIntoTask
// Size: 0x90 (Inherited: 0x70)
struct UAblTransformIntoTask : UAblAbilityTask {
	struct FString CreatureName; // 0x70(0x10)
	struct UAblAbility* CreatureSpawnAbility; // 0x80(0x08)
	bool bSetTransformedCreatureToWild; // 0x88(0x01)
	char pad_89[0x7]; // 0x89(0x07)
};

// Class Phoenix.AblTransformIntoNoDeathScratchpad
// Size: 0x30 (Inherited: 0x28)
struct UAblTransformIntoNoDeathScratchpad : UAblAbilityTaskScratchPad {
	struct AActor* SpawnedCreature; // 0x28(0x08)
};

// Class Phoenix.AblTransformIntoNoDeathTask
// Size: 0x88 (Inherited: 0x70)
struct UAblTransformIntoNoDeathTask : UAblAbilityTask {
	struct FString CreatureName; // 0x70(0x10)
	struct UAblAbility* CreatureSpawnAbility; // 0x80(0x08)
};

// Class Phoenix.AblRagdollForceToNavMeshTask
// Size: 0x78 (Inherited: 0x70)
struct UAblRagdollForceToNavMeshTask : UAblAbilityTask {
	float Force; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)
};

// Class Phoenix.AblDieOnNextImpactReactionScratchpad
// Size: 0x30 (Inherited: 0x28)
struct UAblDieOnNextImpactReactionScratchpad : UAblAbilityTaskScratchPad {
	char pad_28[0x8]; // 0x28(0x08)

	void HandleActorHit(struct AActor* SelfActor, struct AActor* OtherActor, struct FVector NormalImpulse, struct FHitResult& Hit); // Function Phoenix.AblDieOnNextImpactReactionScratchpad.HandleActorHit // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x31b5050
};

// Class Phoenix.AblDieOnNextImpactReactionTask
// Size: 0x70 (Inherited: 0x70)
struct UAblDieOnNextImpactReactionTask : UAblAbilityTask {
};

// Class Phoenix.AblSetMaxHeightModifiersScratchpad
// Size: 0x38 (Inherited: 0x28)
struct UAblSetMaxHeightModifiersScratchpad : UAblAbilityTaskScratchPad {
	struct TArray<struct UAblTaskConditionScratchpad*> ConditionScratchpads; // 0x28(0x10)
};

// Class Phoenix.AblSetMaxHeightModifiersTask
// Size: 0x98 (Inherited: 0x70)
struct UAblSetMaxHeightModifiersTask : UAblAbilityTask {
	bool bEnableMaxHeightModifiers; // 0x70(0x01)
	bool bOverrideMaxHeightValue; // 0x71(0x01)
	char pad_72[0x2]; // 0x72(0x02)
	float OverrideMaxHeightValue; // 0x74(0x04)
	enum class EStandardManagedPriority Priority; // 0x78(0x01)
	char pad_79[0x7]; // 0x79(0x07)
	struct TArray<struct UAblTaskCondition*> Conditions; // 0x80(0x10)
	bool bMustPassAllConditions; // 0x90(0x01)
	char pad_91[0x7]; // 0x91(0x07)
};

// Class Phoenix.AblSetPheonixCharacterMovementModeScratchpad
// Size: 0x28 (Inherited: 0x28)
struct UAblSetPheonixCharacterMovementModeScratchpad : UAblAbilityTaskScratchPad {
};

// Class Phoenix.AblSetPhoenixCharacterMovementModeTask
// Size: 0x78 (Inherited: 0x70)
struct UAblSetPhoenixCharacterMovementModeTask : UAblAbilityTask {
	enum class EMovementMode MovementMode; // 0x70(0x01)
	enum class EManagedMovementModePriority Priority; // 0x71(0x01)
	char pad_72[0x6]; // 0x72(0x06)
};

// Class Phoenix.ablNPC_TurnAssistImpulseTask
// Size: 0x80 (Inherited: 0x70)
struct UablNPC_TurnAssistImpulseTask : UAblAbilityTask {
	enum class ENPC_TurnAssistType TurnAssistType; // 0x70(0x01)
	bool bAllowFollow; // 0x71(0x01)
	char pad_72[0x2]; // 0x72(0x02)
	float RelativeAngle; // 0x74(0x04)
	enum class ENPC_TurnAssist TurnAssistMode; // 0x78(0x01)
	char pad_79[0x7]; // 0x79(0x07)
};

// Class Phoenix.AblNPCTurnToTaskScratchPad
// Size: 0x70 (Inherited: 0x28)
struct UAblNPCTurnToTaskScratchPad : UAblAbilityTaskScratchPad {
	struct AActor* ActorToTrack; // 0x28(0x08)
	struct FRotator TargetRotation; // 0x30(0x0c)
	char pad_3C[0x4]; // 0x3c(0x04)
	struct FAlphaBlend TurningBlend; // 0x40(0x30)
};

// Class Phoenix.AblNPCTurnToTask
// Size: 0xc0 (Inherited: 0x70)
struct UAblNPCTurnToTask : UAblAbilityTask {
	enum class EAblNPCTurnToTaskDestination RotationTarget; // 0x70(0x01)
	bool bTrackTarget; // 0x71(0x01)
	char pad_72[0x2]; // 0x72(0x02)
	struct FRotator RotationOffset; // 0x74(0x0c)
	bool SetYaw; // 0x80(0x01)
	bool SetPitch; // 0x81(0x01)
	char pad_82[0x6]; // 0x82(0x06)
	struct FAlphaBlend Blend; // 0x88(0x30)
	char pad_B8[0x8]; // 0xb8(0x08)
};

// Class Phoenix.AblNpcVulnerabilityScratchpad
// Size: 0x30 (Inherited: 0x28)
struct UAblNpcVulnerabilityScratchpad : UAblAbilityTaskScratchPad {
	char pad_28[0x8]; // 0x28(0x08)
};

// Class Phoenix.AblNpcVulnerabilityTask
// Size: 0x78 (Inherited: 0x70)
struct UAblNpcVulnerabilityTask : UAblAbilityTask {
	bool bModifyVulnerabilityAtTaskStart; // 0x70(0x01)
	bool bVulnerabilityAtTaskStart; // 0x71(0x01)
	bool bModifyVulnerabilityAtTaskEnd; // 0x72(0x01)
	bool bVulnerabilityAtTaskEnd; // 0x73(0x01)
	bool bRestoreVulnerabilityAtTaskEnd; // 0x74(0x01)
	char pad_75[0x3]; // 0x75(0x03)
};

// Class Phoenix.AblObjectArchitectTagChooser
// Size: 0x28 (Inherited: 0x28)
struct UAblObjectArchitectTagChooser : UObject {
};

// Class Phoenix.AblObjectArchitectTagChooser_EnemyClass
// Size: 0x28 (Inherited: 0x28)
struct UAblObjectArchitectTagChooser_EnemyClass : UAblObjectArchitectTagChooser {
};

// Class Phoenix.AblObjectArchitectTagChooser_EnemyFaction
// Size: 0x28 (Inherited: 0x28)
struct UAblObjectArchitectTagChooser_EnemyFaction : UAblObjectArchitectTagChooser {
};

// Class Phoenix.AblBranchConditionIsNearDeathKneeling
// Size: 0x30 (Inherited: 0x30)
struct UAblBranchConditionIsNearDeathKneeling : UAblBranchCondition {
};

// Class Phoenix.AblBranchConditionIsDazed
// Size: 0x30 (Inherited: 0x30)
struct UAblBranchConditionIsDazed : UAblBranchCondition {
};

// Class Phoenix.AblBranchConditionIfDead
// Size: 0x30 (Inherited: 0x30)
struct UAblBranchConditionIfDead : UAblBranchCondition {
};

// Class Phoenix.AblObjectStateBranchCondition
// Size: 0x38 (Inherited: 0x30)
struct UAblObjectStateBranchCondition : UAblBranchCondition {
	enum class EObjectStateBranchCondition ObjectStateBranchCondition; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
};

// Class Phoenix.AblBranchConditionObjectStateScratchpad
// Size: 0x38 (Inherited: 0x30)
struct UAblBranchConditionObjectStateScratchpad : UAblTaskConditionScratchpad {
	struct UObjectStateInfo* ObjectStateInfo; // 0x30(0x08)
};

// Class Phoenix.AblBranchConditionObjectState_New
// Size: 0x60 (Inherited: 0x28)
struct UAblBranchConditionObjectState_New : UAblTaskCondition {
	bool bCheckDeathState; // 0x28(0x01)
	enum class EObjectStateBranchCondition ObjectStateBranchCondition; // 0x29(0x01)
	bool bCheckDatabaseId; // 0x2a(0x01)
	char pad_2B[0x5]; // 0x2b(0x05)
	struct TArray<struct FName> DatabaseIds; // 0x30(0x10)
	bool bCheckSubtypeId; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)
	struct TArray<struct FName> SubtypeIds; // 0x48(0x10)
	bool bInWater; // 0x58(0x01)
	bool bNotInWater; // 0x59(0x01)
	bool bInvert; // 0x5a(0x01)
	char pad_5B[0x5]; // 0x5b(0x05)
};

// Class Phoenix.AblObjectStateDropLootTask
// Size: 0x90 (Inherited: 0x70)
struct UAblObjectStateDropLootTask : UAblAbilityTask {
	bool bSpawnOnFloor; // 0x70(0x01)
	bool bApplyImpulse; // 0x71(0x01)
	char pad_72[0x2]; // 0x72(0x02)
	struct FVector ImpulseDirection; // 0x74(0x0c)
	float ImpulseDirectionRandAngle; // 0x80(0x04)
	float MinImpulse; // 0x84(0x04)
	float MaxImpulse; // 0x88(0x04)
	char pad_8C[0x4]; // 0x8c(0x04)
};

// Class Phoenix.AblObjectStateImpulseIgnoreTask
// Size: 0x78 (Inherited: 0x70)
struct UAblObjectStateImpulseIgnoreTask : UAblAbilityTask {
	bool bUseTaskDuration; // 0x70(0x01)
	char pad_71[0x3]; // 0x71(0x03)
	float ImpulseIgnoreDuration; // 0x74(0x04)
};

// Class Phoenix.AblOpportunityWindowTagTaskScratchPad
// Size: 0x68 (Inherited: 0x28)
struct UAblOpportunityWindowTagTaskScratchPad : UAblAbilityTaskScratchPad {
	char pad_28[0x40]; // 0x28(0x40)
};

// Class Phoenix.ablOpportunityWindowTagTask
// Size: 0xd0 (Inherited: 0x70)
struct UablOpportunityWindowTagTask : UAblAbilityTask {
	struct FName SpellName; // 0x70(0x08)
	struct FGameplayTagContainer CharacterTags; // 0x78(0x20)
	enum class ETagOperation TagOperation; // 0x98(0x01)
	bool RemoveTagsAtEndOfTask; // 0x99(0x01)
	bool bCheckDatabaseId; // 0x9a(0x01)
	char pad_9B[0x5]; // 0x9b(0x05)
	struct TArray<struct FName> DatabaseIds; // 0xa0(0x10)
	bool bCheckSubtypeId; // 0xb0(0x01)
	char pad_B1[0x7]; // 0xb1(0x07)
	struct TArray<struct FName> SubtypeIds; // 0xb8(0x10)
	struct FGameplayTag DuelTechniqueEventTag; // 0xc8(0x08)
};

// Class Phoenix.AblOpportunityWindowTask_ModifyAOECastScratchPad
// Size: 0x70 (Inherited: 0x68)
struct UAblOpportunityWindowTask_ModifyAOECastScratchPad : UAblOpportunityWindowTagTaskScratchPad {
	char pad_68[0x8]; // 0x68(0x08)
};

// Class Phoenix.ablOpportunityWindowTask_ModifyAOECast
// Size: 0xd8 (Inherited: 0xd0)
struct UablOpportunityWindowTask_ModifyAOECast : UablOpportunityWindowTagTask {
	enum class EOpportunityType OpportunityType; // 0xd0(0x01)
	char pad_D1[0x3]; // 0xd1(0x03)
	float RemainingLifeTime; // 0xd4(0x04)
};

// Class Phoenix.ablPhysicalBodyBlendTaskScratchPad
// Size: 0x30 (Inherited: 0x28)
struct UablPhysicalBodyBlendTaskScratchPad : UAblAbilityTaskScratchPad {
	char pad_28[0x8]; // 0x28(0x08)
};

// Class Phoenix.ablPhysicalBodyBlendTask
// Size: 0x90 (Inherited: 0x70)
struct UablPhysicalBodyBlendTask : UAblAbilityTask {
	struct TArray<struct FPhysicalBodyNameWeightPair> PerBoneBlendWeights; // 0x70(0x10)
	float BlendInTime; // 0x80(0x04)
	enum class EAlphaBlendOption BlendInOption; // 0x84(0x01)
	char pad_85[0x3]; // 0x85(0x03)
	float BlendOutTime; // 0x88(0x04)
	enum class EAlphaBlendOption BlendOutOption; // 0x8c(0x01)
	bool bContinous; // 0x8d(0x01)
	char pad_8E[0x2]; // 0x8e(0x02)
};

// Class Phoenix.AblPhysicalReactionTask
// Size: 0x88 (Inherited: 0x70)
struct UAblPhysicalReactionTask : UAblAbilityTask {
	enum class EPhysicalReactionTaskAction Action; // 0x70(0x01)
	enum class EImpactReactionStrength ReactionStrength; // 0x71(0x01)
	bool bBlendBackOnTaskEnd; // 0x72(0x01)
	enum class ERagdollDrivingSetting SetPoseDrivingMode; // 0x73(0x01)
	enum class ERagdollPoseDrivingMode PoseDrivingMode; // 0x74(0x01)
	char pad_75[0x3]; // 0x75(0x03)
	float PoseDrivingBlendDuration; // 0x78(0x04)
	bool bSetCenterOfMassDrivingModes; // 0x7c(0x01)
	enum class ERagdollCOMLocationDrivingMode LocationDrivingMode; // 0x7d(0x01)
	enum class ERagdollCOMRotationDrivingMode RotationDrivingMode; // 0x7e(0x01)
	bool bEnableCcd; // 0x7f(0x01)
	float CcdTime; // 0x80(0x04)
	char pad_84[0x4]; // 0x84(0x04)
};

// Class Phoenix.AblPhysicalReactionBlendBackTask
// Size: 0x80 (Inherited: 0x70)
struct UAblPhysicalReactionBlendBackTask : UAblAbilityTask {
	bool bForcePopOutOfRagdollImmediately; // 0x70(0x01)
	bool bOverrideBlendDuration; // 0x71(0x01)
	char pad_72[0x2]; // 0x72(0x02)
	float BlendDurationOverride; // 0x74(0x04)
	bool bStationaryCapsuleWhileBlending; // 0x78(0x01)
	char pad_79[0x7]; // 0x79(0x07)
};

// Class Phoenix.AblPhysicalReactionCOMVelocityTask
// Size: 0x80 (Inherited: 0x70)
struct UAblPhysicalReactionCOMVelocityTask : UAblAbilityTask {
	enum class EAblNpcReactCapsuleImpulseVelocitySource VelocitySource; // 0x70(0x01)
	char pad_71[0x3]; // 0x71(0x03)
	float Magnitude; // 0x74(0x04)
	float Angle; // 0x78(0x04)
	char pad_7C[0x4]; // 0x7c(0x04)
};

// Class Phoenix.AblPhysicalReactionConstraintContextTask
// Size: 0x78 (Inherited: 0x70)
struct UAblPhysicalReactionConstraintContextTask : UAblAbilityTask {
	struct FName ConstraintContext; // 0x70(0x08)
};

// Class Phoenix.AblPlayDialogTaskScratchPad
// Size: 0x40 (Inherited: 0x28)
struct UAblPlayDialogTaskScratchPad : UAblAbilityTaskScratchPad {
	struct TArray<struct TWeakObjectPtr<struct UAudioComponent>> AttachedDialogs; // 0x28(0x10)
	int32_t DialogEventId; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
};

// Class Phoenix.AblPlayDialogTask
// Size: 0xf0 (Inherited: 0x70)
struct UAblPlayDialogTask : UAblAbilityTask {
	struct FDialogueConversationReference DialogEventReference; // 0x70(0x10)
	struct UAvaAudioDialogueEvent* DialogEvent; // 0x80(0x08)
	struct FName EventName; // 0x88(0x08)
	struct FAudioDialogueFlags AudioDialogueFlags; // 0x90(0x07)
	bool bStopWhenAttachedToDestroyed; // 0x97(0x01)
	bool bStopDialogueOnEndTask; // 0x98(0x01)
	char pad_99[0x7]; // 0x99(0x07)
	struct TSet<struct FName> AllowedSubtypeIDs; // 0xa0(0x50)
};

// Class Phoenix.AblPlayMultiFxAssetBaseTask
// Size: 0xa0 (Inherited: 0x70)
struct UAblPlayMultiFxAssetBaseTask : UAblAbilityTask {
	struct FVector Location; // 0x70(0x0c)
	struct FRotator Rotation; // 0x7c(0x0c)
	struct FName AttachPointName; // 0x88(0x08)
	struct TArray<struct UAblTaskCondition*> TaskConditions; // 0x90(0x10)
};

// Class Phoenix.AblPlayObjectArchitectMultiFxAssetTask
// Size: 0xd0 (Inherited: 0xa0)
struct UAblPlayObjectArchitectMultiFxAssetTask : UAblPlayMultiFxAssetBaseTask {
	struct FGameplayTagContainer BaseObjectArchitectTags; // 0xa0(0x20)
	struct TArray<struct UAblObjectArchitectTagChooser*> TagChoosers; // 0xc0(0x10)
};

// Class Phoenix.AblPlayMultiFxAssetNpcTask
// Size: 0xd0 (Inherited: 0xd0)
struct UAblPlayMultiFxAssetNpcTask : UAblPlayObjectArchitectMultiFxAssetTask {
};

// Class Phoenix.AblPlayMultiFxAssetScratchpad
// Size: 0x48 (Inherited: 0x28)
struct UAblPlayMultiFxAssetScratchpad : UAblAbilityTaskScratchPad {
	char pad_28[0x8]; // 0x28(0x08)
	struct TArray<struct UAblTaskConditionScratchpad*> TaskConditionScratchpads; // 0x30(0x10)
	char pad_40[0x8]; // 0x40(0x08)
};

// Class Phoenix.AblPlayMultiFxAssetTask
// Size: 0xa8 (Inherited: 0xa0)
struct UAblPlayMultiFxAssetTask : UAblPlayMultiFxAssetBaseTask {
	struct UMultiFX2Asset* FXAsset; // 0xa0(0x08)
};

// Class Phoenix.AblPlayMultiFxScratchpad
// Size: 0x58 (Inherited: 0x28)
struct UAblPlayMultiFxScratchpad : UAblAbilityTaskScratchPad {
	char pad_28[0x8]; // 0x28(0x08)
	struct TArray<struct UAblTaskConditionScratchpad*> TaskConditionScratchpads; // 0x30(0x10)
	char pad_40[0x18]; // 0x40(0x18)
};

// Class Phoenix.AblPlayMultiFxTask
// Size: 0xd0 (Inherited: 0x70)
struct UAblPlayMultiFxTask : UAblAbilityTask {
	struct FName MultiFXHandleName; // 0x70(0x08)
	struct TArray<struct UMultiFX2_Base*> FX; // 0x78(0x10)
	struct FVector Location; // 0x88(0x0c)
	struct FRotator Rotation; // 0x94(0x0c)
	struct FName AttachPointName; // 0xa0(0x08)
	bool bShutdownPreviousEffect; // 0xa8(0x01)
	bool bDeactivateOnTaskEnd; // 0xa9(0x01)
	char pad_AA[0x6]; // 0xaa(0x06)
	struct TArray<struct UAblTaskCondition*> TaskConditions; // 0xb0(0x10)
	struct TArray<struct FAblMultiFxChildTask> ChildTasks; // 0xc0(0x10)
};

// Class Phoenix.AblPlayObjectArchitectVfxWithRandomTraitsTask
// Size: 0x140 (Inherited: 0xc8)
struct UAblPlayObjectArchitectVfxWithRandomTraitsTask : UAblPlayObjectArchitectVfxTaskBase {
	struct FVector LocationMin; // 0xc8(0x0c)
	struct FVector LocationMax; // 0xd4(0x0c)
	struct FRotator RotationMin; // 0xe0(0x0c)
	struct FRotator RotationMax; // 0xec(0x0c)
	struct FVector ScaleMin; // 0xf8(0x0c)
	struct FVector ScaleMax; // 0x104(0x0c)
	float LifeSpanMin; // 0x110(0x04)
	float LifeSpanMax; // 0x114(0x04)
	float FadeInTimeMin; // 0x118(0x04)
	float FadeInTimeMax; // 0x11c(0x04)
	float FadeOutTimeMin; // 0x120(0x04)
	float FadeOutTimeMax; // 0x124(0x04)
	struct FVector DecalSizeMin; // 0x128(0x0c)
	struct FVector DecalSizeMax; // 0x134(0x0c)
};

// Class Phoenix.AblPlayPostAkEventScratchPad
// Size: 0x28 (Inherited: 0x28)
struct UAblPlayPostAkEventScratchPad : UAblAbilityTaskScratchPad {
};

// Class Phoenix.AblPlayPostAkEvent
// Size: 0x90 (Inherited: 0x70)
struct UAblPlayPostAkEvent : UAblAbilityTask {
	struct UAkAudioEvent* AkEvent; // 0x70(0x08)
	struct FName EventName; // 0x78(0x08)
	bool bStopWhenAttachedToDestroyed; // 0x80(0x01)
	bool bPlayerOnly; // 0x81(0x01)
	bool bPlayerInstigationOnly; // 0x82(0x01)
	char pad_83[0x5]; // 0x83(0x05)
	struct UAkAudioEvent* EventToPostOnTaskEnd; // 0x88(0x08)
};

// Class Phoenix.AblPostAccessibilityAudioCueTask
// Size: 0x78 (Inherited: 0x70)
struct UAblPostAccessibilityAudioCueTask : UAblAbilityTask {
	enum class EAccessibilityAudioCueEventType AudioCueEventType; // 0x70(0x01)
	bool bOneShot; // 0x71(0x01)
	char pad_72[0x6]; // 0x72(0x06)
};

// Class Phoenix.ablPreStartMoveBodyLeanTask
// Size: 0x80 (Inherited: 0x70)
struct UablPreStartMoveBodyLeanTask : UAblAbilityTask {
	struct FName PlayOnChannel; // 0x70(0x08)
	struct UObject* BodyLeanAbilityClass; // 0x78(0x08)
};

// Class Phoenix.AblPushAwayFromInstigatorScratchpad
// Size: 0x38 (Inherited: 0x28)
struct UAblPushAwayFromInstigatorScratchpad : UAblAbilityTaskScratchPad {
	char pad_28[0x10]; // 0x28(0x10)
};

// Class Phoenix.AblPushAwayFromInstigatorTask
// Size: 0x80 (Inherited: 0x70)
struct UAblPushAwayFromInstigatorTask : UAblAbilityTask {
	float Distance; // 0x70(0x04)
	float Speed; // 0x74(0x04)
	bool bContinuousDistanceCheck; // 0x78(0x01)
	bool bIncludeCapsuleSizeInDistanceCheck; // 0x79(0x01)
	char pad_7A[0x6]; // 0x7a(0x06)
};

// Class Phoenix.AblRagdollBehaviorChangedConditionScratchpad
// Size: 0x38 (Inherited: 0x30)
struct UAblRagdollBehaviorChangedConditionScratchpad : UAblTaskConditionScratchpad {
	char pad_30[0x8]; // 0x30(0x08)
};

// Class Phoenix.AblRagdollBehaviorChangedBranchCondition
// Size: 0x28 (Inherited: 0x28)
struct UAblRagdollBehaviorChangedBranchCondition : UAblTaskCondition {
};

// Class Phoenix.AblHasRagdollBehaviorBranchCondition
// Size: 0x28 (Inherited: 0x28)
struct UAblHasRagdollBehaviorBranchCondition : UAblTaskCondition {
};

// Class Phoenix.AblRagdollControlCompConditionScratchpad
// Size: 0x40 (Inherited: 0x30)
struct UAblRagdollControlCompConditionScratchpad : UAblTaskConditionScratchpad {
	struct URagdollControlComponent* RagdollControlComp; // 0x30(0x08)
	struct UIcarus3DMovementComponent* FlightMovementComp; // 0x38(0x08)
};

// Class Phoenix.AblCanRagdollRecoverBranchCondition
// Size: 0x30 (Inherited: 0x28)
struct UAblCanRagdollRecoverBranchCondition : UAblTaskCondition {
	bool bCheckForRecoverOnGround; // 0x28(0x01)
	bool bCheckForRecoverInWater; // 0x29(0x01)
	bool bCheckForRecoverInAir; // 0x2a(0x01)
	char pad_2B[0x5]; // 0x2b(0x05)
};

// Class Phoenix.AblRagdollReactionAbility
// Size: 0xe0 (Inherited: 0xe0)
struct UAblRagdollReactionAbility : UAblReactionAbility {
};

// Class Phoenix.AblBranchConditionReactionEnded
// Size: 0x30 (Inherited: 0x30)
struct UAblBranchConditionReactionEnded : UAblBranchCondition {
};

// Class Phoenix.AblBranchConditionReactionEndingScratchpad
// Size: 0x40 (Inherited: 0x30)
struct UAblBranchConditionReactionEndingScratchpad : UAblTaskConditionScratchpad {
	struct UAblReactionComponent* ReactionComp; // 0x30(0x08)
	struct UAblReactionData* ReactionData; // 0x38(0x08)
};

// Class Phoenix.AblBranchConditionReactionEnding_New
// Size: 0x28 (Inherited: 0x28)
struct UAblBranchConditionReactionEnding_New : UAblTaskCondition {
};

// Class Phoenix.AblBranchConditionReactionDataScratchpad
// Size: 0x38 (Inherited: 0x30)
struct UAblBranchConditionReactionDataScratchpad : UAblTaskConditionScratchpad {
	struct TWeakObjectPtr<struct UNPC_ReactionComponent> ReactionComp; // 0x30(0x08)
};

// Class Phoenix.AblTaskCondition_ReactionData
// Size: 0x78 (Inherited: 0x28)
struct UAblTaskCondition_ReactionData : UAblTaskCondition {
	bool bCompareImpactDirectionWithActorForward; // 0x28(0x01)
	char pad_29[0x3]; // 0x29(0x03)
	float ImpactDotForwardMin; // 0x2c(0x04)
	float ImpactDotForwardMax; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
	struct FGameplayTagContainer RequiredMunitionTags; // 0x38(0x20)
	struct FGameplayTagContainer UnallowedMunitionTags; // 0x58(0x20)
};

// Class Phoenix.AblReactionPlayMultiFxTask
// Size: 0xd8 (Inherited: 0xd0)
struct UAblReactionPlayMultiFxTask : UAblPlayMultiFxTask {
	enum class EReactionPlayMultiFxTaskType ReactionInfoType; // 0xd0(0x01)
	char pad_D1[0x7]; // 0xd1(0x07)
};

// Class Phoenix.AblReactionSyncPointUpdaterScratchpad
// Size: 0x28 (Inherited: 0x28)
struct UAblReactionSyncPointUpdaterScratchpad : UAblAvaMotionWarpSyncPointUpdaterScratchpad {
};

// Class Phoenix.AblReactionSyncPointUpdater
// Size: 0x38 (Inherited: 0x28)
struct UAblReactionSyncPointUpdater : UAblAvaMotionWarpSyncPointUpdater {
	enum class EReactionLocationSyncPointType LocationType; // 0x28(0x01)
	enum class EReactionRotationSyncPointType RotationType; // 0x29(0x01)
	char pad_2A[0x2]; // 0x2a(0x02)
	struct FVector LocationOffset; // 0x2c(0x0c)
};

// Class Phoenix.AblReactionsCapsuleScalingScratchpad
// Size: 0x88 (Inherited: 0x28)
struct UAblReactionsCapsuleScalingScratchpad : UAblAbilityTaskScratchPad {
	char pad_28[0x60]; // 0x28(0x60)
};

// Class Phoenix.AblReactionsCapsuleScalingTask
// Size: 0xb0 (Inherited: 0x70)
struct UAblReactionsCapsuleScalingTask : UAblAbilityTask {
	bool bUseHeightAsRadius; // 0x70(0x01)
	char pad_71[0x3]; // 0x71(0x03)
	float RadiusMultiplier; // 0x74(0x04)
	float HalfHeightMultiplier; // 0x78(0x04)
	bool bRestoreAtEndTask; // 0x7c(0x01)
	char pad_7D[0x3]; // 0x7d(0x03)
	struct FAlphaBlend BlendTime; // 0x80(0x30)
};

// Class Phoenix.AblReactionsEndComboTask
// Size: 0x70 (Inherited: 0x70)
struct UAblReactionsEndComboTask : UAblAbilityTask {
};

// Class Phoenix.AblReactionsDamageTask
// Size: 0xa0 (Inherited: 0x70)
struct UAblReactionsDamageTask : UAblAbilityTask {
	bool bUseTagsFromReactionData; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
	struct FGameplayTagContainer AdditionalGameplayTags; // 0x78(0x20)
	float Damage; // 0x98(0x04)
	char pad_9C[0x4]; // 0x9c(0x04)
};

// Class Phoenix.AblReactionSpecialEffectTask
// Size: 0x80 (Inherited: 0x70)
struct UAblReactionSpecialEffectTask : UAblAbilityTask {
	struct FGameplayTag SpecialEffectTag; // 0x70(0x08)
	float Duration; // 0x78(0x04)
	char pad_7C[0x4]; // 0x7c(0x04)
};

// Class Phoenix.ablRepresentInventoryItemTaskScratchPad
// Size: 0x138 (Inherited: 0x28)
struct UablRepresentInventoryItemTaskScratchPad : UAblAbilityTaskScratchPad {
	struct ABiped_Player* BipedPlayer; // 0x28(0x08)
	struct USkeletalMeshComponent* SkeletalMeshComponent; // 0x30(0x08)
	struct AActor* SpawnedActor; // 0x38(0x08)
	struct FInventoryResult InventoryResult; // 0x40(0x88)
	struct FItemProperties ItemProperties; // 0xc8(0x6c)
	char pad_134[0x4]; // 0x134(0x04)
};

// Class Phoenix.ablRepresentInventoryItemTask
// Size: 0xa8 (Inherited: 0x70)
struct UablRepresentInventoryItemTask : UAblAbilityTask {
	struct AActor* SpawnClass; // 0x70(0x08)
	struct AActor* TemplateClass; // 0x78(0x08)
	struct AMunitionType_Base* MunitionTemplateClass; // 0x80(0x08)
	struct FVector Scale; // 0x88(0x0c)
	struct FName AttachSocket; // 0x94(0x08)
	char pad_9C[0x4]; // 0x9c(0x04)
	struct UCurveFloat* AlphaCurve; // 0xa0(0x08)
};

// Class Phoenix.RootMotionModifier_ButtSlide
// Size: 0x60 (Inherited: 0x50)
struct URootMotionModifier_ButtSlide : URootMotionModifier {
	struct FVector LastVelocity; // 0x50(0x0c)
	char pad_5C[0x4]; // 0x5c(0x04)
};

// Class Phoenix.RootMotionModifierProperties_ButtSlide
// Size: 0x40 (Inherited: 0x30)
struct URootMotionModifierProperties_ButtSlide : URootMotionModifierProperties {
	float DownwardForce; // 0x30(0x04)
	float Friction; // 0x34(0x04)
	enum class ECustomInterpType RotationInterpType; // 0x38(0x01)
	char pad_39[0x3]; // 0x39(0x03)
	float RotationInterpSpeed; // 0x3c(0x04)
};

// Class Phoenix.RootMotionModifier_CharacterScale
// Size: 0x50 (Inherited: 0x50)
struct URootMotionModifier_CharacterScale : URootMotionModifier {
};

// Class Phoenix.RootMotionModifierProperties_CharacterScale
// Size: 0x30 (Inherited: 0x30)
struct URootMotionModifierProperties_CharacterScale : URootMotionModifierProperties {
};

// Class Phoenix.RootMotionModifier_DodgeDuckAssist
// Size: 0x68 (Inherited: 0x50)
struct URootMotionModifier_DodgeDuckAssist : URootMotionModifier {
	struct FVector DesiredFacingDirection; // 0x50(0x0c)
	float AngleOffset; // 0x5c(0x04)
	float YawRecovery; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)

	void CharacterTeleported(struct AAmbulatory_Character* TeleportedCharacter, struct FVector AmountDisplaced, struct FRotator AmountRotated); // Function Phoenix.RootMotionModifier_DodgeDuckAssist.CharacterTeleported // (Final|Native|Public|HasDefaults) // @ game+0x31bd9e0
};

// Class Phoenix.RootMotionModifierProperties_DodgeDuckAssist
// Size: 0x40 (Inherited: 0x30)
struct URootMotionModifierProperties_DodgeDuckAssist : URootMotionModifierProperties {
	bool bInstantRecovery; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	float YawRecoverySpeed; // 0x34(0x04)
	float TurnAssistSpeed; // 0x38(0x04)
	enum class ECustomInterpType TurnAssistType; // 0x3c(0x01)
	char pad_3D[0x3]; // 0x3d(0x03)
};

// Class Phoenix.RootMotionModifier_DodgeRoll
// Size: 0xb0 (Inherited: 0x50)
struct URootMotionModifier_DodgeRoll : URootMotionModifier {
	char pad_50[0x60]; // 0x50(0x60)
};

// Class Phoenix.RootMotionModifierProperties_DodgeRoll
// Size: 0x60 (Inherited: 0x30)
struct URootMotionModifierProperties_DodgeRoll : URootMotionModifierProperties {
	bool bShadowBlink; // 0x30(0x01)
	bool bShadowBlinkWithTarget; // 0x31(0x01)
	enum class ECustomInterpType TurnToFaceInterpType; // 0x32(0x01)
	char pad_33[0x1]; // 0x33(0x01)
	float TurnToFaceInterpSpeed; // 0x34(0x04)
	float TurnToFaceInterpTime; // 0x38(0x04)
	enum class ECustomInterpType RotationInterpType; // 0x3c(0x01)
	char pad_3D[0x3]; // 0x3d(0x03)
	float RotationInterpSpeed; // 0x40(0x04)
	float RotationInterpTime; // 0x44(0x04)
	float TranslationMultiplier; // 0x48(0x04)
	char pad_4C[0x4]; // 0x4c(0x04)
	struct UCurveFloat* TranslationMultiplierCurve; // 0x50(0x08)
	float BlinkSpeed; // 0x58(0x04)
	char pad_5C[0x4]; // 0x5c(0x04)
};

// Class Phoenix.RootMotionModifier_Dueling
// Size: 0x50 (Inherited: 0x50)
struct URootMotionModifier_Dueling : URootMotionModifier {
};

// Class Phoenix.RootMotionModifierProperties_Dueling
// Size: 0x38 (Inherited: 0x30)
struct URootMotionModifierProperties_Dueling : URootMotionModifierProperties {
	float HorizontalRootMotionAmount; // 0x30(0x04)
	float VerticalRootMotionAmount; // 0x34(0x04)
};

// Class Phoenix.RootMotionModifier_EdgeCheck
// Size: 0x50 (Inherited: 0x50)
struct URootMotionModifier_EdgeCheck : URootMotionModifier {
};

// Class Phoenix.RootMotionModifierProperties_EdgeCheck
// Size: 0x48 (Inherited: 0x30)
struct URootMotionModifierProperties_EdgeCheck : URootMotionModifierProperties {
	float DetectMaxDistance; // 0x30(0x04)
	float ComputeEdgeAtThreshhold; // 0x34(0x04)
	float TraceRadius; // 0x38(0x04)
	bool bDebugDraw; // 0x3c(0x01)
	char pad_3D[0x3]; // 0x3d(0x03)
	float SafeDistanceFromEdge; // 0x40(0x04)
	float EdgeOffsetSpeed; // 0x44(0x04)
};

// Class Phoenix.RootMotionModifier_FacingAssist
// Size: 0x80 (Inherited: 0x50)
struct URootMotionModifier_FacingAssist : URootMotionModifier {
	struct FVector StartDirection; // 0x50(0x0c)
	struct FVector CurrentDirection; // 0x5c(0x0c)
	struct FVector DesiredDirection; // 0x68(0x0c)
	float StartHeading; // 0x74(0x04)
	float ElapsedTime; // 0x78(0x04)
	char pad_7C[0x4]; // 0x7c(0x04)

	void CharacterTeleported(struct AAmbulatory_Character* TeleportedCharacter, struct FVector AmountDisplaced, struct FRotator AmountRotated); // Function Phoenix.RootMotionModifier_FacingAssist.CharacterTeleported // (Final|Native|Public|HasDefaults) // @ game+0x31bdb10
};

// Class Phoenix.RootMotionModifierProperties_FacingAssist
// Size: 0x48 (Inherited: 0x30)
struct URootMotionModifierProperties_FacingAssist : URootMotionModifierProperties {
	enum class ERootMotionModTurnAssistUseDirection UseDirection; // 0x30(0x01)
	bool bFaceNegativeDirectionIfCloser; // 0x31(0x01)
	bool bIgnoreTargetTracker; // 0x32(0x01)
	bool bAllowDesiredDirectionUpdates; // 0x33(0x01)
	bool bRotateRootTranslationIntoDesiredDirection; // 0x34(0x01)
	enum class ECustomInterpType InterpType; // 0x35(0x01)
	char pad_36[0x2]; // 0x36(0x02)
	float InterpSpeed; // 0x38(0x04)
	float InterpTime; // 0x3c(0x04)
	bool bDebug; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)
};

// Class Phoenix.RootMotionModifier_FallingAssist
// Size: 0x60 (Inherited: 0x50)
struct URootMotionModifier_FallingAssist : URootMotionModifier {
	struct FVector CurrentVelocityXZ; // 0x50(0x0c)
	float ElapsedTime; // 0x5c(0x04)
};

// Class Phoenix.RootMotionModifierProperties_FallingAssist
// Size: 0x40 (Inherited: 0x30)
struct URootMotionModifierProperties_FallingAssist : URootMotionModifierProperties {
	float MinSpeed; // 0x30(0x04)
	float MaxSpeed; // 0x34(0x04)
	float InterpToZero; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
};

// Class Phoenix.RootMotionModifier_FastTravelPort
// Size: 0x78 (Inherited: 0x50)
struct URootMotionModifier_FastTravelPort : URootMotionModifier {
	struct TArray<struct TWeakObjectPtr<struct USceneComponent>> TravelerComponents; // 0x50(0x10)
	struct TArray<struct TWeakObjectPtr<struct USceneComponent>> PortalComponents; // 0x60(0x10)
	float ElapsedTime; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)
};

// Class Phoenix.RootMotionModifierProperties_FastTravelPort
// Size: 0x48 (Inherited: 0x30)
struct URootMotionModifierProperties_FastTravelPort : URootMotionModifierProperties {
	bool bAllowYawRotation; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	float YawToTargetThreshold; // 0x34(0x04)
	float TimeToRotateToTarget; // 0x38(0x04)
	bool bAllowTranslation; // 0x3c(0x01)
	char pad_3D[0x3]; // 0x3d(0x03)
	float TimeToTranslateToTarget; // 0x40(0x04)
	bool bDebug; // 0x44(0x01)
	char pad_45[0x3]; // 0x45(0x03)
};

// Class Phoenix.RootMotionModifier_FollowSpline
// Size: 0x58 (Inherited: 0x50)
struct URootMotionModifier_FollowSpline : URootMotionModifier {
	float Speed; // 0x50(0x04)
	float InitialMaxOffsetRadius; // 0x54(0x04)
};

// Class Phoenix.RootMotionModifierProperties_FollowSpline
// Size: 0x60 (Inherited: 0x30)
struct URootMotionModifierProperties_FollowSpline : URootMotionModifierProperties {
	float StartSpeed; // 0x30(0x04)
	bool bUseActualSpeedAsStartSpeed; // 0x34(0x01)
	char pad_35[0x3]; // 0x35(0x03)
	float Acceleration; // 0x38(0x04)
	float MinSpeed; // 0x3c(0x04)
	float MaxSpeed; // 0x40(0x04)
	float RotationSpeed; // 0x44(0x04)
	float MaxOffsetRadius; // 0x48(0x04)
	float HoritzontalSpeed; // 0x4c(0x04)
	struct FBTCustomAction SendActionAtEndOfSpline; // 0x50(0x0c)
	bool bDebug; // 0x5c(0x01)
	char pad_5D[0x3]; // 0x5d(0x03)
};

// Class Phoenix.RootMotionModProperties_Interact
// Size: 0x50 (Inherited: 0x28)
struct URootMotionModProperties_Interact : UObject {
	enum class EInteractTurnToFaceRules TurnToFaceRule; // 0x28(0x01)
	enum class EInteractUseTargetAxis UseTargetAxisForFacing; // 0x29(0x01)
	enum class ECustomInterpType RotateInterpType; // 0x2a(0x01)
	char pad_2B[0x1]; // 0x2b(0x01)
	float RotateInterpSpeed; // 0x2c(0x04)
	float RotateInterpTime; // 0x30(0x04)
	enum class EInteractOffsetRules OffsetRule; // 0x34(0x01)
	enum class EInteractUseTargetAxis UseTargetAxisForOffset; // 0x35(0x01)
	char pad_36[0x2]; // 0x36(0x02)
	float MinOffset; // 0x38(0x04)
	float MaxOffset; // 0x3c(0x04)
	enum class ECustomInterpType OffsetInterpType; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	float OffsetInterpSpeed; // 0x44(0x04)
	float OffsetInterpTime; // 0x48(0x04)
	char pad_4C[0x4]; // 0x4c(0x04)
};

// Class Phoenix.RootMotionModifier_Interact
// Size: 0x80 (Inherited: 0x50)
struct URootMotionModifier_Interact : URootMotionModifier {
	char pad_50[0x30]; // 0x50(0x30)
};

// Class Phoenix.RootMotionModifierProperties_Interact
// Size: 0x40 (Inherited: 0x30)
struct URootMotionModifierProperties_Interact : URootMotionModifierProperties {
	enum class EInteractUseTargetTracker UseTargetTracker; // 0x30(0x01)
	bool bUseActorFromTracker; // 0x31(0x01)
	enum class ETargetID SpecificTargetID; // 0x32(0x01)
	char pad_33[0x5]; // 0x33(0x05)
	struct URootMotionModProperties_Interact* Properties; // 0x38(0x08)
};

// Class Phoenix.RootMotionModifier_InterpToForwardSpeed
// Size: 0x58 (Inherited: 0x50)
struct URootMotionModifier_InterpToForwardSpeed : URootMotionModifier {
	float CurrentSpeed; // 0x50(0x04)
	char pad_54[0x4]; // 0x54(0x04)
};

// Class Phoenix.RootMotionModifierProperties_InterpToForwardSpeed
// Size: 0x48 (Inherited: 0x30)
struct URootMotionModifierProperties_InterpToForwardSpeed : URootMotionModifierProperties {
	enum class ERootMotModDesiredSpeed DesiredSpeedState; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	float DesiredSpeed; // 0x34(0x04)
	float MinSpeed; // 0x38(0x04)
	float MaxSpeed; // 0x3c(0x04)
	float InterpSpeed; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
};

// Class Phoenix.RootMotionModifier_InterpToStop
// Size: 0x68 (Inherited: 0x50)
struct URootMotionModifier_InterpToStop : URootMotionModifier {
	float StartSpeed; // 0x50(0x04)
	float CurrentSpeed; // 0x54(0x04)
	float InterpTime; // 0x58(0x04)
	char pad_5C[0xc]; // 0x5c(0x0c)
};

// Class Phoenix.RootMotionModifierProperties_InterpToStop
// Size: 0x40 (Inherited: 0x30)
struct URootMotionModifierProperties_InterpToStop : URootMotionModifierProperties {
	enum class ECustomInterpType ToStopInterpType; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	float ToStopInterpSpeed; // 0x34(0x04)
	float ToStopTotalTime; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
};

// Class Phoenix.RootMotionModifier_JumpControl
// Size: 0x70 (Inherited: 0x50)
struct URootMotionModifier_JumpControl : URootMotionModifier {
	char pad_50[0x20]; // 0x50(0x20)
};

// Class Phoenix.RootMotionModifierProperties_JumpControl
// Size: 0x48 (Inherited: 0x30)
struct URootMotionModifierProperties_JumpControl : URootMotionModifierProperties {
	float InitialSpeed; // 0x30(0x04)
	float MaxSpeed; // 0x34(0x04)
	float AccelerationInterpSpeed; // 0x38(0x04)
	float BrakingInterpSpeed; // 0x3c(0x04)
	enum class EJumpControlType JumpControlType; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	float BlendInTime; // 0x44(0x04)
};

// Class Phoenix.RootMotionModifier_JumpNudge
// Size: 0x98 (Inherited: 0x50)
struct URootMotionModifier_JumpNudge : URootMotionModifier {
	char pad_50[0x48]; // 0x50(0x48)
};

// Class Phoenix.RootMotionModifierProperties_JumpNudge
// Size: 0x90 (Inherited: 0x30)
struct URootMotionModifierProperties_JumpNudge : URootMotionModifierProperties {
	float TimeWhenPlayerCanChangeJumpType; // 0x30(0x04)
	enum class ECustomInterpType TurnToFaceInterpType; // 0x34(0x01)
	char pad_35[0x3]; // 0x35(0x03)
	float TurnToFaceInterpSpeed; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
	struct UCurveFloat* DeadZoneCurve; // 0x40(0x08)
	struct FVector2D MaxStrafeSpeed; // 0x48(0x08)
	enum class ECustomInterpType StrafeInterpType; // 0x50(0x01)
	char pad_51[0x3]; // 0x51(0x03)
	float StrafeInterpSpeed; // 0x54(0x04)
	enum class ECustomInterpType StrafeRotationInterpType; // 0x58(0x01)
	char pad_59[0x3]; // 0x59(0x03)
	float StrafeRotationInterpSpeed; // 0x5c(0x04)
	enum class ECustomInterpType StrafeTranslationInterpType; // 0x60(0x01)
	char pad_61[0x3]; // 0x61(0x03)
	float StrafeTranslationInterpSpeed; // 0x64(0x04)
	enum class ECustomInterpType ShortJumpRotationInterpType; // 0x68(0x01)
	char pad_69[0x3]; // 0x69(0x03)
	float ShortJumpRotationInterpSpeed; // 0x6c(0x04)
	enum class ECustomInterpType LongJumpRotationInterpType; // 0x70(0x01)
	char pad_71[0x3]; // 0x71(0x03)
	float LongJumpRotationInterpSpeed; // 0x74(0x04)
	float LongJumpMinStickPercentage; // 0x78(0x04)
	float LongJumpPullBackOnStickPercentage; // 0x7c(0x04)
	enum class ECustomInterpType SprintJumpRotationInterpType; // 0x80(0x01)
	char pad_81[0x3]; // 0x81(0x03)
	float SprintJumpRotationInterpSpeed; // 0x84(0x04)
	float SprintJumpMinStickPercentage; // 0x88(0x04)
	float SprintJumpPullBackOnStickPercentage; // 0x8c(0x04)
};

// Class Phoenix.RootMotionModifier_Move
// Size: 0x58 (Inherited: 0x50)
struct URootMotionModifier_Move : URootMotionModifier {
	float StartingSpeed; // 0x50(0x04)
	float ElapsedTime; // 0x54(0x04)

	void CharacterTeleported(struct AAmbulatory_Character* TeleportedCharacter, struct FRotator AmountRotated); // Function Phoenix.RootMotionModifier_Move.CharacterTeleported // (Final|Native|Public|HasDefaults) // @ game+0x31c1840
	void CharacterRotatedBySupport(struct FRotator AmountRotated); // Function Phoenix.RootMotionModifier_Move.CharacterRotatedBySupport // (Final|Native|Public|HasDefaults) // @ game+0x31c1690
};

// Class Phoenix.RootMotionModifierProperties_Move
// Size: 0x50 (Inherited: 0x30)
struct URootMotionModifierProperties_Move : URootMotionModifierProperties {
	enum class EMoveDirectionRule MoveDirectionRule; // 0x30(0x01)
	enum class EMoveMinSpeedRule MoveMinSpeedRule; // 0x31(0x01)
	enum class EMoveMaxSpeedRule MoveMaxSpeedRule; // 0x32(0x01)
	enum class EMoveInterpRule MoveInterpRule; // 0x33(0x01)
	bool bNegateDirection; // 0x34(0x01)
	char pad_35[0x3]; // 0x35(0x03)
	float FixedMinSpeed; // 0x38(0x04)
	float FixedMaxSpeed; // 0x3c(0x04)
	float InterpSpeed; // 0x40(0x04)
	bool bOverrideWalkSpeed; // 0x44(0x01)
	char pad_45[0x3]; // 0x45(0x03)
	float WalkSpeedOverride; // 0x48(0x04)
	bool bEnabled; // 0x4c(0x01)
	char pad_4D[0x3]; // 0x4d(0x03)
};

// Class Phoenix.RootMotionModifier_Multiplier
// Size: 0x50 (Inherited: 0x50)
struct URootMotionModifier_Multiplier : URootMotionModifier {
};

// Class Phoenix.RootMotionModifierProperties_Multiplier
// Size: 0x48 (Inherited: 0x30)
struct URootMotionModifierProperties_Multiplier : URootMotionModifierProperties {
	enum class EMultiplierType MultiplyType; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	float XAxis_Multiplier; // 0x34(0x04)
	float YAxis_Multiplier; // 0x38(0x04)
	float ZAxis_Multiplier; // 0x3c(0x04)
	float Multiplier; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
};

// Class Phoenix.RootMotionModifier_NPCFollowSpline
// Size: 0x58 (Inherited: 0x50)
struct URootMotionModifier_NPCFollowSpline : URootMotionModifier {
	float Speed; // 0x50(0x04)
	float InitialMaxOffsetRadius; // 0x54(0x04)
};

// Class Phoenix.RootMotionModifierProperties_NPCFollowSpline
// Size: 0x60 (Inherited: 0x30)
struct URootMotionModifierProperties_NPCFollowSpline : URootMotionModifierProperties {
	float StartSpeed; // 0x30(0x04)
	bool bUseActualSpeedAsStartSpeed; // 0x34(0x01)
	char pad_35[0x3]; // 0x35(0x03)
	float Acceleration; // 0x38(0x04)
	float MinSpeed; // 0x3c(0x04)
	float MaxSpeed; // 0x40(0x04)
	float RotationSpeed; // 0x44(0x04)
	float MaxOffsetRadius; // 0x48(0x04)
	float HoritzontalSpeed; // 0x4c(0x04)
	struct FBTCustomAction SendActionAtEndOfSpline; // 0x50(0x0c)
	bool bDebug; // 0x5c(0x01)
	char pad_5D[0x3]; // 0x5d(0x03)
};

// Class Phoenix.RootMotionModifier_NPCMobilityTurnAssist
// Size: 0x80 (Inherited: 0x50)
struct URootMotionModifier_NPCMobilityTurnAssist : URootMotionModifier {
	struct FVector RootMotionRotationDirection; // 0x50(0x0c)
	struct FVector RootMotionTranslationDirection; // 0x5c(0x0c)
	float ElapsedTime; // 0x68(0x04)
	struct FVector TranslateVec; // 0x6c(0x0c)
	bool bApplyTranslateVec; // 0x78(0x01)
	char pad_79[0x7]; // 0x79(0x07)

	void CharacterTeleported(struct AAmbulatory_Character* TeleportedCharacter, struct FRotator AmountRotated); // Function Phoenix.RootMotionModifier_NPCMobilityTurnAssist.CharacterTeleported // (Final|Native|Public|HasDefaults) // @ game+0x31c1920
	void CharacterRotatedBySupport(struct FRotator AmountRotated); // Function Phoenix.RootMotionModifier_NPCMobilityTurnAssist.CharacterRotatedBySupport // (Final|Native|Public|HasDefaults) // @ game+0x31c1720
};

// Class Phoenix.RootMotionModifierProperties_NPCMobilityTurnAssist
// Size: 0x38 (Inherited: 0x30)
struct URootMotionModifierProperties_NPCMobilityTurnAssist : URootMotionModifierProperties {
	enum class ENPC_TurnAssist TurnAssistMode; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
};

// Class Phoenix.RootMotionModifier_NPCStrafe
// Size: 0x50 (Inherited: 0x50)
struct URootMotionModifier_NPCStrafe : URootMotionModifier {
};

// Class Phoenix.RootMotionModifierProperties_NPCStrafe
// Size: 0x40 (Inherited: 0x30)
struct URootMotionModifierProperties_NPCStrafe : URootMotionModifierProperties {
	struct TArray<struct FDbSingleColumnInfo> SubtypeIds; // 0x30(0x10)
};

// Class Phoenix.RootMotionModifier_ScaleZToPlayer
// Size: 0x68 (Inherited: 0x50)
struct URootMotionModifier_ScaleZToPlayer : URootMotionModifier {
	char pad_50[0x18]; // 0x50(0x18)
};

// Class Phoenix.RootMotionModifierProperties_ScaleZToPlayer
// Size: 0x40 (Inherited: 0x30)
struct URootMotionModifierProperties_ScaleZToPlayer : URootMotionModifierProperties {
	struct USkeletalMesh* SkeletalMesh; // 0x30(0x08)
	struct FName BoneName; // 0x38(0x08)
};

// Class Phoenix.RootMotionModifier_Shuffle
// Size: 0x50 (Inherited: 0x50)
struct URootMotionModifier_Shuffle : URootMotionModifier {
};

// Class Phoenix.RootMotionModifierProperties_Shuffle
// Size: 0x30 (Inherited: 0x30)
struct URootMotionModifierProperties_Shuffle : URootMotionModifierProperties {
};

// Class Phoenix.RootMotionModifier_Slide
// Size: 0x60 (Inherited: 0x50)
struct URootMotionModifier_Slide : URootMotionModifier {
	struct FVector CurrentVelocity; // 0x50(0x0c)
	char pad_5C[0x4]; // 0x5c(0x04)
};

// Class Phoenix.RootMotionModifierProperties_Slide
// Size: 0x48 (Inherited: 0x30)
struct URootMotionModifierProperties_Slide : URootMotionModifierProperties {
	float DesiredSlopeSpeed; // 0x30(0x04)
	enum class ECustomInterpType SlopeVelocityInterpType; // 0x34(0x01)
	char pad_35[0x3]; // 0x35(0x03)
	float SlopeVelocityInterpSpeed; // 0x38(0x04)
	enum class ECustomInterpType ToFlatGroundInterpType; // 0x3c(0x01)
	char pad_3D[0x3]; // 0x3d(0x03)
	float ToFlatGroundInterpSpeed; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
};

// Class Phoenix.RootMotionModifier_StopAtEdge
// Size: 0x50 (Inherited: 0x50)
struct URootMotionModifier_StopAtEdge : URootMotionModifier {
};

// Class Phoenix.RootMotionModifierProperties_StopAtEdge
// Size: 0x40 (Inherited: 0x30)
struct URootMotionModifierProperties_StopAtEdge : URootMotionModifierProperties {
	float TraceStartUp; // 0x30(0x04)
	float TraceEndDown; // 0x34(0x04)
	float DesiredDistanceFromEdge; // 0x38(0x04)
	bool bDebug; // 0x3c(0x01)
	char pad_3D[0x3]; // 0x3d(0x03)
};

// Class Phoenix.RootMotionModifier_Strafe
// Size: 0x58 (Inherited: 0x50)
struct URootMotionModifier_Strafe : URootMotionModifier {
	float ElapsedTime; // 0x50(0x04)
	char pad_54[0x4]; // 0x54(0x04)

	void CharacterTeleported(struct AAmbulatory_Character* TeleportedCharacter, struct FRotator AmountRotated); // Function Phoenix.RootMotionModifier_Strafe.CharacterTeleported // (Final|Native|Public|HasDefaults) // @ game+0x31c1840
	void CharacterRotatedBySupport(struct FRotator AmountRotated); // Function Phoenix.RootMotionModifier_Strafe.CharacterRotatedBySupport // (Final|Native|Public|HasDefaults) // @ game+0x31c1690
};

// Class Phoenix.RootMotionModifierProperties_Strafe
// Size: 0x38 (Inherited: 0x30)
struct URootMotionModifierProperties_Strafe : URootMotionModifierProperties {
	float Acceleration; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
};

// Class Phoenix.RootMotionModifier_TargetTracker
// Size: 0x50 (Inherited: 0x50)
struct URootMotionModifier_TargetTracker : URootMotionModifier {
};

// Class Phoenix.RootMotionModifierProperties_TargetTracker
// Size: 0x48 (Inherited: 0x30)
struct URootMotionModifierProperties_TargetTracker : URootMotionModifierProperties {
	enum class ERootMotionModTargetType TargetType; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	struct FVector Offset; // 0x34(0x0c)
	bool bGetActorFromTracker; // 0x40(0x01)
	enum class ETargetID GetActorFromTargetID; // 0x41(0x01)
	enum class ECustomInterpType InterpType; // 0x42(0x01)
	char pad_43[0x1]; // 0x43(0x01)
	float InterpSpeed; // 0x44(0x04)
};

// Class Phoenix.RootMotionModifier_Telescope
// Size: 0x80 (Inherited: 0x50)
struct URootMotionModifier_Telescope : URootMotionModifier {
	char pad_50[0x30]; // 0x50(0x30)
};

// Class Phoenix.RootMotionModifierProperties_Telescope
// Size: 0x48 (Inherited: 0x30)
struct URootMotionModifierProperties_Telescope : URootMotionModifierProperties {
	struct FVector Offset; // 0x30(0x0c)
	enum class ECustomInterpType InterpType; // 0x3c(0x01)
	char pad_3D[0x3]; // 0x3d(0x03)
	float InterpSpeed; // 0x40(0x04)
	float InterpTime; // 0x44(0x04)
};

// Class Phoenix.RootMotionModifier_TurnAssist
// Size: 0xd8 (Inherited: 0x50)
struct URootMotionModifier_TurnAssist : URootMotionModifier {
	struct FVector CurrentDirection; // 0x50(0x0c)
	struct FVector TargetDirection; // 0x5c(0x0c)
	struct FVector DesiredDirection; // 0x68(0x0c)
	struct FVector RootMotionRotationDirection; // 0x74(0x0c)
	struct FVector RootMotionTranslationDirection; // 0x80(0x0c)
	float RootYawRemaining; // 0x8c(0x04)
	float RootYawOffset; // 0x90(0x04)
	float RootYawSampleTime; // 0x94(0x04)
	bool bRootYawRemainingInitialized; // 0x98(0x01)
	char pad_99[0x3]; // 0x99(0x03)
	float ElapsedTime; // 0x9c(0x04)
	float ScaledElapsedTime; // 0xa0(0x04)
	bool bValidFacingTargets; // 0xa4(0x01)
	char pad_A5[0x3]; // 0xa5(0x03)
	struct FVector TestVector; // 0xa8(0x0c)
	char pad_B4[0x24]; // 0xb4(0x24)

	void CharacterTeleported(struct AAmbulatory_Character* TeleportedCharacter, struct FVector AmountDisplaced, struct FRotator AmountRotated); // Function Phoenix.RootMotionModifier_TurnAssist.CharacterTeleported // (Final|Native|Public|HasDefaults) // @ game+0x31c1a00
	void CharacterRotatedBySupport(struct FRotator AmountRotated); // Function Phoenix.RootMotionModifier_TurnAssist.CharacterRotatedBySupport // (Final|Native|Public|HasDefaults) // @ game+0x31c17b0
};

// Class Phoenix.RootMotionModifierProperties_TurnAssist
// Size: 0x98 (Inherited: 0x30)
struct URootMotionModifierProperties_TurnAssist : URootMotionModifierProperties {
	enum class ERootMotionModTurnAssistUseDirection UseDirection; // 0x30(0x01)
	enum class ERootMotionModTurnAssistMethod UseMethod; // 0x31(0x01)
	enum class ECustomInterpType RotationInterpType; // 0x32(0x01)
	char pad_33[0x1]; // 0x33(0x01)
	float RegularSpeedRotationInterpSpeed; // 0x34(0x04)
	bool bScaleRotationBasedOnSpeed; // 0x38(0x01)
	char pad_39[0x3]; // 0x39(0x03)
	float LowSpeedRotationInterpSpeed; // 0x3c(0x04)
	struct FVector2D SpeedRange; // 0x40(0x08)
	float SpringHalflife; // 0x48(0x04)
	float SpringLowSpeedHalflifeMultiplier; // 0x4c(0x04)
	bool bAdjustTranslationBasedOnTurn; // 0x50(0x01)
	char pad_51[0x3]; // 0x51(0x03)
	struct FVector2D TranslationAdjustAngleRange; // 0x54(0x08)
	float TranslationAdjustMinMultiplier; // 0x5c(0x04)
	bool bUseFixedDirection; // 0x60(0x01)
	char pad_61[0x7]; // 0x61(0x07)
	struct UCurveFloat* TurnAssistCurve; // 0x68(0x08)
	struct UCurveFloat* TurnAssistTimeMultiplier; // 0x70(0x08)
	float MinRotationScaleBasedOnSpeed; // 0x78(0x04)
	struct FVector2D AllowedRangeFromFallLine; // 0x7c(0x08)
	bool bIgnoreTargetTracker; // 0x84(0x01)
	bool bAllowDesiredDirectionUpdates; // 0x85(0x01)
	char pad_86[0x2]; // 0x86(0x02)
	float DesiredDirectionUpdateDuration; // 0x88(0x04)
	bool bDebug; // 0x8c(0x01)
	enum class ECustomInterpType SplineRotationInterpType; // 0x8d(0x01)
	char pad_8E[0x2]; // 0x8e(0x02)
	float SplineRotationInterpSpeed; // 0x90(0x04)
	char pad_94[0x4]; // 0x94(0x04)
};

// Class Phoenix.RootMotionModifier_WandCastTranslation
// Size: 0x50 (Inherited: 0x50)
struct URootMotionModifier_WandCastTranslation : URootMotionModifier {
};

// Class Phoenix.RootMotionModifierProperties_WandCastTranslation
// Size: 0x30 (Inherited: 0x30)
struct URootMotionModifierProperties_WandCastTranslation : URootMotionModifierProperties {
};

// Class Phoenix.AblRootMotionModifiersScratchpad
// Size: 0x40 (Inherited: 0x28)
struct UAblRootMotionModifiersScratchpad : UAblAbilityTaskScratchPad {
	struct TArray<struct UAblTaskConditionScratchpad*> TaskConditionScratchpads; // 0x28(0x10)
	char pad_38[0x8]; // 0x38(0x08)
};

// Class Phoenix.ablRootMotionModifiersTask
// Size: 0x98 (Inherited: 0x70)
struct UablRootMotionModifiersTask : UAblAbilityTask {
	struct TArray<struct URootMotionModifierProperties*> m_RootMotionModifierPropertiesArray; // 0x70(0x10)
	struct TArray<struct UAblTaskCondition*> TaskConditions; // 0x80(0x10)
	bool bMustPassAllConditions; // 0x90(0x01)
	char pad_91[0x7]; // 0x91(0x07)
};

// Class Phoenix.RootMotionModifierUltimate_SplineLock
// Size: 0x58 (Inherited: 0x50)
struct URootMotionModifierUltimate_SplineLock : URootMotionModifierUltimate {
	float SplineRightOffset; // 0x50(0x04)
	char pad_54[0x4]; // 0x54(0x04)
};

// Class Phoenix.RootMotionModifierProperties_SplineLock
// Size: 0x48 (Inherited: 0x30)
struct URootMotionModifierProperties_SplineLock : URootMotionModifierProperties {
	float MaxOffset; // 0x30(0x04)
	bool bAllowReverseDirection; // 0x34(0x01)
	bool bAllowOrientReverseDirection; // 0x35(0x01)
	bool bLimitToEndPoints; // 0x36(0x01)
	enum class ECustomInterpType OffsetInterpType; // 0x37(0x01)
	float OffsetInterpSpeed; // 0x38(0x04)
	bool bLockIn2D; // 0x3c(0x01)
	bool bZeroOutRootMotionNotInSplineDirection; // 0x3d(0x01)
	bool bOrientToSplineDirection; // 0x3e(0x01)
	enum class ECustomInterpType RotationInterpType; // 0x3f(0x01)
	float RotationInterpSpeed; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
};

// Class Phoenix.AblScaleCharacterScratchPad
// Size: 0x30 (Inherited: 0x28)
struct UAblScaleCharacterScratchPad : UAblAbilityTaskScratchPad {
	char pad_28[0x8]; // 0x28(0x08)
};

// Class Phoenix.AblScaleCharacter
// Size: 0x80 (Inherited: 0x70)
struct UAblScaleCharacter : UAblAbilityTask {
	bool bUseDefaultMaleScale; // 0x70(0x01)
	char pad_71[0x3]; // 0x71(0x03)
	float Scale; // 0x74(0x04)
	float BlendInTime; // 0x78(0x04)
	float BlendOutTime; // 0x7c(0x04)
};

// Class Phoenix.AblSetAllowRMMomentum
// Size: 0x78 (Inherited: 0x70)
struct UAblSetAllowRMMomentum : UAblAbilityTask {
	bool RemoveRMMomentumAtEndOfTask; // 0x70(0x01)
	bool AddRMMomentum; // 0x71(0x01)
	bool RemoveRMMomentum; // 0x72(0x01)
	char pad_73[0x5]; // 0x73(0x05)
};

// Class Phoenix.AblSetAnimFootStateTask
// Size: 0x78 (Inherited: 0x70)
struct UAblSetAnimFootStateTask : UAblAbilityTask {
	enum class EBasicMobilityFootState FootState; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
};

// Class Phoenix.AblSetAnimMechanicTypeTask
// Size: 0x78 (Inherited: 0x70)
struct UAblSetAnimMechanicTypeTask : UAblAbilityTask {
	enum class EAnimMechanicType AnimMechanicType; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
};

// Class Phoenix.AblSetAnimSpeedTypeTask
// Size: 0x78 (Inherited: 0x70)
struct UAblSetAnimSpeedTypeTask : UAblAbilityTask {
	enum class EAnimSpeedType AnimSpeedType; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
};

// Class Phoenix.AblSetCollisionResolutionScratchpad
// Size: 0x38 (Inherited: 0x28)
struct UAblSetCollisionResolutionScratchpad : UAblAbilityTaskScratchPad {
	char pad_28[0x10]; // 0x28(0x10)
};

// Class Phoenix.AblSetCollisionResolutionTask
// Size: 0x78 (Inherited: 0x70)
struct UAblSetCollisionResolutionTask : UAblAbilityTask {
	enum class ECollisionResolutionTaskType CollisionResolutionType; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
};

// Class Phoenix.AblSetHeadTrackingStateTask
// Size: 0x78 (Inherited: 0x70)
struct UAblSetHeadTrackingStateTask : UAblAbilityTask {
	enum class EHeadTrackingState HeadTrackingState; // 0x70(0x01)
	bool bUseEndState; // 0x71(0x01)
	enum class EHeadTrackingState EndHeadTrackingState; // 0x72(0x01)
	enum class EHeadTrackingPriority HeadTrackingPriority; // 0x73(0x01)
	bool bBroadcastChange; // 0x74(0x01)
	char pad_75[0x3]; // 0x75(0x03)
};

// Class Phoenix.AblSetMeshHiddenInGameTaskScratchPad
// Size: 0x38 (Inherited: 0x28)
struct UAblSetMeshHiddenInGameTaskScratchPad : UAblAbilityTaskScratchPad {
	struct USkeletalMeshComponent* SkeletalMeshComponent; // 0x28(0x08)
	bool OriginalHiddenValue; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
};

// Class Phoenix.AblSetMeshHiddenInGameTask
// Size: 0x80 (Inherited: 0x70)
struct UAblSetMeshHiddenInGameTask : UAblAbilityTask {
	struct USkeletalMesh* SkeletalMeshTargetInOwner; // 0x70(0x08)
	bool RestoreHiddenValueAtEndOfTask; // 0x78(0x01)
	bool SetHiddenValue; // 0x79(0x01)
	char pad_7A[0x6]; // 0x7a(0x06)
};

// Class Phoenix.AblSetReactionsEnabledScratchpad
// Size: 0x28 (Inherited: 0x28)
struct UAblSetReactionsEnabledScratchpad : UAblAbilityTaskScratchPad {
};

// Class Phoenix.AblSetReactionsEnabledTask
// Size: 0x78 (Inherited: 0x70)
struct UAblSetReactionsEnabledTask : UAblAbilityTask {
	bool bReactionsEnabled; // 0x70(0x01)
	enum class EStandardManagedPriority Priority; // 0x71(0x01)
	char pad_72[0x6]; // 0x72(0x06)
};

// Class Phoenix.AblSetRightArmStateTask
// Size: 0x78 (Inherited: 0x70)
struct UAblSetRightArmStateTask : UAblAbilityTask {
	enum class ERightArmState RightArmState; // 0x70(0x01)
	bool bUseEndState; // 0x71(0x01)
	enum class ERightArmState EndRightArmState; // 0x72(0x01)
	enum class ERightArmPriority RightArmPriority; // 0x73(0x01)
	bool bBroadcastChange; // 0x74(0x01)
	char pad_75[0x3]; // 0x75(0x03)
};

// Class Phoenix.AblSetTagNotify
// Size: 0x50 (Inherited: 0x40)
struct UAblSetTagNotify : UAblAnimNotify {
	struct FGameplayTag EventTag; // 0x40(0x08)
	bool AddThisTag; // 0x48(0x01)
	bool RemoveThisTag; // 0x49(0x01)
	bool ApplyToAnimationArchitect; // 0x4a(0x01)
	bool ApplyToInteractionArchitect; // 0x4b(0x01)
	char pad_4C[0x4]; // 0x4c(0x04)
};

// Class Phoenix.AblSetVsPhysicsCollisionResolutionEnabledScratchpad
// Size: 0x30 (Inherited: 0x28)
struct UAblSetVsPhysicsCollisionResolutionEnabledScratchpad : UAblAbilityTaskScratchPad {
	char pad_28[0x8]; // 0x28(0x08)
};

// Class Phoenix.AblSetVsPhysicsCollisionResolutionEnabledTask
// Size: 0x78 (Inherited: 0x70)
struct UAblSetVsPhysicsCollisionResolutionEnabledTask : UAblAbilityTask {
	bool bEnabled; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
};

// Class Phoenix.AblSkinFXTask
// Size: 0x80 (Inherited: 0x70)
struct UAblSkinFXTask : UAblAbilityTask {
	struct FName skinEffectName; // 0x70(0x08)
	bool bEndEffectOnExit; // 0x78(0x01)
	char pad_79[0x7]; // 0x79(0x07)
};

// Class Phoenix.AblBranchConditionSlopeSlideDoneScratchpad
// Size: 0x40 (Inherited: 0x30)
struct UAblBranchConditionSlopeSlideDoneScratchpad : UAblTaskConditionScratchpad {
	struct UAmbulatory_MovementComponent* MovementComp; // 0x30(0x08)
	char pad_38[0x8]; // 0x38(0x08)
};

// Class Phoenix.AblBranchConditionSlopeSlideDone
// Size: 0x30 (Inherited: 0x28)
struct UAblBranchConditionSlopeSlideDone : UAblTaskCondition {
	float Timer; // 0x28(0x04)
	enum class EPhysicalSurface SurfaceType; // 0x2c(0x01)
	char pad_2D[0x3]; // 0x2d(0x03)
};

// Class Phoenix.AblSlopeSlideTaskScratchpad
// Size: 0x38 (Inherited: 0x28)
struct UAblSlopeSlideTaskScratchpad : UAblAbilityTaskScratchPad {
	char pad_28[0x10]; // 0x28(0x10)
};

// Class Phoenix.AblSlopeSlideTask
// Size: 0x88 (Inherited: 0x70)
struct UAblSlopeSlideTask : UAblAbilityTask {
	float DesiredSlopeSpeed; // 0x70(0x04)
	enum class ECustomInterpType SlopeVelocityInterpType; // 0x74(0x01)
	char pad_75[0x3]; // 0x75(0x03)
	float SlopeVelocityInterpSpeed; // 0x78(0x04)
	enum class ECustomInterpType ToFlatGroundInterpType; // 0x7c(0x01)
	char pad_7D[0x3]; // 0x7d(0x03)
	float ToFlatGroundInterpSpeed; // 0x80(0x04)
	float SlopeFriction; // 0x84(0x04)
};

// Class Phoenix.AblSpawnInteractActorTask
// Size: 0xd0 (Inherited: 0xd0)
struct UAblSpawnInteractActorTask : UAblSpawnActorTask {
};

// Class Phoenix.ablSpawnMunitionTaskScratchPad
// Size: 0x28 (Inherited: 0x28)
struct UablSpawnMunitionTaskScratchPad : UAblAbilityTaskScratchPad {
};

// Class Phoenix.ablSpawnMunitionTask
// Size: 0x80 (Inherited: 0x70)
struct UablSpawnMunitionTask : UAblAbilityTask {
	struct AMunitionType_Base* MunitionClass; // 0x70(0x08)
	bool bUseSelfActorAsInstigator; // 0x78(0x01)
	bool bUseSelfActorAsMunitionOwner; // 0x79(0x01)
	char pad_7A[0x6]; // 0x7a(0x06)
};

// Class Phoenix.AblSpiderFallTumbleScratchpad
// Size: 0x40 (Inherited: 0x28)
struct UAblSpiderFallTumbleScratchpad : UAblAbilityTaskScratchPad {
	struct UAmbulatory_MovementComponent* AmbulatoryMovementComponent; // 0x28(0x08)
	char pad_30[0x10]; // 0x30(0x10)
};

// Class Phoenix.AblSpiderFallTumbleTask
// Size: 0xe8 (Inherited: 0x70)
struct UAblSpiderFallTumbleTask : UAblAbilityTask {
	struct AActor* ParentClass; // 0x70(0x08)
	struct UAblReactionAbility* ReactionAbility; // 0x78(0x08)
	struct UAblReactionAbility* ProtegoReactionAbility; // 0x80(0x08)
	struct UAblReactionAbility* SplatAbility; // 0x88(0x08)
	float BranchAtFloorHeight; // 0x90(0x04)
	float MaxSplatSpeed; // 0x94(0x04)
	float RandRadianAngle; // 0x98(0x04)
	float FloorImpactDamping; // 0x9c(0x04)
	float FloorImpactDampingVariance; // 0xa0(0x04)
	float MinSpeed; // 0xa4(0x04)
	float MaxSpeed; // 0xa8(0x04)
	char pad_AC[0x4]; // 0xac(0x04)
	struct UParticleSystem* ProtegoParticleSystem; // 0xb0(0x08)
	struct FAlphaBlend AnimationBlendOutOverride; // 0xb8(0x30)

	void HandleBeginOverlap(struct AActor* OverlappedActor, struct AActor* OtherActor); // Function Phoenix.AblSpiderFallTumbleTask.HandleBeginOverlap // (Final|Native|Public) // @ game+0x31c6500
};

// Class Phoenix.AblStartPositionGetter_AnimNotify
// Size: 0x30 (Inherited: 0x28)
struct UAblStartPositionGetter_AnimNotify : UAblStartPositionGetter {
	struct FName AnimNotifyEventName; // 0x28(0x08)
};

// Class Phoenix.AblStartPositionGetter_FootMatch
// Size: 0x50 (Inherited: 0x28)
struct UAblStartPositionGetter_FootMatch : UAblStartPositionGetter {
	struct FVector FootPositionWeight; // 0x28(0x0c)
	struct FVector FootVelocityWeight; // 0x34(0x0c)
	float MinStartTime; // 0x40(0x04)
	float MaxStartTime; // 0x44(0x04)
	float SourceTimeOffset; // 0x48(0x04)
	char pad_4C[0x4]; // 0x4c(0x04)
};

// Class Phoenix.AblStartPositionGetter_NpcFootMatch
// Size: 0x50 (Inherited: 0x50)
struct UAblStartPositionGetter_NpcFootMatch : UAblStartPositionGetter_FootMatch {
};

// Class Phoenix.AblStartPositionGetter_MatchAnimationPosition
// Size: 0x30 (Inherited: 0x28)
struct UAblStartPositionGetter_MatchAnimationPosition : UAblStartPositionGetter {
	struct UMatchAnimationPositionCharacterGetter* SourceCharacterGetter; // 0x28(0x08)
};

// Class Phoenix.MatchAnimationPositionAttachParentGetter
// Size: 0x28 (Inherited: 0x28)
struct UMatchAnimationPositionAttachParentGetter : UMatchAnimationPositionCharacterGetter {
};

// Class Phoenix.AblStartPositionGetter_MountRider
// Size: 0x38 (Inherited: 0x30)
struct UAblStartPositionGetter_MountRider : UAblStartPositionGetter_MatchAnimationPosition {
	struct UAblAbility* RequiredAbility; // 0x30(0x08)
};

// Class Phoenix.AblStartPositionGetter_MatchPrevious
// Size: 0x28 (Inherited: 0x28)
struct UAblStartPositionGetter_MatchPrevious : UAblStartPositionGetter {
};

// Class Phoenix.ablStartPositionGetter_NPCSpawnAnim
// Size: 0x28 (Inherited: 0x28)
struct UablStartPositionGetter_NPCSpawnAnim : UAblStartPositionGetter {
};

// Class Phoenix.AblStartPositionGetter_PhaseMatch
// Size: 0x28 (Inherited: 0x28)
struct UAblStartPositionGetter_PhaseMatch : UAblStartPositionGetter {
};

// Class Phoenix.AblStartPositionGetter_Protego
// Size: 0x30 (Inherited: 0x28)
struct UAblStartPositionGetter_Protego : UAblStartPositionGetter {
	int32_t ImpactFrame; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
};

// Class Phoenix.AblStartPositionGetter_TimeMatch
// Size: 0x30 (Inherited: 0x28)
struct UAblStartPositionGetter_TimeMatch : UAblStartPositionGetter {
	bool bOnlyTimeMatchIfAnimInstanceAgrees; // 0x28(0x01)
	bool bSetFixedDirectionForTurnAssist; // 0x29(0x01)
	char pad_2A[0x6]; // 0x2a(0x06)
};

// Class Phoenix.ablStartPositionGetter_TrollSwing
// Size: 0x30 (Inherited: 0x28)
struct UablStartPositionGetter_TrollSwing : UAblStartPositionGetter {
	float ForehandStartTime; // 0x28(0x04)
	float BackhandStartTime; // 0x2c(0x04)
};

// Class Phoenix.AblSuperSlamScratchpad
// Size: 0x130 (Inherited: 0x28)
struct UAblSuperSlamScratchpad : UAblAbilityTaskScratchPad {
	char pad_28[0xe8]; // 0x28(0xe8)
	struct APhysicsConstraintActor* PhysicsConstraintActor; // 0x110(0x08)
	struct USkeletalMeshComponent* SkeletalMeshComp; // 0x118(0x08)
	struct URagdollControlComponent* RagdollControlComp; // 0x120(0x08)
	char pad_128[0x8]; // 0x128(0x08)
};

// Class Phoenix.AblSuperSlamVelocityDampenerTask
// Size: 0x80 (Inherited: 0x70)
struct UAblSuperSlamVelocityDampenerTask : UAblAbilityTask {
	float AngularVelocityMultiplier; // 0x70(0x04)
	float LinearVelocityMultiplier; // 0x74(0x04)
	float AngularDamping; // 0x78(0x04)
	float LinearDamping; // 0x7c(0x04)
};

// Class Phoenix.AblSuperSlamSpawnPhysicsActorScratchpad
// Size: 0x38 (Inherited: 0x28)
struct UAblSuperSlamSpawnPhysicsActorScratchpad : UAblAbilityTaskScratchPad {
	struct TArray<struct AStaticMeshActor*> Actors; // 0x28(0x10)
};

// Class Phoenix.AblSuperSlamSpawnPhysicsActorTask
// Size: 0xe0 (Inherited: 0x70)
struct UAblSuperSlamSpawnPhysicsActorTask : UAblAbilityTask {
	int32_t MinNumberOfItems; // 0x70(0x04)
	int32_t MaxNumberOfItems; // 0x74(0x04)
	float ConeAngle; // 0x78(0x04)
	float MinForce; // 0x7c(0x04)
	float MaxForce; // 0x80(0x04)
	float MinAngularForce; // 0x84(0x04)
	float MaxAngularForce; // 0x88(0x04)
	char pad_8C[0x4]; // 0x8c(0x04)
	struct TMap<struct FName, struct FMeshArrayHolder> MeshHolders; // 0x90(0x50)
};

// Class Phoenix.AblSuperSlamTask
// Size: 0x90 (Inherited: 0x70)
struct UAblSuperSlamTask : UAblAbilityTask {
	struct TArray<struct FAblSuperSlamCurveData> Curves; // 0x70(0x10)
	struct TArray<struct UMultiFX2_Base*> HitFx; // 0x80(0x10)
};

// Class Phoenix.AblSuperSlamForceHelperScratchpad
// Size: 0x38 (Inherited: 0x28)
struct UAblSuperSlamForceHelperScratchpad : UAblAbilityTaskScratchPad {
	struct USkeletalMeshComponent* SkeletalMeshComp; // 0x28(0x08)
	struct UAblSuperSlamScratchpad* SuperSlamScratchpad; // 0x30(0x08)
};

// Class Phoenix.AblSuperSlamForceHelperTask
// Size: 0x70 (Inherited: 0x70)
struct UAblSuperSlamForceHelperTask : UAblAbilityTask {
};

// Class Phoenix.AblSuperSlamSetCurveTask
// Size: 0x80 (Inherited: 0x70)
struct UAblSuperSlamSetCurveTask : UAblAbilityTask {
	struct TArray<struct FAblSuperSlamCurveData> Curves; // 0x70(0x10)
};

// Class Phoenix.AblSuspendEnemies
// Size: 0x78 (Inherited: 0x70)
struct UAblSuspendEnemies : UAblAbilityTask {
	bool bDisableSuspendHideForCombatPlants; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
};

// Class Phoenix.AblSyncCameraTimeDilationTask
// Size: 0x70 (Inherited: 0x70)
struct UAblSyncCameraTimeDilationTask : UAblAbilityTask {
};

// Class Phoenix.AblTargetTrackerTaskScratchPad
// Size: 0x30 (Inherited: 0x28)
struct UAblTargetTrackerTaskScratchPad : UAblAbilityTaskScratchPad {
	struct UTargetTracker* TargetTracker; // 0x28(0x08)
};

// Class Phoenix.AblTargetTrackerTask
// Size: 0x78 (Inherited: 0x70)
struct UAblTargetTrackerTask : UAblAbilityTask {
	enum class ETask_TargetTrackerType TargetTrackerType; // 0x70(0x01)
	enum class ETask_TargetType TargetType; // 0x71(0x01)
	enum class ETargetID TargetPriority; // 0x72(0x01)
	char pad_73[0x5]; // 0x73(0x05)
};

// Class Phoenix.AblTaskConditionScratchpad_DamageOverTime
// Size: 0x40 (Inherited: 0x30)
struct UAblTaskConditionScratchpad_DamageOverTime : UAblTaskConditionScratchpad {
	char pad_30[0x10]; // 0x30(0x10)

	void OnDoT_End(struct UActorComponent* ActorComp); // Function Phoenix.AblTaskConditionScratchpad_DamageOverTime.OnDoT_End // (Final|Native|Public) // @ game+0x31cd410
};

// Class Phoenix.AblTaskCondition_DamageOverTime
// Size: 0x30 (Inherited: 0x28)
struct UAblTaskCondition_DamageOverTime : UAblTaskCondition {
	struct FName DoT_Type; // 0x28(0x08)
};

// Class Phoenix.AblTaskConditionScratchpad_HermesMessage
// Size: 0x40 (Inherited: 0x30)
struct UAblTaskConditionScratchpad_HermesMessage : UAblTaskConditionScratchpad {
	char pad_30[0x10]; // 0x30(0x10)
};

// Class Phoenix.AblTaskCondition_HermesMessage
// Size: 0x30 (Inherited: 0x28)
struct UAblTaskCondition_HermesMessage : UAblTaskCondition {
	struct FName HermesMessageName; // 0x28(0x08)
};

// Class Phoenix.AblTaskConditionScratchpad_HitBySpell
// Size: 0x48 (Inherited: 0x30)
struct UAblTaskConditionScratchpad_HitBySpell : UAblTaskConditionScratchpad {
	char pad_30[0x18]; // 0x30(0x18)
};

// Class Phoenix.AblTaskCondition_HitBySpell
// Size: 0x30 (Inherited: 0x28)
struct UAblTaskCondition_HitBySpell : UAblTaskCondition {
	struct FName SpellName; // 0x28(0x08)
};

// Class Phoenix.AblTaskConditionScratchpad_InteractionArchitectChild
// Size: 0x38 (Inherited: 0x30)
struct UAblTaskConditionScratchpad_InteractionArchitectChild : UAblTaskConditionScratchpad {
	struct UInteractionArchitectAsset* InteractionArchitectAsset; // 0x30(0x08)
};

// Class Phoenix.AblTaskCondition_InteractionArchitectChild
// Size: 0x38 (Inherited: 0x28)
struct UAblTaskCondition_InteractionArchitectChild : UAblTaskCondition {
	struct UInteractionArchitectAsset* Parent; // 0x28(0x08)
	bool bIncludeSelf; // 0x30(0x01)
	enum class EInteractionProject Project; // 0x31(0x01)
	char pad_32[0x6]; // 0x32(0x06)
};

// Class Phoenix.AblTaskConditionScratchpad_OppugnoProxy
// Size: 0x78 (Inherited: 0x30)
struct UAblTaskConditionScratchpad_OppugnoProxy : UAblTaskConditionScratchpad {
	struct AWorldObject* instancedProxy; // 0x30(0x08)
	char pad_38[0x10]; // 0x38(0x10)
	struct AActor* EnemyOwner; // 0x48(0x08)
	char pad_50[0x28]; // 0x50(0x28)

	void OnActiveSpellToolChanged(struct ATool* ActivatedSpell, struct ATool* DeactivatedSpell); // Function Phoenix.AblTaskConditionScratchpad_OppugnoProxy.OnActiveSpellToolChanged // (Final|Native|Public) // @ game+0x31cd1a0
};

// Class Phoenix.AblTaskCondition_OppugnoProxy
// Size: 0x40 (Inherited: 0x28)
struct UAblTaskCondition_OppugnoProxy : UAblTaskCondition {
	struct AWorldObject* OppugnoProxy; // 0x28(0x08)
	float ProxyOppugnoWeight; // 0x30(0x04)
	struct FGameplayTag DuelTechniqueEventTag; // 0x34(0x08)
	char pad_3C[0x4]; // 0x3c(0x04)
};

// Class Phoenix.AblTetherLocPointUpdaterScratchpad
// Size: 0x48 (Inherited: 0x28)
struct UAblTetherLocPointUpdaterScratchpad : UAblAvaMotionWarpSyncPointUpdaterScratchpad {
	char pad_28[0x20]; // 0x28(0x20)
};

// Class Phoenix.AblTetherLocSyncPointUpdater
// Size: 0x60 (Inherited: 0x28)
struct UAblTetherLocSyncPointUpdater : UAblAvaMotionWarpSyncPointUpdater {
	float TetherDistance; // 0x28(0x04)
	float TetherDistanceRandomFloor; // 0x2c(0x04)
	float TetherDistanceRandomCeiling; // 0x30(0x04)
	enum class EStartVecMethod StartVectorMethod; // 0x34(0x01)
	char pad_35[0x3]; // 0x35(0x03)
	struct FVector ReferenceVector; // 0x38(0x0c)
	float MinRandomAngle; // 0x44(0x04)
	float MaxRandomAngle; // 0x48(0x04)
	float MaxTetherAngle; // 0x4c(0x04)
	int32_t Divisions; // 0x50(0x04)
	bool bInApplyTether; // 0x54(0x01)
	enum class ENPC_Tether TetherType; // 0x55(0x01)
	char pad_56[0x2]; // 0x56(0x02)
	float DesiredDistanceToTarget; // 0x58(0x04)
	bool bAllowPositiveTravel; // 0x5c(0x01)
	bool bAllowNegativeTravel; // 0x5d(0x01)
	char pad_5E[0x2]; // 0x5e(0x02)
};

// Class Phoenix.ablToggleIKDriversTask
// Size: 0x80 (Inherited: 0x70)
struct UablToggleIKDriversTask : UAblAbilityTask {
	enum class EStandardManagedPriority IKPriority; // 0x70(0x01)
	bool bEnableIK; // 0x71(0x01)
	bool bEnableFloorContact; // 0x72(0x01)
	bool bEnableLookat; // 0x73(0x01)
	bool bEnablePoseFixup; // 0x74(0x01)
	char pad_75[0x3]; // 0x75(0x03)
	float BlendInDuration; // 0x78(0x04)
	float BlendOutDuration; // 0x7c(0x04)
};

// Class Phoenix.TurnAdjust_TargetDirectionGetter
// Size: 0x28 (Inherited: 0x28)
struct UTurnAdjust_TargetDirectionGetter : UObject {
};

// Class Phoenix.TurnAdjust_DesiredDirectionGetter
// Size: 0x28 (Inherited: 0x28)
struct UTurnAdjust_DesiredDirectionGetter : UTurnAdjust_TargetDirectionGetter {
};

// Class Phoenix.TurnAdjust_BlackboardDirectionGetter
// Size: 0x30 (Inherited: 0x28)
struct UTurnAdjust_BlackboardDirectionGetter : UTurnAdjust_TargetDirectionGetter {
	struct FName BlackboardKeyName; // 0x28(0x08)
};

// Class Phoenix.TurnAdjust_ToBlackboardLocationGetter
// Size: 0x30 (Inherited: 0x28)
struct UTurnAdjust_ToBlackboardLocationGetter : UTurnAdjust_TargetDirectionGetter {
	struct FName BlackboardKeyName; // 0x28(0x08)
};

// Class Phoenix.TurnAdjust_LedgeNormalGetter
// Size: 0x28 (Inherited: 0x28)
struct UTurnAdjust_LedgeNormalGetter : UTurnAdjust_TargetDirectionGetter {
};

// Class Phoenix.TurnAdjust_TowardsLedgeDirectionGetter
// Size: 0x28 (Inherited: 0x28)
struct UTurnAdjust_TowardsLedgeDirectionGetter : UTurnAdjust_TargetDirectionGetter {
};

// Class Phoenix.TurnAdjust_JumpDownDirectionGetter
// Size: 0x28 (Inherited: 0x28)
struct UTurnAdjust_JumpDownDirectionGetter : UTurnAdjust_TargetDirectionGetter {
};

// Class Phoenix.TurnAdjust_ClimbingLadderDirectionGetter
// Size: 0x28 (Inherited: 0x28)
struct UTurnAdjust_ClimbingLadderDirectionGetter : UTurnAdjust_TargetDirectionGetter {
};

// Class Phoenix.ablTurnAssistTaskScratchPad
// Size: 0x88 (Inherited: 0x28)
struct UablTurnAssistTaskScratchPad : UAblAbilityTaskScratchPad {
	struct TArray<struct FTurnAssistTaskEntry> InProgressTurn; // 0x28(0x10)
	struct FAlphaBlend TurningBlend; // 0x38(0x30)
	struct FVector CurrentDirection; // 0x68(0x0c)
	struct FVector DesiredDirection; // 0x74(0x0c)
	float FixedDeltaAngle; // 0x80(0x04)
	float ElapsedTime; // 0x84(0x04)
};

// Class Phoenix.ablTurnAssistTask
// Size: 0xb8 (Inherited: 0x70)
struct UablTurnAssistTask : UAblAbilityTask {
	enum class ETurnAssistUseDirection UseDirection; // 0x70(0x01)
	bool bUseFixedDirection; // 0x71(0x01)
	char pad_72[0x6]; // 0x72(0x06)
	struct UCurveFloat* FixedDeltaTurnAssistCurve; // 0x78(0x08)
	struct UCurveFloat* TurnAssistCurve; // 0x80(0x08)
	struct UCurveFloat* TurnAssistTimeMultiplier; // 0x88(0x08)
	bool bScaleRotationBasedOnSpeed; // 0x90(0x01)
	char pad_91[0x3]; // 0x91(0x03)
	float MinRotationScaleBasedOnSpeed; // 0x94(0x04)
	struct FVector2D AllowedRangeFromFallLine; // 0x98(0x08)
	struct UCurveFloat* StrafeTurnAssistCurve; // 0xa0(0x08)
	struct UCurveFloat* StrafeTurnAssistTimeMultiplier; // 0xa8(0x08)
	bool bIgnoreTargetTracker; // 0xb0(0x01)
	char pad_B1[0x7]; // 0xb1(0x07)
};

// Class Phoenix.AblUsingStairsAnimsTask
// Size: 0x70 (Inherited: 0x70)
struct UAblUsingStairsAnimsTask : UAblAbilityTask {
};

// Class Phoenix.ablWandCastComboNextTask
// Size: 0xb8 (Inherited: 0x70)
struct UablWandCastComboNextTask : UAblAbilityTask {
	enum class EWandComboType ComboType; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
	struct UAblAbility* NextComboAbility; // 0x78(0x08)
	struct FGameplayTagContainer PerksRequiredForPauseCombo; // 0x80(0x20)
	struct UAblAbility* PauseComboAbility; // 0xa0(0x08)
	int32_t FinisherAtFrame; // 0xa8(0x04)
	int32_t ResetAtFrame; // 0xac(0x04)
	struct UAblAbility* NextLightComboAbility; // 0xb0(0x08)
};

// Class Phoenix.ablWandCastComboResetTask
// Size: 0x78 (Inherited: 0x70)
struct UablWandCastComboResetTask : UAblAbilityTask {
	bool bResetWandCastState; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
};

// Class Phoenix.ablWandCastContextsTaskScratchPad
// Size: 0x88 (Inherited: 0x28)
struct UablWandCastContextsTaskScratchPad : UAblAbilityTaskScratchPad {
	enum class EWandCastType WandCastType; // 0x28(0x01)
	char pad_29[0x7]; // 0x29(0x07)
	struct TMap<int32_t, bool> FrameReachedMap; // 0x30(0x50)
	float ElapsedTime; // 0x80(0x04)
	char pad_84[0x4]; // 0x84(0x04)
};

// Class Phoenix.ablWandCastContextsTask
// Size: 0xc0 (Inherited: 0x70)
struct UablWandCastContextsTask : UAblAbilityTask {
	struct TMap<enum class EWandCastType, struct FFrameToContexts> WandCastTypeToContextMap; // 0x70(0x50)
};

// Class Phoenix.AblZeroVelocity
// Size: 0x78 (Inherited: 0x70)
struct UAblZeroVelocity : UAblAbilityTask {
	bool bZeroLinearVelocity; // 0x70(0x01)
	bool bZeroAngularVelocity; // 0x71(0x01)
	char pad_72[0x6]; // 0x72(0x06)
};

// Class Phoenix.SpellTool
// Size: 0x7e8 (Inherited: 0x2e0)
struct ASpellTool : ATool {
	struct FBTCustomAction SpellStartAction; // 0x2e0(0x0c)
	struct FBTCustomAction SpellStopAction; // 0x2ec(0x0c)
	struct TMap<struct FName, struct UObject*> ExecutionClassMap; // 0x2f8(0x50)
	bool bHeavyCast; // 0x348(0x01)
	enum class ELeftArmState LeftArmState; // 0x349(0x01)
	enum class ERightArmState RightArmState; // 0x34a(0x01)
	char pad_34B[0x5]; // 0x34b(0x05)
	struct TArray<struct UMultiFX2_Base*> PrepMuzzleFX2; // 0x350(0x10)
	struct UAkAudioEvent* PrepMuzzleMotionFX; // 0x360(0x08)
	bool bKillPrepFXWhenMuzzleFXStart; // 0x368(0x01)
	char pad_369[0x7]; // 0x369(0x07)
	struct TArray<struct UMultiFX2_Base*> MuzzleFX2; // 0x370(0x10)
	struct UAkAudioEvent* MuzzleMotionFX; // 0x380(0x08)
	struct UAkAudioEvent* EndMuzzleMotionFX; // 0x388(0x08)
	struct TArray<struct UMultiFX2_Base*> ProjectileFiredFX2; // 0x390(0x10)
	bool ProjectileFiredFX2EndsWithMunition; // 0x3a0(0x01)
	char pad_3A1[0x7]; // 0x3a1(0x07)
	struct UAkAudioEvent* ProjectileMotionFX; // 0x3a8(0x08)
	struct UAkAudioEvent* ProjectileSfx; // 0x3b0(0x08)
	struct TArray<struct FImpactLevelData> ImpactLevelDataArray; // 0x3b8(0x10)
	bool PlaceDecal; // 0x3c8(0x01)
	char pad_3C9[0x7]; // 0x3c9(0x07)
	struct UMaterialInterface* DecalMaterial; // 0x3d0(0x08)
	struct FVector DecalSize; // 0x3d8(0x0c)
	float DecalFadeInDelay; // 0x3e4(0x04)
	float DecalFadeInTime; // 0x3e8(0x04)
	float DecalLifeSpan; // 0x3ec(0x04)
	float DecalFadeTime; // 0x3f0(0x04)
	bool DecalRandomOrientation; // 0x3f4(0x01)
	char pad_3F5[0x3]; // 0x3f5(0x03)
	struct UObject* Decal3D; // 0x3f8(0x08)
	bool Decal3DRandomOrientation; // 0x400(0x01)
	char pad_401[0x7]; // 0x401(0x07)
	struct TArray<struct UMultiFX2_Base*> DestroyedPieceFX2; // 0x408(0x10)
	float DestroyedPieceFXRadius; // 0x418(0x04)
	enum class EGameEventLocation GameEventLocation; // 0x41c(0x01)
	char pad_41D[0x3]; // 0x41d(0x03)
	struct FGameplayTagContainer GameEventTagContainer; // 0x420(0x20)
	enum class EGameEvent_Intensity GameEventIntensity; // 0x440(0x01)
	char pad_441[0x3]; // 0x441(0x03)
	float GameEventDuration; // 0x444(0x04)
	float GameEventRange; // 0x448(0x04)
	float GameEventFalloff; // 0x44c(0x04)
	struct FName DatabaseName; // 0x450(0x08)
	struct FGameplayTagContainer MunitionTagContainer; // 0x458(0x20)
	struct UInteractionArchitectAsset* MunitionDataAsset; // 0x478(0x08)
	struct FGameplayTagContainer EndMunitionTagContainer; // 0x480(0x20)
	enum class EAttackState AttackState; // 0x4a0(0x01)
	char pad_4A1[0x7]; // 0x4a1(0x07)
	struct UObject* SpellImpactComponent; // 0x4a8(0x08)
	struct FGameplayTagContainer GameplayStateTags; // 0x4b0(0x20)
	struct TArray<struct UMultiFX2_Base*> StateEffectFX2; // 0x4d0(0x10)
	struct TArray<struct UStateEffectComponent*> TerminatePreviousEffects; // 0x4e0(0x10)
	bool bEnableCCDOnTarget; // 0x4f0(0x01)
	char pad_4F1[0x3]; // 0x4f1(0x03)
	float PreSpawnMunitionDelay; // 0x4f4(0x04)
	bool bActivateAllPerks; // 0x4f8(0x01)
	char pad_4F9[0x7]; // 0x4f9(0x07)
	struct TArray<struct FAbilityFunction> AbilityFunctions; // 0x500(0x10)
	bool bAoe; // 0x510(0x01)
	bool bAOEAtTargetLocation; // 0x511(0x01)
	bool bAffectTeammates; // 0x512(0x01)
	bool bOnlyAffectsMovable; // 0x513(0x01)
	bool bCanAffectBroken; // 0x514(0x01)
	bool bCanAffectPlayer; // 0x515(0x01)
	bool bSetWandCastTargetTrackers; // 0x516(0x01)
	char pad_517[0x1]; // 0x517(0x01)
	struct TArray<struct AMunitionType_Base*> DeflectMunitionActors; // 0x518(0x10)
	bool SpawnAllDeflectMunitionActors; // 0x528(0x01)
	char pad_529[0x3]; // 0x529(0x03)
	struct TWeakObjectPtr<struct AMunitionType_Base> LastMunitionFired; // 0x52c(0x08)
	bool bPlayersUseImprovedTargeting; // 0x534(0x01)
	char pad_535[0x3]; // 0x535(0x03)
	struct UTriggerEffect* SpellActiveTriggerEffect; // 0x538(0x08)
	struct ULEDFadeEffect* PrepLEDEffect; // 0x540(0x08)
	struct ULEDFadeEffect* StartLEDEffect; // 0x548(0x08)
	struct ULEDFadeEffect* EndLEDEffect; // 0x550(0x08)
	char pad_558[0x20]; // 0x558(0x20)
	struct AActor* OverrideSourceActor; // 0x578(0x08)
	struct AActor* OverrideTargetActor; // 0x580(0x08)
	struct USceneComponent* OverrideTargetComponent; // 0x588(0x08)
	struct AActor* OverrideCharacter; // 0x590(0x08)
	struct TArray<struct AMunitionType_Base*> CachedMunitionArray; // 0x598(0x10)
	char pad_5A8[0x98]; // 0x5a8(0x98)
	struct UInteractionArchitectAsset* LevelDataAsset; // 0x640(0x08)
	char pad_648[0x90]; // 0x648(0x90)
	struct UActorComponent* ImpactComponent; // 0x6d8(0x08)
	char pad_6E0[0xd8]; // 0x6e0(0xd8)
	struct UTriggerEffect* pSpellActiveTriggerEffect; // 0x7b8(0x08)
	bool bAffectsRightTrigger; // 0x7c0(0x01)
	bool bAffectsLeftTrigger; // 0x7c1(0x01)
	char pad_7C2[0x6]; // 0x7c2(0x06)
	struct ULEDFadeEffect* pPrepLEDEffect; // 0x7c8(0x08)
	struct ULEDFadeEffect* pStartLEDEffect; // 0x7d0(0x08)
	struct ULEDFadeEffect* pEndLEDEffect; // 0x7d8(0x08)
	struct UAkComponent* ProjectileAkComponent; // 0x7e0(0x08)

	void TriggerReleased(bool bForce, bool bFromStop); // Function Phoenix.SpellTool.TriggerReleased // (Native|Public|BlueprintCallable) // @ game+0x347b9d0
	void StopActive(); // Function Phoenix.SpellTool.StopActive // (Final|Native|Public|BlueprintCallable) // @ game+0x347b9a0
	void StartChannelingAction(); // Function Phoenix.SpellTool.StartChannelingAction // (Native|Public|BlueprintCallable) // @ game+0x3311b80
	bool Start(); // Function Phoenix.SpellTool.Start // (Native|Public|BlueprintCallable) // @ game+0x1545d30
	void SpellFlourish(); // Function Phoenix.SpellTool.SpellFlourish // (Native|Public|BlueprintCallable) // @ game+0x3310210
	void SetIgnoreActors(struct TArray<struct AActor*> i_Ignores); // Function Phoenix.SpellTool.SetIgnoreActors // (Native|Public|BlueprintCallable) // @ game+0x347b5a0
	void SetDestinationActor(struct AActor* InActor); // Function Phoenix.SpellTool.SetDestinationActor // (Final|Native|Public|BlueprintCallable) // @ game+0x347b510
	void SetAffectImmuneToSpells(bool bAffectImmune); // Function Phoenix.SpellTool.SetAffectImmuneToSpells // (Final|Native|Public|BlueprintCallable) // @ game+0x347b480
	void ReassignBeamTarget(struct AActor* CurrentActor, struct USceneComponent* NewComponent); // Function Phoenix.SpellTool.ReassignBeamTarget // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x347b3a0
	void ReactionStart(struct UAblReactionData* InReactionData, struct UAblReactionComponent* ReactionComponent); // Function Phoenix.SpellTool.ReactionStart // (Final|Native|Protected) // @ game+0x347b2d0
	void ReactionEnd(struct UAblReactionData* InReactionData, struct UAblReactionComponent* ReactionComponent); // Function Phoenix.SpellTool.ReactionEnd // (Final|Native|Protected) // @ game+0x347b200
	void PreSpawnMunition(); // Function Phoenix.SpellTool.PreSpawnMunition // (Final|Native|Public|BlueprintCallable) // @ game+0x347b1e0
	void Prep(); // Function Phoenix.SpellTool.Prep // (Native|Public|BlueprintCallable) // @ game+0x31e06f0
	void PlayHitActorFX(struct FHitResult& HitResult); // Function Phoenix.SpellTool.PlayHitActorFX // (Final|Native|Protected|HasOutParms|BlueprintCallable) // @ game+0x347b100
	void OwnerHasStartedCasting(struct FName WandCastName); // Function Phoenix.SpellTool.OwnerHasStartedCasting // (Native|Public|BlueprintCallable) // @ game+0x347b070
	void OnStop(); // Function Phoenix.SpellTool.OnStop // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void OnStart(); // Function Phoenix.SpellTool.OnStart // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void OnProtegoBlocked(struct AMunitionType_Base* InMunitionInstance, struct AActor* Target, struct FHitResult& Hit, struct FVector ImpactDirection); // Function Phoenix.SpellTool.OnProtegoBlocked // (Event|Public|HasOutParms|HasDefaults|BlueprintEvent) // @ game+0x38a7480
	void OnPrep(); // Function Phoenix.SpellTool.OnPrep // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void OnMunitionOverlap(struct AMunitionType_Base* MunitionInstance, struct FMunitionImpactData& MunitionImpactData); // Function Phoenix.SpellTool.OnMunitionOverlap // (Native|Public|HasOutParms) // @ game+0x347aee0
	void OnMunitionImpactDamage(struct AMunitionType_Base* MunitionInstance, struct FMunitionImpactData& MunitionImpactData); // Function Phoenix.SpellTool.OnMunitionImpactDamage // (Native|Public|HasOutParms) // @ game+0x347ad50
	void OnMunitionImpact(struct AMunitionType_Base* MunitionInstance, struct FMunitionImpactData& MunitionImpactData); // Function Phoenix.SpellTool.OnMunitionImpact // (Native|Public|HasOutParms) // @ game+0x347abc0
	void OnMunitionFired(struct AActor* Target, struct FVector TargetLocation, struct AMunitionType_Base* BaseMunition, struct FGameplayTagContainer& InMunitionTagContainer); // Function Phoenix.SpellTool.OnMunitionFired // (Event|Public|HasOutParms|HasDefaults|BlueprintEvent) // @ game+0x38a7480
	void OnMunitionDestroyed(struct AMunitionType_Base* InMunitionInstance); // Function Phoenix.SpellTool.OnMunitionDestroyed // (Native|Public) // @ game+0x347ab30
	void OnFizzle(); // Function Phoenix.SpellTool.OnFizzle // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void OnCastSpell(struct AActor* Target, struct FVector& Location, struct FVector& MuzzleLocation); // Function Phoenix.SpellTool.OnCastSpell // (Event|Public|HasOutParms|HasDefaults|BlueprintEvent) // @ game+0x38a7480
	void OnCanAffectTarget(struct AActor* Target, bool bInCanAffectTarget); // Function Phoenix.SpellTool.OnCanAffectTarget // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void OnAffectTarget(struct AActor* Target, struct USceneComponent* Component, bool bInTargetAffected); // Function Phoenix.SpellTool.OnAffectTarget // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	bool IsToolUsedByPlayer(); // Function Phoenix.SpellTool.IsToolUsedByPlayer // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x347ab00
	bool IsStopped(); // Function Phoenix.SpellTool.IsStopped // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x347aad0
	bool IsStarted_K2(); // Function Phoenix.SpellTool.IsStarted_K2 // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x347aab0
	bool IsChanneling(); // Function Phoenix.SpellTool.IsChanneling // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x347aa80
	bool IsBeastCaptureSpell(); // Function Phoenix.SpellTool.IsBeastCaptureSpell // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x347aa50
	bool HasUpgradedMechanics(); // Function Phoenix.SpellTool.HasUpgradedMechanics // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x347aa10
	bool HasUpgrade(enum class ESpellUpgrades Upgrade); // Function Phoenix.SpellTool.HasUpgrade // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x347a980
	struct AWandTool* GetWand(); // Function Phoenix.SpellTool.GetWand // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x347a950
	struct FName GetSpellType(); // Function Phoenix.SpellTool.GetSpellType // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x347a8e0
	struct USpellToolRecord* GetSpellToolRecord(); // Function Phoenix.SpellTool.GetSpellToolRecord // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x347a8b0
	enum class ESpellCategory GetSpellCategory(); // Function Phoenix.SpellTool.GetSpellCategory // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x347a890
	struct AActor* GetSourceActor(); // Function Phoenix.SpellTool.GetSourceActor // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x347a860
	float GetProjectileSpeed(); // Function Phoenix.SpellTool.GetProjectileSpeed // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x347a830
	struct FVector GetMuzzleLocation(); // Function Phoenix.SpellTool.GetMuzzleLocation // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x347a620
	struct AMunitionType_Base* GetMunitionActor(); // Function Phoenix.SpellTool.GetMunitionActor // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x347a5e0
	float GetMaxRange(); // Function Phoenix.SpellTool.GetMaxRange // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x347a5a0
	enum class EImpactTypes GetImpactType(); // Function Phoenix.SpellTool.GetImpactType // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x347a560
	struct UObject* GetExecutionClassFromKeyWord(struct FName KeyWord); // Function Phoenix.SpellTool.GetExecutionClassFromKeyWord // (Native|Public|BlueprintCallable) // @ game+0x347a4c0
	float GetDuration(bool bTargetIsACharacter); // Function Phoenix.SpellTool.GetDuration // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x347a410
	struct AActor* GetCharacterActor(); // Function Phoenix.SpellTool.GetCharacterActor // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x347a1c0
	struct ACharacter* GetCharacter(); // Function Phoenix.SpellTool.GetCharacter // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x347a150
	struct AActor* GetActiveTarget(); // Function Phoenix.SpellTool.GetActiveTarget // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x330e3d0
	struct AMunitionType_Base* GetActiveMunition(); // Function Phoenix.SpellTool.GetActiveMunition // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x347a0e0
	void ForceStop(); // Function Phoenix.SpellTool.ForceStop // (Native|Public|BlueprintCallable) // @ game+0x347a0c0
	void FireOnHitBySpell(struct AActor* InTargetActor, struct AActor* InInstigator, struct FGameplayTagContainer& InMunitionTagContainer, struct FHitResult& HitResult, struct FVector& ImpactDirection); // Function Phoenix.SpellTool.FireOnHitBySpell // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3479ea0
	void Failed_K2(); // Function Phoenix.SpellTool.Failed_K2 // (Final|Native|Public|BlueprintCallable) // @ game+0x3479e80
	void EndToggleSpell(bool bForcedExternally); // Function Phoenix.SpellTool.EndToggleSpell // (Native|Public|BlueprintCallable) // @ game+0x3479df0
	struct UActorComponent* CreateImpactComponent(struct AActor* InTargetActor, struct FMunitionImpactData& InMunitionImpactData); // Function Phoenix.SpellTool.CreateImpactComponent // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3479c60
	float CalculateCharacterDamage(struct AActor* InTarget, bool& OutWillKillTarget); // Function Phoenix.SpellTool.CalculateCharacterDamage // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3479af0
	bool BreaksShield(struct AActor* Target, struct FGameplayTagContainer& InTagContainer); // Function Phoenix.SpellTool.BreaksShield // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x34799f0
	void Abort(); // Function Phoenix.SpellTool.Abort // (Native|Public|BlueprintCallable) // @ game+0x330e3b0
};

// Class Phoenix.ChannelingSpellTool
// Size: 0x958 (Inherited: 0x7e8)
struct AChannelingSpellTool : ASpellTool {
	struct FBTCustomAction FlourishAction; // 0x7e8(0x0c)
	struct FBTCustomAction ChannelingAction; // 0x7f4(0x0c)
	struct TArray<struct UMultiFX2_Base*> TapActivateFX2; // 0x800(0x10)
	struct TArray<struct UMultiFX2_Base*> ChargingFX2; // 0x810(0x10)
	struct TArray<struct UMultiFX2_Base*> ChargedFX2; // 0x820(0x10)
	struct TArray<struct UMultiFX2_Base*> ChargedActivateFX2; // 0x830(0x10)
	struct TArray<struct UMultiFX2_Base*> RibbonFX2; // 0x840(0x10)
	bool ChargeVersionAvailable; // 0x850(0x01)
	char pad_851[0x7]; // 0x851(0x07)
	struct TArray<struct UMultiFX2_Base*> ChargingMuzzleFX2; // 0x858(0x10)
	struct TArray<struct UMultiFX2_Base*> ChargedMuzzleFX2; // 0x868(0x10)
	struct TArray<struct UMultiFX2_Base*> EndMuzzleFX2; // 0x878(0x10)
	bool DUMMY; // 0x888(0x01)
	char pad_889[0x7]; // 0x889(0x07)
	struct TArray<struct UMultiFX2_Base*> BeamFX2; // 0x890(0x10)
	bool bSetTargetTrackers; // 0x8a0(0x01)
	bool Dummy2; // 0x8a1(0x01)
	char pad_8A2[0x6]; // 0x8a2(0x06)
	struct FGameplayTagContainer ChargedMunitionTagContainer; // 0x8a8(0x20)
	struct UInteractionArchitectAsset* ChargedMunitionDataAsset; // 0x8c8(0x08)
	struct FVector BeamTarget; // 0x8d0(0x0c)
	char pad_8DC[0x4]; // 0x8dc(0x04)
	struct AActor* BeamTargetActor; // 0x8e0(0x08)
	char pad_8E8[0x70]; // 0x8e8(0x70)

	void OnCharged(); // Function Phoenix.ChannelingSpellTool.OnCharged // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void OnActivateTap(struct AActor* Target); // Function Phoenix.ChannelingSpellTool.OnActivateTap // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void OnActivateCharged(struct AActor* Target); // Function Phoenix.ChannelingSpellTool.OnActivateCharged // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	bool HasMinChannelingTimeBeenMet(); // Function Phoenix.ChannelingSpellTool.HasMinChannelingTimeBeenMet // (Final|Native|Public|BlueprintCallable) // @ game+0x32302d0
};

// Class Phoenix.AccioSpellTool
// Size: 0xae0 (Inherited: 0x958)
struct AAccioSpellTool : AChannelingSpellTool {
	struct TArray<struct FAccioLevelData> LevelDataArray; // 0x958(0x10)
	struct TArray<struct FAccioDampingSphere> DampingSpheres; // 0x968(0x10)
	float AccioEndThreshold; // 0x978(0x04)
	float AccioHoverDistance; // 0x97c(0x04)
	float AccioHoverHeight; // 0x980(0x04)
	float AccioEndSpellTime; // 0x984(0x04)
	float SlidingDotMin; // 0x988(0x04)
	float SlidingMinVel; // 0x98c(0x04)
	float AccioEndVelocityScale; // 0x990(0x04)
	float FlyingBookPullVelocity; // 0x994(0x04)
	float FlyingBookHideDistance; // 0x998(0x04)
	float FlyingBookSlowStartScale; // 0x99c(0x04)
	float MinDamageDealt; // 0x9a0(0x04)
	float MaxDamageDealt; // 0x9a4(0x04)
	float MinDamageDealtCharacter; // 0x9a8(0x04)
	float MaxDamageDealtCharacter; // 0x9ac(0x04)
	float MinDamageTaken; // 0x9b0(0x04)
	float MaxDamageTaken; // 0x9b4(0x04)
	float MinDamageTakenCharacter; // 0x9b8(0x04)
	float MaxDamageTakenCharacter; // 0x9bc(0x04)
	float AccioCharacterHoverDistance; // 0x9c0(0x04)
	float AccioCharacterHoverHeight; // 0x9c4(0x04)
	struct USpellToolRecord* WingardiumSpellToolRecord; // 0x9c8(0x08)
	float ExtendedRange; // 0x9d0(0x04)
	char pad_9D4[0x4]; // 0x9d4(0x04)
	struct AMunitionType_Base* AOEMunition; // 0x9d8(0x08)
	bool bSkipTriggerReaction; // 0x9e0(0x01)
	char pad_9E1[0x3]; // 0x9e1(0x03)
	float PullCharacterObjectVelocityMultiplier; // 0x9e4(0x04)
	char pad_9E8[0x98]; // 0x9e8(0x98)
	struct AWingardiumBulletTimeSpellTool* WingardiumSpellTool; // 0xa80(0x08)
	char pad_A88[0x58]; // 0xa88(0x58)

	void StartAccioBall(); // Function Phoenix.AccioSpellTool.StartAccioBall // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x31cd920
	void PullCharacter(struct FHitResult& HitResult); // Function Phoenix.AccioSpellTool.PullCharacter // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x31cd4e0
	void OnActorHit(struct AActor* SelfActor, struct AActor* OtherActor, struct FVector NormalImpulse, struct FHitResult& Hit); // Function Phoenix.AccioSpellTool.OnActorHit // (Native|Public|HasOutParms|HasDefaults) // @ game+0x31cd270
	void EndAccioBall(); // Function Phoenix.AccioSpellTool.EndAccioBall // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x31cc490
};

// Class Phoenix.AchievementManager
// Size: 0x498 (Inherited: 0x28)
struct UAchievementManager : UObject {
	char pad_28[0x470]; // 0x28(0x470)

	void SetHomeworkWatcher(enum class EHomeworkType HomeworkType, struct FString HomeworkName, struct AActor* Caller, bool bEnable, bool AssertIfNotFound); // Function Phoenix.AchievementManager.SetHomeworkWatcher // (Final|Native|Public|BlueprintCallable) // @ game+0x31cd760
	void SetAchievementWatcher(struct FName AchievementID, struct AActor* Caller, bool bEnable); // Function Phoenix.AchievementManager.SetAchievementWatcher // (Final|Native|Public|BlueprintCallable) // @ game+0x31cd650
	void ResetAchievement(struct FName AchievementID); // Function Phoenix.AchievementManager.ResetAchievement // (Final|Native|Public|BlueprintCallable) // @ game+0x31cd5c0
	void OnSaveGameLoaded(); // Function Phoenix.AchievementManager.OnSaveGameLoaded // (Final|Native|Public) // @ game+0x31cd4c0
	void OnNewGame(); // Function Phoenix.AchievementManager.OnNewGame // (Final|Native|Public) // @ game+0x31cd4a0
	bool IsHomeworkComplete(enum class EHomeworkType HomeworkType, struct FString HomeworkName, bool AssertIfNotFound); // Function Phoenix.AchievementManager.IsHomeworkComplete // (Final|Native|Public|BlueprintCallable) // @ game+0x31cd070
	bool IsFieldGuideComplete(); // Function Phoenix.AchievementManager.IsFieldGuideComplete // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x31cd040
	bool IsAchievementComplete(struct FName AchievementID); // Function Phoenix.AchievementManager.IsAchievementComplete // (Final|Native|Public|BlueprintCallable) // @ game+0x31ccfa0
	bool IsAchievementActive(struct FName AchievementID); // Function Phoenix.AchievementManager.IsAchievementActive // (Final|Native|Public|BlueprintCallable) // @ game+0x31ccf00
	void HandleStatChanged(struct FName StatID, int32_t Value, int32_t Delta); // Function Phoenix.AchievementManager.HandleStatChanged // (Final|Native|Private) // @ game+0x31ccdf0
	struct UAchievementManager* GetPure(); // Function Phoenix.AchievementManager.GetPure // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x31cc4b0
	struct TArray<struct FKnowledgeAchievementResult> GetKnowledgeChallengesForSubject(struct FName KnowledgeSubject); // Function Phoenix.AchievementManager.GetKnowledgeChallengesForSubject // (Final|Native|Public|BlueprintCallable) // @ game+0x31ccd10
	int32_t GetHomeworkInstances(enum class EHomeworkType HomeworkType, struct FString HomeworkName, bool AssertIfNotFound); // Function Phoenix.AchievementManager.GetHomeworkInstances // (Final|Native|Public|BlueprintCallable) // @ game+0x31ccbe0
	float GetFieldGuideCompletionPercentPerCategory(struct FAchievementCategory Category); // Function Phoenix.AchievementManager.GetFieldGuideCompletionPercentPerCategory // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x31ccad0
	float GetFieldGuideCompletionPercent(); // Function Phoenix.AchievementManager.GetFieldGuideCompletionPercent // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x31ccaa0
	int32_t GetDelayedRewardsCount(); // Function Phoenix.AchievementManager.GetDelayedRewardsCount // (Final|Native|Public|BlueprintCallable) // @ game+0x31cca70
	struct TArray<struct FKnowledgeAchievementResult> GetDelayedRewards(); // Function Phoenix.AchievementManager.GetDelayedRewards // (Final|Native|Public|BlueprintCallable) // @ game+0x31cc9f0
	struct FKnowledgeAchievementResult GetChallengeLevel(struct FName AchievementID); // Function Phoenix.AchievementManager.GetChallengeLevel // (Final|Native|Public|BlueprintCallable) // @ game+0x31cc8d0
	struct TMap<struct FName, struct FAchievementCategory> GetChallengeCategories(); // Function Phoenix.AchievementManager.GetChallengeCategories // (Final|Native|Public|BlueprintCallable) // @ game+0x31cc7b0
	struct TArray<struct FKnowledgeAchievementResult> GetChalkboardChallengesForClass(struct FName ClassPrefix); // Function Phoenix.AchievementManager.GetChalkboardChallengesForClass // (Final|Native|Public|BlueprintCallable) // @ game+0x31cc6d0
	struct FName GetAchievementType(struct FName AchievementID); // Function Phoenix.AchievementManager.GetAchievementType // (Final|Native|Public|BlueprintCallable) // @ game+0x31cc640
	int32_t GetAchievementInstances(struct FName AchievementID); // Function Phoenix.AchievementManager.GetAchievementInstances // (Final|Native|Public|BlueprintCallable) // @ game+0x31cc5a0
	int32_t GetAchievementInstanceGoal(struct FName AchievementID); // Function Phoenix.AchievementManager.GetAchievementInstanceGoal // (Final|Native|Public|BlueprintCallable) // @ game+0x31cc500
	struct UAchievementManager* Get(); // Function Phoenix.AchievementManager.Get // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x31cc4b0
	void DebugCompleteAllChallenges(); // Function Phoenix.AchievementManager.DebugCompleteAllChallenges // (Final|Exec|Native|Public) // @ game+0x1074730
	void DebugAwardChallenge(struct FString ChallengeID); // Function Phoenix.AchievementManager.DebugAwardChallenge // (Final|Exec|Native|Public) // @ game+0x31cc3a0
	void DebugAwardAchievement(struct FString AchievementID); // Function Phoenix.AchievementManager.DebugAwardAchievement // (Final|Exec|Native|Public) // @ game+0x31cc3a0
	void DebugAchievementShowState(struct FString AchievementID); // Function Phoenix.AchievementManager.DebugAchievementShowState // (Final|Exec|Native|Public) // @ game+0x31cc3a0
	void DebugAchievementResetSteam(); // Function Phoenix.AchievementManager.DebugAchievementResetSteam // (Final|Exec|Native|Public) // @ game+0x1074730
	void DebugAchievementOneOfEach(struct FString AchievementID, struct FString ObjectName); // Function Phoenix.AchievementManager.DebugAchievementOneOfEach // (Final|Exec|Native|Public) // @ game+0x31cc220
	void DebugAchievementIncrease(struct FString AchievementID, int32_t Amount); // Function Phoenix.AchievementManager.DebugAchievementIncrease // (Final|Exec|Native|Public) // @ game+0x31cc0f0
	bool ClaimReward(struct FKnowledgeAchievementResult achievement, struct FAchievementReward reward); // Function Phoenix.AchievementManager.ClaimReward // (Final|Native|Public|BlueprintCallable) // @ game+0x31cbf40
	void AwardOnUnlock(struct FName LockId); // Function Phoenix.AchievementManager.AwardOnUnlock // (Final|Native|Public|BlueprintCallable) // @ game+0x31cbc70
	void AwardOneTimeHomework(enum class EHomeworkType HomeworkType, struct FString HomeworkName, bool AssertIfNotFound); // Function Phoenix.AchievementManager.AwardOneTimeHomework // (Final|Native|Public|BlueprintCallable) // @ game+0x31cbe10
	void AwardOneTimeAchievement(struct FName AchievementID, bool CheckRulesFirst, bool AssertIfNotOneTime); // Function Phoenix.AchievementManager.AwardOneTimeAchievement // (Final|Native|Public|BlueprintCallable) // @ game+0x31cbd00
	bool ApplyWhitelistInstance(struct FName AchievementID, struct FName InstanceName); // Function Phoenix.AchievementManager.ApplyWhitelistInstance // (Final|Native|Public|BlueprintCallable) // @ game+0x31cbba0
	bool ApplyOneOfEachInstance(struct FName AchievementID, struct FName InstanceName, bool isInternal); // Function Phoenix.AchievementManager.ApplyOneOfEachInstance // (Final|Native|Public|BlueprintCallable) // @ game+0x31cba90
	void ApplyKnowledgeAction(struct FName KnowledgeSubject, struct FName KnowledgeAction, struct FName KnowledgeCategoryOverride); // Function Phoenix.AchievementManager.ApplyKnowledgeAction // (Final|Native|Public|BlueprintCallable) // @ game+0x31cb980
	void ApplyHomework(enum class EHomeworkType HomeworkType, struct FString HomeworkName, int32_t Count, bool AssertIfNotFound); // Function Phoenix.AchievementManager.ApplyHomework // (Final|Native|Public|BlueprintCallable) // @ game+0x31cb810
	void ApplyAchievementIncrease(struct FName AchievementID, int32_t Count, bool CheckRulesFirst, bool AssertIfNotAccumluate); // Function Phoenix.AchievementManager.ApplyAchievementIncrease // (Final|Native|Public|BlueprintCallable) // @ game+0x31cb6b0
	bool AnyDelayedRewards(); // Function Phoenix.AchievementManager.AnyDelayedRewards // (Final|Native|Public|BlueprintCallable) // @ game+0x31cb680
};

// Class Phoenix.Acknowledgement
// Size: 0x68 (Inherited: 0x28)
struct UAcknowledgement : UObject {
	char pad_28[0x40]; // 0x28(0x40)

	void EventExecute(bool bNewResult); // Function Phoenix.Acknowledgement.EventExecute // (Final|Native|Public) // @ game+0x31d07a0
};

// Class Phoenix.AcknowledgementEnumsBlueprintLibrary
// Size: 0x28 (Inherited: 0x28)
struct UAcknowledgementEnumsBlueprintLibrary : UBlueprintFunctionLibrary {

	struct FName GetEAcknowledgementSpeakerTypeNameFromID(enum class EAcknowledgementSpeakerType inID); // Function Phoenix.AcknowledgementEnumsBlueprintLibrary.GetEAcknowledgementSpeakerTypeNameFromID // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x31d0ac0
	enum class EAcknowledgementSpeakerType GetEAcknowledgementSpeakerTypeFromName(struct FName& strName); // Function Phoenix.AcknowledgementEnumsBlueprintLibrary.GetEAcknowledgementSpeakerTypeFromName // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x31d0a00
	struct FName GetEAcknowledgementRuleTypeNameFromID(enum class EAcknowledgementRuleType inID); // Function Phoenix.AcknowledgementEnumsBlueprintLibrary.GetEAcknowledgementRuleTypeNameFromID // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x31d0960
	enum class EAcknowledgementRuleType GetEAcknowledgementRuleTypeFromName(struct FName& strName); // Function Phoenix.AcknowledgementEnumsBlueprintLibrary.GetEAcknowledgementRuleTypeFromName // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x31d08a0
};

// Class Phoenix.AcknowledgementManager
// Size: 0x4a0 (Inherited: 0x28)
struct UAcknowledgementManager : UObject {
	char pad_28[0x18]; // 0x28(0x18)
	struct FMulticastInlineDelegate AcknowledgementStatChangedEvent; // 0x40(0x10)
	struct FMulticastInlineDelegate AcknowledgementEvent; // 0x50(0x10)
	char pad_60[0xa0]; // 0x60(0xa0)
	struct UGameLogicObject* AcknowledgementLogicContainer; // 0x100(0x08)
	struct TMap<struct FName, struct UAcknowledgement*> Acknowledgements; // 0x108(0x50)
	struct TMap<struct FName, struct UAcknowledgement*> TimeBasedAcknowledgements; // 0x158(0x50)
	char pad_1A8[0x2f8]; // 0x1a8(0x2f8)

	void UpdateMiscStatStatic(struct FName Key, struct FString Value); // Function Phoenix.AcknowledgementManager.UpdateMiscStatStatic // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x31d2210
	void UpdateMiscIntStatStatic(struct FName Key, int32_t Value); // Function Phoenix.AcknowledgementManager.UpdateMiscIntStatStatic // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x31d2150
	void UpdateMiscBoolStatStatic(struct FName Key, bool bValue); // Function Phoenix.AcknowledgementManager.UpdateMiscBoolStatStatic // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x31d2090
	void SetSpecialSpeakerForAcknowledgement(struct AActor* InSpecialSpeaker); // Function Phoenix.AcknowledgementManager.SetSpecialSpeakerForAcknowledgement // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x31d1ce0
	void SetSpecialSpeakerByDBIDForAcknowledgement(struct FName& InSpecialSpeakerName); // Function Phoenix.AcknowledgementManager.SetSpecialSpeakerByDBIDForAcknowledgement // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x31d1c60
	void OnSaveGameLoaded(); // Function Phoenix.AcknowledgementManager.OnSaveGameLoaded // (Final|Native|Protected) // @ game+0x31d1620
	void OnPreLoadGame(); // Function Phoenix.AcknowledgementManager.OnPreLoadGame // (Final|Native|Protected) // @ game+0x31d1600
	void OnNewGame(); // Function Phoenix.AcknowledgementManager.OnNewGame // (Final|Native|Protected) // @ game+0x31d1600
	void HandleStatChanged(struct FName StatID, int32_t Value, int32_t Delta); // Function Phoenix.AcknowledgementManager.HandleStatChanged // (Final|Native|Private) // @ game+0x31d0f00
	void HandleHouseChestAcknowledgement(); // Function Phoenix.AcknowledgementManager.HandleHouseChestAcknowledgement // (Final|Native|Public|BlueprintCallable) // @ game+0x31d0c80
	void HandleFleshLoaded(struct AActor* InFleshActor); // Function Phoenix.AcknowledgementManager.HandleFleshLoaded // (Final|Native|Public) // @ game+0x31d0bf0
	struct UAcknowledgementManager* GetAcknowledgementManager(); // Function Phoenix.AcknowledgementManager.GetAcknowledgementManager // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x31d0850
	struct UAcknowledgementManager* Get(); // Function Phoenix.AcknowledgementManager.Get // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x31d0850
};

// Class Phoenix.HUDElementGroup
// Size: 0x2e8 (Inherited: 0x268)
struct UHUDElementGroup : UUserWidget {
	enum class UIHUDGroups MyGroup; // 0x268(0x01)
	enum class ESlateVisibility DesiredHiddenState; // 0x269(0x01)
	char pad_26A[0x7e]; // 0x26a(0x7e)

	void ShowHUDElement(struct UObject* Provider); // Function Phoenix.HUDElementGroup.ShowHUDElement // (Native|Public|BlueprintCallable) // @ game+0x3306300
	void HideHUDElement(struct UObject* Provider); // Function Phoenix.HUDElementGroup.HideHUDElement // (Native|Public|BlueprintCallable) // @ game+0x33051d0
	bool GetShouldBeHidden(); // Function Phoenix.HUDElementGroup.GetShouldBeHidden // (Final|Native|Public) // @ game+0x33050d0
};

// Class Phoenix.ActionDiamondRing
// Size: 0x318 (Inherited: 0x2e8)
struct UActionDiamondRing : UHUDElementGroup {
	int32_t HighlightedSpellIndex; // 0x2e8(0x04)
	char pad_2EC[0x2c]; // 0x2ec(0x2c)

	void UpdateMiniDiamond(int32_t GroupIndex); // Function Phoenix.ActionDiamondRing.UpdateMiniDiamond // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ShowMiniDiamond(); // Function Phoenix.ActionDiamondRing.ShowMiniDiamond // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ShowButtonCallouts(bool Show); // Function Phoenix.ActionDiamondRing.ShowButtonCallouts // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void OnShowHUDElement(bool IgnoreLocks); // Function Phoenix.ActionDiamondRing.OnShowHUDElement // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void OnShowButtonsChanged(bool Show); // Function Phoenix.ActionDiamondRing.OnShowButtonsChanged // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void OnHideHUDElement(enum class ESlateVisibility HiddenState); // Function Phoenix.ActionDiamondRing.OnHideHUDElement // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void OnFocusChanged(struct AActor* Actor, float Delta); // Function Phoenix.ActionDiamondRing.OnFocusChanged // (Final|Native|Public) // @ game+0x31d1530
	void NewDiamondSelected(); // Function Phoenix.ActionDiamondRing.NewDiamondSelected // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void CollectItemData(int32_t GroupIndex); // Function Phoenix.ActionDiamondRing.CollectItemData // (Final|Native|Public|BlueprintCallable) // @ game+0x31d0600
	void AddItemWidgetToArray(struct UActionRingItem* Item); // Function Phoenix.ActionDiamondRing.AddItemWidgetToArray // (Final|Native|Public|BlueprintCallable) // @ game+0x31d0480
};

// Class Phoenix.ActionItemWidget
// Size: 0x268 (Inherited: 0x268)
struct UActionItemWidget : UUserWidget {

	void ExecuteAction(); // Function Phoenix.ActionItemWidget.ExecuteAction // (Final|Native|Public|BlueprintCallable) // @ game+0x1074730
	void CollectItemData(int32_t LoadoutIndex, int32_t ItemIndex, struct UImage* ItemIcon); // Function Phoenix.ActionItemWidget.CollectItemData // (Final|Native|Public|BlueprintCallable) // @ game+0x31d0690
};

// Class Phoenix.ActionRingItem
// Size: 0x2a0 (Inherited: 0x268)
struct UActionRingItem : UUserWidget {
	char pad_268[0x38]; // 0x268(0x38)

	void ToggleSelectionHighlight(bool Show); // Function Phoenix.ActionRingItem.ToggleSelectionHighlight // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void SetSubWidgetVisibility(enum class EUIQActionBarType ItemType); // Function Phoenix.ActionRingItem.SetSubWidgetVisibility // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void SetSpellTool(); // Function Phoenix.ActionRingItem.SetSpellTool // (Final|Native|Public|BlueprintCallable) // @ game+0x31d1d60
	void SetItemInventoryData(); // Function Phoenix.ActionRingItem.SetItemInventoryData // (Final|Native|Public|BlueprintCallable) // @ game+0x31d1c20
	void SetItemData(enum class UIActionModes ActionMode, int32_t iGroupIndex, int32_t iMacroIndex, int32_t iItemIndex, bool ShowNone); // Function Phoenix.ActionRingItem.SetItemData // (Final|Native|Public|BlueprintCallable) // @ game+0x31d19f0
	void OnUpdateMeter(float pct, bool IsASpell); // Function Phoenix.ActionRingItem.OnUpdateMeter // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void OnToggleEmptyItem(bool IsEmpty); // Function Phoenix.ActionRingItem.OnToggleEmptyItem // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void OnSpellWhitelistDeactivated(struct UObject* InCaller); // Function Phoenix.ActionRingItem.OnSpellWhitelistDeactivated // (Final|Native|Public) // @ game+0x31d1960
	void OnSpellWhitelistActivated(struct UObject* InCaller); // Function Phoenix.ActionRingItem.OnSpellWhitelistActivated // (Final|Native|Public) // @ game+0x31d18d0
	void OnSpellCooldownChanged(struct FName SpellName, float CooldownPct); // Function Phoenix.ActionRingItem.OnSpellCooldownChanged // (Final|Native|Public) // @ game+0x31d1800
	void OnSpellCleared(struct UObject* InCaller, struct FName& SpellName); // Function Phoenix.ActionRingItem.OnSpellCleared // (Final|Native|Public|HasOutParms) // @ game+0x31d1720
	void OnSpellCastFailed(); // Function Phoenix.ActionRingItem.OnSpellCastFailed // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void OnSpellBlacklisted(struct UObject* InCaller, struct FName& SpellName); // Function Phoenix.ActionRingItem.OnSpellBlacklisted // (Final|Native|Public|HasOutParms) // @ game+0x31d1640
	void OnSetItemInventoryData(bool IsConsumable, int32_t ItemCount); // Function Phoenix.ActionRingItem.OnSetItemInventoryData // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void OnOverlayTextureLoaded(struct UTexture2D* Texture); // Function Phoenix.ActionRingItem.OnOverlayTextureLoaded // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void OnItemIconTextureLoaded(struct UTexture2D* Texture); // Function Phoenix.ActionRingItem.OnItemIconTextureLoaded // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void OnIconTextureLoaded(struct UTexture2D* Texture); // Function Phoenix.ActionRingItem.OnIconTextureLoaded // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void OnIconGlowTextureLoaded(struct UTexture2D* Texture); // Function Phoenix.ActionRingItem.OnIconGlowTextureLoaded // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void OnHideItemCount(); // Function Phoenix.ActionRingItem.OnHideItemCount // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void OnCreateBipedPlayer(struct UObject* InCaller); // Function Phoenix.ActionRingItem.OnCreateBipedPlayer // (Final|Native|Public) // @ game+0x31d14a0
	void MarkSpellAsBlacklisted(); // Function Phoenix.ActionRingItem.MarkSpellAsBlacklisted // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void LoadOverlayCallback(struct UTexture2D* Texture, struct UObject* Param); // Function Phoenix.ActionRingItem.LoadOverlayCallback // (Final|Native|Private) // @ game+0x31d12d0
	void LoadItemIconCallback(struct UTexture2D* Texture, struct UObject* Param); // Function Phoenix.ActionRingItem.LoadItemIconCallback // (Final|Native|Private) // @ game+0x31d1200
	void LoadIconGlowCallback(struct UTexture2D* Texture, struct UObject* Param); // Function Phoenix.ActionRingItem.LoadIconGlowCallback // (Final|Native|Private) // @ game+0x31d1130
	void LoadIconCallback(struct UTexture2D* Texture, struct UObject* Param); // Function Phoenix.ActionRingItem.LoadIconCallback // (Final|Native|Private) // @ game+0x31d1060
	void HandleSpellCastFailed(struct UObject* InCaller, struct FString SpellStr); // Function Phoenix.ActionRingItem.HandleSpellCastFailed // (Final|Native|Public) // @ game+0x31d0e20
	enum class ESpellCategory GetSpellCategory(); // Function Phoenix.ActionRingItem.GetSpellCategory // (Final|Native|Public|BlueprintCallable) // @ game+0x31d0b60
	void ClearSpellAsBlacklisted(); // Function Phoenix.ActionRingItem.ClearSpellAsBlacklisted // (Event|Public|BlueprintEvent) // @ game+0x38a7480
};

// Class Phoenix.PhoenixUserWidget
// Size: 0x328 (Inherited: 0x2c8)
struct UPhoenixUserWidget : UUMGFocusWidget {
	struct FMulticastInlineDelegate IntroStartedEvent; // 0x2c8(0x10)
	struct FMulticastInlineDelegate IntroEndedEvent; // 0x2d8(0x10)
	struct FMulticastInlineDelegate OutroStartedEvent; // 0x2e8(0x10)
	struct FMulticastInlineDelegate OutroEndedEvent; // 0x2f8(0x10)
	float DefaultIntroDuration; // 0x308(0x04)
	float DefaultOutroDuration; // 0x30c(0x04)
	bool InterruptMenuReaderOnDestruct; // 0x310(0x01)
	char pad_311[0x17]; // 0x311(0x17)

	void TriggerOutro(int32_t OutroType); // Function Phoenix.PhoenixUserWidget.TriggerOutro // (Final|Native|Public|BlueprintCallable) // @ game+0x33f7a80
	void TriggerIntro(int32_t IntroType); // Function Phoenix.PhoenixUserWidget.TriggerIntro // (Final|Native|Public|BlueprintCallable) // @ game+0x33f79f0
	void TriggerCustomOutro(int32_t OutroType, float OutroDuration); // Function Phoenix.PhoenixUserWidget.TriggerCustomOutro // (Final|Native|Public|BlueprintCallable) // @ game+0x33f7920
	void TriggerCustomIntro(int32_t IntroType, float IntroDuration); // Function Phoenix.PhoenixUserWidget.TriggerCustomIntro // (Final|Native|Public|BlueprintCallable) // @ game+0x33f7850
	void ReadMenu(int32_t DepthLevel, enum class EMenuReaderInterruptType InterruptType, struct UObject* InterruptOwnerFilter); // Function Phoenix.PhoenixUserWidget.ReadMenu // (Final|Native|Public|BlueprintCallable) // @ game+0x33f71f0
	void PhoenixUserWidgetIntEvent__DelegateSignature(struct UPhoenixUserWidget* PhoenixUserWidget, int32_t IntParam); // DelegateFunction Phoenix.PhoenixUserWidget.PhoenixUserWidgetIntEvent__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x38a7480
	void OverrideInitialIntroType(int32_t IntroType); // Function Phoenix.PhoenixUserWidget.OverrideInitialIntroType // (Final|Native|Public|BlueprintCallable) // @ game+0x33f7060
	void OnOutroStarted(int32_t OutroType, float OutroDuration); // Function Phoenix.PhoenixUserWidget.OnOutroStarted // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void OnOutroEnded(int32_t OutroType); // Function Phoenix.PhoenixUserWidget.OnOutroEnded // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void OnIntroStarted(int32_t IntroType, float IntroDuration); // Function Phoenix.PhoenixUserWidget.OnIntroStarted // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void OnIntroEnded(int32_t IntroType); // Function Phoenix.PhoenixUserWidget.OnIntroEnded // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	bool IsTransitionInProgress(); // Function Phoenix.PhoenixUserWidget.IsTransitionInProgress // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x33f7030
	bool IsCurrentTransitionAnIntro(); // Function Phoenix.PhoenixUserWidget.IsCurrentTransitionAnIntro // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x33f7000
	void InterruptMenuReader(enum class EMenuReaderInterruptType InterruptType, struct UObject* InterruptOwnerFilter); // Function Phoenix.PhoenixUserWidget.InterruptMenuReader // (Final|Native|Public|BlueprintCallable) // @ game+0x33f6f30
	int32_t GetCurrentTransitionType(); // Function Phoenix.PhoenixUserWidget.GetCurrentTransitionType // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x33f6ca0
	float GetCurrentTransitionProgress(); // Function Phoenix.PhoenixUserWidget.GetCurrentTransitionProgress // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x33f6c70
	struct TArray<struct FString> GatherMenuReaderStrings(int32_t DepthLevel); // Function Phoenix.PhoenixUserWidget.GatherMenuReaderStrings // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x38a7480
};

// Class Phoenix.Screen
// Size: 0x370 (Inherited: 0x328)
struct UScreen : UPhoenixUserWidget {
	enum class EUIScreenType ScreenType; // 0x328(0x01)
	enum class EUIPopupPriority PopupPriority; // 0x329(0x01)
	bool ShouldShowCursor; // 0x32a(0x01)
	bool ShouldHideCursorOnRemove; // 0x32b(0x01)
	struct FVector2D CursorPositionOverride; // 0x32c(0x08)
	bool HandleBackButton; // 0x334(0x01)
	enum class EMouseLockMode MouseLockMode; // 0x335(0x01)
	bool bAutoAcquireUMGFocus; // 0x336(0x01)
	char pad_337[0x1]; // 0x337(0x01)
	struct TArray<enum class EUMGInputAction> IgnoredFocusInputActions; // 0x338(0x10)
	struct TArray<enum class EUMGInputAxis> IgnoredFocusInputAxis; // 0x348(0x10)
	char pad_358[0x18]; // 0x358(0x18)

	void ScreenUnregisterAllUMGInputAxis(); // Function Phoenix.Screen.ScreenUnregisterAllUMGInputAxis // (Final|Native|Public|BlueprintCallable) // @ game+0x34606a0
	void ScreenUnregisterAllUMGInputActions(enum class EInputEvent InputEvent); // Function Phoenix.Screen.ScreenUnregisterAllUMGInputActions // (Final|Native|Public|BlueprintCallable) // @ game+0x3460620
	void ScreenRegisterAllUMGInputAxis(); // Function Phoenix.Screen.ScreenRegisterAllUMGInputAxis // (Final|Native|Public|BlueprintCallable) // @ game+0x3460600
	void ScreenRegisterAllUMGInputActions(enum class EInputEvent InputEvent); // Function Phoenix.Screen.ScreenRegisterAllUMGInputActions // (Final|Native|Public|BlueprintCallable) // @ game+0x3460580
	void OnScreenOutroComplete(struct UPhoenixUserWidget* PhoenixWidget, int32_t OutroType); // Function Phoenix.Screen.OnScreenOutroComplete // (Final|Native|Protected) // @ game+0x3460450
	bool IsInputEnabled(); // Function Phoenix.Screen.IsInputEnabled // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3460250
	int32_t GetZOrderOffsetForScreenType(enum class EUIScreenType InScreenType); // Function Phoenix.Screen.GetZOrderOffsetForScreenType // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x34601d0
	void GatherMastermindExtraScreenStrings(struct TArray<struct FString>& outExtraScreenStrings); // Function Phoenix.Screen.GatherMastermindExtraScreenStrings // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x38a7480
	void CloseScreenWithOutro(); // Function Phoenix.Screen.CloseScreenWithOutro // (Final|Native|Public|BlueprintCallable) // @ game+0x345fad0
	void ClassLoaded(); // Function Phoenix.Screen.ClassLoaded // (Event|Public|BlueprintEvent) // @ game+0x38a7480
};

// Class Phoenix.ActionSelectionBase
// Size: 0x370 (Inherited: 0x370)
struct UActionSelectionBase : UScreen {
};

// Class Phoenix.ActionSelectionScreenBase
// Size: 0x458 (Inherited: 0x370)
struct UActionSelectionScreenBase : UScreen {
	struct UCommonActionsBase* CommonActionsCode; // 0x370(0x08)
	struct FString CurrentHighlightedItem; // 0x378(0x10)
	struct FString CurrentHighlightedItemVariation; // 0x388(0x10)
	struct FName CurrentHighlightedItemHolder; // 0x398(0x08)
	enum class EUIQActionBarType CurrentHighlightedItemType; // 0x3a0(0x01)
	bool IsSpellVideoShowing; // 0x3a1(0x01)
	char pad_3A2[0x2]; // 0x3a2(0x02)
	struct FName TutorialName; // 0x3a4(0x08)
	struct FName SlotTutorialStepName; // 0x3ac(0x08)
	bool CurrentHighlightedItemIsUnlocked; // 0x3b4(0x01)
	bool CurrentHighlightedItemIsBlacklisted; // 0x3b5(0x01)
	bool InSlottingMode; // 0x3b6(0x01)
	char pad_3B7[0x1]; // 0x3b7(0x01)
	struct FString TutorializedSpell; // 0x3b8(0x10)
	bool RequestedSpellSlotted; // 0x3c8(0x01)
	bool NeedsAutosave; // 0x3c9(0x01)
	bool LeviosoTutorialActive; // 0x3ca(0x01)
	bool AccioTutorialActive; // 0x3cb(0x01)
	bool VanishmentTutorialActive; // 0x3cc(0x01)
	bool ConjurationTutorialActive; // 0x3cd(0x01)
	bool CreatureBrushTutorialActive; // 0x3ce(0x01)
	bool CreatureFeedTutorialActive; // 0x3cf(0x01)
	bool AlterationTutorialActive; // 0x3d0(0x01)
	bool EquippingIncendioTutorialActive; // 0x3d1(0x01)
	char pad_3D2[0x86]; // 0x3d2(0x86)

	void UpdateMacroCode(struct FString ItemName, struct FString Variation, struct FName HolderID, enum class EUIQActionBarType ItemType); // Function Phoenix.ActionSelectionScreenBase.UpdateMacroCode // (Final|Native|Public|BlueprintCallable) // @ game+0x31d1ea0
	void ToggleListenForSpellSlottingEvents(bool ShouldListen); // Function Phoenix.ActionSelectionScreenBase.ToggleListenForSpellSlottingEvents // (Final|Native|Public|BlueprintCallable) // @ game+0x31d1e10
	void ToggleListenForSpellGroupEvents(bool ShouldListen); // Function Phoenix.ActionSelectionScreenBase.ToggleListenForSpellGroupEvents // (Final|Native|Public|BlueprintCallable) // @ game+0x31d1d80
	void SetSlottedSpells(); // Function Phoenix.ActionSelectionScreenBase.SetSlottedSpells // (Final|Native|Public|BlueprintCallable) // @ game+0x31d1c40
	void SetItemDataCode(int32_t GroupId); // Function Phoenix.ActionSelectionScreenBase.SetItemDataCode // (Final|Native|Public|BlueprintCallable) // @ game+0x31d1b90
	void OnSpellSelectedBP(struct UObject* SpellObject); // Function Phoenix.ActionSelectionScreenBase.OnSpellSelectedBP // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void OnSpellHoveredBP(struct UObject* SpellObject); // Function Phoenix.ActionSelectionScreenBase.OnSpellHoveredBP // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void OnShowButtonsChanged(bool Show); // Function Phoenix.ActionSelectionScreenBase.OnShowButtonsChanged // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void OnSetSlottedSpells(struct TArray<struct FString>& SlottedSpells); // Function Phoenix.ActionSelectionScreenBase.OnSetSlottedSpells // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x38a7480
	void OnRequestedSpellSlotted(struct FString SpellName); // Function Phoenix.ActionSelectionScreenBase.OnRequestedSpellSlotted // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void OnHideSpellPreviewer(); // Function Phoenix.ActionSelectionScreenBase.OnHideSpellPreviewer // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void OnHideCursor(); // Function Phoenix.ActionSelectionScreenBase.OnHideCursor // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void OnHandleRightTriggerRelease(); // Function Phoenix.ActionSelectionScreenBase.OnHandleRightTriggerRelease // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void OnHandleRightTriggerPress(); // Function Phoenix.ActionSelectionScreenBase.OnHandleRightTriggerPress // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void OnHandleDirectionalButtonInput(); // Function Phoenix.ActionSelectionScreenBase.OnHandleDirectionalButtonInput // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void OnExitRequested(); // Function Phoenix.ActionSelectionScreenBase.OnExitRequested // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void OnChangeDiamondTop(); // Function Phoenix.ActionSelectionScreenBase.OnChangeDiamondTop // (Final|Native|Public) // @ game+0x31d1480
	void OnChangeDiamondRight(); // Function Phoenix.ActionSelectionScreenBase.OnChangeDiamondRight // (Final|Native|Public) // @ game+0x31d1460
	void OnChangeDiamondLeft(); // Function Phoenix.ActionSelectionScreenBase.OnChangeDiamondLeft // (Final|Native|Public) // @ game+0x31d1440
	void OnChangeDiamondBottom(); // Function Phoenix.ActionSelectionScreenBase.OnChangeDiamondBottom // (Final|Native|Public) // @ game+0x31d1420
	void OnCastTopSpell(); // Function Phoenix.ActionSelectionScreenBase.OnCastTopSpell // (Final|Native|Public) // @ game+0x31d1400
	void OnCastRightSpell(); // Function Phoenix.ActionSelectionScreenBase.OnCastRightSpell // (Final|Native|Public) // @ game+0x31d13e0
	void OnCastLeftSpell(); // Function Phoenix.ActionSelectionScreenBase.OnCastLeftSpell // (Final|Native|Public) // @ game+0x31d13c0
	void OnCastBottomSpell(); // Function Phoenix.ActionSelectionScreenBase.OnCastBottomSpell // (Final|Native|Public) // @ game+0x31d13a0
	void HideCursorIfInTutorial(); // Function Phoenix.ActionSelectionScreenBase.HideCursorIfInTutorial // (Final|Native|Public|BlueprintCallable) // @ game+0x31d1040
	bool HandleViewSpellButtonPress(); // Function Phoenix.ActionSelectionScreenBase.HandleViewSpellButtonPress // (Final|Native|Public|BlueprintCallable) // @ game+0x31d1010
	bool HandleRightTriggerRelease(); // Function Phoenix.ActionSelectionScreenBase.HandleRightTriggerRelease // (Final|Native|Public|BlueprintCallable) // @ game+0x31d0df0
	bool HandleRightTriggerPress(); // Function Phoenix.ActionSelectionScreenBase.HandleRightTriggerPress // (Final|Native|Public|BlueprintCallable) // @ game+0x31d0dc0
	bool HandleKeyUp(enum class EUMGInputAction InputAction); // Function Phoenix.ActionSelectionScreenBase.HandleKeyUp // (Final|Native|Public|BlueprintCallable) // @ game+0x31d0d30
	bool HandleKeyDown(enum class EUMGInputAction InputAction); // Function Phoenix.ActionSelectionScreenBase.HandleKeyDown // (Final|Native|Public|BlueprintCallable) // @ game+0x31d0ca0
	bool HandleCloseScreenButtonPress(); // Function Phoenix.ActionSelectionScreenBase.HandleCloseScreenButtonPress // (Final|Native|Public|BlueprintCallable) // @ game+0x31d0bc0
	bool HandleBackButtonPress(); // Function Phoenix.ActionSelectionScreenBase.HandleBackButtonPress // (Final|Native|Public|BlueprintCallable) // @ game+0x31d0b90
	void ExitActionSelection(); // Function Phoenix.ActionSelectionScreenBase.ExitActionSelection // (Final|Native|Public|BlueprintCallable) // @ game+0x31d0830
	bool CanSlotSpell(); // Function Phoenix.ActionSelectionScreenBase.CanSlotSpell // (Final|Native|Public|BlueprintCallable) // @ game+0x31d05d0
	bool CanExitScreen(); // Function Phoenix.ActionSelectionScreenBase.CanExitScreen // (Final|Native|Public|BlueprintCallable) // @ game+0x31d05a0
	void AttachCommonAction(struct UCommonActionsBase* ActionsWidget); // Function Phoenix.ActionSelectionScreenBase.AttachCommonAction // (Final|Native|Public|BlueprintCallable) // @ game+0x31d0510
};

// Class Phoenix.ActionSelectionScreenBase_Controller
// Size: 0x478 (Inherited: 0x458)
struct UActionSelectionScreenBase_Controller : UActionSelectionScreenBase {
	char pad_458[0x20]; // 0x458(0x20)

	void OnSpellModifierRelease(); // Function Phoenix.ActionSelectionScreenBase_Controller.OnSpellModifierRelease // (Final|Native|Public|BlueprintCallable) // @ game+0x31d7880
	void OnSpellModifierPress(); // Function Phoenix.ActionSelectionScreenBase_Controller.OnSpellModifierPress // (Final|Native|Public|BlueprintCallable) // @ game+0x31d7860
};

// Class Phoenix.Actor_ByCharacterID
// Size: 0xc0 (Inherited: 0x38)
struct UActor_ByCharacterID : UActorProvider {
	char pad_38[0x8]; // 0x38(0x08)
	struct FSpawnSelectInfo DBInfo; // 0x40(0x80)
};

// Class Phoenix.Actor_ByStat
// Size: 0x58 (Inherited: 0x38)
struct UActor_ByStat : UActorProvider {
	char pad_38[0x8]; // 0x38(0x08)
	struct FStatList Stat; // 0x40(0x08)
	struct TArray<struct FActorByStat> Actors; // 0x48(0x10)
};

// Class Phoenix.Actor_CharactersWand
// Size: 0x38 (Inherited: 0x38)
struct UActor_CharactersWand : UActorProvider {
};

// Class Phoenix.Actor_Companion
// Size: 0x38 (Inherited: 0x38)
struct UActor_Companion : UActorProvider {
};

// Class Phoenix.Actor_CreatureReleasedFromInventory
// Size: 0x108 (Inherited: 0x38)
struct UActor_CreatureReleasedFromInventory : UActorProvider {
	char pad_38[0x8]; // 0x38(0x08)
	bool bGetSavedCreature; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)
	struct FString SavedCreatureID; // 0x48(0x10)
	struct FDbSingleColumnInfo DBInfo; // 0x58(0x88)
	bool bUseExistingDOV; // 0xe0(0x01)
	char pad_E1[0x7]; // 0xe1(0x07)
	struct UActorProvider* ExistingDOV; // 0xe8(0x08)
	struct FName NurturingSpaceOverride; // 0xf0(0x08)
	char pad_F8[0x10]; // 0xf8(0x10)
};

// Class Phoenix.Actor_FromDOV_SpawnedCallback
// Size: 0x38 (Inherited: 0x28)
struct UActor_FromDOV_SpawnedCallback : UObject {
	struct UObject* Caller; // 0x28(0x08)
	struct UActor_FromDOV* Provider; // 0x30(0x08)

	void ObjectSpawnCallback(struct AActor* SpawnedActor, struct FName& GroupName); // Function Phoenix.Actor_FromDOV_SpawnedCallback.ObjectSpawnCallback // (Final|Native|Public|HasOutParms) // @ game+0x31d7780
};

// Class Phoenix.Actor_FromDOV
// Size: 0x68 (Inherited: 0x38)
struct UActor_FromDOV : UActorProvider {
	char pad_38[0x8]; // 0x38(0x08)
	struct FWorldActorReference DOVActorReference; // 0x40(0x20)
	struct FName SpawnGroupName; // 0x60(0x08)
};

// Class Phoenix.Actor_FromDOVWithName_SpawnedCallback
// Size: 0x38 (Inherited: 0x28)
struct UActor_FromDOVWithName_SpawnedCallback : UObject {
	struct UObject* Caller; // 0x28(0x08)
	struct UActor_FromDOVWithName* Provider; // 0x30(0x08)

	void ObjectSpawnCallback(struct AActor* SpawnedActor, struct FName& GroupName); // Function Phoenix.Actor_FromDOVWithName_SpawnedCallback.ObjectSpawnCallback // (Final|Native|Public|HasOutParms) // @ game+0x31d76a0
};

// Class Phoenix.Actor_FromDOVWithName
// Size: 0x50 (Inherited: 0x38)
struct UActor_FromDOVWithName : UActorProvider {
	char pad_38[0x8]; // 0x38(0x08)
	struct FName DOVActorName; // 0x40(0x08)
	struct FName SpawnGroupName; // 0x48(0x08)
};

// Class Phoenix.Actor_DOVWithName
// Size: 0x40 (Inherited: 0x38)
struct UActor_DOVWithName : UActorProvider {
	struct FName DOVActorName; // 0x38(0x08)
};

// Class Phoenix.Actor_FromSE
// Size: 0x48 (Inherited: 0x38)
struct UActor_FromSE : UActorProvider {
	char pad_38[0x8]; // 0x38(0x08)
	struct UScheduledEntity* ScheduledEntity; // 0x40(0x08)
};

// Class Phoenix.Actor_FromStreamingPlaceholder
// Size: 0x60 (Inherited: 0x38)
struct UActor_FromStreamingPlaceholder : UActorProvider {
	char pad_38[0x8]; // 0x38(0x08)
	struct FWorldActorReference StreamingPlaceholder; // 0x40(0x20)
};

// Class Phoenix.Actor_FromT3Pool
// Size: 0x210 (Inherited: 0x38)
struct UActor_FromT3Pool : UActorProvider {
	char pad_38[0x8]; // 0x38(0x08)
	bool bUseBoundParameter; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)
	struct UStringProvider* ActorDbIdProvider; // 0x48(0x08)
	struct FDbDoubleColumnInfo CharacterIdInfo; // 0x50(0xd8)
	struct FDbSingleColumnInfo CharacterLookIdInfo; // 0x128(0x88)
	struct UTransformProvider* PlacementLocation; // 0x1b0(0x08)
	bool bStartWithoutActors; // 0x1b8(0x01)
	char pad_1B9[0x57]; // 0x1b9(0x57)
};

// Class Phoenix.Actor_MissionPerformTasks
// Size: 0x48 (Inherited: 0x38)
struct UActor_MissionPerformTasks : UActorProvider {
	struct FName MissionID; // 0x38(0x08)
	int32_t MissionUID; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
};

// Class Phoenix.Actor_MissionSplineFollower
// Size: 0x48 (Inherited: 0x38)
struct UActor_MissionSplineFollower : UActorProvider {
	struct FName MissionID; // 0x38(0x08)
	int32_t MissionUID; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
};

// Class Phoenix.Actor_MissionStation
// Size: 0x48 (Inherited: 0x38)
struct UActor_MissionStation : UActorProvider {
	struct FName MissionID; // 0x38(0x08)
	int32_t MissionUID; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
};

// Class Phoenix.Actor_MountCreature
// Size: 0x48 (Inherited: 0x38)
struct UActor_MountCreature : UActorProvider {
	char pad_38[0x8]; // 0x38(0x08)
	struct ACreatureMountHandler* MountHandlerClass; // 0x40(0x08)
};

// Class Phoenix.Actor_NamedCreature
// Size: 0xf8 (Inherited: 0x38)
struct UActor_NamedCreature : UActorProvider {
	char pad_38[0x8]; // 0x38(0x08)
	struct FDbSingleColumnInfo DBInfo; // 0x40(0x88)
	bool bUseExistingDOV; // 0xc8(0x01)
	char pad_C9[0x3]; // 0xc9(0x03)
	struct FName DOVName; // 0xcc(0x08)
	char pad_D4[0x24]; // 0xd4(0x24)
};

// Class Phoenix.Actor_SanctuaryZoneStreaming
// Size: 0x50 (Inherited: 0x38)
struct UActor_SanctuaryZoneStreaming : UActorProvider {
	char pad_38[0x8]; // 0x38(0x08)
	struct FName ZoneName; // 0x40(0x08)
	bool bWaitForParallelStreamingComplete; // 0x48(0x01)
	char pad_49[0x7]; // 0x49(0x07)
};

// Class Phoenix.ActorSpawnFromDOVCallback
// Size: 0x38 (Inherited: 0x28)
struct UActorSpawnFromDOVCallback : UObject {
	struct UObject* Caller; // 0x28(0x08)
	struct UActor_SpawnFromDOVBase* Provider; // 0x30(0x08)

	void ObjectSpawnCallback(struct AActor* SpawnedActor, struct FName& GroupName); // Function Phoenix.ActorSpawnFromDOVCallback.ObjectSpawnCallback // (Final|Native|Public|HasOutParms) // @ game+0x31d75c0
};

// Class Phoenix.Actor_SpawnFromDOVBase
// Size: 0x50 (Inherited: 0x38)
struct UActor_SpawnFromDOVBase : UActorProvider {
	char pad_38[0x8]; // 0x38(0x08)
	struct FName SpawnGroupName; // 0x40(0x08)
	bool bKeepAliveAtEndOfScenerig; // 0x48(0x01)
	char pad_49[0x7]; // 0x49(0x07)
};

// Class Phoenix.Actor_SpawnFromDOV
// Size: 0x70 (Inherited: 0x50)
struct UActor_SpawnFromDOV : UActor_SpawnFromDOVBase {
	struct FWorldActorReference DOVActorReference; // 0x50(0x20)
};

// Class Phoenix.Actor_SpawnFromDOVWithName
// Size: 0x58 (Inherited: 0x50)
struct UActor_SpawnFromDOVWithName : UActor_SpawnFromDOVBase {
	struct FName DOVActorName; // 0x50(0x08)
};

// Class Phoenix.AIDataProvider_CreatureApproachRange
// Size: 0x48 (Inherited: 0x40)
struct UAIDataProvider_CreatureApproachRange : UAIDataProvider_QueryParams {
	bool bRandomizeRange; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)
};

// Class Phoenix.AIDataProvider_CreatureTurnApproachRadius
// Size: 0x40 (Inherited: 0x40)
struct UAIDataProvider_CreatureTurnApproachRadius : UAIDataProvider_QueryParams {
};

// Class Phoenix.AIDataProvider_CreatureTrotApproachRadius
// Size: 0x40 (Inherited: 0x40)
struct UAIDataProvider_CreatureTrotApproachRadius : UAIDataProvider_QueryParams {
};

// Class Phoenix.AIDataProvider_CreatureRunApproachRadius
// Size: 0x40 (Inherited: 0x40)
struct UAIDataProvider_CreatureRunApproachRadius : UAIDataProvider_QueryParams {
};

// Class Phoenix.AIDataProvider_CreatureGrazingMin
// Size: 0x40 (Inherited: 0x40)
struct UAIDataProvider_CreatureGrazingMin : UAIDataProvider_QueryParams {
};

// Class Phoenix.AIDataProvider_CreatureGrazingMax
// Size: 0x40 (Inherited: 0x40)
struct UAIDataProvider_CreatureGrazingMax : UAIDataProvider_QueryParams {
};

// Class Phoenix.AIDataProvider_CreatureGrazingWait
// Size: 0x40 (Inherited: 0x40)
struct UAIDataProvider_CreatureGrazingWait : UAIDataProvider_QueryParams {
};

// Class Phoenix.AIDataProvider_CreatureCirclingTime
// Size: 0x48 (Inherited: 0x40)
struct UAIDataProvider_CreatureCirclingTime : UAIDataProvider_QueryParams {
	enum class ECreatureDataProviderValueRangeType RangeType; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
};

// Class Phoenix.AIDataProvider_CreaturePerchingTime
// Size: 0x48 (Inherited: 0x40)
struct UAIDataProvider_CreaturePerchingTime : UAIDataProvider_QueryParams {
	enum class ECreatureDataProviderValueRangeType RangeType; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
};

// Class Phoenix.AIDataProvider_CreatureExploreWaitTime
// Size: 0x48 (Inherited: 0x40)
struct UAIDataProvider_CreatureExploreWaitTime : UAIDataProvider_QueryParams {
	enum class ECreatureDataProviderValueRangeType RangeType; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
};

// Class Phoenix.AIDataProvider_CreatureExploreRange
// Size: 0x48 (Inherited: 0x40)
struct UAIDataProvider_CreatureExploreRange : UAIDataProvider_QueryParams {
	enum class ECreatureDataProviderValueRangeType RangeType; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
};

// Class Phoenix.AIDataProvider_CreatureExploreRangeFromHerdLocation
// Size: 0x48 (Inherited: 0x40)
struct UAIDataProvider_CreatureExploreRangeFromHerdLocation : UAIDataProvider_QueryParams {
	enum class ECreatureDataProviderValueRangeType RangeType; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
};

// Class Phoenix.AIDataProvider_CreatureNewHerdLocationRange
// Size: 0x48 (Inherited: 0x40)
struct UAIDataProvider_CreatureNewHerdLocationRange : UAIDataProvider_QueryParams {
	enum class ECreatureDataProviderValueRangeType RangeType; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
};

// Class Phoenix.AIDataProvider_CreatureForageRange
// Size: 0x48 (Inherited: 0x40)
struct UAIDataProvider_CreatureForageRange : UAIDataProvider_QueryParams {
	enum class ECreatureDataProviderValueRangeType RangeType; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
};

// Class Phoenix.AIDataProvider_CreatureForageLookAroundTime
// Size: 0x48 (Inherited: 0x40)
struct UAIDataProvider_CreatureForageLookAroundTime : UAIDataProvider_QueryParams {
	enum class ECreatureDataProviderValueRangeType RangeType; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
};

// Class Phoenix.AIDataProvider_CreatureRelaxTime
// Size: 0x48 (Inherited: 0x40)
struct UAIDataProvider_CreatureRelaxTime : UAIDataProvider_QueryParams {
	enum class ECreatureStance Stance; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	enum class ECreatureDataProviderValueRangeType RangeType; // 0x44(0x04)
};

// Class Phoenix.AIDataProvider_CreatureScaledCapsuleRadius
// Size: 0x48 (Inherited: 0x40)
struct UAIDataProvider_CreatureScaledCapsuleRadius : UAIDataProvider_QueryParams {
	float Multiplier; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
};

// Class Phoenix.AIDataProvider_CreatureCombat_RepositionDistance
// Size: 0x50 (Inherited: 0x40)
struct UAIDataProvider_CreatureCombat_RepositionDistance : UAIDataProvider_QueryParams {
	struct UCreatureCombatRepositionData* CombatData; // 0x40(0x08)
	enum class ECreatureDataProviderValueRangeType RangeType; // 0x48(0x04)
	char pad_4C[0x4]; // 0x4c(0x04)
};

// Class Phoenix.AIDataProvider_CreatureCombat_AttackDistance
// Size: 0x50 (Inherited: 0x40)
struct UAIDataProvider_CreatureCombat_AttackDistance : UAIDataProvider_QueryParams {
	struct UCreatureCombatAttackData* CombatData; // 0x40(0x08)
	enum class ECreatureDataProviderValueRangeType RangeType; // 0x48(0x04)
	char pad_4C[0x4]; // 0x4c(0x04)
};

// Class Phoenix.AIDataProvider_CreatureCombat_AttackImpactTime
// Size: 0x48 (Inherited: 0x40)
struct UAIDataProvider_CreatureCombat_AttackImpactTime : UAIDataProvider_QueryParams {
	struct UCreatureCombatAttackData* CombatData; // 0x40(0x08)
};

// Class Phoenix.AIDataProvider_CreatureCombat_AttackCommitTime
// Size: 0x48 (Inherited: 0x40)
struct UAIDataProvider_CreatureCombat_AttackCommitTime : UAIDataProvider_QueryParams {
	struct UCreatureCombatAttackData* CombatData; // 0x40(0x08)
};

// Class Phoenix.AISense_CogGroup_Aim
// Size: 0x188 (Inherited: 0x188)
struct UAISense_CogGroup_Aim : UAISense_CogGroup {
};

// Class Phoenix.AISense_CogGroup_AutoTarget
// Size: 0x188 (Inherited: 0x188)
struct UAISense_CogGroup_AutoTarget : UAISense_CogGroup {
};

// Class Phoenix.AISense_CogGroup_Climb
// Size: 0x188 (Inherited: 0x188)
struct UAISense_CogGroup_Climb : UAISense_CogGroup {
};

// Class Phoenix.AISense_CogGroup_Interact
// Size: 0x1a0 (Inherited: 0x188)
struct UAISense_CogGroup_Interact : UAISense_CogGroup {
	char pad_188[0x18]; // 0x188(0x18)
};

// Class Phoenix.AISense_CogGroup_Oppugno
// Size: 0x188 (Inherited: 0x188)
struct UAISense_CogGroup_Oppugno : UAISense_CogGroup {
};

// Class Phoenix.AISense_CogGroup_Reparo
// Size: 0x188 (Inherited: 0x188)
struct UAISense_CogGroup_Reparo : UAISense_CogGroup {
};

// Class Phoenix.AISense_CogGroup_Station
// Size: 0x188 (Inherited: 0x188)
struct UAISense_CogGroup_Station : UAISense_CogGroup {
};

// Class Phoenix.AISense_CogGroup_StealthInteract
// Size: 0x188 (Inherited: 0x188)
struct UAISense_CogGroup_StealthInteract : UAISense_CogGroup {
};

// Class Phoenix.AISense_CogGroup_TargetOfInterest
// Size: 0x188 (Inherited: 0x188)
struct UAISense_CogGroup_TargetOfInterest : UAISense_CogGroup {
};

// Class Phoenix.AISense_Creature
// Size: 0x90 (Inherited: 0x80)
struct UAISense_Creature : UAISense {
	char pad_80[0x10]; // 0x80(0x10)
};

// Class Phoenix.AISense_NPC
// Size: 0x80 (Inherited: 0x80)
struct UAISense_NPC : UAISense {
};

// Class Phoenix.AISense_EnemyAITarget
// Size: 0x80 (Inherited: 0x80)
struct UAISense_EnemyAITarget : UAISense_NPC {
};

// Class Phoenix.AISense_EnemyAIWeapon
// Size: 0x80 (Inherited: 0x80)
struct UAISense_EnemyAIWeapon : UAISense_NPC {
};

// Class Phoenix.AISense_GameEvent
// Size: 0x80 (Inherited: 0x80)
struct UAISense_GameEvent : UAISense {

	void ReportGameEvent(struct UObject* WorldContextObject, struct FGameplayTagContainer TagContainer, struct FVector Location, enum class EGameEvent_Intensity Intensity, float Duration, float Range, float Falloff, struct AActor* Instigator, bool bTrackBackToInstigator, struct AActor* Target, struct FName Name); // Function Phoenix.AISense_GameEvent.ReportGameEvent // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x31d78a0
};

// Class Phoenix.AISense_Magic
// Size: 0xe8 (Inherited: 0x80)
struct UAISense_Magic : UAISense {
	struct TArray<struct FAIMagicEvent> MagicEvents; // 0x80(0x10)
	float SpeedOfMagicFeelSq; // 0x90(0x04)
	char pad_94[0x54]; // 0x94(0x54)

	void ReportMagicEvent(struct UObject* WorldContextObject, struct FVector MagicLocation, float Power, struct AActor* Instigator, float MaxRange, struct FName Tag); // Function Phoenix.AISense_Magic.ReportMagicEvent // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x31d7c20
};

// Class Phoenix.AISense_NearbyCreatures
// Size: 0x90 (Inherited: 0x80)
struct UAISense_NearbyCreatures : UAISense {
	char pad_80[0x10]; // 0x80(0x10)
};

// Class Phoenix.AISense_NPCCrimeScene
// Size: 0x80 (Inherited: 0x80)
struct UAISense_NPCCrimeScene : UAISense_NPC {
};

// Class Phoenix.AISense_Smell
// Size: 0x80 (Inherited: 0x80)
struct UAISense_Smell : UAISense {
};

// Class Phoenix.AISenseConfig_Creature
// Size: 0x60 (Inherited: 0x48)
struct UAISenseConfig_Creature : UAISenseConfig {
	struct UAISense_Creature* Implementation; // 0x48(0x08)
	float LowerRadius; // 0x50(0x04)
	float UpperRadius; // 0x54(0x04)
	float AwarenessMultiplier; // 0x58(0x04)
	char pad_5C[0x4]; // 0x5c(0x04)
};

// Class Phoenix.AISenseConfig_NPC
// Size: 0x60 (Inherited: 0x48)
struct UAISenseConfig_NPC : UAISenseConfig {
	bool bEnabled; // 0x48(0x01)
	char pad_49[0x3]; // 0x49(0x03)
	float UpdateInterval; // 0x4c(0x04)
	float EvaluateRadius; // 0x50(0x04)
	bool bStartActive; // 0x54(0x01)
	char pad_55[0xb]; // 0x55(0x0b)
};

// Class Phoenix.AISenseConfig_EnemyAITarget
// Size: 0x328 (Inherited: 0x60)
struct UAISenseConfig_EnemyAITarget : UAISenseConfig_NPC {
	struct UAISense_EnemyAITarget* Implementation; // 0x60(0x08)
	enum class EPerceptionPointEvaluateSource EvaluateSource; // 0x68(0x01)
	char pad_69[0x7]; // 0x69(0x07)
	struct TArray<struct FString> ExcludeTagList; // 0x70(0x10)
	struct TArray<struct APerceptionPointArea*> ForceTargetVolumeList; // 0x80(0x10)
	struct TArray<struct APerceptionPointArea*> ForceTargetExcludeVolumeList; // 0x90(0x10)
	bool bOverrideDistanceRequirement; // 0xa0(0x01)
	char pad_A1[0x7]; // 0xa1(0x07)
	struct TArray<struct APerceptionPointArea*> PerceiveVolumeList; // 0xa8(0x10)
	float PerceiveRadius; // 0xb8(0x04)
	float LoseRadius; // 0xbc(0x04)
	float HeightDifference; // 0xc0(0x04)
	float EvaluateInterval; // 0xc4(0x04)
	struct UEnemy_TargetSenseAsset* TargetSenseAsset; // 0xc8(0x08)
	struct UEnemy_TargetSenseAsset* NPCTargetSenseAsset; // 0xd0(0x08)
	struct UEnemy_TargetSenseAsset* NonCombatSenseAsset; // 0xd8(0x08)
	struct FEnemy_TargetSense_LOS LOS; // 0xe0(0x1c)
	struct FEnemy_TargetSense_FOV FieldOfView; // 0xfc(0x1bc)
	struct FEnemy_TargetSense_Remember Remember; // 0x2b8(0x10)
	struct FEnemy_TargetSense_TAS TAS; // 0x2c8(0x28)
	struct FEnemy_TargetSense_DisillusionmentScale DisillusionmentScale; // 0x2f0(0x04)
	char pad_2F4[0x4]; // 0x2f4(0x04)
	struct TArray<struct APerceptionPointArea*> TeamateShareVolumeList; // 0x2f8(0x10)
	char pad_308[0x20]; // 0x308(0x20)
};

// Class Phoenix.AISenseConfig_EnemyAIWeapon
// Size: 0x80 (Inherited: 0x60)
struct UAISenseConfig_EnemyAIWeapon : UAISenseConfig_NPC {
	struct UAISense_EnemyAIWeapon* Implementation; // 0x60(0x08)
	bool bOverrideDistanceRequirement; // 0x68(0x01)
	char pad_69[0x3]; // 0x69(0x03)
	float PerceiveRadius; // 0x6c(0x04)
	struct TArray<struct APerceptionPointArea*> PerceiveVolumeList; // 0x70(0x10)
};

// Class Phoenix.AISenseConfig_GameEvent
// Size: 0x58 (Inherited: 0x48)
struct UAISenseConfig_GameEvent : UAISenseConfig {
	struct UAISense_GameEvent* Implementation; // 0x48(0x08)
	struct UPlayer_FootfallDataAsset* FootfallDataAsset; // 0x50(0x08)
};

// Class Phoenix.AISenseConfig_Magic
// Size: 0x58 (Inherited: 0x48)
struct UAISenseConfig_Magic : UAISenseConfig {
	float MagicSensingRange; // 0x48(0x04)
	float LoSMagicSensingRange; // 0x4c(0x04)
	char bUseLoSMagicSensing : 1; // 0x50(0x01)
	char pad_50_1 : 7; // 0x50(0x01)
	char pad_51[0x3]; // 0x51(0x03)
	struct FAISenseAffiliationFilter DetectionByAffiliation; // 0x54(0x04)
};

// Class Phoenix.AISenseConfig_NearbyCreatures
// Size: 0x50 (Inherited: 0x48)
struct UAISenseConfig_NearbyCreatures : UAISenseConfig {
	float Range; // 0x48(0x04)
	char pad_4C[0x4]; // 0x4c(0x04)
};

// Class Phoenix.NPC_CrimeSceneSenseAsset
// Size: 0x60 (Inherited: 0x30)
struct UNPC_CrimeSceneSenseAsset : UDataAsset {
	struct FNPC_CrimeSceneSense CrimeSceneSense; // 0x30(0x30)
};

// Class Phoenix.AISenseConfig_NPCCrimeScene
// Size: 0x80 (Inherited: 0x60)
struct UAISenseConfig_NPCCrimeScene : UAISenseConfig_NPC {
	struct UAISense_NPCCrimeScene* Implementation; // 0x60(0x08)
	struct UNPC_CrimeSceneSenseAsset* SenseAsset; // 0x68(0x08)
	float PerceiveRadius; // 0x70(0x04)
	float LoseRadius; // 0x74(0x04)
	float HeightDifference; // 0x78(0x04)
	float EvaluateInterval; // 0x7c(0x04)
};

// Class Phoenix.AISenseConfig_Smell
// Size: 0x58 (Inherited: 0x48)
struct UAISenseConfig_Smell : UAISenseConfig {
	struct UAISense_Smell* Implementation; // 0x48(0x08)
	float Range; // 0x50(0x04)
	bool bDisplayDebugSphere; // 0x54(0x01)
	char pad_55[0x3]; // 0x55(0x03)
};

// Class Phoenix.AISenseEvent_GameEvent
// Size: 0xb8 (Inherited: 0x28)
struct UAISenseEvent_GameEvent : UAISenseEvent {
	struct FAIGameEvent Event; // 0x28(0x90)
};

// Class Phoenix.AISenseEvent_Magic
// Size: 0x58 (Inherited: 0x28)
struct UAISenseEvent_Magic : UAISenseEvent {
	struct FAIMagicEvent Event; // 0x28(0x30)
};

// Class Phoenix.AlohomoraLevelHelper
// Size: 0x28 (Inherited: 0x28)
struct UAlohomoraLevelHelper : UObject {

	void SwitchAlohomoraLevel(enum class EAlohomoraLevel& AlohomoraLevel); // Function Phoenix.AlohomoraLevelHelper.SwitchAlohomoraLevel // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x31dcf20
	void SetAlohomoraLevel(enum class EAlohomoraLevel AlohomoraLevel); // Function Phoenix.AlohomoraLevelHelper.SetAlohomoraLevel // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x31dcca0
	bool IsAlohomoraLevel(enum class EAlohomoraLevel AlohomoraLevel); // Function Phoenix.AlohomoraLevelHelper.IsAlohomoraLevel // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x31dca60
	enum class EAlohomoraLevel GetAlohomoraLevel(); // Function Phoenix.AlohomoraLevelHelper.GetAlohomoraLevel // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x31db0a0
};

// Class Phoenix.AmbientCreatureSpawnManager
// Size: 0x270 (Inherited: 0x28)
struct UAmbientCreatureSpawnManager : UObject {
	char pad_28[0x248]; // 0x28(0x248)

	void SetSpawningEnabled(bool bEnabled); // Function Phoenix.AmbientCreatureSpawnManager.SetSpawningEnabled // (Final|Native|Public|BlueprintCallable) // @ game+0x31dce10
	struct UAmbientCreatureSpawnManager* Get(); // Function Phoenix.AmbientCreatureSpawnManager.Get // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x31db050
	void CullAllCreatures(bool bFadeOut); // Function Phoenix.AmbientCreatureSpawnManager.CullAllCreatures // (Final|Native|Public|BlueprintCallable) // @ game+0x31dafc0
};

// Class Phoenix.AmbientCreatureSpawnVolume
// Size: 0x300 (Inherited: 0x250)
struct AAmbientCreatureSpawnVolume : ATriggerBox {
	enum class EAmbientCreatureSpawnVolumeType VolumeType; // 0x250(0x04)
	char pad_254[0x4]; // 0x254(0x04)
	struct FDbSingleColumnInfo CreatureGroupSelector; // 0x258(0x88)
	enum class EAmbientCreatureSpawnVolumePriority VolumePriority; // 0x2e0(0x04)
	float RangeMultiplier; // 0x2e4(0x04)
	bool bSuppressSpawning; // 0x2e8(0x01)
	char pad_2E9[0x17]; // 0x2e9(0x17)

	void OnEndOverlap(struct AActor* SelfActor, struct AActor* OtherActor); // Function Phoenix.AmbientCreatureSpawnVolume.OnEndOverlap // (Final|Native|Private) // @ game+0x31dcbb0
	void OnBeginOverlap(struct AActor* SelfActor, struct AActor* OtherActor); // Function Phoenix.AmbientCreatureSpawnVolume.OnBeginOverlap // (Final|Native|Private) // @ game+0x31dcae0
};

// Class Phoenix.AmbientGhost_AnimInstance
// Size: 0x2c0 (Inherited: 0x2c0)
struct UAmbientGhost_AnimInstance : UAnimInstance {
	bool bWaveEnabled; // 0x2b8(0x01)

	void WaveCompleted(); // Function Phoenix.AmbientGhost_AnimInstance.WaveCompleted // (Final|Native|Public|BlueprintCallable) // @ game+0x31dcfa0
};

// Class Phoenix.AmbientGhost_Character
// Size: 0x540 (Inherited: 0x4e0)
struct AAmbientGhost_Character : ACharacter {
	char pad_4E0[0x10]; // 0x4e0(0x10)
	struct USplineComponent* SplineComponent; // 0x4f0(0x08)
	float DistanceAlongSpline; // 0x4f8(0x04)
	float TravelDirection; // 0x4fc(0x04)
	float TravelSpeed; // 0x500(0x04)
	float YawSpeed; // 0x504(0x04)
	float TurnToFacePlayerSpeed; // 0x508(0x04)
	float DistanceAtWhichGhostFacesPlayer; // 0x50c(0x04)
	float VerticalDistanceAtWhichGhostFacesPlayer; // 0x510(0x04)
	float OuterRadius; // 0x514(0x04)
	float OuterRadiusVerticalDistance; // 0x518(0x04)
	float InnerRadius; // 0x51c(0x04)
	float InnerRadiusVerticalDistance; // 0x520(0x04)
	struct TWeakObjectPtr<struct UAmbientGhost_AnimInstance> AmbientGhostAnimInstance; // 0x524(0x08)
	char pad_52C[0x14]; // 0x52c(0x14)

	void ExitedOuterRadius(); // Function Phoenix.AmbientGhost_Character.ExitedOuterRadius // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ExitedInnerRadius(); // Function Phoenix.AmbientGhost_Character.ExitedInnerRadius // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void EnteredOuterRadius(); // Function Phoenix.AmbientGhost_Character.EnteredOuterRadius // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void EnteredInnerRadius(); // Function Phoenix.AmbientGhost_Character.EnteredInnerRadius // (Event|Public|BlueprintEvent) // @ game+0x38a7480
};

// Class Phoenix.AmbientPaintingActor
// Size: 0x2d0 (Inherited: 0x248)
struct AAmbientPaintingActor : AActor {
	char pad_248[0x10]; // 0x248(0x10)
	struct USceneComponent* RootSceneComponent; // 0x258(0x08)
	struct UStaticMeshComponent* FrameT; // 0x260(0x08)
	struct FDataTableRowHandle AtlasHandle; // 0x268(0x10)
	struct FDataTableRowHandle PaintingHandle; // 0x278(0x10)
	struct UMaterialInterface* PaintingMaterial; // 0x288(0x08)
	struct UDataTable* AmbientPaintingsLibraryDT; // 0x290(0x08)
	struct UPhysicalResponseComponent* PhysicalResponse; // 0x298(0x08)
	struct UBinkMediaPlayer* BinkMediaPlayer; // 0x2a0(0x08)
	char pad_2A8[0x10]; // 0x2a8(0x10)
	struct UMaterialInstanceDynamic* MaterialInstance; // 0x2b8(0x08)
	char pad_2C0[0x10]; // 0x2c0(0x10)
};

// Class Phoenix.AmbientPaintingBudgeter
// Size: 0xa0 (Inherited: 0x40)
struct UAmbientPaintingBudgeter : UBudgeter {
	char pad_40[0x60]; // 0x40(0x60)
};

// Class Phoenix.AmbientPaintingBudgeterInterface
// Size: 0x28 (Inherited: 0x28)
struct UAmbientPaintingBudgeterInterface : UInterface {
};

// Class Phoenix.AmbulatoryAnimTask_TurnAssist
// Size: 0xa8 (Inherited: 0x58)
struct UAmbulatoryAnimTask_TurnAssist : UAmbulatoryTurnAssistAnimTask {
	struct FAlphaBlend TurningBlend; // 0x58(0x30)
	struct FVector CurrentDirection; // 0x88(0x0c)
	struct FVector DesiredDirection; // 0x94(0x0c)
	float ElapsedTime; // 0xa0(0x04)
	bool bTimerReset; // 0xa4(0x01)
	char pad_A5[0x3]; // 0xa5(0x03)
};

// Class Phoenix.AnalyticsManager
// Size: 0x238 (Inherited: 0x28)
struct UAnalyticsManager : UObject {
	char pad_28[0x210]; // 0x28(0x210)

	void SetUsingFloo(bool UsingFloo); // Function Phoenix.AnalyticsManager.SetUsingFloo // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x31dcea0
	void SetSaveSlot(int32_t SaveSlot); // Function Phoenix.AnalyticsManager.SetSaveSlot // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x31dcd90
