// UserDefinedStruct PropList.PropList
// Size: 0xb0 (Inherited: 0x00)
struct FPropList {
	struct TArray<struct TSoftObjectPtr<UStaticMesh>> Overland_27_B7F9AC9246BB6E856A027BBE3E8575A4; // 0x00(0x10)
	struct TArray<struct TSoftObjectPtr<UStaticMesh>> Castle_28_2DAEE6544C5EF23EDE4B259D0BCE8E54; // 0x10(0x10)
	struct TArray<struct TSoftObjectPtr<UStaticMesh>> Cairn_29_E246348546B3B0AF3C2AD188EEA8842A; // 0x20(0x10)
	struct TArray<struct TSoftObjectPtr<UStaticMesh>> Sanctum_30_B8DAE5F142ED2E848E5E298C51CF3E19; // 0x30(0x10)
	struct TArray<struct TSoftObjectPtr<UStaticMesh>> Cavern_31_263216FD46CA581952F06BAECDA08C50; // 0x40(0x10)
	struct TArray<struct TSoftObjectPtr<UStaticMesh>> Hogwarts_35_025A5976434426E65D385E86CD0BAB2E; // 0x50(0x10)
	struct TArray<struct TSoftObjectPtr<UStaticMesh>> Hogsmeade_37_F39CEEF349C3D302B0862A96C834808E; // 0x60(0x10)
	struct TArray<struct TSoftObjectPtr<UStaticMesh>> Hamlets_41_6EF051194DF8473A795DD68BCE011415; // 0x70(0x10)
	struct TArray<struct TSoftObjectPtr<UStaticMesh>> Bandit_43_906252484568999F97A05EB78BB003F9; // 0x80(0x10)
	struct TArray<struct TSoftObjectPtr<UStaticMesh>> GobMines_47_6DF174C846923FEA52047CB2D24A2563; // 0x90(0x10)
	struct TArray<struct TSoftObjectPtr<UStaticMesh>> Cages_54_B10C51D542193FA5393557BE03E6FE14; // 0xa0(0x10)
};

