// Class Slate.ButtonWidgetStyle
// Size: 0x2a8 (Inherited: 0x30)
struct UButtonWidgetStyle : USlateWidgetStyleContainerBase {
	struct FButtonStyle ButtonStyle; // 0x30(0x278)
};

// Class Slate.CheckBoxWidgetStyle
// Size: 0x5b0 (Inherited: 0x30)
struct UCheckBoxWidgetStyle : USlateWidgetStyleContainerBase {
	struct FCheckBoxStyle CheckBoxStyle; // 0x30(0x580)
};

// Class Slate.ComboBoxWidgetStyle
// Size: 0x420 (Inherited: 0x30)
struct UComboBoxWidgetStyle : USlateWidgetStyleContainerBase {
	struct FComboBoxStyle ComboBoxStyle; // 0x30(0x3f0)
};

// Class Slate.ComboButtonWidgetStyle
// Size: 0x3e8 (Inherited: 0x30)
struct UComboButtonWidgetStyle : USlateWidgetStyleContainerBase {
	struct FComboButtonStyle ComboButtonStyle; // 0x30(0x3b8)
};

// Class Slate.EditableTextBoxWidgetStyle
// Size: 0x828 (Inherited: 0x30)
struct UEditableTextBoxWidgetStyle : USlateWidgetStyleContainerBase {
	struct FEditableTextBoxStyle EditableTextBoxStyle; // 0x30(0x7f8)
};

// Class Slate.EditableTextWidgetStyle
// Size: 0x250 (Inherited: 0x30)
struct UEditableTextWidgetStyle : USlateWidgetStyleContainerBase {
	struct FEditableTextStyle EditableTextStyle; // 0x30(0x220)
};

// Class Slate.ProgressWidgetStyle
// Size: 0x1d0 (Inherited: 0x30)
struct UProgressWidgetStyle : USlateWidgetStyleContainerBase {
	struct FProgressBarStyle ProgressBarStyle; // 0x30(0x1a0)
};

// Class Slate.ScrollBarWidgetStyle
// Size: 0x500 (Inherited: 0x30)
struct UScrollBarWidgetStyle : USlateWidgetStyleContainerBase {
	struct FScrollBarStyle ScrollBarStyle; // 0x30(0x4d0)
};

// Class Slate.ScrollBoxWidgetStyle
// Size: 0x258 (Inherited: 0x30)
struct UScrollBoxWidgetStyle : USlateWidgetStyleContainerBase {
	struct FScrollBoxStyle ScrollBoxStyle; // 0x30(0x228)
};

// Class Slate.SlateSettings
// Size: 0x30 (Inherited: 0x28)
struct USlateSettings : UObject {
	bool bExplicitCanvasChildZOrder; // 0x28(0x01)
	char pad_29[0x7]; // 0x29(0x07)
};

// Class Slate.SpinBoxWidgetStyle
// Size: 0x318 (Inherited: 0x30)
struct USpinBoxWidgetStyle : USlateWidgetStyleContainerBase {
	struct FSpinBoxStyle SpinBoxStyle; // 0x30(0x2e8)
};

// Class Slate.TextBlockWidgetStyle
// Size: 0x2a0 (Inherited: 0x30)
struct UTextBlockWidgetStyle : USlateWidgetStyleContainerBase {
	struct FTextBlockStyle TextBlockStyle; // 0x30(0x270)
};

// Class Slate.ToolMenuBase
// Size: 0x28 (Inherited: 0x28)
struct UToolMenuBase : UObject {
};

