// BlueprintGeneratedClass SM_Cairn_BonePile_C.SM_Cairn_BonePile_C_C
// Size: 0x2c8 (Inherited: 0x248)
struct ASM_Cairn_BonePile_C_C : AActor {
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_Cairn_Bone_Short_F1; // 0x248(0x08)
	struct UStaticMeshComponent* SM_Cairn_Bone_Blade_F1; // 0x250(0x08)
	struct UStaticMeshComponent* SM_Cairn_Bone_Skull_A1; // 0x258(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_5SM_Cairn_Bone_Short_A1; // 0x260(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_Cairn_Bone_Femur_A1; // 0x268(0x08)
	struct UStaticMeshComponent* SM_Cairn_Bone_Skull_E1; // 0x270(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Cairn_Bone_Skull_B1; // 0x278(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_Cairn_Bone_Skull_D1; // 0x280(0x08)
	struct UStaticMeshComponent* SM_Cairn_Bone_BeastSkull_A1; // 0x288(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Cairn_Bone_Blade_E1; // 0x290(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Cairn_Bone_Blade_A1; // 0x298(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_Cairn_Bone_Long_A1; // 0x2a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_6SM_Cairn_Bone_Long_B1; // 0x2a8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Cairn_Bone_Rib_A1; // 0x2b0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_Cairn_Bone_Blade_C1; // 0x2b8(0x08)
	struct USceneComponent* SharedRoot; // 0x2c0(0x08)
};

