// BlueprintGeneratedClass SM_CastleDun_Debris_RubbleMound_Side_B_BP.SM_CastleDun_Debris_RubbleMound_Side_B_BP_C
// Size: 0x2a0 (Inherited: 0x248)
struct ASM_CastleDun_Debris_RubbleMound_Side_B_BP_C : AActor {
	struct UStaticMeshComponent* SM_CastleDun_Debris_RubbleMound_Side_A; // 0x248(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_CastleDun_SmallDebris_E; // 0x250(0x08)
	struct UStaticMeshComponent* SM_CastleDun_SmallDebris_B; // 0x258(0x08)
	struct UStaticMeshComponent* SM_CastleDun_Floor_SquarePiece_J; // 0x260(0x08)
	struct UStaticMeshComponent* SM_CastleDun_Floor_SquarePiece_H; // 0x268(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WallDebris_D; // 0x270(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WallDebris_B; // 0x278(0x08)
	struct UStaticMeshComponent* SM_CastleDun_WallDebris_C; // 0x280(0x08)
	struct UStaticMeshComponent* SM_CastleDun_Floor_SquarePiece_G; // 0x288(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleDun_WallDebris_A; // 0x290(0x08)
	struct USceneComponent* SharedRoot; // 0x298(0x08)
};

