// BlueprintGeneratedClass SM_CastleRuins_2_Wall_I.SM_CastleRuins_2_Wall_I_C
// Size: 0x2a8 (Inherited: 0x248)
struct ASM_CastleRuins_2_Wall_I_C : AActor {
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_2_Relief_A_b; // 0x248(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_Relief_A_e; // 0x250(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_CastleRuins_2_Relief_A1_a; // 0x258(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_Relief_A1_c; // 0x260(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_Relief_A1_b; // 0x268(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_Relief_B1_b; // 0x270(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_Relief_B1_c; // 0x278(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_Broken_B_a; // 0x280(0x08)
	struct UStaticMeshComponent* SM_CastleRuins_2_Broken_E; // 0x288(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleRuins_2_Wall_A; // 0x290(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_CastleRuins_2_Broken_F_b; // 0x298(0x08)
	struct USceneComponent* SharedRoot; // 0x2a0(0x08)
};

