// BlueprintGeneratedClass SM_CastleDun_Rail250_A.SM_CastleDun_Rail250_A_C
// Size: 0x290 (Inherited: 0x248)
struct ASM_CastleDun_Rail250_A_C : AActor {
	struct UStaticMeshComponent* StaticMeshComponent07; // 0x248(0x08)
	struct UStaticMeshComponent* StaticMeshComponent06; // 0x250(0x08)
	struct UStaticMeshComponent* StaticMeshComponent05; // 0x258(0x08)
	struct UStaticMeshComponent* StaticMeshComponent04; // 0x260(0x08)
	struct UStaticMeshComponent* StaticMeshComponent03; // 0x268(0x08)
	struct UStaticMeshComponent* StaticMeshComponent02; // 0x270(0x08)
	struct UStaticMeshComponent* StaticMeshComponent01; // 0x278(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0; // 0x280(0x08)
	struct USceneComponent* SharedRoot; // 0x288(0x08)
};

