// BlueprintGeneratedClass SM_CastleRuins_2_WallBroken_A2.SM_CastleRuins_2_WallBroken_A2_C
// Size: 0x440 (Inherited: 0x248)
struct ASM_CastleRuins_2_WallBroken_A2_C : AActor {
	struct UStaticMeshComponent* StaticMeshComponent070; // 0x248(0x08)
	struct UStaticMeshComponent* StaticMeshComponent069; // 0x250(0x08)
	struct UStaticMeshComponent* StaticMeshComponent067; // 0x258(0x08)
	struct UStaticMeshComponent* StaticMeshComponent066; // 0x260(0x08)
	struct UStaticMeshComponent* StaticMeshComponent065; // 0x268(0x08)
	struct UStaticMeshComponent* StaticMeshComponent064; // 0x270(0x08)
	struct UStaticMeshComponent* StaticMeshComponent063; // 0x278(0x08)
	struct UStaticMeshComponent* StaticMeshComponent061; // 0x280(0x08)
	struct UStaticMeshComponent* StaticMeshComponent059; // 0x288(0x08)
	struct UStaticMeshComponent* StaticMeshComponent058; // 0x290(0x08)
	struct UStaticMeshComponent* StaticMeshComponent057; // 0x298(0x08)
	struct UStaticMeshComponent* StaticMeshComponent056; // 0x2a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent055; // 0x2a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent054; // 0x2b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent053; // 0x2b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent052; // 0x2c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent051; // 0x2c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent050; // 0x2d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent049; // 0x2d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent047; // 0x2e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent046; // 0x2e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent045; // 0x2f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent044; // 0x2f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent043; // 0x300(0x08)
	struct UStaticMeshComponent* StaticMeshComponent042; // 0x308(0x08)
	struct UStaticMeshComponent* StaticMeshComponent041; // 0x310(0x08)
	struct UStaticMeshComponent* StaticMeshComponent040; // 0x318(0x08)
	struct UStaticMeshComponent* StaticMeshComponent039; // 0x320(0x08)
	struct UStaticMeshComponent* StaticMeshComponent038; // 0x328(0x08)
	struct UStaticMeshComponent* StaticMeshComponent036; // 0x330(0x08)
	struct UStaticMeshComponent* StaticMeshComponent035; // 0x338(0x08)
	struct UStaticMeshComponent* StaticMeshComponent034; // 0x340(0x08)
	struct UStaticMeshComponent* StaticMeshComponent033; // 0x348(0x08)
	struct UStaticMeshComponent* StaticMeshComponent032; // 0x350(0x08)
	struct UStaticMeshComponent* StaticMeshComponent031; // 0x358(0x08)
	struct UStaticMeshComponent* StaticMeshComponent029; // 0x360(0x08)
	struct UStaticMeshComponent* StaticMeshComponent028; // 0x368(0x08)
	struct UStaticMeshComponent* StaticMeshComponent027; // 0x370(0x08)
	struct UStaticMeshComponent* StaticMeshComponent026; // 0x378(0x08)
	struct UStaticMeshComponent* StaticMeshComponent025; // 0x380(0x08)
	struct UStaticMeshComponent* StaticMeshComponent023; // 0x388(0x08)
	struct UStaticMeshComponent* StaticMeshComponent022; // 0x390(0x08)
	struct UStaticMeshComponent* StaticMeshComponent021; // 0x398(0x08)
	struct UStaticMeshComponent* StaticMeshComponent020; // 0x3a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent019; // 0x3a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent018; // 0x3b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent017; // 0x3b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent016; // 0x3c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent015; // 0x3c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent014; // 0x3d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent013; // 0x3d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent012; // 0x3e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent011; // 0x3e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent010; // 0x3f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent09; // 0x3f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent08; // 0x400(0x08)
	struct UStaticMeshComponent* StaticMeshComponent07; // 0x408(0x08)
	struct UStaticMeshComponent* StaticMeshComponent06; // 0x410(0x08)
	struct UStaticMeshComponent* StaticMeshComponent05; // 0x418(0x08)
	struct UStaticMeshComponent* StaticMeshComponent03; // 0x420(0x08)
	struct UStaticMeshComponent* StaticMeshComponent02; // 0x428(0x08)
	struct UStaticMeshComponent* StaticMeshComponent01; // 0x430(0x08)
	struct USceneComponent* SharedRoot; // 0x438(0x08)
};

