// BlueprintGeneratedClass SM_CastleRuins_2_Wall_Broken_B2.SM_CastleRuins_2_Wall_Broken_B2_C
// Size: 0x514 (Inherited: 0x248)
struct ASM_CastleRuins_2_Wall_Broken_B2_C : AActor {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x248(0x08)
	struct UObjectStateComponent* ObjectState; // 0x250(0x08)
	struct UStaticMeshComponent* StaticMeshComponent094; // 0x258(0x08)
	struct UStaticMeshComponent* StaticMeshComponent093; // 0x260(0x08)
	struct UStaticMeshComponent* StaticMeshComponent092; // 0x268(0x08)
	struct UStaticMeshComponent* StaticMeshComponent091; // 0x270(0x08)
	struct UStaticMeshComponent* StaticMeshComponent090; // 0x278(0x08)
	struct UStaticMeshComponent* StaticMeshComponent089; // 0x280(0x08)
	struct UStaticMeshComponent* StaticMeshComponent088; // 0x288(0x08)
	struct UStaticMeshComponent* StaticMeshComponent087; // 0x290(0x08)
	struct UStaticMeshComponent* StaticMeshComponent086; // 0x298(0x08)
	struct UStaticMeshComponent* StaticMeshComponent085; // 0x2a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent084; // 0x2a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent083; // 0x2b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent082; // 0x2b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent081; // 0x2c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent080; // 0x2c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent079; // 0x2d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent078; // 0x2d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent077; // 0x2e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent076; // 0x2e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent075; // 0x2f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent074; // 0x2f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent073; // 0x300(0x08)
	struct UStaticMeshComponent* StaticMeshComponent072; // 0x308(0x08)
	struct UStaticMeshComponent* StaticMeshComponent071; // 0x310(0x08)
	struct UStaticMeshComponent* StaticMeshComponent070; // 0x318(0x08)
	struct UStaticMeshComponent* StaticMeshComponent069; // 0x320(0x08)
	struct UStaticMeshComponent* StaticMeshComponent068; // 0x328(0x08)
	struct UStaticMeshComponent* StaticMeshComponent067; // 0x330(0x08)
	struct UStaticMeshComponent* StaticMeshComponent066; // 0x338(0x08)
	struct UStaticMeshComponent* StaticMeshComponent065; // 0x340(0x08)
	struct UStaticMeshComponent* StaticMeshComponent064; // 0x348(0x08)
	struct UStaticMeshComponent* StaticMeshComponent063; // 0x350(0x08)
	struct UStaticMeshComponent* StaticMeshComponent062; // 0x358(0x08)
	struct UStaticMeshComponent* StaticMeshComponent061; // 0x360(0x08)
	struct UStaticMeshComponent* StaticMeshComponent060; // 0x368(0x08)
	struct UStaticMeshComponent* StaticMeshComponent059; // 0x370(0x08)
	struct UStaticMeshComponent* StaticMeshComponent058; // 0x378(0x08)
	struct UStaticMeshComponent* StaticMeshComponent057; // 0x380(0x08)
	struct UStaticMeshComponent* StaticMeshComponent056; // 0x388(0x08)
	struct UStaticMeshComponent* StaticMeshComponent055; // 0x390(0x08)
	struct UStaticMeshComponent* StaticMeshComponent054; // 0x398(0x08)
	struct UStaticMeshComponent* StaticMeshComponent053; // 0x3a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent052; // 0x3a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent051; // 0x3b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent050; // 0x3b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent049; // 0x3c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent048; // 0x3c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent047; // 0x3d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent046; // 0x3d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent045; // 0x3e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent044; // 0x3e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent043; // 0x3f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent042; // 0x3f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent041; // 0x400(0x08)
	struct UStaticMeshComponent* StaticMeshComponent040; // 0x408(0x08)
	struct UStaticMeshComponent* StaticMeshComponent039; // 0x410(0x08)
	struct UStaticMeshComponent* StaticMeshComponent038; // 0x418(0x08)
	struct UStaticMeshComponent* StaticMeshComponent037; // 0x420(0x08)
	struct UStaticMeshComponent* StaticMeshComponent036; // 0x428(0x08)
	struct UStaticMeshComponent* StaticMeshComponent035; // 0x430(0x08)
	struct UStaticMeshComponent* StaticMeshComponent034; // 0x438(0x08)
	struct UStaticMeshComponent* StaticMeshComponent033; // 0x440(0x08)
	struct UStaticMeshComponent* StaticMeshComponent032; // 0x448(0x08)
	struct UStaticMeshComponent* StaticMeshComponent031; // 0x450(0x08)
	struct UStaticMeshComponent* StaticMeshComponent030; // 0x458(0x08)
	struct UStaticMeshComponent* StaticMeshComponent029; // 0x460(0x08)
	struct UStaticMeshComponent* StaticMeshComponent028; // 0x468(0x08)
	struct UStaticMeshComponent* StaticMeshComponent027; // 0x470(0x08)
	struct UStaticMeshComponent* StaticMeshComponent026; // 0x478(0x08)
	struct UStaticMeshComponent* StaticMeshComponent025; // 0x480(0x08)
	struct UStaticMeshComponent* StaticMeshComponent024; // 0x488(0x08)
	struct UStaticMeshComponent* StaticMeshComponent023; // 0x490(0x08)
	struct UStaticMeshComponent* StaticMeshComponent022; // 0x498(0x08)
	struct UStaticMeshComponent* StaticMeshComponent021; // 0x4a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent020; // 0x4a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent018; // 0x4b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent017; // 0x4b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent016; // 0x4c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent015; // 0x4c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent014; // 0x4d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent013; // 0x4d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent012; // 0x4e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent011; // 0x4e8(0x08)
	struct USceneComponent* SharedRoot; // 0x4f0(0x08)
	struct TArray<struct UStaticMeshComponent*> Bricks; // 0x4f8(0x10)
	struct FVector ImpactLocation; // 0x508(0x0c)

	bool NearDeathKneeling(float DamageAmount, struct AActor* Instigator, struct FGameplayTagContainer MunitionTagContainer, struct FVector Velocity); // Function SM_CastleRuins_2_Wall_Broken_B2.SM_CastleRuins_2_Wall_Broken_B2_C.NearDeathKneeling // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	bool Damaged(float DamageAmount, struct FVector HitLocation, struct FVector HitDirection, struct UPrimitiveComponent* PrimComp, struct FGameplayTagContainer MunitionTagContainer, struct AActor* Instigator, struct FVector Velocity); // Function SM_CastleRuins_2_Wall_Broken_B2.SM_CastleRuins_2_Wall_Broken_B2_C.Damaged // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	bool Destroyed(float DamageAmount, struct AActor* Instigator, struct FGameplayTagContainer MunitionTagContainer, struct FVector Velocity); // Function SM_CastleRuins_2_Wall_Broken_B2.SM_CastleRuins_2_Wall_Broken_B2_C.Destroyed // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void OnAffectedBySpell(struct ASpellTool* SpellTool, struct AActor* Instigator, struct TArray<struct UInteractionArchitectAsset*>& DataAssets, struct USpellToolRecord* SpellToolRecord, struct FName SpellType, struct FGameplayTagContainer Impact, struct FHitResult& Hit, struct FVector& ImpactDirection); // Function SM_CastleRuins_2_Wall_Broken_B2.SM_CastleRuins_2_Wall_Broken_B2_C.OnAffectedBySpell // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x38a7480
	void OnAffectedBySpellEnd(struct ASpellTool* SpellTool, struct AActor* Instigator, struct USpellToolRecord* SpellToolRecord, struct FName SpellType, struct FGameplayTagContainer Impact); // Function SM_CastleRuins_2_Wall_Broken_B2.SM_CastleRuins_2_Wall_Broken_B2_C.OnAffectedBySpellEnd // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void OnOverlappedBySpell(struct ASpellTool* SpellTool, struct AActor* Instigator, struct USpellToolRecord* SpellToolRecord, struct FName SpellType, struct FGameplayTagContainer Impact, struct FVector& MunitionLocation); // Function SM_CastleRuins_2_Wall_Broken_B2.SM_CastleRuins_2_Wall_Broken_B2_C.OnOverlappedBySpell // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x38a7480
	void OnSpellEffective(struct AActor* Instigator); // Function SM_CastleRuins_2_Wall_Broken_B2.SM_CastleRuins_2_Wall_Broken_B2_C.OnSpellEffective // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void OnSpellIneffective(struct AActor* Instigator); // Function SM_CastleRuins_2_Wall_Broken_B2.SM_CastleRuins_2_Wall_Broken_B2_C.OnSpellIneffective // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void OnSpellTooWeak(struct AActor* Instigator); // Function SM_CastleRuins_2_Wall_Broken_B2.SM_CastleRuins_2_Wall_Broken_B2_C.OnSpellTooWeak // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void OnAttemptToHeal(); // Function SM_CastleRuins_2_Wall_Broken_B2.SM_CastleRuins_2_Wall_Broken_B2_C.OnAttemptToHeal // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void OnAttemptToRepair(); // Function SM_CastleRuins_2_Wall_Broken_B2.SM_CastleRuins_2_Wall_Broken_B2_C.OnAttemptToRepair // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void OnBeginRepairing(); // Function SM_CastleRuins_2_Wall_Broken_B2.SM_CastleRuins_2_Wall_Broken_B2_C.OnBeginRepairing // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void OnCriticalHealthReached(); // Function SM_CastleRuins_2_Wall_Broken_B2.SM_CastleRuins_2_Wall_Broken_B2_C.OnCriticalHealthReached // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void OnDoneRepairing(); // Function SM_CastleRuins_2_Wall_Broken_B2.SM_CastleRuins_2_Wall_Broken_B2_C.OnDoneRepairing // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void OnFailedToBeDestroyed(); // Function SM_CastleRuins_2_Wall_Broken_B2.SM_CastleRuins_2_Wall_Broken_B2_C.OnFailedToBeDestroyed // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void OnFailedToBeHealed(); // Function SM_CastleRuins_2_Wall_Broken_B2.SM_CastleRuins_2_Wall_Broken_B2_C.OnFailedToBeHealed // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void OnGeometryCollectionCompletelyBroken(struct URepairComponent* RepairComponent, struct UGeometryCollectionComponent* GeometryCollectionComponent, float impulseStr, float Radius, struct FVector HitLocation, struct FVector HitDirection); // Function SM_CastleRuins_2_Wall_Broken_B2.SM_CastleRuins_2_Wall_Broken_B2_C.OnGeometryCollectionCompletelyBroken // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void OnGeometryCollectionDamaged(struct URepairComponent* RepairComponent, struct UGeometryCollectionComponent* GeometryCollectionComponent, float impulseStr, float Radius, struct FVector HitLocation, struct FVector HitDirection); // Function SM_CastleRuins_2_Wall_Broken_B2.SM_CastleRuins_2_Wall_Broken_B2_C.OnGeometryCollectionDamaged // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void OnGeometryCollectionSpawned(struct URepairComponent* RepairComponent, struct UGeometryCollectionComponent* GeometryCollectionComponent, float impulseStr, float Radius, struct FVector HitLocation, struct FVector HitDirection, bool bCompletelyBroken); // Function SM_CastleRuins_2_Wall_Broken_B2.SM_CastleRuins_2_Wall_Broken_B2_C.OnGeometryCollectionSpawned // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void OnHealed(float healAmount, struct UPrimitiveComponent* PrimComp); // Function SM_CastleRuins_2_Wall_Broken_B2.SM_CastleRuins_2_Wall_Broken_B2_C.OnHealed // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ReceiveBeginPlay(); // Function SM_CastleRuins_2_Wall_Broken_B2.SM_CastleRuins_2_Wall_Broken_B2_C.ReceiveBeginPlay // (Event|Protected|BlueprintEvent) // @ game+0x38a7480
	void OnHitBySpell(struct ASpellTool* SpellTool, struct AActor* Instigator, struct USpellToolRecord* SpellToolRecord, struct FName SpellType, struct FHitResult& Hit, struct FVector& ImpactDirection); // Function SM_CastleRuins_2_Wall_Broken_B2.SM_CastleRuins_2_Wall_Broken_B2_C.OnHitBySpell // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x38a7480
	void OnFailedToBeDamaged(float DamageAmount, struct FVector HitLocation, struct FVector HitDirection, struct UPrimitiveComponent* PrimComp, struct FGameplayTagContainer MunitionTagContainer, struct AActor* Instigator, struct FVector Velocity); // Function SM_CastleRuins_2_Wall_Broken_B2.SM_CastleRuins_2_Wall_Broken_B2_C.OnFailedToBeDamaged // (Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_SM_CastleRuins_2_Wall_Broken_B2(int32_t EntryPoint); // Function SM_CastleRuins_2_Wall_Broken_B2.SM_CastleRuins_2_Wall_Broken_B2_C.ExecuteUbergraph_SM_CastleRuins_2_Wall_Broken_B2 // (Final|UbergraphFunction|HasDefaults) // @ game+0x38a7480
};

