// BlueprintGeneratedClass SM_CastleDun_Rail500_worn_A.SM_CastleDun_Rail500_worn_A_C
// Size: 0x290 (Inherited: 0x248)
struct ASM_CastleDun_Rail500_worn_A_C : AActor {
	struct UStaticMeshComponent* SM_CastleDun_Post_C1; // 0x248(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleDun_Post_A; // 0x250(0x08)
	struct UStaticMeshComponent* Cube; // 0x258(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleDun_Post_D1; // 0x260(0x08)
	struct UStaticMeshComponent* SM_CastleDun_LowerRail_B1; // 0x268(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_2SM_CastleDun_Post_B1; // 0x270(0x08)
	struct UStaticMeshComponent* SM_CastleDun_UpperRail_B1; // 0x278(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HISM_3SM_CastleDun_Post_E; // 0x280(0x08)
	struct USceneComponent* SharedRoot; // 0x288(0x08)
};

