// BlueprintGeneratedClass SM_CastleDun_Rail500_broken_A.SM_CastleDun_Rail500_broken_A_C
// Size: 0x2c8 (Inherited: 0x248)
struct ASM_CastleDun_Rail500_broken_A_C : AActor {
	struct UStaticMeshComponent* StaticMeshComponent014; // 0x248(0x08)
	struct UStaticMeshComponent* StaticMeshComponent013; // 0x250(0x08)
	struct UStaticMeshComponent* StaticMeshComponent012; // 0x258(0x08)
	struct UStaticMeshComponent* StaticMeshComponent011; // 0x260(0x08)
	struct UStaticMeshComponent* StaticMeshComponent010; // 0x268(0x08)
	struct UStaticMeshComponent* StaticMeshComponent09; // 0x270(0x08)
	struct UStaticMeshComponent* StaticMeshComponent08; // 0x278(0x08)
	struct UStaticMeshComponent* StaticMeshComponent07; // 0x280(0x08)
	struct UStaticMeshComponent* StaticMeshComponent06; // 0x288(0x08)
	struct UStaticMeshComponent* StaticMeshComponent05; // 0x290(0x08)
	struct UStaticMeshComponent* StaticMeshComponent04; // 0x298(0x08)
	struct UStaticMeshComponent* StaticMeshComponent03; // 0x2a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent02; // 0x2a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent01; // 0x2b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0; // 0x2b8(0x08)
	struct USceneComponent* SharedRoot; // 0x2c0(0x08)
};

