// UserDefinedStruct STR_Stir_Crazy.STR_Stir_Crazy
// Size: 0xf0 (Inherited: 0x00)
struct FSTR_Stir_Crazy {
	struct USkeletalMesh* Container_Mesh_61_D6C591F44D38F1D70B0162A213FCCD29; // 0x00(0x08)
	struct UStaticMesh* CauldronMeshOption_109_F64DCC294114B41DE25A30A5AC35FC8A; // 0x08(0x08)
	bool Has_Utensil?_97_6D0F764141372DC25D6E4AA668684B56; // 0x10(0x01)
	char pad_11[0x7]; // 0x11(0x07)
	struct USkeletalMesh* Utensil_Mesh_91_A28F7E424F1AC85C53589DB83855DD19; // 0x18(0x08)
	struct FVector Utensil_Target_Offset_28_0F92E81D4A79FB41A0E151B493A6CE02; // 0x20(0x0c)
	bool Utensil_Infintely_Stir?_123_51AD94984D21FCABB28911915D6A7103; // 0x2c(0x01)
	char pad_2D[0x3]; // 0x2d(0x03)
	struct UAnimInstance* Utensil_AnimBP_103_94529EAC463C0469B861EC9C8FAB94DA; // 0x30(0x08)
	struct ABP_Stir_Crazy_Contents_Master_C* Contents_BP_92_2C578E144EBF98929827AF89B4DD4653; // 0x38(0x08)
	struct FVector Contents_BP_Scale_93_5CCAFE6546939A77929FC196D43C00D2; // 0x40(0x0c)
	struct FVector Contents_BP_Offset_94_B6C76FF64D882D89B3D2FA8090269707; // 0x4c(0x0c)
	bool Has_Lid?_15_5A5D3FE44D5354DE1D47029A98FDAFD3; // 0x58(0x01)
	char pad_59[0x7]; // 0x59(0x07)
	struct USkeletalMesh* Lid_Mesh_18_40D6E97340C532E51A4888BE4C9A5BF9; // 0x60(0x08)
	struct UAnimInstance* Lid_AnimBP_52_AFD2910746E62B982B8954B9152A0327; // 0x68(0x08)
	float MinCookingTime_104_6AB05EB1498B77D8ED7CBB96E9EB6C77; // 0x70(0x04)
	float MaxCookingTime_105_09AA2F8E4905A9DC11E123938B2B8C74; // 0x74(0x04)
	bool Add_Ingredients?_70_FE80D7AC4D6E9197D67466BACCA64AA9; // 0x78(0x01)
	char pad_79[0x7]; // 0x79(0x07)
	struct TArray<struct FWorldFXNiagaraSystem> Ingredient_VFX_88_8D89CC0A47813834180DA79F574E1129; // 0x80(0x10)
	bool CanPourWithLadle?_118_DA8A193C4733225448BDE8B3A5DEBA32; // 0x90(0x01)
	char pad_91[0x7]; // 0x91(0x07)
	struct FWorldFXNiagaraSystem LadlePourVFX_121_D4AE4F6B43FC8275EE35E2B802224A70; // 0x98(0x58)
};

