// UserDefinedStruct STR_BanditCamp_Stations.STR_BanditCamp_Stations
// Size: 0x140 (Inherited: 0x00)
struct FSTR_BanditCamp_Stations {
	struct TSoftClassPtr<UObject> BP_StationPatrol1P_8_59BF82874167D96812D3DDAB914AFF86; // 0x00(0x28)
	struct TSoftClassPtr<UObject> BP_StationFireside_warm1p_9_BFF9129D47BF4E21D5A011BF53FC6B48; // 0x28(0x28)
	struct TSoftClassPtr<UObject> BP_StationGuard1P_15_497634A4427E418185A1BFA26E5D4D70; // 0x50(0x28)
	struct TSoftClassPtr<UObject> BP_StationBed_11_CBD51E254D4FE4173A6CFC99A7CC67FA; // 0x78(0x28)
	struct TSoftClassPtr<UObject> BP_FiresideBench2P_13_E61C6E214536C35EC8A612A0809FF291; // 0xa0(0x28)
	struct TSoftClassPtr<UObject> BP_StationStand2p_Bickering_19_AE9962014630D1E0930975A5D331AF13; // 0xc8(0x28)
	struct TSoftClassPtr<UObject> BP_Stand3PStation_22_1E635D8C40D6428C04E0FE96CF11F437; // 0xf0(0x28)
	struct TSoftClassPtr<UObject> BP_Stand2PStation_24_EF48B0DE4A41ADB5F19AC38B40047E37; // 0x118(0x28)
};

