// UserDefinedStruct STR_RavenclawArmorAnimation.STR_RavenclawArmorAnimation
// Size: 0x88 (Inherited: 0x00)
struct FSTR_RavenclawArmorAnimation {
	struct TArray<struct UAnimSequence*> Pose_15_285B0EBC46F3DE7C0C944CAD324D60D5; // 0x00(0x10)
	struct TArray<struct UAnimSequence*> Attention_16_02F882A7445FA3AE0435B69A33D91CBF; // 0x10(0x10)
	struct TArray<struct UAnimSequence*> Reaction_17_A191A03F46AB7445074E419D19DC1E30; // 0x20(0x10)
	struct TArray<struct UAnimSequence*> Idles_11_71FBDA7440637013FF24358D366D8710; // 0x30(0x10)
	struct TArray<struct UAnimSequence*> BlockPathStart_25_412515BD45DDE0D8A23E36ADD6EF3BB7; // 0x40(0x10)
	struct TArray<struct UAnimSequence*> BlockPathLoop_27_B9F16442495C3EAE4672A1BAAA918B39; // 0x50(0x10)
	struct TArray<struct UAnimSequence*> BlockPathEnd_29_D64753C146876B83C89FE28AC34BB650; // 0x60(0x10)
	struct FVector CollisionOffset_34_2194BE2E4B77CAA05062CABE5E5E1957; // 0x70(0x0c)
	struct FVector CollisionExtent_35_3FFDF020401123402FE141B69664924B; // 0x7c(0x0c)
};

