// UserDefinedStruct STR_Bandit_2M_Platform_Pieces.STR_Bandit_2M_Platform_Pieces
// Size: 0xa0 (Inherited: 0x00)
struct FSTR_Bandit_2M_Platform_Pieces {
	struct TArray<struct AActor*> Base_B_33_E174EEAF4B1ABA9A205F01B91502393B; // 0x00(0x10)
	struct TArray<struct AActor*> BaseCap_B_34_992E1A754CC8A9CC7C5795B0C9476045; // 0x10(0x10)
	struct TArray<struct AActor*> Wall_Climbable_Wood_B_35_3BC2F31A42DD947EBF8F61A072DDFC6F; // 0x20(0x10)
	struct TArray<struct AActor*> Wall_NonClimbable_Wood_B_36_0C23FD1F4BE640B2F72C018947B8CD5A; // 0x30(0x10)
	struct TArray<struct AActor*> Wall_NonClimbable_Cloth_B_37_7EF4DD7B4AD721E7D612318F67628C4C; // 0x40(0x10)
	struct TArray<struct AActor*> Base_A_42_FA1306014908AA17F1DC2FAA2C0933B9; // 0x50(0x10)
	struct TArray<struct AActor*> BaseCap_A_44_531BDB8B4F3C882E73663E843AE57648; // 0x60(0x10)
	struct TArray<struct AActor*> Wall_Climbable_Wood_A_46_AC8FC3494E29D3A4697FC29929626E71; // 0x70(0x10)
	struct TArray<struct AActor*> Wall_NonClimbable_Wood_A_48_096DFA7644DDBF81DD70E08AA74CCAFC; // 0x80(0x10)
	struct TArray<struct AActor*> Wall_NonClimbable_Cloth_A_52_266F8441462F5F1EF184419C16285FAE; // 0x90(0x10)
};

