// UserDefinedStruct STR_Bandit_4M_Platform_Pieces.STR_Bandit_4M_Platform_Pieces
// Size: 0xa0 (Inherited: 0x00)
struct FSTR_Bandit_4M_Platform_Pieces {
	struct TArray<struct AActor*> Base_B_31_E174EEAF4B1ABA9A205F01B91502393B; // 0x00(0x10)
	struct TArray<struct AActor*> BaseCap_B_32_992E1A754CC8A9CC7C5795B0C9476045; // 0x10(0x10)
	struct TArray<struct AActor*> Wall_Climbable_Wood_B_33_3BC2F31A42DD947EBF8F61A072DDFC6F; // 0x20(0x10)
	struct TArray<struct AActor*> Wall_NonClimbable_Wood_B_34_0C23FD1F4BE640B2F72C018947B8CD5A; // 0x30(0x10)
	struct TArray<struct AActor*> Wall_NonClimbable_Cloth_B_35_7EF4DD7B4AD721E7D612318F67628C4C; // 0x40(0x10)
	struct TArray<struct AActor*> Base_A_40_3E13836344F9BD27A4CDC38EF09F9D84; // 0x50(0x10)
	struct TArray<struct AActor*> BaseCap_A_42_EB14954D4A48CB30F8AAA2A07B020B07; // 0x60(0x10)
	struct TArray<struct AActor*> Wall_Climbable_Wood_A_44_BBE3589543FD1FCC090AF38964B225F9; // 0x70(0x10)
	struct TArray<struct AActor*> Wall_NonClimbable_Wood_A_46_7B36034A4447FD5A37C7BCAEBF4AC60E; // 0x80(0x10)
	struct TArray<struct AActor*> Wall_NonClimbable_Cloth_A_51_AF26A73C4C57794F984A5A9A87670C05; // 0x90(0x10)
};

