// UserDefinedStruct STR_CaveIn_AnimMeshElement.STR_CaveIn_AnimMeshElement
// Size: 0x55 (Inherited: 0x00)
struct FSTR_CaveIn_AnimMeshElement {
	bool PhysicsOnly_14_B6A547B541BAF4688E7D4BB07B6AA5F7; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct AActor* AnimActor_2_7BBF7F404F7B24EF712D219F42AB9C85; // 0x08(0x08)
	struct FTransform EndTransform_5_69648695444896C97FF9F8AED0241BEE; // 0x10(0x30)
	float ElementDelay_15_E1B74EB142A543D33C7DAAB7EC9C8F9D; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
	struct UCurveFloat* AnimCurve_11_4DA234D5444EC3FD93570F891C11ABF0; // 0x48(0x08)
	float PlayRate_18_14DFA21E4EB4500EF37189A038F88ADD; // 0x50(0x04)
	bool UseCameraShake_20_31965C294DDC70302C9A6598D85B3B75; // 0x54(0x01)
};

