// UserDefinedStruct STR_Torch_LF.STR_Torch_LF
// Size: 0x28 (Inherited: 0x00)
struct FSTR_Torch_LF {
	bool UseCustomTexture_20_E4C8FF6640CD9D1233F15188936F367B; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct UTexture2D* CusomTexture_21_92F5A8A34887AC90D6FC9692DB7FE271; // 0x08(0x08)
	bool UseCustomRotation_18_DE29E6D9412FFE0BBCEC1F96083E2E19; // 0x10(0x01)
	char pad_11[0x3]; // 0x11(0x03)
	struct FRotator CustomRotation_19_353015E2441EBE4CDBE6C186B3D192CF; // 0x14(0x0c)
	bool CastShadow_24_0E95C2374FF381011BD5089E490310E9; // 0x20(0x01)
	char pad_21[0x3]; // 0x21(0x03)
	float MInShadow_26_563F690E441D46B32A087C8FAB3C5F30; // 0x24(0x04)
};

