// UserDefinedStruct STR_SuperSmashObjectProfile.STR_SuperSmashObjectProfile
// Size: 0x60 (Inherited: 0x00)
struct FSTR_SuperSmashObjectProfile {
	struct UStaticMesh* Mesh_2_5C45587640C897B7B4E1188A69CEEF68; // 0x00(0x08)
	struct FVector MeshScale_5_C9EEBA67450A907E29328FBE43F4672B; // 0x08(0x0c)
	char pad_14[0x4]; // 0x14(0x04)
	struct UNiagaraSystem* StudentImpactVFX_8_17526A924FC5BBDEDC3D3D8DBC6A5761; // 0x18(0x08)
	struct UNiagaraSystem* FlatSurfaceImpactVFX_10_E1B57C5D480823A725E545981953DF40; // 0x20(0x08)
	struct UAkAudioEvent* AKAudioImpactSound_13_AEBB8C934B1A338D651BD48BF4BF4E3B; // 0x28(0x08)
	bool IsPotion?_16_7ADFF5F94E238B11C97E7282ECF2CFDE; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	struct FLinearColor LinearColour_19_6793CF1C44F874D97CBDD3B8FA1680B9; // 0x34(0x10)
	char pad_44[0x4]; // 0x44(0x04)
	struct UMaterialInterface* PotionMaterial_24_289C1E264C072B3E6E20C68200295F26; // 0x48(0x08)
	struct UMaterialInterface* StudentDecalMaterial_34_60C955004733D1C0A5AC058B3F4CD676; // 0x50(0x08)
	struct UMaterialInterface* FlatDecalMaterial_35_A6958FC144F001A7C9E466AA02608C23; // 0x58(0x08)
};

