// UserDefinedStruct STR_CustomWandStyleDefinition.STR_CustomWandStyleDefinition
// Size: 0x141 (Inherited: 0x00)
struct FSTR_CustomWandStyleDefinition {
	struct TSoftObjectPtr<USkeletalMesh> SoftMesh_27_8D8EB96E4FC105BB40ED66BD8E5109EE; // 0x00(0x28)
	bool BaseOption_50_78EFD28F46416C5C5C75559F9DA73FBF; // 0x28(0x01)
	char pad_29[0x7]; // 0x29(0x07)
	struct FString Subgroup_33_67BE5FB047644FAAD247BD84AD5BC3B0; // 0x30(0x10)
	struct FString HandleName_54_B3C7A39143E46DBD491A5F81976C913D; // 0x40(0x10)
	struct TSoftObjectPtr<UTexture> Tip_D_37_89F1EE8240019CE45E2417816FA0D99E; // 0x50(0x28)
	struct TSoftObjectPtr<UTexture> Tip_N_39_4E0988D64374C638DED8C39D3FA4C919; // 0x78(0x28)
	struct TSoftObjectPtr<UTexture> Tip_MRO_44_EAB7DF7D46521D2879AAA4B05DC3F10C; // 0xa0(0x28)
	struct TSoftObjectPtr<UTexture> Handle_D_45_16F7A516446F36DE2C85B19CA47408F8; // 0xc8(0x28)
	struct TSoftObjectPtr<UTexture> Handle_N_46_0A7775004A519C7DC9D81BB1E65F92D3; // 0xf0(0x28)
	struct TSoftObjectPtr<UTexture> Handle_MRO_48_A443128241B4C0D32EC07DAEEC63765C; // 0x118(0x28)
	bool Show_24_AAA654FB452A518DFD4FDC944FCFC7DD; // 0x140(0x01)
};

