// UserDefinedStruct STR_TriggerVolumes_Particles.STR_TriggerVolumes_Particles
// Size: 0x25 (Inherited: 0x00)
struct FSTR_TriggerVolumes_Particles {
	struct UParticleSystem* ParticleSystem_3_C16665F74028DE3281499F915AAC0CF6; // 0x00(0x08)
	bool UseSpawnrate_21_770BB4544E84009300708BB17CD3443A; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
	float Spawnrate_7_5646BAA449F47A4C741009A7E63960C4; // 0x0c(0x04)
	bool UseParticleColor_23_5732CA26498E9E596596C9A77A49D668; // 0x10(0x01)
	char pad_11[0x3]; // 0x11(0x03)
	struct FLinearColor ParticleColor_22_9E086A924D96E9B027475BB6B2D03549; // 0x14(0x10)
	bool VelocityBasedOnPlayerMovement_28_DDDAFE7141DCBF4976FDBD9D230038E2; // 0x24(0x01)
};

