// UserDefinedStruct STR_SpiderEggsacParams.STR_SpiderEggsacParams
// Size: 0x2c (Inherited: 0x00)
struct FSTR_SpiderEggsacParams {
	enum class E_BabySpiderType SpiderType_15_20B5C604451B271CF661E5BE1F4FE3ED; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float ActivationRadius_5_31F2AAFB40CE3BED93FE1795043B0810; // 0x04(0x04)
	float ProximityRadius_7_FE0689DB4C43FF53E7873D914890B4B0; // 0x08(0x04)
	struct FVector2D SpawnRange_23_FC5837A7491E26AB26E9D991D5261BBE; // 0x0c(0x08)
	float BurstTime_32_D541ED17455BCDB0490CEBBD57248A19; // 0x14(0x04)
	float ForceBurstTime_35_860E186B4AAE42D62435E99D10BACF23; // 0x18(0x04)
	float ExplodeDamage_21_AE5BE192453813AA447F73B5FBB9EA16; // 0x1c(0x04)
	float ExplodeRadius_26_FF43500E4E299620245CDB9CF19863E9; // 0x20(0x04)
	float NearbyRadius_28_EDA8264247F26F9771762CB209D65BB3; // 0x24(0x04)
	float NearbyAlertTime_30_E7A89D5C4E6CFDAB74C31EB6AF48DE86; // 0x28(0x04)
};

