// BlueprintGeneratedClass SUB_Biome_COAST_VFX_P.SUB_Biome_COAST_VFX_P_C
// Size: 0x2a0 (Inherited: 0x250)
struct ASUB_Biome_COAST_VFX_P_C : ALevelScriptActor {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x250(0x08)
	struct ABP_SlaveToLoop_Seagull_C* BP_SlaveToLoop_Seagull3_ExecuteUbergraph_SUB_Biome_COAST_VFX_P_RefProperty; // 0x258(0x08)
	struct ABP_SlaveToLoop_Seagull_C* BP_SlaveToLoop_Seagull4_ExecuteUbergraph_SUB_Biome_COAST_VFX_P_RefProperty; // 0x260(0x08)
	struct ABP_SlaveToLoop_Seagull_C* BP_SlaveToLoop_Seagull5_ExecuteUbergraph_SUB_Biome_COAST_VFX_P_RefProperty; // 0x268(0x08)
	struct ABP_SlaveToLoop_Seagull_C* BP_SlaveToLoop_Seagull2_ExecuteUbergraph_SUB_Biome_COAST_VFX_P_RefProperty; // 0x270(0x08)
	struct ABP_SlaveToLoop_Seagull_C* BP_SlaveToLoop_Seagull_2_ExecuteUbergraph_SUB_Biome_COAST_VFX_P_RefProperty; // 0x278(0x08)
	struct ABP_SlaveToLoop_Seagull_C* BP_SlaveToLoop_Seagull6_ExecuteUbergraph_SUB_Biome_COAST_VFX_P_RefProperty; // 0x280(0x08)
	struct ABP_SlaveToLoop_Seagull_C* BP_SlaveToLoop_Seagull7_ExecuteUbergraph_SUB_Biome_COAST_VFX_P_RefProperty; // 0x288(0x08)
	struct ABP_SlaveToLoop_Seagull_C* BP_SlaveToLoop_Seagull8_ExecuteUbergraph_SUB_Biome_COAST_VFX_P_RefProperty; // 0x290(0x08)
	struct ABP_SlaveToLoop_Seagull_C* BP_SlaveToLoop_Seagull9_ExecuteUbergraph_SUB_Biome_COAST_VFX_P_RefProperty; // 0x298(0x08)

	void ReceiveBeginPlay(); // Function SUB_Biome_COAST_VFX_P.SUB_Biome_COAST_VFX_P_C.ReceiveBeginPlay // (Event|Protected|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_SUB_Biome_COAST_VFX_P(int32_t EntryPoint); // Function SUB_Biome_COAST_VFX_P.SUB_Biome_COAST_VFX_P_C.ExecuteUbergraph_SUB_Biome_COAST_VFX_P // (Final|UbergraphFunction|HasDefaults) // @ game+0x38a7480
};

