// BlueprintGeneratedClass SUB_Study_VFX_P.SUB_Study_VFX_P_C
// Size: 0x298 (Inherited: 0x250)
struct ASUB_Study_VFX_P_C : ALevelScriptActor {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x250(0x08)
	struct ASlaveToSplineActor* SlaveToSplineActor_1_ExecuteUbergraph_SUB_Study_VFX_P_RefProperty; // 0x258(0x08)
	struct ASlaveToSplineActor* SlaveToSplineActor_2_ExecuteUbergraph_SUB_Study_VFX_P_RefProperty; // 0x260(0x08)
	struct ASlaveToSplineActor* SlaveToSplineActor_4_ExecuteUbergraph_SUB_Study_VFX_P_RefProperty; // 0x268(0x08)
	struct ASlaveToSplineActor* SlaveToSplineActor_6_ExecuteUbergraph_SUB_Study_VFX_P_RefProperty; // 0x270(0x08)
	struct ASlaveToSplineActor* SlaveToSplineActor_7_ExecuteUbergraph_SUB_Study_VFX_P_RefProperty; // 0x278(0x08)
	struct ASlaveToSplineActor* SlaveToSplineActor_12_ExecuteUbergraph_SUB_Study_VFX_P_RefProperty; // 0x280(0x08)
	struct ASlaveToSplineActor* SlaveToSplineActor_15_ExecuteUbergraph_SUB_Study_VFX_P_RefProperty; // 0x288(0x08)
	struct ASlaveToSplineActor* SlaveToSplineActor_17_ExecuteUbergraph_SUB_Study_VFX_P_RefProperty; // 0x290(0x08)

	void ReceiveBeginPlay(); // Function SUB_Study_VFX_P.SUB_Study_VFX_P_C.ReceiveBeginPlay // (Event|Protected|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_SUB_Study_VFX_P(int32_t EntryPoint); // Function SUB_Study_VFX_P.SUB_Study_VFX_P_C.ExecuteUbergraph_SUB_Study_VFX_P // (Final|UbergraphFunction|HasDefaults) // @ game+0x38a7480
};

