// BlueprintGeneratedClass SUB_DADA_3_Classroom_INT_3111622117.SUB_DADA_3_Classroom_INT_C
// Size: 0x298 (Inherited: 0x250)
struct ASUB_DADA_3_Classroom_INT_C : ALevelScriptActor {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x250(0x08)
	struct TArray<struct AActor*> Desks; // 0x258(0x10)
	struct ABP_Class_CutNav_C* BP_Class_CutNav_DesksOrg_ExecuteUbergraph_SUB_DADA_3_Classroom_INT_RefProperty; // 0x268(0x08)
	struct ABP_Class_CutNav_C* BP_Class_CutNav_DesksOrg2_ExecuteUbergraph_SUB_DADA_3_Classroom_INT_RefProperty; // 0x270(0x08)
	struct ABP_Class_CutNav_C* BP_Class_CutNav_DesksOrg3_ExecuteUbergraph_SUB_DADA_3_Classroom_INT_RefProperty; // 0x278(0x08)
	struct ABP_Class_CutNav_C* BP_Class_CutNav_DesksOrg4_ExecuteUbergraph_SUB_DADA_3_Classroom_INT_RefProperty; // 0x280(0x08)
	struct ABP_Class_CutNav_C* BP_Class_CutNav_DesksOrg5_ExecuteUbergraph_SUB_DADA_3_Classroom_INT_RefProperty; // 0x288(0x08)
	struct ABP_Class_CutNav_C* BP_Class_CutNav_DesksOrg6_ExecuteUbergraph_SUB_DADA_3_Classroom_INT_RefProperty; // 0x290(0x08)

	void ReceiveBeginPlay(); // Function SUB_DADA_3_Classroom_INT_3111622117.SUB_DADA_3_Classroom_INT_C.ReceiveBeginPlay // (Event|Protected|BlueprintEvent) // @ game+0x38a7480
	void ToggleDADAClassroomDesks(struct UObject* Caller, int32_t int); // Function SUB_DADA_3_Classroom_INT_3111622117.SUB_DADA_3_Classroom_INT_C.ToggleDADAClassroomDesks // (BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_SUB_DADA_3_Classroom_INT(int32_t EntryPoint); // Function SUB_DADA_3_Classroom_INT_3111622117.SUB_DADA_3_Classroom_INT_C.ExecuteUbergraph_SUB_DADA_3_Classroom_INT // (Final|UbergraphFunction|HasDefaults) // @ game+0x38a7480
};

