// WidgetBlueprintGeneratedClass UI_BP_FieldGuide.UI_BP_FieldGuide_C
// Size: 0x600 (Inherited: 0x378)
struct UUI_BP_FieldGuide_C : UFieldGuideMenu {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x378(0x08)
	struct UWidgetAnimation* fadeScrim; // 0x380(0x08)
	struct UUI_BP_AsyncLoadWrapper_C* Async_FG_Actions; // 0x388(0x08)
	struct UUI_BP_AsyncLoadWrapper_C* Async_FG_Collections; // 0x390(0x08)
	struct UUI_BP_AsyncLoadWrapper_C* Async_FG_Gear; // 0x398(0x08)
	struct UUI_BP_AsyncLoadWrapper_C* Async_FG_Inventory; // 0x3a0(0x08)
	struct UUI_BP_AsyncLoadWrapper_C* Async_FG_Map; // 0x3a8(0x08)
	struct UUI_BP_AsyncLoadWrapper_C* Async_FG_OwlMail; // 0x3b0(0x08)
	struct UUI_BP_AsyncLoadWrapper_C* Async_FG_Quests; // 0x3b8(0x08)
	struct UUI_BP_AsyncLoadWrapper_C* Async_FG_Settings; // 0x3c0(0x08)
	struct UUI_BP_AsyncLoadWrapper_C* Async_FG_Talents; // 0x3c8(0x08)
	struct UImage* backgroundDim; // 0x3d0(0x08)
	struct UImage* backgroundHide; // 0x3d8(0x08)
	struct UUI_BP_NavBarButton_C* btn_Actions; // 0x3e0(0x08)
	struct UUI_BP_NavBarButton_C* btn_Character; // 0x3e8(0x08)
	struct UUI_BP_NavBarButton_C* btn_Collections; // 0x3f0(0x08)
	struct UUI_BP_NavBarButton_C* btn_Inventory; // 0x3f8(0x08)
	struct UUI_BP_NavBarButton_C* btn_Mail; // 0x400(0x08)
	struct UUI_BP_NavBarButton_C* btn_Map; // 0x408(0x08)
	struct UUI_BP_NavBarButton_C* btn_Missions; // 0x410(0x08)
	struct UUI_BP_NavBarButton_C* btn_Settings; // 0x418(0x08)
	struct UUI_BP_NavBarButton_C* btn_Talents; // 0x420(0x08)
	struct UUI_BP_FG_Index_C* FG_IndexPage; // 0x428(0x08)
	struct UButton* HiddenButtonForHoverEvents; // 0x430(0x08)
	struct UUI_BP_Legend_Horizontal_Screen_C* Legend; // 0x438(0x08)
	struct UAsyncWidgetSwitcher* MenuWidgetSwitcher; // 0x440(0x08)
	struct UCanvasPanel* navBar; // 0x448(0x08)
	struct UHorizontalBox* NavBarContainer; // 0x450(0x08)
	struct UButton* NavBarLeftButton; // 0x458(0x08)
	struct UButton* NavBarRightButton; // 0x460(0x08)
	bool HiddenButtonHovered; // 0x468(0x01)
	char pad_469[0x7]; // 0x469(0x07)
	struct TMap<struct UUI_BP_NavBarButton_C*, struct UUI_BP_AsyncLoadWrapper_C*> NavBarToMenuMap; // 0x470(0x50)
	struct UUI_BP_NavBarButton_C* SelectedNavBarButton; // 0x4c0(0x08)
	float DisplayPageDelay; // 0x4c8(0x04)
	char pad_4CC[0x4]; // 0x4cc(0x04)
	struct TMap<struct FString, struct UUI_BP_AsyncLoadWrapper_C*> PageNameToMenuMap; // 0x4d0(0x50)
	bool LockedToPage; // 0x520(0x01)
	char pad_521[0x7]; // 0x521(0x07)
	struct TArray<struct FString> DestPagePath; // 0x528(0x10)
	struct TMap<struct UUI_BP_AsyncLoadWrapper_C*, struct FString> MenuToPageNameMap; // 0x538(0x50)
	struct UUI_BP_AsyncLoadWrapper_C* NewPage; // 0x588(0x08)
	bool isScrimShowing; // 0x590(0x01)
	char pad_591[0x7]; // 0x591(0x07)
	struct TMap<struct UUI_BP_AsyncLoadWrapper_C*, enum class EPauseMenuPage> MenuToEnumMap; // 0x598(0x50)
	bool InMenuTransition; // 0x5e8(0x01)
	char pad_5E9[0x3]; // 0x5e9(0x03)
	int32_t CurrentTabIndex; // 0x5ec(0x04)
	struct TArray<enum class ENotificationCategory> NotificationCategories; // 0x5f0(0x10)

	void TerminateLingeringTutorials(); // Function UI_BP_FieldGuide.UI_BP_FieldGuide_C.TerminateLingeringTutorials // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void DoesTutorialPreventExitingPauseMenu(bool& Prevented); // Function UI_BP_FieldGuide.UI_BP_FieldGuide_C.DoesTutorialPreventExitingPauseMenu // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void DoesTutorialPreventBackingOut(bool& Prevented); // Function UI_BP_FieldGuide.UI_BP_FieldGuide_C.DoesTutorialPreventBackingOut // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	struct TArray<struct FString> GatherMenuReaderStrings(int32_t DepthLevel); // Function UI_BP_FieldGuide.UI_BP_FieldGuide_C.GatherMenuReaderStrings // (Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x38a7480
