// WidgetBlueprintGeneratedClass UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C
// Size: 0x4f1 (Inherited: 0x378)
struct UUI_BP_CharCreator_Finalize_C : UAvatarCreatorPage {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x378(0x08)
	struct UWidgetAnimation* NoNameAllert; // 0x380(0x08)
	struct UUI_BP_GenderTextButton_C* DifficultyButton_Easy; // 0x388(0x08)
	struct UUI_BP_GenderTextButton_C* DifficultyButton_Hard; // 0x390(0x08)
	struct UUI_BP_GenderTextButton_C* DifficultyButton_Normal; // 0x398(0x08)
	struct UUI_BP_GenderTextButton_C* DifficultyButton_Story; // 0x3a0(0x08)
	struct UPhoenixTextBlock* DifficultyDescText; // 0x3a8(0x08)
	struct UPhoenixTextBlock* DormChoiceDescText; // 0x3b0(0x08)
	struct UPhoenixTextBlock* DormText; // 0x3b8(0x08)
	struct UPhoenixTextBlock* ErrorMessage; // 0x3c0(0x08)
	struct UUI_BP_MenuFinalized_C* FinalizedButton-NOTUSED; // 0x3c8(0x08)
	struct UUI_BP_InputButton_C* FirstName; // 0x3d0(0x08)
	struct UUI_BP_InputButton_C* lastName; // 0x3d8(0x08)
	struct UPhoenixTextBlock* NameCharacterText; // 0x3e0(0x08)
	struct UPhoenixTextBlock* PitchText; // 0x3e8(0x08)
	struct UPhoenixTextBlock* SelectDifficultyText; // 0x3f0(0x08)
	struct UPhoenixTextBlock* ToneText; // 0x3f8(0x08)
	struct UUI_BP_GenderTextButton_C* VoiceOneButton; // 0x400(0x08)
	struct UUI_BP_SettingsSliderButton_Snapping_C* VoicePitchSlider; // 0x408(0x08)
	struct UPhoenixTextBlock* VoiceText; // 0x410(0x08)
	struct UUI_BP_GenderTextButton_C* VoiceTwoButton; // 0x418(0x08)
	struct UUI_BP_GenderTextButton_C* WitchButton; // 0x420(0x08)
	struct UUI_BP_GenderTextButton_C* WizardButton; // 0x428(0x08)
	struct FString PageTitle; // 0x430(0x10)
	struct FMulticastInlineDelegate NotifyTabSelected; // 0x440(0x10)
	struct FText NoText; // 0x450(0x18)
	struct FMulticastInlineDelegate CreateCharacterSelected; // 0x468(0x10)
	struct UUserWidget* ParentWidget; // 0x478(0x08)
	int32_t TextFieldCharLimit; // 0x480(0x04)
	bool showCustomizeButton; // 0x484(0x01)
	char pad_485[0x3]; // 0x485(0x03)
	struct FString FirstNameText; // 0x488(0x10)
	struct FString LastNameText; // 0x498(0x10)
	struct UUI_BP_GenderTextButton_C* selectedBirthTypeButton; // 0x4a8(0x08)
	struct UUI_BP_GenderTextButton_C* SelectedDifficultyButton; // 0x4b0(0x08)
	enum class EDifficulty Difficulty; // 0x4b8(0x01)
	char pad_4B9[0x7]; // 0x4b9(0x07)
	struct FString SelectedDifficultyDesc; // 0x4c0(0x10)
	struct TArray<struct FString> WizardWords; // 0x4d0(0x10)
	struct FMulticastInlineDelegate ActivateFinalizeButton; // 0x4e0(0x10)
	bool isPlayerNameValid; // 0x4f0(0x01)

	void I_GetPageTitle(struct FString& PageTitle); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.I_GetPageTitle // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void I_GetPageLegend(struct FString& PageLegend); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.I_GetPageLegend // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void GetAsyncWrapperRenderSize(struct FVector2D& RenderSize); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.GetAsyncWrapperRenderSize // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void DoubleEnsureNameIsInSyncWithCode(); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.DoubleEnsureNameIsInSyncWithCode // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void ShowNoNameAlert(); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.ShowNoNameAlert // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void ShowErrorMessage(bool ShowMessage, struct FString Error); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.ShowErrorMessage // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void SetupWizardWords(); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.SetupWizardWords // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	struct TArray<struct FString> GatherMenuReaderStrings(int32_t DepthLevel); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.GatherMenuReaderStrings // (Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x38a7480
	void Play Dialogue Sample(); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.Play Dialogue Sample // (Private|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void ToggleDifficultySelection(struct UUI_BP_GenderTextButton_C* Button); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.ToggleDifficultySelection // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void ToggleVoiceSelection(int32_t VoiceSelectionIndex); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.ToggleVoiceSelection // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void ValidatePlayerName(bool CheckProfanity, struct FString FirstName, struct FString lastName, bool& IsValidName); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.ValidatePlayerName // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void SetButtonText(); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.SetButtonText // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void I_UpdateHighlights(struct TMap<struct FString, struct FString> CurrentPresets); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.I_UpdateHighlights // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void I_TabActivated(); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.I_TabActivated // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void I_ScrollIntoView(); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.I_ScrollIntoView // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void InEditorPostConstruct(); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.InEditorPostConstruct // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void Initialize(); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.Initialize // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void SetParent(struct UUserWidget* Parent); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.SetParent // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void I_UpdateIcons(enum class EGenderEnum Gender); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.I_UpdateIcons // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void I_FinalizeFailed(struct FString ErrorMsg); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.I_FinalizeFailed // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void Construct(); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x38a7480
	void BndEvt__firstName_K2Node_ComponentBoundEvent_3_OnTextChanged__DelegateSignature(struct FString newText); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.BndEvt__firstName_K2Node_ComponentBoundEvent_3_OnTextChanged__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__lastName_K2Node_ComponentBoundEvent_4_OnTextChanged__DelegateSignature(struct FString newText); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.BndEvt__lastName_K2Node_ComponentBoundEvent_4_OnTextChanged__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_CharCreator_Finalize_VoiceOneButton_K2Node_ComponentBoundEvent_5_MenuTextButtonClicked__DelegateSignature(struct UUI_BP_GenderTextButton_C* Button); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.BndEvt__UI_BP_CharCreator_Finalize_VoiceOneButton_K2Node_ComponentBoundEvent_5_MenuTextButtonClicked__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_CharCreator_Finalize_VoiceTwoButton_K2Node_ComponentBoundEvent_6_MenuTextButtonClicked__DelegateSignature(struct UUI_BP_GenderTextButton_C* Button); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.BndEvt__UI_BP_CharCreator_Finalize_VoiceTwoButton_K2Node_ComponentBoundEvent_6_MenuTextButtonClicked__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_CharCreator_Finalize_WitchButton_K2Node_ComponentBoundEvent_10_MenuTextButtonClicked__DelegateSignature(struct UUI_BP_GenderTextButton_C* Button); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.BndEvt__UI_BP_CharCreator_Finalize_WitchButton_K2Node_ComponentBoundEvent_10_MenuTextButtonClicked__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_CharCreator_Finalize_WizardButton_K2Node_ComponentBoundEvent_11_MenuTextButtonClicked__DelegateSignature(struct UUI_BP_GenderTextButton_C* Button); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.BndEvt__UI_BP_CharCreator_Finalize_WizardButton_K2Node_ComponentBoundEvent_11_MenuTextButtonClicked__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_CharCreator_Finalize_DifficultyButton_Story_K2Node_ComponentBoundEvent_0_MenuTextButtonClicked__DelegateSignature(struct UUI_BP_GenderTextButton_C* Button); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.BndEvt__UI_BP_CharCreator_Finalize_DifficultyButton_Story_K2Node_ComponentBoundEvent_0_MenuTextButtonClicked__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_CharCreator_Finalize_DifficultyButton_Easy_K2Node_ComponentBoundEvent_1_MenuTextButtonClicked__DelegateSignature(struct UUI_BP_GenderTextButton_C* Button); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.BndEvt__UI_BP_CharCreator_Finalize_DifficultyButton_Easy_K2Node_ComponentBoundEvent_1_MenuTextButtonClicked__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_CharCreator_Finalize_DifficultyButton_Normal_K2Node_ComponentBoundEvent_2_MenuTextButtonClicked__DelegateSignature(struct UUI_BP_GenderTextButton_C* Button); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.BndEvt__UI_BP_CharCreator_Finalize_DifficultyButton_Normal_K2Node_ComponentBoundEvent_2_MenuTextButtonClicked__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_CharCreator_Finalize_DifficultyButton_Hard_K2Node_ComponentBoundEvent_3_MenuTextButtonClicked__DelegateSignature(struct UUI_BP_GenderTextButton_C* Button); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.BndEvt__UI_BP_CharCreator_Finalize_DifficultyButton_Hard_K2Node_ComponentBoundEvent_3_MenuTextButtonClicked__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_CharCreator_Finalize_DifficultyButton_Easy_K2Node_ComponentBoundEvent_14_MenuTextButtonHovered__DelegateSignature(struct UUI_BP_GenderTextButton_C* Button); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.BndEvt__UI_BP_CharCreator_Finalize_DifficultyButton_Easy_K2Node_ComponentBoundEvent_14_MenuTextButtonHovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_CharCreator_Finalize_DifficultyButton_Normal_K2Node_ComponentBoundEvent_15_MenuTextButtonHovered__DelegateSignature(struct UUI_BP_GenderTextButton_C* Button); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.BndEvt__UI_BP_CharCreator_Finalize_DifficultyButton_Normal_K2Node_ComponentBoundEvent_15_MenuTextButtonHovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_CharCreator_Finalize_DifficultyButton_Story_K2Node_ComponentBoundEvent_16_MenuTextButtonHovered__DelegateSignature(struct UUI_BP_GenderTextButton_C* Button); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.BndEvt__UI_BP_CharCreator_Finalize_DifficultyButton_Story_K2Node_ComponentBoundEvent_16_MenuTextButtonHovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_CharCreator_Finalize_DifficultyButton_Hard_K2Node_ComponentBoundEvent_17_MenuTextButtonHovered__DelegateSignature(struct UUI_BP_GenderTextButton_C* Button); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.BndEvt__UI_BP_CharCreator_Finalize_DifficultyButton_Hard_K2Node_ComponentBoundEvent_17_MenuTextButtonHovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_CharCreator_Finalize_DifficultyButton_Story_K2Node_ComponentBoundEvent_18_MenuTextButtonUnhovered__DelegateSignature(struct UUI_BP_GenderTextButton_C* Button); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.BndEvt__UI_BP_CharCreator_Finalize_DifficultyButton_Story_K2Node_ComponentBoundEvent_18_MenuTextButtonUnhovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_CharCreator_Finalize_DifficultyButton_Easy_K2Node_ComponentBoundEvent_19_MenuTextButtonUnhovered__DelegateSignature(struct UUI_BP_GenderTextButton_C* Button); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.BndEvt__UI_BP_CharCreator_Finalize_DifficultyButton_Easy_K2Node_ComponentBoundEvent_19_MenuTextButtonUnhovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_CharCreator_Finalize_DifficultyButton_Normal_K2Node_ComponentBoundEvent_20_MenuTextButtonUnhovered__DelegateSignature(struct UUI_BP_GenderTextButton_C* Button); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.BndEvt__UI_BP_CharCreator_Finalize_DifficultyButton_Normal_K2Node_ComponentBoundEvent_20_MenuTextButtonUnhovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_CharCreator_Finalize_DifficultyButton_Hard_K2Node_ComponentBoundEvent_21_MenuTextButtonUnhovered__DelegateSignature(struct UUI_BP_GenderTextButton_C* Button); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.BndEvt__UI_BP_CharCreator_Finalize_DifficultyButton_Hard_K2Node_ComponentBoundEvent_21_MenuTextButtonUnhovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_CharCreator_Finalize_VoiceOneButton_K2Node_ComponentBoundEvent_0_MenuTextButtonHovered__DelegateSignature(struct UUI_BP_GenderTextButton_C* Button); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.BndEvt__UI_BP_CharCreator_Finalize_VoiceOneButton_K2Node_ComponentBoundEvent_0_MenuTextButtonHovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_CharCreator_Finalize_VoiceTwoButton_K2Node_ComponentBoundEvent_1_MenuTextButtonHovered__DelegateSignature(struct UUI_BP_GenderTextButton_C* Button); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.BndEvt__UI_BP_CharCreator_Finalize_VoiceTwoButton_K2Node_ComponentBoundEvent_1_MenuTextButtonHovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_CharCreator_Finalize_WitchButton_K2Node_ComponentBoundEvent_24_MenuTextButtonHovered__DelegateSignature(struct UUI_BP_GenderTextButton_C* Button); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.BndEvt__UI_BP_CharCreator_Finalize_WitchButton_K2Node_ComponentBoundEvent_24_MenuTextButtonHovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_CharCreator_Finalize_WizardButton_K2Node_ComponentBoundEvent_25_MenuTextButtonHovered__DelegateSignature(struct UUI_BP_GenderTextButton_C* Button); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.BndEvt__UI_BP_CharCreator_Finalize_WizardButton_K2Node_ComponentBoundEvent_25_MenuTextButtonHovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_CharCreator_Finalize_VoiceOneButton_K2Node_ComponentBoundEvent_7_MenuTextButtonUnhovered__DelegateSignature(struct UUI_BP_GenderTextButton_C* Button); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.BndEvt__UI_BP_CharCreator_Finalize_VoiceOneButton_K2Node_ComponentBoundEvent_7_MenuTextButtonUnhovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_CharCreator_Finalize_VoiceTwoButton_K2Node_ComponentBoundEvent_8_MenuTextButtonUnhovered__DelegateSignature(struct UUI_BP_GenderTextButton_C* Button); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.BndEvt__UI_BP_CharCreator_Finalize_VoiceTwoButton_K2Node_ComponentBoundEvent_8_MenuTextButtonUnhovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_CharCreator_Finalize_WitchButton_K2Node_ComponentBoundEvent_9_MenuTextButtonUnhovered__DelegateSignature(struct UUI_BP_GenderTextButton_C* Button); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.BndEvt__UI_BP_CharCreator_Finalize_WitchButton_K2Node_ComponentBoundEvent_9_MenuTextButtonUnhovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_CharCreator_Finalize_WizardButton_K2Node_ComponentBoundEvent_27_MenuTextButtonUnhovered__DelegateSignature(struct UUI_BP_GenderTextButton_C* Button); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.BndEvt__UI_BP_CharCreator_Finalize_WizardButton_K2Node_ComponentBoundEvent_27_MenuTextButtonUnhovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void PreConstruct(bool IsDesignTime); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_CharCreator_Finalize_VoicePitchSlider_K2Node_ComponentBoundEvent_30_SettingsSliderFinished__DelegateSignature(struct UUI_BP_SettingsSliderButton_Snapping_C* SliderButton, float EndValue); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.BndEvt__UI_BP_CharCreator_Finalize_VoicePitchSlider_K2Node_ComponentBoundEvent_30_SettingsSliderFinished__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_CharCreator_Finalize_VoicePitchSlider_K2Node_ComponentBoundEvent_29_SettingsSliderHovered__DelegateSignature(struct UUI_BP_SettingsSliderButton_Snapping_C* SliderButton); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.BndEvt__UI_BP_CharCreator_Finalize_VoicePitchSlider_K2Node_ComponentBoundEvent_29_SettingsSliderHovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_CharCreator_Finalize_VoicePitchSlider_K2Node_ComponentBoundEvent_31_SettingsSliderUnhovered__DelegateSignature(struct UUI_BP_SettingsSliderButton_Snapping_C* SliderButton); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.BndEvt__UI_BP_CharCreator_Finalize_VoicePitchSlider_K2Node_ComponentBoundEvent_31_SettingsSliderUnhovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_CharCreator_Finalize_firstName_K2Node_ComponentBoundEvent_32_OnInputHovered__DelegateSignature(struct UUI_BP_InputButton_C* Button); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.BndEvt__UI_BP_CharCreator_Finalize_firstName_K2Node_ComponentBoundEvent_32_OnInputHovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_CharCreator_Finalize_firstName_K2Node_ComponentBoundEvent_33_OnInputUnhovered__DelegateSignature(struct UUI_BP_InputButton_C* Button); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.BndEvt__UI_BP_CharCreator_Finalize_firstName_K2Node_ComponentBoundEvent_33_OnInputUnhovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_CharCreator_Finalize_lastName_K2Node_ComponentBoundEvent_34_OnInputHovered__DelegateSignature(struct UUI_BP_InputButton_C* Button); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.BndEvt__UI_BP_CharCreator_Finalize_lastName_K2Node_ComponentBoundEvent_34_OnInputHovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_CharCreator_Finalize_lastName_K2Node_ComponentBoundEvent_35_OnInputUnhovered__DelegateSignature(struct UUI_BP_InputButton_C* Button); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.BndEvt__UI_BP_CharCreator_Finalize_lastName_K2Node_ComponentBoundEvent_35_OnInputUnhovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void WizardWordsLoaded(struct UObject* Caller); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.WizardWordsLoaded // (BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_CharCreator_Finalize_VoicePitchSlider_K2Node_ComponentBoundEvent_22_SettingsSliderChanged__DelegateSignature(struct UUI_BP_SettingsSliderButton_Snapping_C* SliderButton, float NewValue); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.BndEvt__UI_BP_CharCreator_Finalize_VoicePitchSlider_K2Node_ComponentBoundEvent_22_SettingsSliderChanged__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_UI_BP_CharCreator_Finalize(int32_t EntryPoint); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.ExecuteUbergraph_UI_BP_CharCreator_Finalize // (Final|UbergraphFunction|HasDefaults) // @ game+0x38a7480
	void ActivateFinalizeButton__DelegateSignature(bool Activate); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.ActivateFinalizeButton__DelegateSignature // (Public|Delegate|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void CreateCharacterSelected__DelegateSignature(bool HasBeenNamed); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.CreateCharacterSelected__DelegateSignature // (Public|Delegate|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void NotifyTabSelected__DelegateSignature(int32_t Tab); // Function UI_BP_CharCreator_Finalize.UI_BP_CharCreator_Finalize_C.NotifyTabSelected__DelegateSignature // (Public|Delegate|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
};

