// WidgetBlueprintGeneratedClass UI_BP_Settings_Audio.UI_BP_Settings_Audio_C
// Size: 0x49a (Inherited: 0x3f0)
struct UUI_BP_Settings_Audio_C : USettingsTabWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x3f0(0x08)
	struct UWidgetAnimation* showDetails; // 0x3f8(0x08)
	struct UUI_BP_SettingsSliderButton_C* btn_DialogVolume; // 0x400(0x08)
	struct UUI_BP_SettingsDropDownButton_C* btn_MasteringSuite; // 0x408(0x08)
	struct UUI_BP_SettingsCheckboxButton_C* btn_mono; // 0x410(0x08)
	struct UUI_BP_SettingsSliderButton_C* btn_MusicVolume; // 0x418(0x08)
	struct UUI_BP_SettingsCheckboxButton_C* btn_mute; // 0x420(0x08)
	struct UUI_BP_SettingsSliderButton_C* btn_SoundEffectsVolume; // 0x428(0x08)
	struct UUI_BP_SettingsCheckboxButton_C* btn_subtitles; // 0x430(0x08)
	struct UUI_BP_SettingsSliderButton_C* btn_VoicePitch; // 0x438(0x08)
	struct UUI_BP_SettingsDetails_C* detailsPanel; // 0x440(0x08)
	struct TArray<float> DynamicRanges; // 0x448(0x10)
	bool isButtonHovered; // 0x458(0x01)
	bool isDetailsShowing; // 0x459(0x01)
	char pad_45A[0x2]; // 0x45a(0x02)
	float CurrentHoverTime; // 0x45c(0x04)
	float RequiredHoverTime; // 0x460(0x04)
	char pad_464[0x4]; // 0x464(0x04)
	struct FString tooltipTitle; // 0x468(0x10)
	struct FString TooltipDescription; // 0x478(0x10)
	struct TArray<struct FString> MasteringSuiteOptions; // 0x488(0x10)
	bool PitchSettingDirty; // 0x498(0x01)
	bool VoicePitchShown; // 0x499(0x01)

	void GetAsyncWrapperRenderSize(struct FVector2D& RenderSize); // Function UI_BP_Settings_Audio.UI_BP_Settings_Audio_C.GetAsyncWrapperRenderSize // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void SequenceEvent__ENTRYPOINTUI_BP_Settings_Audio_1(); // Function UI_BP_Settings_Audio.UI_BP_Settings_Audio_C.SequenceEvent__ENTRYPOINTUI_BP_Settings_Audio_1 // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void PopulateTooltip(); // Function UI_BP_Settings_Audio.UI_BP_Settings_Audio_C.PopulateTooltip // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void HideTooltip(); // Function UI_BP_Settings_Audio.UI_BP_Settings_Audio_C.HideTooltip // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void SetTooltipData(struct FString Title, struct FString Description); // Function UI_BP_Settings_Audio.UI_BP_Settings_Audio_C.SetTooltipData // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void ToggleVolumeSlidersEnabled(bool Enable); // Function UI_BP_Settings_Audio.UI_BP_Settings_Audio_C.ToggleVolumeSlidersEnabled // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void GetPercentageFloat22(int32_t CurrentValue, float& NewValue); // Function UI_BP_Settings_Audio.UI_BP_Settings_Audio_C.GetPercentageFloat22 // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void Init Audio Settings(); // Function UI_BP_Settings_Audio.UI_BP_Settings_Audio_C.Init Audio Settings // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void InEditorPostConstruct(); // Function UI_BP_Settings_Audio.UI_BP_Settings_Audio_C.InEditorPostConstruct // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void SetParent(struct UUserWidget* Parent); // Function UI_BP_Settings_Audio.UI_BP_Settings_Audio_C.SetParent // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void Initialize(); // Function UI_BP_Settings_Audio.UI_BP_Settings_Audio_C.Initialize // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void BndEvt__btn_mute_K2Node_ComponentBoundEvent_5_SettingsCheckmarkPressed__DelegateSignature(bool IsChecked, struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_Audio.UI_BP_Settings_Audio_C.BndEvt__btn_mute_K2Node_ComponentBoundEvent_5_SettingsCheckmarkPressed__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__btn_subtitles_K2Node_ComponentBoundEvent_6_SettingsCheckmarkPressed__DelegateSignature(bool IsChecked, struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_Audio.UI_BP_Settings_Audio_C.BndEvt__btn_subtitles_K2Node_ComponentBoundEvent_6_SettingsCheckmarkPressed__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__btn_dynamicRange_K2Node_ComponentBoundEvent_8_DropDownOptionChanged__DelegateSignature(int32_t NewOptionIndex, struct UUI_BP_SettingsDropDownButton_C* Button); // Function UI_BP_Settings_Audio.UI_BP_Settings_Audio_C.BndEvt__btn_dynamicRange_K2Node_ComponentBoundEvent_8_DropDownOptionChanged__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void Construct(); // Function UI_BP_Settings_Audio.UI_BP_Settings_Audio_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_Audio_btn_DialogVolume_K2Node_ComponentBoundEvent_0_SettingsSliderHovered__DelegateSignature(struct UUI_BP_SettingsSliderButton_C* SliderButton); // Function UI_BP_Settings_Audio.UI_BP_Settings_Audio_C.BndEvt__UI_BP_Settings_Audio_btn_DialogVolume_K2Node_ComponentBoundEvent_0_SettingsSliderHovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_Audio_btn_dynamicRange_K2Node_ComponentBoundEvent_1_DropdownHovered__DelegateSignature(struct UUI_BP_SettingsDropDownButton_C* Button); // Function UI_BP_Settings_Audio.UI_BP_Settings_Audio_C.BndEvt__UI_BP_Settings_Audio_btn_dynamicRange_K2Node_ComponentBoundEvent_1_DropdownHovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_Audio_btn_MusicVolume_K2Node_ComponentBoundEvent_2_SettingsSliderHovered__DelegateSignature(struct UUI_BP_SettingsSliderButton_C* SliderButton); // Function UI_BP_Settings_Audio.UI_BP_Settings_Audio_C.BndEvt__UI_BP_Settings_Audio_btn_MusicVolume_K2Node_ComponentBoundEvent_2_SettingsSliderHovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_Audio_btn_mute_K2Node_ComponentBoundEvent_3_ToggleHovered__DelegateSignature(struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_Audio.UI_BP_Settings_Audio_C.BndEvt__UI_BP_Settings_Audio_btn_mute_K2Node_ComponentBoundEvent_3_ToggleHovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_Audio_btn_SoundEffectsVolume_K2Node_ComponentBoundEvent_4_SettingsSliderHovered__DelegateSignature(struct UUI_BP_SettingsSliderButton_C* SliderButton); // Function UI_BP_Settings_Audio.UI_BP_Settings_Audio_C.BndEvt__UI_BP_Settings_Audio_btn_SoundEffectsVolume_K2Node_ComponentBoundEvent_4_SettingsSliderHovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_Audio_btn_subtitles_K2Node_ComponentBoundEvent_11_ToggleHovered__DelegateSignature(struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_Audio.UI_BP_Settings_Audio_C.BndEvt__UI_BP_Settings_Audio_btn_subtitles_K2Node_ComponentBoundEvent_11_ToggleHovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_Audio_btn_subtitles_K2Node_ComponentBoundEvent_12_ToggleUnhovered__DelegateSignature(struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_Audio.UI_BP_Settings_Audio_C.BndEvt__UI_BP_Settings_Audio_btn_subtitles_K2Node_ComponentBoundEvent_12_ToggleUnhovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_Audio_btn_DialogVolume_K2Node_ComponentBoundEvent_13_SettingsSliderUnhovered__DelegateSignature(struct UUI_BP_SettingsSliderButton_C* SliderButton); // Function UI_BP_Settings_Audio.UI_BP_Settings_Audio_C.BndEvt__UI_BP_Settings_Audio_btn_DialogVolume_K2Node_ComponentBoundEvent_13_SettingsSliderUnhovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_Audio_btn_dynamicRange_K2Node_ComponentBoundEvent_14_DropdownUnhovered__DelegateSignature(); // Function UI_BP_Settings_Audio.UI_BP_Settings_Audio_C.BndEvt__UI_BP_Settings_Audio_btn_dynamicRange_K2Node_ComponentBoundEvent_14_DropdownUnhovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_Audio_btn_MusicVolume_K2Node_ComponentBoundEvent_15_SettingsSliderUnhovered__DelegateSignature(struct UUI_BP_SettingsSliderButton_C* SliderButton); // Function UI_BP_Settings_Audio.UI_BP_Settings_Audio_C.BndEvt__UI_BP_Settings_Audio_btn_MusicVolume_K2Node_ComponentBoundEvent_15_SettingsSliderUnhovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_Audio_btn_mute_K2Node_ComponentBoundEvent_16_ToggleUnhovered__DelegateSignature(struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_Audio.UI_BP_Settings_Audio_C.BndEvt__UI_BP_Settings_Audio_btn_mute_K2Node_ComponentBoundEvent_16_ToggleUnhovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_Audio_btn_SoundEffectsVolume_K2Node_ComponentBoundEvent_17_SettingsSliderUnhovered__DelegateSignature(struct UUI_BP_SettingsSliderButton_C* SliderButton); // Function UI_BP_Settings_Audio.UI_BP_Settings_Audio_C.BndEvt__UI_BP_Settings_Audio_btn_SoundEffectsVolume_K2Node_ComponentBoundEvent_17_SettingsSliderUnhovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_Audio_btn_MusicVolume_K2Node_ComponentBoundEvent_18_SettingsSliderFinished__DelegateSignature(struct UUI_BP_SettingsSliderButton_C* SliderButton, float EndValue); // Function UI_BP_Settings_Audio.UI_BP_Settings_Audio_C.BndEvt__UI_BP_Settings_Audio_btn_MusicVolume_K2Node_ComponentBoundEvent_18_SettingsSliderFinished__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_Audio_btn_SoundEffectsVolume_K2Node_ComponentBoundEvent_19_SettingsSliderFinished__DelegateSignature(struct UUI_BP_SettingsSliderButton_C* SliderButton, float EndValue); // Function UI_BP_Settings_Audio.UI_BP_Settings_Audio_C.BndEvt__UI_BP_Settings_Audio_btn_SoundEffectsVolume_K2Node_ComponentBoundEvent_19_SettingsSliderFinished__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_Audio_btn_DialogVolume_K2Node_ComponentBoundEvent_20_SettingsSliderFinished__DelegateSignature(struct UUI_BP_SettingsSliderButton_C* SliderButton, float EndValue); // Function UI_BP_Settings_Audio.UI_BP_Settings_Audio_C.BndEvt__UI_BP_Settings_Audio_btn_DialogVolume_K2Node_ComponentBoundEvent_20_SettingsSliderFinished__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_Audio_btn_dynamicRange_K2Node_ComponentBoundEvent_7_DropDownOptionHovered__DelegateSignature(struct UUI_BP_SettingsDropDownButton_C* Button, struct FString HoveredItemString); // Function UI_BP_Settings_Audio.UI_BP_Settings_Audio_C.BndEvt__UI_BP_Settings_Audio_btn_dynamicRange_K2Node_ComponentBoundEvent_7_DropDownOptionHovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void OnLegendItemHoldEnd(struct ULegendItem* LegendItem, bool HoldWasCompleted); // Function UI_BP_Settings_Audio.UI_BP_Settings_Audio_C.OnLegendItemHoldEnd // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_Audio_btn_VoicePitch_K2Node_ComponentBoundEvent_22_SettingsSliderHovered__DelegateSignature(struct UUI_BP_SettingsSliderButton_C* SliderButton); // Function UI_BP_Settings_Audio.UI_BP_Settings_Audio_C.BndEvt__UI_BP_Settings_Audio_btn_VoicePitch_K2Node_ComponentBoundEvent_22_SettingsSliderHovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_Audio_btn_VoicePitch_K2Node_ComponentBoundEvent_23_SettingsSliderUnhovered__DelegateSignature(struct UUI_BP_SettingsSliderButton_C* SliderButton); // Function UI_BP_Settings_Audio.UI_BP_Settings_Audio_C.BndEvt__UI_BP_Settings_Audio_btn_VoicePitch_K2Node_ComponentBoundEvent_23_SettingsSliderUnhovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_Audio_btn_VoicePitch_K2Node_ComponentBoundEvent_25_SettingsSliderFinished__DelegateSignature(struct UUI_BP_SettingsSliderButton_C* SliderButton, float EndValue); // Function UI_BP_Settings_Audio.UI_BP_Settings_Audio_C.BndEvt__UI_BP_Settings_Audio_btn_VoicePitch_K2Node_ComponentBoundEvent_25_SettingsSliderFinished__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void InitForSettingsLocation(bool IsInFieldGuide); // Function UI_BP_Settings_Audio.UI_BP_Settings_Audio_C.InitForSettingsLocation // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_Audio_btn_VoicePitch_K2Node_ComponentBoundEvent_24_SettingsSliderChanged__DelegateSignature(struct UUI_BP_SettingsSliderButton_C* SliderButton, float NewValue); // Function UI_BP_Settings_Audio.UI_BP_Settings_Audio_C.BndEvt__UI_BP_Settings_Audio_btn_VoicePitch_K2Node_ComponentBoundEvent_24_SettingsSliderChanged__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_Audio_btn_MusicVolume_K2Node_ComponentBoundEvent_9_SettingsSliderChanged__DelegateSignature(struct UUI_BP_SettingsSliderButton_C* SliderButton, float NewValue); // Function UI_BP_Settings_Audio.UI_BP_Settings_Audio_C.BndEvt__UI_BP_Settings_Audio_btn_MusicVolume_K2Node_ComponentBoundEvent_9_SettingsSliderChanged__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_Audio_btn_SoundEffectsVolume_K2Node_ComponentBoundEvent_10_SettingsSliderChanged__DelegateSignature(struct UUI_BP_SettingsSliderButton_C* SliderButton, float NewValue); // Function UI_BP_Settings_Audio.UI_BP_Settings_Audio_C.BndEvt__UI_BP_Settings_Audio_btn_SoundEffectsVolume_K2Node_ComponentBoundEvent_10_SettingsSliderChanged__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_Audio_btn_DialogVolume_K2Node_ComponentBoundEvent_21_SettingsSliderChanged__DelegateSignature(struct UUI_BP_SettingsSliderButton_C* SliderButton, float NewValue); // Function UI_BP_Settings_Audio.UI_BP_Settings_Audio_C.BndEvt__UI_BP_Settings_Audio_btn_DialogVolume_K2Node_ComponentBoundEvent_21_SettingsSliderChanged__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_Audio_btn_mono_K2Node_ComponentBoundEvent_26_ToggleHovered__DelegateSignature(struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_Audio.UI_BP_Settings_Audio_C.BndEvt__UI_BP_Settings_Audio_btn_mono_K2Node_ComponentBoundEvent_26_ToggleHovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_Audio_btn_mono_K2Node_ComponentBoundEvent_27_ToggleUnhovered__DelegateSignature(struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_Audio.UI_BP_Settings_Audio_C.BndEvt__UI_BP_Settings_Audio_btn_mono_K2Node_ComponentBoundEvent_27_ToggleUnhovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_Audio_btn_mono_K2Node_ComponentBoundEvent_28_SettingsCheckmarkPressed__DelegateSignature(bool IsChecked, struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_Audio.UI_BP_Settings_Audio_C.BndEvt__UI_BP_Settings_Audio_btn_mono_K2Node_ComponentBoundEvent_28_SettingsCheckmarkPressed__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void LeaveFromPage(); // Function UI_BP_Settings_Audio.UI_BP_Settings_Audio_C.LeaveFromPage // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_UI_BP_Settings_Audio(int32_t EntryPoint); // Function UI_BP_Settings_Audio.UI_BP_Settings_Audio_C.ExecuteUbergraph_UI_BP_Settings_Audio // (Final|UbergraphFunction|HasDefaults) // @ game+0x38a7480
};

