// WidgetBlueprintGeneratedClass UI_BP_Settings_Display_Console.UI_BP_Settings_Display_Console_C
// Size: 0x4d0 (Inherited: 0x420)
struct UUI_BP_Settings_Display_Console_C : UGraphicsSettingsWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x420(0x08)
	struct UWidgetAnimation* showDetails; // 0x428(0x08)
	struct UUI_BP_MenuTextButton_C* btn_calibration; // 0x430(0x08)
	struct UUI_BP_SettingsCheckboxButton_C* btn_chromaticAberration; // 0x438(0x08)
	struct UUI_BP_SettingsCheckboxButton_C* btn_DepthOfField; // 0x440(0x08)
	struct UUI_BP_SettingsCheckboxButton_C* btn_FilmGrain; // 0x448(0x08)
	struct UUI_BP_SettingsCheckboxButton_C* btn_FrameRateCap; // 0x450(0x08)
	struct UUI_BP_MenuTextButton_C* btn_InstallHDTexture; // 0x458(0x08)
	struct UUI_BP_SettingsCheckboxButton_C* btn_motionBlur; // 0x460(0x08)
	struct UUI_BP_SettingsDropDownButton_C* btn_PerformanceMode; // 0x468(0x08)
	struct UUI_BP_SettingsDetails_C* settingsDetails; // 0x470(0x08)
	struct TArray<struct FString> performanceModes; // 0x478(0x10)
	struct FString performanceModeStringPrefix; // 0x488(0x10)
	struct FString TargetPerformanceMode; // 0x498(0x10)
	bool shouldShowRebootPopup; // 0x4a8(0x01)
	char pad_4A9[0x7]; // 0x4a9(0x07)
	struct TArray<struct FLegendItemData> LegendItemDataArray; // 0x4b0(0x10)
	struct TArray<struct FInputActionHoldInfo> InputActionHoldArray; // 0x4c0(0x10)

	void GetAsyncWrapperRenderSize(struct FVector2D& RenderSize); // Function UI_BP_Settings_Display_Console.UI_BP_Settings_Display_Console_C.GetAsyncWrapperRenderSize // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void UpdateInstallHDTextureButton(); // Function UI_BP_Settings_Display_Console.UI_BP_Settings_Display_Console_C.UpdateInstallHDTextureButton // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void InitInstallHDTextureButton(); // Function UI_BP_Settings_Display_Console.UI_BP_Settings_Display_Console_C.InitInstallHDTextureButton // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void PopulatePerformanceModes(); // Function UI_BP_Settings_Display_Console.UI_BP_Settings_Display_Console_C.PopulatePerformanceModes // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void UpdateCapFrameRateButton(struct UPhoenixGameSettings*& GameSettings); // Function UI_BP_Settings_Display_Console.UI_BP_Settings_Display_Console_C.UpdateCapFrameRateButton // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void ShowTooltip(struct FString Title, struct FString Description); // Function UI_BP_Settings_Display_Console.UI_BP_Settings_Display_Console_C.ShowTooltip // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void HideTooltip(); // Function UI_BP_Settings_Display_Console.UI_BP_Settings_Display_Console_C.HideTooltip // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void BndEvt__btn_MotionBlur_K2Node_ComponentBoundEvent_2_SettingsCheckmarkPressed__DelegateSignature(bool IsChecked, struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_Display_Console.UI_BP_Settings_Display_Console_C.BndEvt__btn_MotionBlur_K2Node_ComponentBoundEvent_2_SettingsCheckmarkPressed__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_Display_Console_btn_calibration_K2Node_ComponentBoundEvent_1_MenuTextButtonClicked__DelegateSignature(struct UUI_BP_MenuTextButton_C* Button); // Function UI_BP_Settings_Display_Console.UI_BP_Settings_Display_Console_C.BndEvt__UI_BP_Settings_Display_Console_btn_calibration_K2Node_ComponentBoundEvent_1_MenuTextButtonClicked__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_Display_btn_chromaticAberration_K2Node_ComponentBoundEvent_8_SettingsCheckmarkPressed__DelegateSignature(bool IsChecked, struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_Display_Console.UI_BP_Settings_Display_Console_C.BndEvt__UI_BP_Settings_Display_btn_chromaticAberration_K2Node_ComponentBoundEvent_8_SettingsCheckmarkPressed__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_Display_btn_chromaticAberration_1_K2Node_ComponentBoundEvent_50_SettingsCheckmarkPressed__DelegateSignature(bool IsChecked, struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_Display_Console.UI_BP_Settings_Display_Console_C.BndEvt__UI_BP_Settings_Display_btn_chromaticAberration_1_K2Node_ComponentBoundEvent_50_SettingsCheckmarkPressed__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__btn_PerformanceMode_K2Node_ComponentBoundEvent_0_DropDownOptionChanged__DelegateSignature(int32_t NewOptionIndex, struct UUI_BP_SettingsDropDownButton_C* Button); // Function UI_BP_Settings_Display_Console.UI_BP_Settings_Display_Console_C.BndEvt__btn_PerformanceMode_K2Node_ComponentBoundEvent_0_DropDownOptionChanged__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__btn_motionBlur_K2Node_ComponentBoundEvent_47_ToggleUnhovered__DelegateSignature(struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_Display_Console.UI_BP_Settings_Display_Console_C.BndEvt__btn_motionBlur_K2Node_ComponentBoundEvent_47_ToggleUnhovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_Display_btn_chromaticAberration_K2Node_ComponentBoundEvent_40_ToggleUnhovered__DelegateSignature(struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_Display_Console.UI_BP_Settings_Display_Console_C.BndEvt__UI_BP_Settings_Display_btn_chromaticAberration_K2Node_ComponentBoundEvent_40_ToggleUnhovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_Display_btn_DepthOfField_K2Node_ComponentBoundEvent_57_ToggleUnhovered__DelegateSignature(struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_Display_Console.UI_BP_Settings_Display_Console_C.BndEvt__UI_BP_Settings_Display_btn_DepthOfField_K2Node_ComponentBoundEvent_57_ToggleUnhovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void Initialize(); // Function UI_BP_Settings_Display_Console.UI_BP_Settings_Display_Console_C.Initialize // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_Display_btn_DepthOfField_K2Node_ComponentBoundEvent_55_ToggleHovered__DelegateSignature(struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_Display_Console.UI_BP_Settings_Display_Console_C.BndEvt__UI_BP_Settings_Display_btn_DepthOfField_K2Node_ComponentBoundEvent_55_ToggleHovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_Display_btn_chromaticAberration_K2Node_ComponentBoundEvent_10_ToggleHovered__DelegateSignature(struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_Display_Console.UI_BP_Settings_Display_Console_C.BndEvt__UI_BP_Settings_Display_btn_chromaticAberration_K2Node_ComponentBoundEvent_10_ToggleHovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__btn_motionBlur_K2Node_ComponentBoundEvent_29_ToggleHovered__DelegateSignature(struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_Display_Console.UI_BP_Settings_Display_Console_C.BndEvt__btn_motionBlur_K2Node_ComponentBoundEvent_29_ToggleHovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void SetParent(struct UUserWidget* Parent); // Function UI_BP_Settings_Display_Console.UI_BP_Settings_Display_Console_C.SetParent // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_Display_Console_btn_PerformanceMode_K2Node_ComponentBoundEvent_3_DropdownHovered__DelegateSignature(struct UUI_BP_SettingsDropDownButton_C* Button); // Function UI_BP_Settings_Display_Console.UI_BP_Settings_Display_Console_C.BndEvt__UI_BP_Settings_Display_Console_btn_PerformanceMode_K2Node_ComponentBoundEvent_3_DropdownHovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_Display_Console_btn_PerformanceMode_K2Node_ComponentBoundEvent_4_DropdownUnhovered__DelegateSignature(); // Function UI_BP_Settings_Display_Console.UI_BP_Settings_Display_Console_C.BndEvt__UI_BP_Settings_Display_Console_btn_PerformanceMode_K2Node_ComponentBoundEvent_4_DropdownUnhovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_Display_Console_btn_calibration_K2Node_ComponentBoundEvent_5_MenuTextButtonHovered__DelegateSignature(struct UUI_BP_MenuTextButton_C* Button); // Function UI_BP_Settings_Display_Console.UI_BP_Settings_Display_Console_C.BndEvt__UI_BP_Settings_Display_Console_btn_calibration_K2Node_ComponentBoundEvent_5_MenuTextButtonHovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_Display_Console_btn_calibration_K2Node_ComponentBoundEvent_6_MenuTextButtonUnhovered__DelegateSignature(struct UUI_BP_MenuTextButton_C* Button); // Function UI_BP_Settings_Display_Console.UI_BP_Settings_Display_Console_C.BndEvt__UI_BP_Settings_Display_Console_btn_calibration_K2Node_ComponentBoundEvent_6_MenuTextButtonUnhovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_Display_Console_btn_FilmGrain_K2Node_ComponentBoundEvent_5_SettingsCheckmarkPressed__DelegateSignature(bool IsChecked, struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_Display_Console.UI_BP_Settings_Display_Console_C.BndEvt__UI_BP_Settings_Display_Console_btn_FilmGrain_K2Node_ComponentBoundEvent_5_SettingsCheckmarkPressed__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void InEditorPostConstruct(); // Function UI_BP_Settings_Display_Console.UI_BP_Settings_Display_Console_C.InEditorPostConstruct // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_Display_Console_btn_FilmGrain_K2Node_ComponentBoundEvent_9_ToggleHovered__DelegateSignature(struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_Display_Console.UI_BP_Settings_Display_Console_C.BndEvt__UI_BP_Settings_Display_Console_btn_FilmGrain_K2Node_ComponentBoundEvent_9_ToggleHovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_Display_Console_btn_FilmGrain_K2Node_ComponentBoundEvent_13_ToggleUnhovered__DelegateSignature(struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_Display_Console.UI_BP_Settings_Display_Console_C.BndEvt__UI_BP_Settings_Display_Console_btn_FilmGrain_K2Node_ComponentBoundEvent_13_ToggleUnhovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_Display_Console_btn_PerformanceMode_K2Node_ComponentBoundEvent_10_DropDownOptionHovered__DelegateSignature(struct UUI_BP_SettingsDropDownButton_C* Button, struct FString HoveredItemString); // Function UI_BP_Settings_Display_Console.UI_BP_Settings_Display_Console_C.BndEvt__UI_BP_Settings_Display_Console_btn_PerformanceMode_K2Node_ComponentBoundEvent_10_DropDownOptionHovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void OnLegendItemHoldEnd(struct ULegendItem* LegendItem, bool HoldWasCompleted); // Function UI_BP_Settings_Display_Console.UI_BP_Settings_Display_Console_C.OnLegendItemHoldEnd // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void InitializeAllSettings(); // Function UI_BP_Settings_Display_Console.UI_BP_Settings_Display_Console_C.InitializeAllSettings // (BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_Display_Console_btn_CapFrame_K2Node_ComponentBoundEvent_12_SettingsCheckmarkPressed__DelegateSignature(bool IsChecked, struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_Display_Console.UI_BP_Settings_Display_Console_C.BndEvt__UI_BP_Settings_Display_Console_btn_CapFrame_K2Node_ComponentBoundEvent_12_SettingsCheckmarkPressed__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void EnableDisableCapFrameButton(); // Function UI_BP_Settings_Display_Console.UI_BP_Settings_Display_Console_C.EnableDisableCapFrameButton // (BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_Display_Console_btn_FrameRateCap_K2Node_ComponentBoundEvent_14_ToggleHovered__DelegateSignature(struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_Display_Console.UI_BP_Settings_Display_Console_C.BndEvt__UI_BP_Settings_Display_Console_btn_FrameRateCap_K2Node_ComponentBoundEvent_14_ToggleHovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_Display_Console_btn_FrameRateCap_K2Node_ComponentBoundEvent_15_ToggleUnhovered__DelegateSignature(struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_Display_Console.UI_BP_Settings_Display_Console_C.BndEvt__UI_BP_Settings_Display_Console_btn_FrameRateCap_K2Node_ComponentBoundEvent_15_ToggleUnhovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void Tick(struct FGeometry MyGeometry, float InDeltaTime); // Function UI_BP_Settings_Display_Console.UI_BP_Settings_Display_Console_C.Tick // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_Display_Console_btn_InstallHDTexture_K2Node_ComponentBoundEvent_16_MenuTextButtonClicked__DelegateSignature(struct UUI_BP_MenuTextButton_C* Button); // Function UI_BP_Settings_Display_Console.UI_BP_Settings_Display_Console_C.BndEvt__UI_BP_Settings_Display_Console_btn_InstallHDTexture_K2Node_ComponentBoundEvent_16_MenuTextButtonClicked__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_Display_Console_btn_InstallHDTexture_K2Node_ComponentBoundEvent_18_MenuTextButtonHovered__DelegateSignature(struct UUI_BP_MenuTextButton_C* Button); // Function UI_BP_Settings_Display_Console.UI_BP_Settings_Display_Console_C.BndEvt__UI_BP_Settings_Display_Console_btn_InstallHDTexture_K2Node_ComponentBoundEvent_18_MenuTextButtonHovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_Display_Console_btn_InstallHDTexture_K2Node_ComponentBoundEvent_19_MenuTextButtonUnhovered__DelegateSignature(struct UUI_BP_MenuTextButton_C* Button); // Function UI_BP_Settings_Display_Console.UI_BP_Settings_Display_Console_C.BndEvt__UI_BP_Settings_Display_Console_btn_InstallHDTexture_K2Node_ComponentBoundEvent_19_MenuTextButtonUnhovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_UI_BP_Settings_Display_Console(int32_t EntryPoint); // Function UI_BP_Settings_Display_Console.UI_BP_Settings_Display_Console_C.ExecuteUbergraph_UI_BP_Settings_Display_Console // (Final|UbergraphFunction|HasDefaults) // @ game+0x38a7480
};

