// WidgetBlueprintGeneratedClass UI_BP_Settings_Display.UI_BP_Settings_Display_C
// Size: 0x6e4 (Inherited: 0x420)
struct UUI_BP_Settings_Display_C : UGraphicsSettingsWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x420(0x08)
	struct UWidgetAnimation* showDetails; // 0x428(0x08)
	struct UUI_BP_SettingsDropDownButton_C* btn_AntiAliasingMode; // 0x430(0x08)
	struct UUI_BP_MenuTextButton_C* btn_applySettings; // 0x438(0x08)
	struct UUI_BP_MenuTextButton_C* btn_calibration; // 0x440(0x08)
	struct UUI_BP_SettingsCheckboxButton_C* btn_chromaticAberration; // 0x448(0x08)
	struct UUI_BP_SettingsCheckboxButton_C* btn_DepthOfField; // 0x450(0x08)
	struct UUI_BP_SettingsDropDownButton_C* btn_displayOptions; // 0x458(0x08)
	struct UUI_BP_SettingsSliderButton_C* btn_fieldOfView; // 0x460(0x08)
	struct UUI_BP_SettingsCheckboxButton_C* btn_FilmGrain; // 0x468(0x08)
	struct UUI_BP_SettingsCheckboxButton_C* btn_framegeneration; // 0x470(0x08)
	struct UUI_BP_SettingsDropDownButton_C* btn_FrameRate; // 0x478(0x08)
	struct UUI_BP_SettingsCheckboxButton_C* btn_HDRCheckbox; // 0x480(0x08)
	struct UUI_BP_SettingsCheckboxButton_C* btn_motionBlur; // 0x488(0x08)
	struct UUI_BP_SettingsDropDownButton_C* btn_nvidiaLatency; // 0x490(0x08)
	struct UUI_BP_SettingsDropDownButton_C* btn_RenderingResolution; // 0x498(0x08)
	struct UUI_BP_MenuTextButton_C* btn_resetSettings; // 0x4a0(0x08)
	struct UUI_BP_SettingsDropDownButton_C* btn_Resolution; // 0x4a8(0x08)
	struct UUI_BP_SettingsDropDownButton_C* btn_selectedMonitor; // 0x4b0(0x08)
	struct UUI_BP_SettingsDropDownButton_C* btn_selectGPU; // 0x4b8(0x08)
	struct UUI_BP_SettingsDropDownButton_C* btn_UpscaleBrand; // 0x4c0(0x08)
	struct UUI_BP_SettingsDropDownButton_C* btn_UpscaleMode; // 0x4c8(0x08)
	struct UUI_BP_SettingsSliderButton_C* btn_upscaleSharpness; // 0x4d0(0x08)
	struct UUI_BP_SettingsCheckboxButton_C* btn_VSync; // 0x4d8(0x08)
	struct UButton* DisabledFrameGenerationHoverButton; // 0x4e0(0x08)
	struct UButton* DisabledVSyncHoverButton; // 0x4e8(0x08)
	struct UUI_BP_SimpleScrollBox_C* displayScrollBox; // 0x4f0(0x08)
	struct UUI_BP_SettingsDetails_C* settingsDetails; // 0x4f8(0x08)
	struct TArray<struct FIntPoint> ResolutionArray; // 0x500(0x10)
	struct TArray<enum class EWindowMode> DisplayArray; // 0x510(0x10)
	float Min_FOVOffset_PC; // 0x520(0x04)
	float Max_FOVOffset_PC; // 0x524(0x04)
	float Min_FOVOffset_Console; // 0x528(0x04)
	float Max_FOVOffset_Console; // 0x52c(0x04)
	struct TArray<struct FString> ResolutionStringArray; // 0x530(0x10)
	struct USystemMenuWidget* ParentSettingsPage; // 0x540(0x08)
	struct TArray<struct FString> AvailableMonitors; // 0x548(0x10)
	float SelectedUpscaleSoftness; // 0x558(0x04)
	char pad_55C[0x4]; // 0x55c(0x04)
	struct TArray<struct FString> AvailableUpscaleMethodStrings; // 0x560(0x10)
	struct TMap<int32_t, struct FIntPoint> AvailableRenderingResolutions; // 0x570(0x50)
	struct TArray<struct FString> AvailableRenderingResolutionStrings; // 0x5c0(0x10)
	struct TArray<int32_t> ResolutionScales; // 0x5d0(0x10)
	struct TArray<struct FString> AvailableFrameRates; // 0x5e0(0x10)
	struct TArray<struct FString> AntiAliasingModeArray; // 0x5f0(0x10)
	struct TArray<struct FString> UpscaleBrandArray; // 0x600(0x10)
	struct TArray<struct FString> UpscaleModeArray; // 0x610(0x10)
	enum class EUpscaleMode UnconfirmedUpscaleMode; // 0x620(0x01)
	char pad_621[0x3]; // 0x621(0x03)
	struct FIntPoint UnconfirmedScreenResolution; // 0x624(0x08)
	float UnconfirmedUpscaleSharpness; // 0x62c(0x04)
	bool UnconfirmedEnableHDR; // 0x630(0x01)
	bool UnconfirmedEnableVSync; // 0x631(0x01)
	char pad_632[0x2]; // 0x632(0x02)
	float UnconfirmedMaxFrameRate; // 0x634(0x04)
	bool UnconfirmedEnableMotionBlur; // 0x638(0x01)
	bool UnconfirmedEnableDepthOfField; // 0x639(0x01)
	char pad_63A[0x2]; // 0x63a(0x02)
	float UnconfirmedRenderingResolutionPct; // 0x63c(0x04)
	bool UnconfirmedEnableChromaticAberration; // 0x640(0x01)
	bool UnconfirmedEnableFilmGrain; // 0x641(0x01)
	char pad_642[0x2]; // 0x642(0x02)
	float UnconfirmedFOVOffset; // 0x644(0x04)
	struct FString tooltipTitle; // 0x648(0x10)
	struct FString TooltipDescription; // 0x658(0x10)
	bool isButtonHovered; // 0x668(0x01)
	char pad_669[0x3]; // 0x669(0x03)
	float CurrentHoverTime; // 0x66c(0x04)
	float RequiredHoverTime; // 0x670(0x04)
	bool isDetailsShowing; // 0x674(0x01)
	char pad_675[0x3]; // 0x675(0x03)
	struct TArray<struct FGraphicsAdapterDesc> AvailableGPUs; // 0x678(0x10)
	int32_t LastConfirmedGPUSelection; // 0x688(0x04)
	int32_t UnconfirmedGPUSelection; // 0x68c(0x04)
	bool GPUSelectionChanged; // 0x690(0x01)
	enum class EAntiAliasingMode UnconfirmedAntiAliasingMode; // 0x691(0x01)
	char pad_692[0x6]; // 0x692(0x06)
	struct TArray<enum class EAntiAliasingMode> AntiAliasingModeValuesArray; // 0x698(0x10)
	struct TArray<enum class EUpscaleBrand> UpscaleBrandValuesArray; // 0x6a8(0x10)
	struct TArray<enum class EUpscaleMode> UpscaleModeValuesArray; // 0x6b8(0x10)
	bool UnconfirmedEnableFrameGeneration; // 0x6c8(0x01)
	char pad_6C9[0x7]; // 0x6c9(0x07)
	struct TArray<struct FNvidiaLatencyModeInfo> LatencyOptions; // 0x6d0(0x10)
	int32_t UnconfirmedNVidiaLatencyIndex; // 0x6e0(0x04)

	void GetAsyncWrapperRenderSize(struct FVector2D& RenderSize); // Function UI_BP_Settings_Display.UI_BP_Settings_Display_C.GetAsyncWrapperRenderSize // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void GetCurrentLatencyIndex(int32_t& LatencyIndex); // Function UI_BP_Settings_Display.UI_BP_Settings_Display_C.GetCurrentLatencyIndex // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void Convert FOVValue to Text(float FOVOffset, struct FText& FOVText); // Function UI_BP_Settings_Display.UI_BP_Settings_Display_C.Convert FOVValue to Text // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void InitializeAllSettings(); // Function UI_BP_Settings_Display.UI_BP_Settings_Display_C.InitializeAllSettings // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
