// WidgetBlueprintGeneratedClass UI_BP_Settings_Accessibility.UI_BP_Settings_Accessibility_C
// Size: 0x5b8 (Inherited: 0x3c8)
struct UUI_BP_Settings_Accessibility_C : UTabPageWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x3c8(0x08)
	struct UWidgetAnimation* FadeScrollBox; // 0x3d0(0x08)
	struct UWidgetAnimation* showDetails; // 0x3d8(0x08)
	struct UUI_BP_SettingsDetails_C* accessibilityDetails; // 0x3e0(0x08)
	struct UUI_BP_SimpleScrollBox_C* accessibilityScrollBox; // 0x3e8(0x08)
	struct UUI_BP_AudioLegendPopup_C* AudioCueHelpPage; // 0x3f0(0x08)
	struct UUI_BP_SettingsCheckboxButton_C* btn_aimMode; // 0x3f8(0x08)
	struct UUI_BP_MenuTextButton_C* btn_AudioCueLegend; // 0x400(0x08)
	struct UUI_BP_SettingsSliderButton_C* btn_AudioCueOpacity; // 0x408(0x08)
	struct UUI_BP_SettingsSliderButton_C* btn_AudioCueScale; // 0x410(0x08)
	struct UUI_BP_SettingsCheckboxButton_C* btn_AudioVisualizer; // 0x418(0x08)
	struct UUI_BP_SettingsSliderButton_C* btn_cameraShake; // 0x420(0x08)
	struct UUI_BP_SettingsCheckboxButton_C* btn_cinematicCameraShake; // 0x428(0x08)
	struct UUI_BP_SettingsDropDownButton_C* btn_colorOptions; // 0x430(0x08)
	struct UUI_BP_SettingsSliderButton_C* btn_cursorSensitivity; // 0x438(0x08)
	struct UUI_BP_SettingsSliderButton_C* btn_deadzone; // 0x440(0x08)
	struct UUI_BP_SettingsCheckboxButton_C* btn_GameHighContrast; // 0x448(0x08)
	struct UUI_BP_SettingsCheckboxButton_C* btn_MenuReader; // 0x450(0x08)
	struct UUI_BP_SettingsDropDownButton_C* btn_MenuReaderVoice; // 0x458(0x08)
	struct UUI_BP_SettingsSliderButton_C* btn_MenuReaderVolume; // 0x460(0x08)
	struct UUI_BP_SettingsSliderButton_C* btn_MiniMapOpacity; // 0x468(0x08)
	struct UUI_BP_SettingsCheckboxButton_C* btn_PathLine; // 0x470(0x08)
	struct UUI_BP_SettingsCheckboxButton_C* btn_southpaw; // 0x478(0x08)
	struct UUI_BP_SettingsCheckboxButton_C* btn_spellCastMode; // 0x480(0x08)
	struct UUI_BP_SettingsCheckboxButton_C* btn_switchSticks; // 0x488(0x08)
	struct UUI_BP_SettingsCheckboxButton_C* btn_TextHighContrast; // 0x490(0x08)
	struct UUI_BP_SettingsDropDownButton_C* drp_FontSize; // 0x498(0x08)
	struct FMulticastInlineDelegate CameraShakeChanged; // 0x4a0(0x10)
	struct FMulticastInlineDelegate ToggleCinematicCameraShake; // 0x4b0(0x10)
	struct FMulticastInlineDelegate ColorOptionsChanged; // 0x4c0(0x10)
	struct FMulticastInlineDelegate ToggleAimMode; // 0x4d0(0x10)
	struct FMulticastInlineDelegate ToggleTrackCurrentTarget; // 0x4e0(0x10)
	struct FMulticastInlineDelegate ToggleSwitchInputSticks; // 0x4f0(0x10)
	struct FMulticastInlineDelegate ToggleSouthpawControls; // 0x500(0x10)
	struct FMulticastInlineDelegate CameraDeadzoneChanged; // 0x510(0x10)
	struct FMulticastInlineDelegate CursorSensitivityChanged; // 0x520(0x10)
	float MaxGamepadDeadzone; // 0x530(0x04)
	float MinGamepadDeadzone; // 0x534(0x04)
	float MaxCameraShake; // 0x538(0x04)
	float MinCameraShake; // 0x53c(0x04)
	struct TArray<struct FString> ContrastMode; // 0x540(0x10)
	bool isButtonHovered; // 0x550(0x01)
	bool isDetailsShowing; // 0x551(0x01)
	char pad_552[0x2]; // 0x552(0x02)
	float CurrentHoverTime; // 0x554(0x04)
	float RequiredHoverTime; // 0x558(0x04)
	char pad_55C[0x4]; // 0x55c(0x04)
	struct FString TooltipDescription; // 0x560(0x10)
	float MaxMiniMapOpacity; // 0x570(0x04)
	float MinMiniMapOpacity; // 0x574(0x04)
	float MaxAudioCueOpacity; // 0x578(0x04)
	float MinAudioCueOpacity; // 0x57c(0x04)
	float MaxAudioCueScale; // 0x580(0x04)
	float MinAudioCueScale; // 0x584(0x04)
	float MaxMenuReaderVolume; // 0x588(0x04)
	float MinMenuReaderVolume; // 0x58c(0x04)
	struct TArray<struct FMenuReaderVoice> CachedMenuReaderVoices; // 0x590(0x10)
	bool IsInFirstFlow; // 0x5a0(0x01)
	char pad_5A1[0x7]; // 0x5a1(0x07)
	struct FMulticastInlineDelegate OnMenuReaderSettingToggled; // 0x5a8(0x10)

	void GetAsyncWrapperRenderSize(struct FVector2D& RenderSize); // Function UI_BP_Settings_Accessibility.UI_BP_Settings_Accessibility_C.GetAsyncWrapperRenderSize // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	struct TArray<struct FString> GatherMenuReaderStrings(int32_t DepthLevel); // Function UI_BP_Settings_Accessibility.UI_BP_Settings_Accessibility_C.GatherMenuReaderStrings // (Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x38a7480
	void SetIsInFirstFlow(bool InFirstFlow); // Function UI_BP_Settings_Accessibility.UI_BP_Settings_Accessibility_C.SetIsInFirstFlow // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
