// WidgetBlueprintGeneratedClass UI_BP_LogoAndLegal.UI_BP_LogoAndLegal_C
// Size: 0x2b0 (Inherited: 0x268)
struct UUI_BP_LogoAndLegal_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x268(0x08)
	struct UImage* Bink; // 0x270(0x08)
	struct UVerticalBox* Content; // 0x278(0x08)
	struct UImage* InstaLod; // 0x280(0x08)
	struct UImage* Mercuna; // 0x288(0x08)
	struct UImage* Oodle; // 0x290(0x08)
	struct UImage* SpeedTree; // 0x298(0x08)
	struct UImage* UnrealEngine; // 0x2a0(0x08)
	struct UImage* Wwise; // 0x2a8(0x08)

	void AdjustForViewportWidth(); // Function UI_BP_LogoAndLegal.UI_BP_LogoAndLegal_C.AdjustForViewportWidth // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void OnInitialized(); // Function UI_BP_LogoAndLegal.UI_BP_LogoAndLegal_C.OnInitialized // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x38a7480
	void Construct(); // Function UI_BP_LogoAndLegal.UI_BP_LogoAndLegal_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x38a7480
	void ResolutionSettingsApplied(struct UObject* Caller); // Function UI_BP_LogoAndLegal.UI_BP_LogoAndLegal_C.ResolutionSettingsApplied // (BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_UI_BP_LogoAndLegal(int32_t EntryPoint); // Function UI_BP_LogoAndLegal.UI_BP_LogoAndLegal_C.ExecuteUbergraph_UI_BP_LogoAndLegal // (Final|UbergraphFunction|HasDefaults) // @ game+0x38a7480
};

