// WidgetBlueprintGeneratedClass UI_BP_Settings_UI.UI_BP_Settings_UI_C
// Size: 0x5b0 (Inherited: 0x3c8)
struct UUI_BP_Settings_UI_C : UTabPageWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x3c8(0x08)
	struct UWidgetAnimation* hideDetails; // 0x3d0(0x08)
	struct UWidgetAnimation* showDetails; // 0x3d8(0x08)
	struct UUI_BP_SettingsCheckboxButton_C* btn_ShowBeastControls; // 0x3e0(0x08)
	struct UUI_BP_SettingsCheckboxButton_C* btn_ShowEnemyDamageNumbers; // 0x3e8(0x08)
	struct UUI_BP_SettingsCheckboxButton_C* btn_ShowHudBeacons; // 0x3f0(0x08)
	struct UUI_BP_SettingsCheckboxButton_C* btn_ShowMapElements; // 0x3f8(0x08)
	struct UUI_BP_SettingsCheckboxButton_C* btn_ShowMeterElements; // 0x400(0x08)
	struct UUI_BP_SettingsCheckboxButton_C* btn_ShowMissionElements; // 0x408(0x08)
	struct UUI_BP_SettingsCheckboxButton_C* btn_ShowRightSideNotifications; // 0x410(0x08)
	struct UUI_BP_SettingsCheckboxButton_C* btn_ShowSpecialNotifications; // 0x418(0x08)
	struct UUI_BP_SettingsCheckboxButton_C* btn_ShowSpellElements; // 0x420(0x08)
	struct UUI_BP_SettingsCheckboxButton_C* btn_ShowTargetElements; // 0x428(0x08)
	struct UUI_BP_SettingsCheckboxButton_C* btn_ShowToolWheel; // 0x430(0x08)
	struct UUI_BP_SettingsCheckboxButton_C* btn_ShowXPElements; // 0x438(0x08)
	struct UUI_BP_MenuTextButton_C* button_LanguageSelect; // 0x440(0x08)
	struct UUI_BP_MenuTextButton_C* button_OpenCredits; // 0x448(0x08)
	struct UUI_BP_MenuTextButton_C* button_OpenHydra; // 0x450(0x08)
	struct UUI_BP_MenuTextButton_C* button_OpenWBGamesHub; // 0x458(0x08)
	struct UUI_BP_SettingsDetails_C* detailsPanel; // 0x460(0x08)
	struct FMulticastInlineDelegate DifficultyChanged; // 0x468(0x10)
	struct FMulticastInlineDelegate ToggleThreatIndicator; // 0x478(0x10)
	struct FMulticastInlineDelegate ToggleInvertCameraX; // 0x488(0x10)
	struct FMulticastInlineDelegate ToggleRumble; // 0x498(0x10)
	struct FMulticastInlineDelegate HorizontalSensitivityChanged_Default_Mouse; // 0x4a8(0x10)
	struct FMulticastInlineDelegate VerticalSensitivityChanged_Default_Mouse; // 0x4b8(0x10)
	struct FMulticastInlineDelegate ToggleInvertCameraY; // 0x4c8(0x10)
	struct FMulticastInlineDelegate FollowCameraSpeedChanged; // 0x4d8(0x10)
	struct FMulticastInlineDelegate HorizontalSensitivityChanged_Aim_Mouse; // 0x4e8(0x10)
	struct FMulticastInlineDelegate VerticalSensitivityChanged_Aim_Mouse; // 0x4f8(0x10)
	struct FMulticastInlineDelegate HorizontalSensitivityChanged_Transfig_Mouse; // 0x508(0x10)
	struct FMulticastInlineDelegate VerticalSensitivityChanged_Transfig_Mouse; // 0x518(0x10)
	struct FMulticastInlineDelegate HorizontalSensitivityChanged_Default_Controller; // 0x528(0x10)
	struct FMulticastInlineDelegate VerticalSensitivityChanged_Default_Controller; // 0x538(0x10)
	struct FMulticastInlineDelegate HorizontalSensitivityChanged_Aim_Controller; // 0x548(0x10)
	struct FMulticastInlineDelegate VerticalSensitivityChanged_Aim_Controller; // 0x558(0x10)
	struct FMulticastInlineDelegate HorizontalSensitivityChanged_Transfig_Controller; // 0x568(0x10)
	struct FMulticastInlineDelegate VerticalSensitivityChanged_Transfig_Controller; // 0x578(0x10)
	struct FMulticastInlineDelegate ToggleFollowCamera; // 0x588(0x10)
	struct FString TooltipDescription; // 0x598(0x10)
	float CurrentHoverTime; // 0x5a8(0x04)
	float RequiredHoverTime; // 0x5ac(0x04)

	void GetAsyncWrapperRenderSize(struct FVector2D& RenderSize); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.GetAsyncWrapperRenderSize // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void HideTooltip(); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.HideTooltip // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void SetTooltipData(struct FString Description); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.SetTooltipData // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void InitUIOptions(); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.InitUIOptions // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void BndEvt__btn_ShowHudBeacons_K2Node_ComponentBoundEvent_2_SettingsCheckmarkPressed__DelegateSignature(bool IsChecked, struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.BndEvt__btn_ShowHudBeacons_K2Node_ComponentBoundEvent_2_SettingsCheckmarkPressed__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__button_OpenHydra_K2Node_ComponentBoundEvent_0_MenuTextButtonClicked__DelegateSignature(struct UUI_BP_MenuTextButton_C* Button); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.BndEvt__button_OpenHydra_K2Node_ComponentBoundEvent_0_MenuTextButtonClicked__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__button_OpenWBGamesHub_K2Node_ComponentBoundEvent_4_MenuTextButtonClicked__DelegateSignature(struct UUI_BP_MenuTextButton_C* Button); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.BndEvt__button_OpenWBGamesHub_K2Node_ComponentBoundEvent_4_MenuTextButtonClicked__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__btn_ShowRightSideNotifications_K2Node_ComponentBoundEvent_1_SettingsCheckmarkPressed__DelegateSignature(bool IsChecked, struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.BndEvt__btn_ShowRightSideNotifications_K2Node_ComponentBoundEvent_1_SettingsCheckmarkPressed__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__btn_ShowMissionElements_K2Node_ComponentBoundEvent_5_SettingsCheckmarkPressed__DelegateSignature(bool IsChecked, struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.BndEvt__btn_ShowMissionElements_K2Node_ComponentBoundEvent_5_SettingsCheckmarkPressed__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__btn_ShowXPElements_K2Node_ComponentBoundEvent_6_SettingsCheckmarkPressed__DelegateSignature(bool IsChecked, struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.BndEvt__btn_ShowXPElements_K2Node_ComponentBoundEvent_6_SettingsCheckmarkPressed__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__btn_ShowSpellElements_K2Node_ComponentBoundEvent_8_SettingsCheckmarkPressed__DelegateSignature(bool IsChecked, struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.BndEvt__btn_ShowSpellElements_K2Node_ComponentBoundEvent_8_SettingsCheckmarkPressed__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__btn_ShowMeterElements_K2Node_ComponentBoundEvent_9_SettingsCheckmarkPressed__DelegateSignature(bool IsChecked, struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.BndEvt__btn_ShowMeterElements_K2Node_ComponentBoundEvent_9_SettingsCheckmarkPressed__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__btn_ShowMapElements_K2Node_ComponentBoundEvent_10_SettingsCheckmarkPressed__DelegateSignature(bool IsChecked, struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.BndEvt__btn_ShowMapElements_K2Node_ComponentBoundEvent_10_SettingsCheckmarkPressed__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__btn_ShowTargetElements_K2Node_ComponentBoundEvent_11_SettingsCheckmarkPressed__DelegateSignature(bool IsChecked, struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.BndEvt__btn_ShowTargetElements_K2Node_ComponentBoundEvent_11_SettingsCheckmarkPressed__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__btn_ShowSpecialNotifications_K2Node_ComponentBoundEvent_12_SettingsCheckmarkPressed__DelegateSignature(bool IsChecked, struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.BndEvt__btn_ShowSpecialNotifications_K2Node_ComponentBoundEvent_12_SettingsCheckmarkPressed__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_UI_btn_ShowHudBeacons_K2Node_ComponentBoundEvent_3_ToggleHovered__DelegateSignature(struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.BndEvt__UI_BP_Settings_UI_btn_ShowHudBeacons_K2Node_ComponentBoundEvent_3_ToggleHovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_UI_btn_ShowMapElements_K2Node_ComponentBoundEvent_7_ToggleHovered__DelegateSignature(struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.BndEvt__UI_BP_Settings_UI_btn_ShowMapElements_K2Node_ComponentBoundEvent_7_ToggleHovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_UI_btn_ShowMeterElements_K2Node_ComponentBoundEvent_14_ToggleHovered__DelegateSignature(struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.BndEvt__UI_BP_Settings_UI_btn_ShowMeterElements_K2Node_ComponentBoundEvent_14_ToggleHovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_UI_button_OpenHydra_K2Node_ComponentBoundEvent_15_MenuTextButtonHovered__DelegateSignature(struct UUI_BP_MenuTextButton_C* Button); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.BndEvt__UI_BP_Settings_UI_button_OpenHydra_K2Node_ComponentBoundEvent_15_MenuTextButtonHovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_UI_button_OpenWBGamesHub_K2Node_ComponentBoundEvent_16_MenuTextButtonHovered__DelegateSignature(struct UUI_BP_MenuTextButton_C* Button); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.BndEvt__UI_BP_Settings_UI_button_OpenWBGamesHub_K2Node_ComponentBoundEvent_16_MenuTextButtonHovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_UI_btn_ShowRightSideNotifications_K2Node_ComponentBoundEvent_17_ToggleHovered__DelegateSignature(struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.BndEvt__UI_BP_Settings_UI_btn_ShowRightSideNotifications_K2Node_ComponentBoundEvent_17_ToggleHovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_UI_btn_ShowMissionElements_K2Node_ComponentBoundEvent_18_ToggleHovered__DelegateSignature(struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.BndEvt__UI_BP_Settings_UI_btn_ShowMissionElements_K2Node_ComponentBoundEvent_18_ToggleHovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_UI_btn_ShowXPElements_K2Node_ComponentBoundEvent_19_ToggleHovered__DelegateSignature(struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.BndEvt__UI_BP_Settings_UI_btn_ShowXPElements_K2Node_ComponentBoundEvent_19_ToggleHovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_UI_btn_ShowSpellElements_K2Node_ComponentBoundEvent_20_ToggleHovered__DelegateSignature(struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.BndEvt__UI_BP_Settings_UI_btn_ShowSpellElements_K2Node_ComponentBoundEvent_20_ToggleHovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_UI_btn_ShowTargetElements_K2Node_ComponentBoundEvent_21_ToggleHovered__DelegateSignature(struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.BndEvt__UI_BP_Settings_UI_btn_ShowTargetElements_K2Node_ComponentBoundEvent_21_ToggleHovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_UI_btn_ShowSpecialNotifications_K2Node_ComponentBoundEvent_22_ToggleHovered__DelegateSignature(struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.BndEvt__UI_BP_Settings_UI_btn_ShowSpecialNotifications_K2Node_ComponentBoundEvent_22_ToggleHovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_UI_btn_ShowHudBeacons_K2Node_ComponentBoundEvent_24_ToggleUnhovered__DelegateSignature(struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.BndEvt__UI_BP_Settings_UI_btn_ShowHudBeacons_K2Node_ComponentBoundEvent_24_ToggleUnhovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_UI_btn_ShowMapElements_K2Node_ComponentBoundEvent_25_ToggleUnhovered__DelegateSignature(struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.BndEvt__UI_BP_Settings_UI_btn_ShowMapElements_K2Node_ComponentBoundEvent_25_ToggleUnhovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_UI_btn_ShowMeterElements_K2Node_ComponentBoundEvent_26_ToggleUnhovered__DelegateSignature(struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.BndEvt__UI_BP_Settings_UI_btn_ShowMeterElements_K2Node_ComponentBoundEvent_26_ToggleUnhovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_UI_btn_ShowMissionElements_K2Node_ComponentBoundEvent_27_ToggleUnhovered__DelegateSignature(struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.BndEvt__UI_BP_Settings_UI_btn_ShowMissionElements_K2Node_ComponentBoundEvent_27_ToggleUnhovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_UI_btn_ShowRightSideNotifications_K2Node_ComponentBoundEvent_28_ToggleUnhovered__DelegateSignature(struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.BndEvt__UI_BP_Settings_UI_btn_ShowRightSideNotifications_K2Node_ComponentBoundEvent_28_ToggleUnhovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_UI_btn_ShowSpecialNotifications_K2Node_ComponentBoundEvent_29_ToggleUnhovered__DelegateSignature(struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.BndEvt__UI_BP_Settings_UI_btn_ShowSpecialNotifications_K2Node_ComponentBoundEvent_29_ToggleUnhovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_UI_btn_ShowSpellElements_K2Node_ComponentBoundEvent_30_ToggleUnhovered__DelegateSignature(struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.BndEvt__UI_BP_Settings_UI_btn_ShowSpellElements_K2Node_ComponentBoundEvent_30_ToggleUnhovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_UI_btn_ShowTargetElements_K2Node_ComponentBoundEvent_31_ToggleUnhovered__DelegateSignature(struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.BndEvt__UI_BP_Settings_UI_btn_ShowTargetElements_K2Node_ComponentBoundEvent_31_ToggleUnhovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_UI_btn_ShowXPElements_K2Node_ComponentBoundEvent_33_ToggleUnhovered__DelegateSignature(struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.BndEvt__UI_BP_Settings_UI_btn_ShowXPElements_K2Node_ComponentBoundEvent_33_ToggleUnhovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_UI_button_OpenHydra_K2Node_ComponentBoundEvent_34_MenuTextButtonUnhovered__DelegateSignature(struct UUI_BP_MenuTextButton_C* Button); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.BndEvt__UI_BP_Settings_UI_button_OpenHydra_K2Node_ComponentBoundEvent_34_MenuTextButtonUnhovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_UI_button_OpenWBGamesHub_K2Node_ComponentBoundEvent_35_MenuTextButtonUnhovered__DelegateSignature(struct UUI_BP_MenuTextButton_C* Button); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.BndEvt__UI_BP_Settings_UI_button_OpenWBGamesHub_K2Node_ComponentBoundEvent_35_MenuTextButtonUnhovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void Construct(); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x38a7480
	void CollapseSettingsDetails(); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.CollapseSettingsDetails // (BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void OnLegendItemHoldEnd(struct ULegendItem* LegendItem, bool HoldWasCompleted); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.OnLegendItemHoldEnd // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_UI_button_OpenCredits_K2Node_ComponentBoundEvent_13_MenuTextButtonHovered__DelegateSignature(struct UUI_BP_MenuTextButton_C* Button); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.BndEvt__UI_BP_Settings_UI_button_OpenCredits_K2Node_ComponentBoundEvent_13_MenuTextButtonHovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_UI_button_OpenCredits_K2Node_ComponentBoundEvent_23_MenuTextButtonUnhovered__DelegateSignature(struct UUI_BP_MenuTextButton_C* Button); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.BndEvt__UI_BP_Settings_UI_button_OpenCredits_K2Node_ComponentBoundEvent_23_MenuTextButtonUnhovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_UI_button_OpenCredits_K2Node_ComponentBoundEvent_32_MenuTextButtonClicked__DelegateSignature(struct UUI_BP_MenuTextButton_C* Button); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.BndEvt__UI_BP_Settings_UI_button_OpenCredits_K2Node_ComponentBoundEvent_32_MenuTextButtonClicked__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void CreditsEnded(); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.CreditsEnded // (BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void InEditorPostConstruct(); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.InEditorPostConstruct // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void Initialize(); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.Initialize // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void SetParent(struct UUserWidget* Parent); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.SetParent // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_UI_btn_ShowToolWheel_K2Node_ComponentBoundEvent_36_SettingsCheckmarkPressed__DelegateSignature(bool IsChecked, struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.BndEvt__UI_BP_Settings_UI_btn_ShowToolWheel_K2Node_ComponentBoundEvent_36_SettingsCheckmarkPressed__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_UI_btn_ShowToolWheel_K2Node_ComponentBoundEvent_37_ToggleHovered__DelegateSignature(struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.BndEvt__UI_BP_Settings_UI_btn_ShowToolWheel_K2Node_ComponentBoundEvent_37_ToggleHovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_UI_btn_ShowToolWheel_K2Node_ComponentBoundEvent_38_ToggleUnhovered__DelegateSignature(struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.BndEvt__UI_BP_Settings_UI_btn_ShowToolWheel_K2Node_ComponentBoundEvent_38_ToggleUnhovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_UI_btn_ShowEnemyDamageNumbers_K2Node_ComponentBoundEvent_39_SettingsCheckmarkPressed__DelegateSignature(bool IsChecked, struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.BndEvt__UI_BP_Settings_UI_btn_ShowEnemyDamageNumbers_K2Node_ComponentBoundEvent_39_SettingsCheckmarkPressed__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_UI_btn_ShowEnemyDamageNumbers_K2Node_ComponentBoundEvent_40_ToggleHovered__DelegateSignature(struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.BndEvt__UI_BP_Settings_UI_btn_ShowEnemyDamageNumbers_K2Node_ComponentBoundEvent_40_ToggleHovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_UI_btn_ShowEnemyDamageNumbers_K2Node_ComponentBoundEvent_41_ToggleUnhovered__DelegateSignature(struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.BndEvt__UI_BP_Settings_UI_btn_ShowEnemyDamageNumbers_K2Node_ComponentBoundEvent_41_ToggleUnhovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_UI_btn_ShowBeastControls_K2Node_ComponentBoundEvent_42_SettingsCheckmarkPressed__DelegateSignature(bool IsChecked, struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.BndEvt__UI_BP_Settings_UI_btn_ShowBeastControls_K2Node_ComponentBoundEvent_42_SettingsCheckmarkPressed__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_UI_btn_ShowBeastControls_K2Node_ComponentBoundEvent_43_ToggleHovered__DelegateSignature(struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.BndEvt__UI_BP_Settings_UI_btn_ShowBeastControls_K2Node_ComponentBoundEvent_43_ToggleHovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_UI_btn_ShowBeastControls_K2Node_ComponentBoundEvent_44_ToggleUnhovered__DelegateSignature(struct UUI_BP_SettingsCheckboxButton_C* Button); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.BndEvt__UI_BP_Settings_UI_btn_ShowBeastControls_K2Node_ComponentBoundEvent_44_ToggleUnhovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_UI_button_LanguageSelect_K2Node_ComponentBoundEvent_45_MenuTextButtonClicked__DelegateSignature(struct UUI_BP_MenuTextButton_C* Button); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.BndEvt__UI_BP_Settings_UI_button_LanguageSelect_K2Node_ComponentBoundEvent_45_MenuTextButtonClicked__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_UI_button_LanguageSelect_K2Node_ComponentBoundEvent_46_MenuTextButtonHovered__DelegateSignature(struct UUI_BP_MenuTextButton_C* Button); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.BndEvt__UI_BP_Settings_UI_button_LanguageSelect_K2Node_ComponentBoundEvent_46_MenuTextButtonHovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void BndEvt__UI_BP_Settings_UI_button_LanguageSelect_K2Node_ComponentBoundEvent_47_MenuTextButtonUnhovered__DelegateSignature(struct UUI_BP_MenuTextButton_C* Button); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.BndEvt__UI_BP_Settings_UI_button_LanguageSelect_K2Node_ComponentBoundEvent_47_MenuTextButtonUnhovered__DelegateSignature // (BlueprintEvent) // @ game+0x38a7480
	void OnLanguageSelected(); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.OnLanguageSelected // (BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_UI_BP_Settings_UI(int32_t EntryPoint); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.ExecuteUbergraph_UI_BP_Settings_UI // (Final|UbergraphFunction) // @ game+0x38a7480
	void ToggleFollowCamera__DelegateSignature(bool IsChecked); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.ToggleFollowCamera__DelegateSignature // (Public|Delegate|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void VerticalSensitivityChanged_Transfig_Controller__DelegateSignature(float New Value); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.VerticalSensitivityChanged_Transfig_Controller__DelegateSignature // (Public|Delegate|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void HorizontalSensitivityChanged_Transfig_Controller__DelegateSignature(float New Value); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.HorizontalSensitivityChanged_Transfig_Controller__DelegateSignature // (Public|Delegate|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void VerticalSensitivityChanged_Aim_Controller__DelegateSignature(float New Value); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.VerticalSensitivityChanged_Aim_Controller__DelegateSignature // (Public|Delegate|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void HorizontalSensitivityChanged_Aim_Controller__DelegateSignature(float New Value); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.HorizontalSensitivityChanged_Aim_Controller__DelegateSignature // (Public|Delegate|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void VerticalSensitivityChanged_Default_Controller__DelegateSignature(float New Value); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.VerticalSensitivityChanged_Default_Controller__DelegateSignature // (Public|Delegate|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void HorizontalSensitivityChanged_Default_Controller__DelegateSignature(float New Value); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.HorizontalSensitivityChanged_Default_Controller__DelegateSignature // (Public|Delegate|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void VerticalSensitivityChanged_Transfig_Mouse__DelegateSignature(float New Value); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.VerticalSensitivityChanged_Transfig_Mouse__DelegateSignature // (Public|Delegate|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void HorizontalSensitivityChanged_Transfig_Mouse__DelegateSignature(float New Value); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.HorizontalSensitivityChanged_Transfig_Mouse__DelegateSignature // (Public|Delegate|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void VerticalSensitivityChanged_Aim_Mouse__DelegateSignature(float New Value); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.VerticalSensitivityChanged_Aim_Mouse__DelegateSignature // (Public|Delegate|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void HorizontalSensitivityChanged_Aim_Mouse__DelegateSignature(float New Value); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.HorizontalSensitivityChanged_Aim_Mouse__DelegateSignature // (Public|Delegate|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void FollowCameraSpeedChanged__DelegateSignature(float New Value); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.FollowCameraSpeedChanged__DelegateSignature // (Public|Delegate|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void ToggleInvertCameraY__DelegateSignature(bool IsChecked); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.ToggleInvertCameraY__DelegateSignature // (Public|Delegate|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void VerticalSensitivityChanged_Default_Mouse__DelegateSignature(float NewValue); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.VerticalSensitivityChanged_Default_Mouse__DelegateSignature // (Public|Delegate|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void HorizontalSensitivityChanged_Default_Mouse__DelegateSignature(float NewValue); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.HorizontalSensitivityChanged_Default_Mouse__DelegateSignature // (Public|Delegate|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void ToggleRumble__DelegateSignature(bool IsChecked); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.ToggleRumble__DelegateSignature // (Public|Delegate|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void ToggleInvertCameraX__DelegateSignature(bool IsChecked); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.ToggleInvertCameraX__DelegateSignature // (Public|Delegate|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void ToggleThreatIndicator__DelegateSignature(bool IsChecked); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.ToggleThreatIndicator__DelegateSignature // (Public|Delegate|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void DifficultyChanged__DelegateSignature(int32_t DifficultyIndex); // Function UI_BP_Settings_UI.UI_BP_Settings_UI_C.DifficultyChanged__DelegateSignature // (Public|Delegate|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
};

