// WidgetBlueprintGeneratedClass UI_BP_Settings_Graphics.UI_BP_Settings_Graphics_C
// Size: 0x584 (Inherited: 0x420)
struct UUI_BP_Settings_Graphics_C : UGraphicsSettingsWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x420(0x08)
	struct UWidgetAnimation* showDetails; // 0x428(0x08)
	struct UUI_BP_MenuTextButton_C* btn_applySettings; // 0x430(0x08)
	struct UUI_BP_MenuTextButton_C* btn_benchmark; // 0x438(0x08)
	struct UUI_BP_SettingsDropDownButton_C* btn_effectsQuality; // 0x440(0x08)
	struct UUI_BP_SettingsDropDownButton_C* btn_fogQuality; // 0x448(0x08)
	struct UUI_BP_SettingsDropDownButton_C* btn_foilageQuality; // 0x450(0x08)
	struct UUI_BP_SettingsDropDownButton_C* btn_globalQuality; // 0x458(0x08)
	struct UUI_BP_SettingsDropDownButton_C* btn_materialQuality; // 0x460(0x08)
	struct UUI_BP_SettingsDropDownButton_C* btn_populationQuality; // 0x468(0x08)
	struct UUI_BP_SettingsDropDownButton_C* btn_postProcessQuality; // 0x470(0x08)
	struct UUI_BP_SettingsCheckboxButton_C* btn_RaytracingAO; // 0x478(0x08)
	struct UUI_BP_SettingsDropDownButton_C* btn_raytracingQuality; // 0x480(0x08)
	struct UUI_BP_SettingsCheckboxButton_C* btn_RaytracingReflections; // 0x488(0x08)
	struct UUI_BP_SettingsCheckboxButton_C* btn_RaytracingShadows; // 0x490(0x08)
	struct UUI_BP_MenuTextButton_C* btn_resetSettings; // 0x498(0x08)
	struct UUI_BP_SettingsDropDownButton_C* btn_shadowQuality; // 0x4a0(0x08)
	struct UUI_BP_SettingsDropDownButton_C* btn_skyQuality; // 0x4a8(0x08)
	struct UUI_BP_SettingsDropDownButton_C* btn_textureQuality; // 0x4b0(0x08)
	struct UUI_BP_SettingsDropDownButton_C* btn_viewDistance; // 0x4b8(0x08)
	struct UUI_BP_SettingsDetails_C* detailsPanel; // 0x4c0(0x08)
	struct UUI_BP_SimpleScrollBox_C* graphicsScrollBox; // 0x4c8(0x08)
	struct TArray<struct FIntPoint> ResolutionArray; // 0x4d0(0x10)
	struct TArray<enum class EWindowMode> DisplayArray; // 0x4e0(0x10)
	struct USystemMenuWidget* ParentSettingsPage; // 0x4f0(0x08)
	int32_t LastConfirmedEffectsQuality; // 0x4f8(0x04)
	int32_t UnconfirmedEffectsQuality; // 0x4fc(0x04)
	int32_t LastConfirmedFoliageQuality; // 0x500(0x04)
	int32_t UnconfirmedFoliageQuality; // 0x504(0x04)
	int32_t LastConfirmedPostProcessQuality; // 0x508(0x04)
	int32_t UnconfirmedPostProcessQuality; // 0x50c(0x04)
	int32_t LastConfirmedShadowQuality; // 0x510(0x04)
	int32_t UnconfirmedShadowQuality; // 0x514(0x04)
	int32_t LastConfirmedTextureQuality; // 0x518(0x04)
	int32_t UnconfirmedTextureQuality; // 0x51c(0x04)
	int32_t LastConfirmedViewDistanceQuality; // 0x520(0x04)
	int32_t UnconfirmedViewDistanceQuality; // 0x524(0x04)
	bool isDetailsShowing; // 0x528(0x01)
	bool LastConfirmedRayTracingAO; // 0x529(0x01)
	bool LastConfirmedRayTracingReflections; // 0x52a(0x01)
	bool LastConfirmedRayTracingShadows; // 0x52b(0x01)
	bool RequiresConfirm; // 0x52c(0x01)
	bool UnconfirmedRayTracingAO; // 0x52d(0x01)
	bool UnconfirmedRayTracingReflections; // 0x52e(0x01)
	bool UnconfirmedRayTracingShadows; // 0x52f(0x01)
	struct FString TooltipDescription; // 0x530(0x10)
	struct FString tooltipTitle; // 0x540(0x10)
	float CurrentHoverTime; // 0x550(0x04)
	float RequiredHoverTime; // 0x554(0x04)
	bool RaytraceActiveStateChanged; // 0x558(0x01)
	bool PlayUltraSettingsAudio; // 0x559(0x01)
	char pad_55A[0x2]; // 0x55a(0x02)
	int32_t LastConfirmedMaterialQuality; // 0x55c(0x04)
	int32_t UnconfirmedMaterialQuality; // 0x560(0x04)
	int32_t UnconfirmedFogQuality; // 0x564(0x04)
	int32_t LastConfirmedFogQuality; // 0x568(0x04)
	int32_t UnconfirmedSkyQuality; // 0x56c(0x04)
	int32_t LastConfirmedSkyQuality; // 0x570(0x04)
	int32_t UnconfirmedPopulationQuality; // 0x574(0x04)
	int32_t LastPopulationQuality; // 0x578(0x04)
	int32_t UnconfirmedRaytracingQuality; // 0x57c(0x04)
	int32_t LastConfirmedRaytracingQuality; // 0x580(0x04)

	void GetAsyncWrapperRenderSize(struct FVector2D& RenderSize); // Function UI_BP_Settings_Graphics.UI_BP_Settings_Graphics_C.GetAsyncWrapperRenderSize // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	bool Get_btn_raytracingQuality_bIsEnabled_1(); // Function UI_BP_Settings_Graphics.UI_BP_Settings_Graphics_C.Get_btn_raytracingQuality_bIsEnabled_1 // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x38a7480
	void AreAnySettingsBetterThanRecommended(bool& IsBetterThanRecommended); // Function UI_BP_Settings_Graphics.UI_BP_Settings_Graphics_C.AreAnySettingsBetterThanRecommended // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
