// WidgetBlueprintGeneratedClass UI_BP_Settings_Gameplay.UI_BP_Settings_Gameplay_C
// Size: 0x605 (Inherited: 0x3c8)
struct UUI_BP_Settings_Gameplay_C : UGameplaySettingsWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x3c8(0x08)
	struct UWidgetAnimation* showDetails; // 0x3d0(0x08)
	struct UUI_BP_SettingsCheckboxButton_C* btn_AlwaysUseCameraAiming; // 0x3d8(0x08)
	struct UUI_BP_SettingsSliderButton_C* btn_cameraAcceleration_Aiming; // 0x3e0(0x08)
	struct UUI_BP_SettingsSliderButton_C* btn_cameraAcceleration_Default; // 0x3e8(0x08)
	struct UUI_BP_SettingsSliderButton_C* btn_cameraSensitivity_Aiming; // 0x3f0(0x08)
	struct UUI_BP_SettingsSliderButton_C* btn_cameraSensitivity_Default; // 0x3f8(0x08)
	struct UUI_BP_SettingsDropDownButton_C* btn_difficulty; // 0x400(0x08)
	struct UUI_BP_SettingsSliderButton_C* btn_followCameraSpeed; // 0x408(0x08)
	struct UUI_BP_SettingsCheckboxButton_C* btn_invertBroomY; // 0x410(0x08)
	struct UUI_BP_SettingsCheckboxButton_C* btn_invertCameraX; // 0x418(0x08)
	struct UUI_BP_SettingsCheckboxButton_C* btn_invertCameraY; // 0x420(0x08)
	struct UUI_BP_SettingsCheckboxButton_C* btn_RgbPeripherals; // 0x428(0x08)
	struct UUI_BP_SettingsCheckboxButton_C* btn_rumble; // 0x430(0x08)
	struct UUI_BP_SettingsCheckboxButton_C* btn_sprintWalkToggle; // 0x438(0x08)
	struct UUI_BP_SettingsCheckboxButton_C* btn_tilt; // 0x440(0x08)
	struct UUI_BP_SettingsSliderButton_C* btn_tiltSensitivity; // 0x448(0x08)
	struct UUI_BP_SettingsDetails_C* detailsPanel; // 0x450(0x08)
	struct UUI_BP_SimpleScrollBox_C* gameplayScrollBox; // 0x458(0x08)
	struct FMulticastInlineDelegate DifficultyChanged; // 0x460(0x10)
	struct FMulticastInlineDelegate ToggleThreatIndicator; // 0x470(0x10)
	struct FMulticastInlineDelegate ToggleInvertCameraX; // 0x480(0x10)
	struct FMulticastInlineDelegate ToggleRumble; // 0x490(0x10)
	struct FMulticastInlineDelegate HorizontalSensitivityChanged_Default_Mouse; // 0x4a0(0x10)
	struct FMulticastInlineDelegate VerticalSensitivityChanged_Default_Mouse; // 0x4b0(0x10)
	struct FMulticastInlineDelegate ToggleInvertCameraY; // 0x4c0(0x10)
	struct FMulticastInlineDelegate FollowCameraSpeedChanged; // 0x4d0(0x10)
	struct FMulticastInlineDelegate HorizontalSensitivityChanged_Aim_Mouse; // 0x4e0(0x10)
	struct FMulticastInlineDelegate VerticalSensitivityChanged_Aim_Mouse; // 0x4f0(0x10)
	struct FMulticastInlineDelegate HorizontalSensitivityChanged_Transfig_Mouse; // 0x500(0x10)
	struct FMulticastInlineDelegate VerticalSensitivityChanged_Transfig_Mouse; // 0x510(0x10)
	struct FMulticastInlineDelegate HorizontalSensitivityChanged_Default_Controller; // 0x520(0x10)
	struct FMulticastInlineDelegate VerticalSensitivityChanged_Default_Controller; // 0x530(0x10)
	struct FMulticastInlineDelegate HorizontalSensitivityChanged_Aim_Controller; // 0x540(0x10)
	struct FMulticastInlineDelegate VerticalSensitivityChanged_Aim_Controller; // 0x550(0x10)
	struct FMulticastInlineDelegate HorizontalSensitivityChanged_Transfig_Controller; // 0x560(0x10)
	struct FMulticastInlineDelegate VerticalSensitivityChanged_Transfig_Controller; // 0x570(0x10)
	float CurrentHoverTime; // 0x580(0x04)
	float RequiredHoverTime; // 0x584(0x04)
	float Sensitivity_Default_Min; // 0x588(0x04)
	float Sensitivity_Default_Max; // 0x58c(0x04)
	float Sensitivity_Aiming_Min; // 0x590(0x04)
	float Sensitivity_Aiming_Max; // 0x594(0x04)
	float Acceleration_Default_Min; // 0x598(0x04)
	float Acceleration_Default_Max; // 0x59c(0x04)
	float Acceleration_Aiming_Min; // 0x5a0(0x04)
	float Acceleration_Aiming_Max; // 0x5a4(0x04)
	float MinFollowCameraSpeed; // 0x5a8(0x04)
	float MaxFollowCameraSpeed; // 0x5ac(0x04)
	struct FMulticastInlineDelegate ToggleFollowCamera; // 0x5b0(0x10)
	float MinAimAssistStrength; // 0x5c0(0x04)
	float MaxAimAssistStrength; // 0x5c4(0x04)
	struct FMulticastInlineDelegate ToggleTilt; // 0x5c8(0x10)
	float TiltSensitivity_Max; // 0x5d8(0x04)
	float TiltSensitivity_Min; // 0x5dc(0x04)
	struct FMulticastInlineDelegate TiltSensitivityChanged; // 0x5e0(0x10)
	struct FString TooltipDescription; // 0x5f0(0x10)
	bool isButtonHovered; // 0x600(0x01)
	bool isDetailsShowing; // 0x601(0x01)
	bool EnableDifficultySetting; // 0x602(0x01)
	bool DifficultySettingDirty; // 0x603(0x01)
	enum class EDifficulty CurrentDifficultySetting; // 0x604(0x01)

	void GetAsyncWrapperRenderSize(struct FVector2D& RenderSize); // Function UI_BP_Settings_Gameplay.UI_BP_Settings_Gameplay_C.GetAsyncWrapperRenderSize // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void HideTooltip(); // Function UI_BP_Settings_Gameplay.UI_BP_Settings_Gameplay_C.HideTooltip // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void SetTooltipData(struct FString Description); // Function UI_BP_Settings_Gameplay.UI_BP_Settings_Gameplay_C.SetTooltipData // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void SliderValueToSensitivityValue(float SliderValue, float SensitivityMin, float SensitivityMax, float& SensitivityValue); // Function UI_BP_Settings_Gameplay.UI_BP_Settings_Gameplay_C.SliderValueToSensitivityValue // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
