// WidgetBlueprintGeneratedClass UI_BP_FG_VortexPanelBack.UI_BP_FG_VortexPanelBack_C
// Size: 0x2a8 (Inherited: 0x268)
struct UUI_BP_FG_VortexPanelBack_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x268(0x08)
	struct UWidgetAnimation* AppearPannelBack_Gold; // 0x270(0x08)
	struct UWidgetAnimation* AppearPannelBack; // 0x278(0x08)
	struct UImage* detailsPanelVortex_1; // 0x280(0x08)
	struct UImage* detailsPanelVortex_2; // 0x288(0x08)
	struct UImage* detailsPanelVortex_3; // 0x290(0x08)
	struct UImage* detailsPanelVortex_4; // 0x298(0x08)
	struct UImage* overlayStarGlow; // 0x2a0(0x08)

	void PannelVortexDisAppearAnim(); // Function UI_BP_FG_VortexPanelBack.UI_BP_FG_VortexPanelBack_C.PannelVortexDisAppearAnim // (BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void PannelVortexAppearGold(); // Function UI_BP_FG_VortexPanelBack.UI_BP_FG_VortexPanelBack_C.PannelVortexAppearGold // (BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void PannelVortexAppearAnim(); // Function UI_BP_FG_VortexPanelBack.UI_BP_FG_VortexPanelBack_C.PannelVortexAppearAnim // (BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void PannelVortexDisAppearGold(); // Function UI_BP_FG_VortexPanelBack.UI_BP_FG_VortexPanelBack_C.PannelVortexDisAppearGold // (BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_UI_BP_FG_VortexPanelBack(int32_t EntryPoint); // Function UI_BP_FG_VortexPanelBack.UI_BP_FG_VortexPanelBack_C.ExecuteUbergraph_UI_BP_FG_VortexPanelBack // (Final|UbergraphFunction) // @ game+0x38a7480
};

