// WidgetBlueprintGeneratedClass UI_BP_Settings_GamepadControls.UI_BP_Settings_GamepadControls_C
// Size: 0x7c8 (Inherited: 0x3c8)
struct UUI_BP_Settings_GamepadControls_C : UTabPageWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x3c8(0x08)
	struct UPhoenixRichTextBlock* AccessMapGraphic; // 0x3d0(0x08)
	struct UPhoenixRichTextBlock* AccessMapGraphic_2; // 0x3d8(0x08)
	struct UPhoenixRichTextBlock* AccessMapGraphic_3; // 0x3e0(0x08)
	struct UPhoenixRichTextBlock* AccessMapGraphic_4; // 0x3e8(0x08)
	struct UPhoenixRichTextBlock* AccessMapText; // 0x3f0(0x08)
	struct UPhoenixRichTextBlock* AccessMapText_2; // 0x3f8(0x08)
	struct UPhoenixRichTextBlock* AccessMapText_3; // 0x400(0x08)
	struct UPhoenixRichTextBlock* AccessMapText_4; // 0x408(0x08)
	struct UPhoenixRichTextBlock* aim; // 0x410(0x08)
	struct UVerticalBox* broom_LeftColumn; // 0x418(0x08)
	struct UVerticalBox* broom_RightColumn; // 0x420(0x08)
	struct UImage* controllerImage; // 0x428(0x08)
	struct UWidgetSwitcher* controlSwitcher; // 0x430(0x08)
	struct UHorizontalBox* controlTabMenu; // 0x438(0x08)
	struct UPhoenixRichTextBlock* DisableLockOnGraphic; // 0x440(0x08)
	struct UPhoenixRichTextBlock* DisableLockOnText; // 0x448(0x08)
	struct UPhoenixRichTextBlock* DPadDownGraphic_3; // 0x450(0x08)
	struct UPhoenixRichTextBlock* DPadDownText; // 0x458(0x08)
	struct UPhoenixRichTextBlock* DPadLeftGraphic; // 0x460(0x08)
	struct UPhoenixRichTextBlock* DPadLeftGraphic_2; // 0x468(0x08)
	struct UPhoenixRichTextBlock* DPadLeftGraphic_3; // 0x470(0x08)
	struct UPhoenixRichTextBlock* DPadLeftGraphic_8; // 0x478(0x08)
	struct UPhoenixRichTextBlock* DPadLeftText; // 0x480(0x08)
	struct UPhoenixRichTextBlock* DPadLeftText_2; // 0x488(0x08)
	struct UPhoenixRichTextBlock* DPadLeftText_3; // 0x490(0x08)
	struct UPhoenixRichTextBlock* DPadLeftText_8; // 0x498(0x08)
	struct UPhoenixRichTextBlock* DPadRightGraphic; // 0x4a0(0x08)
	struct UPhoenixRichTextBlock* DPadRightGraphic_2; // 0x4a8(0x08)
	struct UPhoenixRichTextBlock* DPadRightGraphic_3; // 0x4b0(0x08)
	struct UPhoenixRichTextBlock* DPadRightGraphic_8; // 0x4b8(0x08)
	struct UPhoenixRichTextBlock* DPadRightText; // 0x4c0(0x08)
	struct UPhoenixRichTextBlock* DPadRightText_2; // 0x4c8(0x08)
	struct UPhoenixRichTextBlock* DPadRightText_3; // 0x4d0(0x08)
	struct UPhoenixRichTextBlock* DPadRightText_8; // 0x4d8(0x08)
	struct UPhoenixRichTextBlock* DPadUpGraphic; // 0x4e0(0x08)
	struct UPhoenixRichTextBlock* DPadUpGraphic_3; // 0x4e8(0x08)
	struct UPhoenixRichTextBlock* DPadUpText_3; // 0x4f0(0x08)
	struct UPhoenixRichTextBlock* FaceButtonBottomGraphic; // 0x4f8(0x08)
	struct UPhoenixRichTextBlock* FaceButtonBottomGraphic_3; // 0x500(0x08)
	struct UPhoenixRichTextBlock* FaceButtonBottomText; // 0x508(0x08)
	struct UPhoenixRichTextBlock* FaceButtonBottomText_3; // 0x510(0x08)
	struct UPhoenixRichTextBlock* FaceButtonLeftGraphic; // 0x518(0x08)
	struct UPhoenixRichTextBlock* FaceButtonLeftText; // 0x520(0x08)
	struct UPhoenixRichTextBlock* FaceButtonRightGraphic; // 0x528(0x08)
	struct UPhoenixRichTextBlock* FaceButtonRightGraphic_3; // 0x530(0x08)
	struct UPhoenixRichTextBlock* FaceButtonRightGraphic_4; // 0x538(0x08)
	struct UPhoenixRichTextBlock* FaceButtonRightText; // 0x540(0x08)
	struct UPhoenixRichTextBlock* FaceButtonRightText_3; // 0x548(0x08)
	struct UPhoenixRichTextBlock* FaceButtonRightText_4; // 0x550(0x08)
	struct UPhoenixRichTextBlock* FaceButtonTopGraphic; // 0x558(0x08)
	struct UPhoenixRichTextBlock* FaceButtonTopText1; // 0x560(0x08)
	struct UPhoenixRichTextBlock* FaceButtonTopText2; // 0x568(0x08)
	struct UPhoenixRichTextBlock* finisherLB; // 0x570(0x08)
	struct UPhoenixTextBlock* FinisherPlus; // 0x578(0x08)
	struct UPhoenixRichTextBlock* finisherRB; // 0x580(0x08)
	struct UPhoenixRichTextBlock* FinisherText; // 0x588(0x08)
	struct UVerticalBox* gameplay_LeftColumn; // 0x590(0x08)
	struct UVerticalBox* gameplay_RightColumn; // 0x598(0x08)
	struct UPhoenixRichTextBlock* LeftBumper; // 0x5a0(0x08)
	struct UPhoenixRichTextBlock* LeftBumperText1; // 0x5a8(0x08)
	struct UPhoenixRichTextBlock* LeftBumperText2; // 0x5b0(0x08)
	struct UPhoenixRichTextBlock* LeftStickClickGraphic_2; // 0x5b8(0x08)
	struct UPhoenixRichTextBlock* LeftStickClickText_2; // 0x5c0(0x08)
	struct UPhoenixRichTextBlock* LeftTrigger; // 0x5c8(0x08)
	struct UPhoenixRichTextBlock* LeftTriggerGraphic_3; // 0x5d0(0x08)
	struct UPhoenixRichTextBlock* LeftTriggerGraphic_6; // 0x5d8(0x08)
	struct UPhoenixRichTextBlock* LeftTriggerText_3; // 0x5e0(0x08)
	struct UPhoenixRichTextBlock* LeftTriggerText_6; // 0x5e8(0x08)
	struct UVerticalBox* mountFlying_Left; // 0x5f0(0x08)
	struct UVerticalBox* mountFlying_Right; // 0x5f8(0x08)
	struct UVerticalBox* mountGroiund_Right; // 0x600(0x08)
	struct UVerticalBox* mountGround_Left; // 0x608(0x08)
	struct UPhoenixRichTextBlock* MoveCameraGraphic; // 0x610(0x08)
	struct UPhoenixRichTextBlock* MoveCameraGraphic_2; // 0x618(0x08)
	struct UPhoenixRichTextBlock* MoveCameraGraphic_3; // 0x620(0x08)
	struct UPhoenixRichTextBlock* MoveCameraText; // 0x628(0x08)
	struct UPhoenixRichTextBlock* MoveCameraText_2; // 0x630(0x08)
	struct UPhoenixRichTextBlock* MoveCameraText_3; // 0x638(0x08)
	struct UPhoenixRichTextBlock* MoveGraphic; // 0x640(0x08)
	struct UPhoenixRichTextBlock* MoveGraphic_2; // 0x648(0x08)
	struct UPhoenixRichTextBlock* MoveGraphic_3; // 0x650(0x08)
	struct UPhoenixRichTextBlock* MoveGraphic_4; // 0x658(0x08)
	struct UPhoenixRichTextBlock* MoveText; // 0x660(0x08)
	struct UPhoenixRichTextBlock* MoveText_2; // 0x668(0x08)
	struct UPhoenixRichTextBlock* MoveText_3; // 0x670(0x08)
	struct UPhoenixRichTextBlock* MoveText_4; // 0x678(0x08)
	struct UPhoenixRichTextBlock* OptionsGraphic; // 0x680(0x08)
	struct UPhoenixRichTextBlock* OptionsGraphic_2; // 0x688(0x08)
	struct UPhoenixRichTextBlock* OptionsGraphic_3; // 0x690(0x08)
	struct UPhoenixRichTextBlock* OptionsGraphic_4; // 0x698(0x08)
	struct UPhoenixRichTextBlock* OptionsText; // 0x6a0(0x08)
	struct UPhoenixRichTextBlock* OptionsText_2; // 0x6a8(0x08)
	struct UPhoenixRichTextBlock* OptionsText_3; // 0x6b0(0x08)
	struct UPhoenixRichTextBlock* OptionsText_4; // 0x6b8(0x08)
	struct UPhoenixRichTextBlock* quickPathSelection; // 0x6c0(0x08)
	struct UPhoenixRichTextBlock* quickPathSelection_2; // 0x6c8(0x08)
	struct UPhoenixRichTextBlock* RightBumperGraphic; // 0x6d0(0x08)
	struct UPhoenixRichTextBlock* RightBumperText; // 0x6d8(0x08)
	struct UPhoenixRichTextBlock* RightStickGraphic; // 0x6e0(0x08)
	struct UPhoenixRichTextBlock* RightStickText1; // 0x6e8(0x08)
	struct UPhoenixRichTextBlock* RightStickText2; // 0x6f0(0x08)
	struct UPhoenixRichTextBlock* RightTriggerGraphic; // 0x6f8(0x08)
	struct UPhoenixRichTextBlock* RightTriggerGraphic_2; // 0x700(0x08)
	struct UPhoenixRichTextBlock* RightTriggerGraphic_3; // 0x708(0x08)
	struct UPhoenixRichTextBlock* RightTriggerGraphic_4; // 0x710(0x08)
	struct UPhoenixRichTextBlock* RightTriggerGraphic_5; // 0x718(0x08)
	struct UPhoenixRichTextBlock* RightTriggerGraphic_6; // 0x720(0x08)
	struct UPhoenixRichTextBlock* RightTriggerGraphic_7; // 0x728(0x08)
	struct UPhoenixRichTextBlock* RightTriggerGraphic_8; // 0x730(0x08)
	struct UPhoenixRichTextBlock* RightTriggerGraphic_9; // 0x738(0x08)
	struct UPhoenixRichTextBlock* RightTriggerGraphic_10; // 0x740(0x08)
	struct UPhoenixRichTextBlock* RightTriggerGraphic_11; // 0x748(0x08)
	struct UPhoenixTextBlock* RightTriggerPlus; // 0x750(0x08)
	struct UPhoenixTextBlock* RightTriggerPlus2; // 0x758(0x08)
	struct UPhoenixRichTextBlock* RightTriggerText; // 0x760(0x08)
	struct UPhoenixRichTextBlock* RightTriggerText_2; // 0x768(0x08)
	struct UPhoenixRichTextBlock* RightTriggerText_3; // 0x770(0x08)
	struct UPhoenixRichTextBlock* RightTriggerText_11; // 0x778(0x08)
	struct UPhoenixRichTextBlock* RightTriggerText1; // 0x780(0x08)
	struct UPhoenixRichTextBlock* RightTriggerText2; // 0x788(0x08)
	struct UPhoenixRichTextBlock* RightTriggerText3; // 0x790(0x08)
	struct UPhoenixTextBlock* schemeTitle; // 0x798(0x08)
	struct UPhoenixRichTextBlock* SprintGraphic; // 0x7a0(0x08)
	struct UPhoenixRichTextBlock* SprintText; // 0x7a8(0x08)
	int32_t ControlIndex; // 0x7b0(0x04)
	char pad_7B4[0x4]; // 0x7b4(0x04)
	struct TArray<struct FString> ControlSchemeTitles; // 0x7b8(0x10)

	void SetMountFlyingLayout(bool IsSouthpaw); // Function UI_BP_Settings_GamepadControls.UI_BP_Settings_GamepadControls_C.SetMountFlyingLayout // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void SetMountGroundLayout(bool IsSouthpaw); // Function UI_BP_Settings_GamepadControls.UI_BP_Settings_GamepadControls_C.SetMountGroundLayout // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void SetBroomLayout(bool IsSouthpaw); // Function UI_BP_Settings_GamepadControls.UI_BP_Settings_GamepadControls_C.SetBroomLayout // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void SetGameplayLayout(bool IsSouthpaw); // Function UI_BP_Settings_GamepadControls.UI_BP_Settings_GamepadControls_C.SetGameplayLayout // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void RefreshLayout(); // Function UI_BP_Settings_GamepadControls.UI_BP_Settings_GamepadControls_C.RefreshLayout // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void UpdateGamepadImage(); // Function UI_BP_Settings_GamepadControls.UI_BP_Settings_GamepadControls_C.UpdateGamepadImage // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	struct TArray<struct FString> GatherMenuReaderStrings(int32_t DepthLevel); // Function UI_BP_Settings_GamepadControls.UI_BP_Settings_GamepadControls_C.GatherMenuReaderStrings // (Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x38a7480
	void SwitchCategories(int32_t Direction); // Function UI_BP_Settings_GamepadControls.UI_BP_Settings_GamepadControls_C.SwitchCategories // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void InitControlCategories(); // Function UI_BP_Settings_GamepadControls.UI_BP_Settings_GamepadControls_C.InitControlCategories // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void Construct(); // Function UI_BP_Settings_GamepadControls.UI_BP_Settings_GamepadControls_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x38a7480
	void PreConstruct(bool IsDesignTime); // Function UI_BP_Settings_GamepadControls.UI_BP_Settings_GamepadControls_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x38a7480
	void OnInitialized(); // Function UI_BP_Settings_GamepadControls.UI_BP_Settings_GamepadControls_C.OnInitialized // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x38a7480
	void RefreshButtonCallouts(struct UObject* Caller); // Function UI_BP_Settings_GamepadControls.UI_BP_Settings_GamepadControls_C.RefreshButtonCallouts // (BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_UI_BP_Settings_GamepadControls(int32_t EntryPoint); // Function UI_BP_Settings_GamepadControls.UI_BP_Settings_GamepadControls_C.ExecuteUbergraph_UI_BP_Settings_GamepadControls // (Final|UbergraphFunction|HasDefaults) // @ game+0x38a7480
};

