// BlueprintGeneratedClass VFX_BP_BellTower_Fountain.VFX_BP_BellTower_Fountain_C
// Size: 0x358 (Inherited: 0x248)
struct AVFX_BP_BellTower_Fountain_C : AActor {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x248(0x08)
	struct UParticleSystemComponent* WaterSplash12; // 0x250(0x08)
	struct UParticleSystemComponent* WaterSplash11; // 0x258(0x08)
	struct UParticleSystemComponent* WaterSplash10; // 0x260(0x08)
	struct UParticleSystemComponent* WaterSplash9; // 0x268(0x08)
	struct UParticleSystemComponent* Water12; // 0x270(0x08)
	struct UParticleSystemComponent* Water11; // 0x278(0x08)
	struct UParticleSystemComponent* Water10; // 0x280(0x08)
	struct UParticleSystemComponent* Water9; // 0x288(0x08)
	struct UStaticMeshComponent* SM_Statue_StoneGargoyle3; // 0x290(0x08)
	struct UStaticMeshComponent* SM_Statue_StoneGargoyle2; // 0x298(0x08)
	struct UStaticMeshComponent* SM_Statue_StoneGargoyle1; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_Statue_StoneGargoyle; // 0x2a8(0x08)
	struct UParticleSystemComponent* WaterSplash8; // 0x2b0(0x08)
	struct UAkComponent* Ak_VFX_BP_BellTower_Fountain; // 0x2b8(0x08)
	struct UParticleSystemComponent* WaterSplash7; // 0x2c0(0x08)
	struct UParticleSystemComponent* WaterSplash6; // 0x2c8(0x08)
	struct UParticleSystemComponent* WaterSplash5; // 0x2d0(0x08)
	struct UParticleSystemComponent* WaterSplash4; // 0x2d8(0x08)
	struct UParticleSystemComponent* WaterSplash3; // 0x2e0(0x08)
	struct UParticleSystemComponent* WaterSplash2; // 0x2e8(0x08)
	struct UParticleSystemComponent* WaterSplash1; // 0x2f0(0x08)
	struct UParticleSystemComponent* TopSpout; // 0x2f8(0x08)
	struct UParticleSystemComponent* Waterdrops; // 0x300(0x08)
	struct UParticleSystemComponent* Water8; // 0x308(0x08)
	struct UParticleSystemComponent* Water7; // 0x310(0x08)
	struct UParticleSystemComponent* Water6; // 0x318(0x08)
	struct UParticleSystemComponent* Water5; // 0x320(0x08)
	struct UParticleSystemComponent* Water4; // 0x328(0x08)
	struct UParticleSystemComponent* Water3; // 0x330(0x08)
	struct UParticleSystemComponent* Water2; // 0x338(0x08)
	struct UParticleSystemComponent* Water1; // 0x340(0x08)
	struct UStaticMeshComponent* SM_HW_GroundsQ_BellTowerGardenFountain_A; // 0x348(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x350(0x08)

	void UserConstructionScript(); // Function VFX_BP_BellTower_Fountain.VFX_BP_BellTower_Fountain_C.UserConstructionScript // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x38a7480
	void ReceiveBeginPlay(); // Function VFX_BP_BellTower_Fountain.VFX_BP_BellTower_Fountain_C.ReceiveBeginPlay // (Event|Protected|BlueprintEvent) // @ game+0x38a7480
	void ExecuteUbergraph_VFX_BP_BellTower_Fountain(int32_t EntryPoint); // Function VFX_BP_BellTower_Fountain.VFX_BP_BellTower_Fountain_C.ExecuteUbergraph_VFX_BP_BellTower_Fountain // (Final|UbergraphFunction|HasDefaults) // @ game+0x38a7480
};

